{"id":"0d7a9363-af70-4e7b-a3b7-1a176b7fbe84","created_by":"Oddvar Moe, Sander Wiebing, oscd.community","name":"Exports Registry Key To an Alternate Data Stream","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Exports the target Registry key and hides it in the specified alternate data stream.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Rr][Ee][Gg][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/","rule_id":"0d7a9363-af70-4e7b-a3b7-1a176b7fbe84","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Regedit/","https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\regedit.exe`"}
