{"id":"ae02ed70-11aa-4a22-b397-c0d0e8f6ea99","created_by":"Florian Roth","name":"Unusual File Download from File Sharing Domain","tags":["attack.defense_evasion","attack.s0139","attack.t1564.004"],"interval":"5m","description":"Detects the download of suspicious file type from a well-known file and paste sharing domain","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(Contents:(/.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/ OR /.*[Rr][Aa][Ww]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Ii][Ss][Tt]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*\\.[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*\\.[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*\\.[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo]\\/.*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/) AND file.path:(/.*\\.[Pp][Ss]1\\:[Zz][Oo][Nn][Ee].*/ OR /.*\\.[Bb][Aa][Tt]\\:[Zz][Oo][Nn][Ee].*/))","rule_id":"ae02ed70-11aa-4a22-b397-c0d0e8f6ea99","timestamp_override":"event.ingested","references":["https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(Contents:(*transfer.sh* OR *raw.githubusercontent.com* OR *gist.githubusercontent.com* OR *pastebin.com* OR *cdn.discordapp.com\\/attachments\\/* OR *mediafire.com* OR *mega.nz* OR *ddns.net* OR *.paste.ee* OR *.hastebin.com* OR *.ghostbin.co\\/* OR *ufile.io* OR *storage.googleapis.com* OR *anonfiles.com* OR *send.exploit.in*) AND file.path:(*.ps1\\:Zone* OR *.bat\\:Zone*))`"}
