{"id":"b69888d4-380c-45ce-9cf9-d9ce46e67821","created_by":"Florian Roth, @0xrawsec","name":"Executable in ADS","tags":["attack.defense_evasion","attack.s0139","attack.t1564.004"],"interval":"5m","description":"Detects the creation of an ADS data stream that contains an executable (non-empty imphash)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=.*/ AND (NOT (related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=00000000000000000000000000000000.*/)))","rule_id":"b69888d4-380c-45ce-9cf9-d9ce46e67821","timestamp_override":"event.ingested","references":["https://twitter.com/0xrawsec/status/1002478725605273600?s=21"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(related.hash:*IMPHASH\\=* AND (NOT (related.hash:*IMPHASH\\=00000000000000000000000000000000*)))`"}
