{"id":"a1a144b7-5c9b-4853-a559-2172be8d4a03","created_by":"Florian Roth","name":"Remote Thread Creation in Suspicious Targets","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055.003"],"interval":"5m","description":"Detects a remote thread creation in suspicious target images","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:(/.*\\\\[Mm][Ss][Pp][Aa][Ii][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Rr][Ii][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/) AND (NOT (winlog.event_data.StartFunction:/[Ee][Tt][Ww][Pp][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Tt][Hh][Rr][Ee][Aa][Dd]/)))","rule_id":"a1a144b7-5c9b-4853-a559-2172be8d4a03","timestamp_override":"event.ingested","references":["https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:(*\\\\mspaint.exe OR *\\\\calc.exe OR *\\\\notepad.exe OR *\\\\sethc.exe OR *\\\\write.exe OR *\\\\wordpad.exe OR *\\\\explorer.exe) AND (NOT (winlog.event_data.StartFunction:EtwpNotificationThread)))`"}
