{"id":"c15e99a3-c474-48ab-b9a7-84549a7a9d16","created_by":"frack113","name":"Remote Thread Creation Ttdinject.exe Proxy","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Detects a remote thread creation of Ttdinject.exe used as proxy","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Tt][Tt][Dd][Ii][Nn][Jj][Ee][Cc][Tt]\\.[Ee][Xx][Ee]/","rule_id":"c15e99a3-c474-48ab-b9a7-84549a7a9d16","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\ttdinject.exe`"}
