{"id":"7cff77e1-9663-46a3-8260-17f2e1aa9d0a","created_by":"frack113","name":"AppInstaller Attempts From URL by DNS","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"AppInstaller.exe is spawned by the default handler for the URI, it attempts to load/install a package from the URL","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Dd][Ee][Ss][Kk][Tt][Oo][Pp][Aa][Pp][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]_.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/)","rule_id":"7cff77e1-9663-46a3-8260-17f2e1aa9d0a","timestamp_override":"event.ingested","references":["https://twitter.com/notwhickey/status/1333900137232523264","https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft.DesktopAppInstaller_* AND process.executable:*\\\\AppInstaller.exe)`"}
