{"id":"b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544","created_by":"frack113","name":"Query Tor Onion Address","tags":["attack.command_and_control","attack.t1090.003"],"interval":"5m","description":"Detects DNS resolution of an .onion address related to Tor routing networks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"dns.question.name:/.*\\.[Oo][Nn][Ii][Oo][Nn].*/","rule_id":"b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544","timestamp_override":"event.ingested","references":["https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`dns.question.name:*.onion*`"}
