{"id":"ec82e2a5-81ea-4211-a1f8-37a0286df2c2","created_by":"Brandon George (blog post), Thomas Patzke (rule)","name":"Suspicious DNS Query for IP Lookup Service APIs","tags":["attack.reconnaissance","attack.t1590"],"interval":"5m","description":"Detects DNS queries for ip lookup services such as api.ipify.org not originating from a browser process.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of ip lookup services such as ipify API"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(dns.question.name:(/[Cc][Aa][Nn][Ii][Rr][Ee][Aa][Cc][Hh][Tt][Hh][Ee]\\.[Nn][Ee][Tt]/ OR /[Ii][Pp][Vv]4\\.[Ii][Cc][Aa][Nn][Hh][Aa][Zz][Ii][Pp]\\.[Cc][Oo][Mm]/ OR /[Ii][Pp]\\.[Aa][Nn][Yy][Ss][Rr][Cc]\\.[Nn][Ee][Tt]/ OR /[Ee][Dd][Nn][Ss]\\.[Ii][Pp]\\-[Aa][Pp][Ii]\\.[Cc][Oo][Mm]/ OR /[Ww][Tt][Ff][Ii][Ss][Mm][Yy][Ii][Pp]\\.[Cc][Oo][Mm]/ OR /[Cc][Hh][Ee][Cc][Kk][Ii][Pp]\\.[Dd][Yy][Nn][Dd][Nn][Ss]\\.[Oo][Rr][Gg]/ OR /[Aa][Pp][Ii]\\.2[Ii][Pp]\\.[Uu][Aa]/ OR /[Ii][Cc][Aa][Nn][Hh][Aa][Zz][Ii][Pp]\\.[Cc][Oo][Mm]/ OR /[Aa][Pp][Ii]\\.[Ii][Pp][Ii][Ff][Yy]\\.[Oo][Rr][Gg]/ OR /[Ii][Pp]\\-[Aa][Pp][Ii]\\.[Cc][Oo][Mm]/ OR /[Cc][Hh][Ee][Cc][Kk][Ii][Pp]\\.[Aa][Mm][Aa][Zz][Oo][Nn][Aa][Ww][Ss]\\.[Cc][Oo][Mm]/ OR /[Ii][Pp][Ee][Cc][Hh][Oo]\\.[Nn][Ee][Tt]/ OR /[Ii][Pp][Ii][Nn][Ff][Oo]\\.[Ii][Oo]/ OR /[Ii][Pp][Vv]4[Bb][Oo][Tt]\\.[Ww][Hh][Aa][Tt][Ii][Ss][Mm][Yy][Ii][Pp][Aa][Dd][Dd][Rr][Ee][Ss][Ss]\\.[Cc][Oo][Mm]/ OR /[Ff][Rr][Ee][Ee][Gg][Ee][Oo][Ii][Pp]\\.[Aa][Pp][Pp]/) AND (NOT (process.executable:(/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/))))","rule_id":"ec82e2a5-81ea-4211-a1f8-37a0286df2c2","timestamp_override":"event.ingested","references":["https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon","https://twitter.com/neonprimetime/status/1436376497980428318"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(dns.question.name:(canireachthe.net OR ipv4.icanhazip.com OR ip.anysrc.net OR edns.ip\\-api.com OR wtfismyip.com OR checkip.dyndns.org OR api.2ip.ua OR icanhazip.com OR api.ipify.org OR ip\\-api.com OR checkip.amazonaws.com OR ipecho.net OR ipinfo.io OR ipv4bot.whatismyipaddress.com OR freegeoip.app) AND (NOT (process.executable:(*\\\\chrome.exe OR *\\\\iexplore.exe OR *\\\\firefox.exe OR *\\\\brave.exe OR *\\\\opera.exe OR *\\\\msedge.exe OR *\\\\vivaldi.exe))))`"}
