{"id":"1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b","created_by":"yatinwad and TheDFIRReport","name":"DNS Query for Ufile.io Upload Domain","tags":["attack.exfiltration","attack.t1567.002"],"interval":"5m","description":"Detects DNS queries for subdomains used for upload to ufile.io","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Ufile upload"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"dns.question.name:/.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/","rule_id":"1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/12/13/diavol-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`dns.question.name:*ufile.io*`"}
