{"id":"7bd3902d-8b8b-4dd4-838a-c6862d40150d","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"DNS HybridConnectionManager Service Bus","tags":["attack.persistence","attack.t1554"],"interval":"5m","description":"Detects Azure Hybrid Connection Manager services querying the Azure service bus service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of Azure Hybrid Connection Manager and the Azure Service Bus service"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(dns.question.name:/.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Bb][Uu][Ss]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Nn][Ee][Tt].*/ AND process.executable:/.*[Hh][Yy][Bb][Rr][Ii][Dd][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/)","rule_id":"7bd3902d-8b8b-4dd4-838a-c6862d40150d","timestamp_override":"event.ingested","references":["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(dns.question.name:*servicebus.windows.net* AND process.executable:*HybridConnectionManager*)`"}
