{"id":"613c03ba-0779-4a53-8a1f-47f914a4ded3","created_by":"Aaron Greetham (@beardofbinary) - NCC Group","name":"DNS Query for MEGA.io Upload Domain","tags":["attack.exfiltration","attack.t1567.002"],"interval":"5m","description":"Detects DNS queries for subdomains used for upload to MEGA.io","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Mega upload"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"dns.question.name:/.*[Uu][Ss][Ee][Rr][Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Mm][Ee][Gg][Aa]\\.[Cc][Oo]\\.[Nn][Zz].*/","rule_id":"613c03ba-0779-4a53-8a1f-47f914a4ded3","timestamp_override":"event.ingested","references":["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`dns.question.name:*userstorage.mega.co.nz*`"}
