{"id":"a21bcd7e-38ec-49ad-b69a-9ea17e69509e","created_by":"frack113","name":"Suspicious Ldap Domain Access","tags":["attack.discovery","attack.t1482"],"interval":"5m","description":"Detect suspicious ldap request from non Windows application","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Programs that also lookup the observed domain"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(dns.question.name:/_[Ll][Dd][Aa][Pp]\\..*/ AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:/\\<[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\>/))))","rule_id":"a21bcd7e-38ec-49ad-b69a-9ea17e69509e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(dns.question.name:_ldap.* AND (NOT ((process.executable:C\\:\\\\Windows\\\\*) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:<unknown\\ process>))))`"}
