{"id":"778ba9a8-45e4-4b80-8e3e-34a419f0b85e","created_by":"Florian Roth","name":"Suspicious TeamViewer Domain Access","tags":["attack.command_and_control","attack.t1219"],"interval":"5m","description":"Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer client by an image that isn't named TeamViewer (sometimes used by threat actors for obfuscation)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown binary names of TeamViewer","Other programs that also lookup the observed domain"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(dns.question.name:(/[Tt][Aa][Ff]\\.[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /[Uu][Dd][Pp]\\.[Pp][Ii][Nn][Gg]\\.[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\.[Cc][Oo][Mm]/) AND (NOT (process.executable:/.*[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr].*/)))","rule_id":"778ba9a8-45e4-4b80-8e3e-34a419f0b85e","timestamp_override":"event.ingested","references":["https://www.teamviewer.com/en-us/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(dns.question.name:(taf.teamviewer.com OR udp.ping.teamviewer.com) AND (NOT (process.executable:*TeamViewer*)))`"}
