{"id":"f356a9c4-effd-4608-bbf8-408afd5cd006","created_by":"Florian Roth","name":"Suspicious Cobalt Strike DNS Beaconing","tags":["attack.command_and_control","attack.t1071.004"],"interval":"5m","description":"Detects a program that invoked suspicious DNS queries known from Cobalt Strike beacons","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(dns.question.name:(/[Aa][Aa][Aa]\\.[Ss][Tt][Aa][Gg][Ee]\\..*/ OR /[Pp][Oo][Ss][Tt]\\.1.*/) OR dns.question.name:/.*\\.[Ss][Tt][Aa][Gg][Ee]\\.123456\\..*/)","rule_id":"f356a9c4-effd-4608-bbf8-408afd5cd006","timestamp_override":"event.ingested","references":["https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns","https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(dns.question.name:(aaa.stage.* OR post.1*) OR dns.question.name:*.stage.123456.*)`"}
