{"id":"46deb5e1-28c9-4905-b2df-51cdcc9e6073","created_by":"oscd.community, Natalia Shornikova","name":"PowerShell Scripts Run by a Services","tags":["attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects powershell script installed as a Service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/)","rule_id":"46deb5e1-28c9-4905-b2df-51cdcc9e6073","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(*powershell* OR *pwsh*)`"}
