{"id":"2c4523d5-d481-4ed0-8ec3-7fbf0cb41a75","created_by":"Florian Roth","name":"Suspicious Driver Load from Temp","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects a driver load from a temporary directory","risk_score":73,"enabled":true,"severity":"high","false_positives":["There is a relevant set of false positives depending on applications in the environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/","rule_id":"2c4523d5-d481-4ed0-8ec3-7fbf0cb41a75","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\Temp\\\\*`"}
