{"id":"df5ff0a5-f83f-4a5b-bba1-3e6a3f6f6ea2","created_by":"Florian Roth, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community","name":"Credential Dumping Tools Service Execution","tags":["attack.credential_access","attack.execution","attack.t1003.001","attack.t1003.002","attack.t1003.004","attack.t1003.005","attack.t1003.006","attack.t1569.002","attack.s0005"],"interval":"5m","description":"Detects well-known credential dumping tools execution via service execution events","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Legitimate Administrator using credential dumping tool for password recovery"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/.*[Ff][Gg][Ee][Xx][Ee][Cc].*/ OR /.*[Dd][Uu][Mm][Pp][Ss][Vv][Cc].*/ OR /.*[Cc][Aa][Cc][Hh][Ee][Dd][Uu][Mm][Pp].*/ OR /.*[Mm][Ii][Mm][Ii][Dd][Rr][Vv].*/ OR /.*[Gg][Ss][Ee][Cc][Dd][Uu][Mm][Pp].*/ OR /.*[Ss][Ee][Rr][Vv][Pp][Ww].*/ OR /.*[Pp][Ww][Dd][Uu][Mm][Pp].*/)","rule_id":"df5ff0a5-f83f-4a5b-bba1-3e6a3f6f6ea2","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(*fgexec* OR *dumpsvc* OR *cachedump* OR *mimidrv* OR *gsecdump* OR *servpw* OR *pwdump*)`"}
