{"id":"1a42dfa6-6cb2-4df9-9b48-295be477e835","created_by":"Florian Roth","name":"Vulnerable WinRing0 Driver Load","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the load of a signed WinRing0 driver often used by threat actors, crypto miners (XMRIG) or malware for privilege escalation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ww][Ii][Nn][Rr][Ii][Nn][Gg]0[Xx]64\\.[Ss][Yy][Ss]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Ii][Nn][Gg]0\\.[Ss][Yy][Ss]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Ii][Nn][Gg]0\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Ii][Nn][Gg]0[Xx]64\\.[Dd][Ll][Ll]/) OR related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Dd]41[Ff][Aa]95[Dd]4642[Dd][Cc]981[Ff]10[Dd][Ee]36[Ff]4[Dd][Cc]8[Cc][Dd]7.*/ OR IMPHASH:/[Dd]41[Ff][Aa]95[Dd]4642[Dd][Cc]981[Ff]10[Dd][Ee]36[Ff]4[Dd][Cc]8[Cc][Dd]7/)","rule_id":"1a42dfa6-6cb2-4df9-9b48-295be477e835","timestamp_override":"event.ingested","references":["https://github.com/xmrig/xmrig/tree/master/bin/WinRing0"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\WinRing0x64.sys OR *\\\\WinRing0.sys OR *\\\\WinRing0.dll OR *\\\\WinRing0x64.dll) OR related.hash:*IMPHASH\\=D41FA95D4642DC981F10DE36F4DC8CD7* OR IMPHASH:d41fa95d4642dc981f10de36f4dc8cd7)`"}
