{"id":"9bacc538-d1b9-4d42-862e-469eafc05a41","created_by":"Florian Roth","name":"Vulnerable HW Driver Load","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the load of a legitimate signed driver named HW.sys by often used by threat actors or malware for privilege escalation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Hh][Ww]\\.[Ss][Yy][Ss]/ OR related.hash:(/.*[Ss][Hh][Aa]256\\=4880[Ff]40[Ff]2[Ee]557[Cc][Ff][Ff]38100620[Bb]9[Aa][Aa]1[Aa]3[Aa]753[Cc][Bb]693[Aa][Ff]16[Cc][Dd]3[Dd]95841583[Ee][Dd][Cc][Bb]57[Aa]8.*/ OR /.*[Ss][Hh][Aa]256\\=55963284[Bb][Bb][Dd]5[Aa]3297[Ff]39[Ff]12[Ff]0[Dd]8[Aa]01[Ee][Dd]99[Ff][Ee]59[Dd]008561[Ee]3537[Bb][Cc][Dd]4[Dd][Bb]4[Bb]4268[Ff][Aa].*/ OR /.*[Ss][Hh][Aa]256\\=6[Aa]4875[Aa][Ee]86131[Aa]594019[Dd][Ee][Cc]4[Aa][Bb][Dd]46[Aa][Cc]6[Bb][Aa]47[Ee]57[Aa]88287[Bb]814[Dd]07[Dd]929858[Ff][Ee]3[Ee]5.*/ OR /.*[Ss][Hh][Aa]1\\=74[Ee]4[Ee]3006[Bb]644392[Ff]5[Ff][Cc][Ee][Aa]4[Aa]9[Bb][Aa][Ee]1[Dd]9[Dd]84714[Bb]57.*/ OR /.*[Ss][Hh][Aa]1\\=18[Ff]34[Aa]0005[Ee]82[Aa]9[Aa]1556[Bb][Aa]40[Bb]997[Bb]0[Ee][Aa][Ee]554[Dd]5[Ff][Dd].*/ OR /.*[Ss][Hh][Aa]1\\=4[Ee]56[Ee]0[Bb]1[Dd]12664[Cc]05615[Cc]69697[Aa]2[Ff]5[Cc]5[Dd]893058[Aa].*/ OR /.*[Mm][Dd]5\\=3247014[Bb][Aa]35[Dd]406475311[Aa]2[Ee][Aa][Bb]0[Cc]4657.*/ OR /.*[Mm][Dd]5\\=376[Bb]1[Ee]8957227[Aa]3639[Ee][Cc]1482900[Dd]9[Bb]97.*/ OR /.*[Mm][Dd]5\\=45[Cc]2[Dd]133[Dd]41[Dd]2732[Ff]3653[Ee][Dd]615[Aa]745[Cc]8.*/) OR SHA256:(/4880[Ff]40[Ff]2[Ee]557[Cc][Ff][Ff]38100620[Bb]9[Aa][Aa]1[Aa]3[Aa]753[Cc][Bb]693[Aa][Ff]16[Cc][Dd]3[Dd]95841583[Ee][Dd][Cc][Bb]57[Aa]8/ OR /55963284[Bb][Bb][Dd]5[Aa]3297[Ff]39[Ff]12[Ff]0[Dd]8[Aa]01[Ee][Dd]99[Ff][Ee]59[Dd]008561[Ee]3537[Bb][Cc][Dd]4[Dd][Bb]4[Bb]4268[Ff][Aa]/ OR /6[Aa]4875[Aa][Ee]86131[Aa]594019[Dd][Ee][Cc]4[Aa][Bb][Dd]46[Aa][Cc]6[Bb][Aa]47[Ee]57[Aa]88287[Bb]814[Dd]07[Dd]929858[Ff][Ee]3[Ee]5/) OR SHA1:(/74[Ee]4[Ee]3006[Bb]644392[Ff]5[Ff][Cc][Ee][Aa]4[Aa]9[Bb][Aa][Ee]1[Dd]9[Dd]84714[Bb]57/ OR /18[Ff]34[Aa]0005[Ee]82[Aa]9[Aa]1556[Bb][Aa]40[Bb]997[Bb]0[Ee][Aa][Ee]554[Dd]5[Ff][Dd]/ OR /4[Ee]56[Ee]0[Bb]1[Dd]12664[Cc]05615[Cc]69697[Aa]2[Ff]5[Cc]5[Dd]893058[Aa]/) OR MD5:(/3247014[Bb][Aa]35[Dd]406475311[Aa]2[Ee][Aa][Bb]0[Cc]4657/ OR /376[Bb]1[Ee]8957227[Aa]3639[Ee][Cc]1482900[Dd]9[Bb]97/ OR /45[Cc]2[Dd]133[Dd]41[Dd]2732[Ff]3653[Ee][Dd]615[Aa]745[Cc]8/))","rule_id":"9bacc538-d1b9-4d42-862e-469eafc05a41","timestamp_override":"event.ingested","references":["https://decoded.avast.io/janvojtesek/the-return-of-candiru-zero-days-in-the-middle-east/","https://www.virustotal.com/gui/file/6a4875ae86131a594019dec4abd46ac6ba47e57a88287b814d07d929858fe3e5/details"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\HW.sys OR related.hash:(*SHA256\\=4880F40F2E557CFF38100620B9AA1A3A753CB693AF16CD3D95841583EDCB57A8* OR *SHA256\\=55963284BBD5A3297F39F12F0D8A01ED99FE59D008561E3537BCD4DB4B4268FA* OR *SHA256\\=6A4875AE86131A594019DEC4ABD46AC6BA47E57A88287B814D07D929858FE3E5* OR *SHA1\\=74E4E3006B644392F5FCEA4A9BAE1D9D84714B57* OR *SHA1\\=18F34A0005E82A9A1556BA40B997B0EAE554D5FD* OR *SHA1\\=4E56E0B1D12664C05615C69697A2F5C5D893058A* OR *MD5\\=3247014BA35D406475311A2EAB0C4657* OR *MD5\\=376B1E8957227A3639EC1482900D9B97* OR *MD5\\=45C2D133D41D2732F3653ED615A745C8*) OR SHA256:(4880f40f2e557cff38100620b9aa1a3a753cb693af16cd3d95841583edcb57a8 OR 55963284bbd5a3297f39f12f0d8a01ed99fe59d008561e3537bcd4db4b4268fa OR 6a4875ae86131a594019dec4abd46ac6ba47e57a88287b814d07d929858fe3e5) OR SHA1:(74e4e3006b644392f5fcea4a9bae1d9d84714b57 OR 18f34a0005e82a9a1556ba40b997b0eae554d5fd OR 4e56e0b1d12664c05615c69697a2f5c5d893058a) OR MD5:(3247014ba35d406475311a2eab0c4657 OR 376b1e8957227a3639ec1482900d9b97 OR 45c2d133d41d2732f3653ed615a745c8))`"}
