{"id":"295c9289-acee-4503-a571-8eacaef36b28","created_by":"Nasreddine Bencherchali","name":"Vulnerable HackSys Extreme Vulnerable Driver Load","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally vulnerable Windows driver developed for security enthusiasts to learn and polish their exploitation skills at Kernel level and often abused by threat actors","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Hh][Ee][Vv][Dd]\\.[Ss][Yy][Ss]/ OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ff]26[Dd]0[Bb]110873[Aa]1[Cc]7[Dd]8[Cc]4[Ff]08[Ff][Bb][Ee][Aa][Bb]89[Cc]5.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Cc]46[Ee][Aa]2[Ee]651[Ff][Dd]5[Ff]7[Ff]716[Cc]8867[Cc]6[Dd]13594.*/) OR IMPHASH:(/[Ff]26[Dd]0[Bb]110873[Aa]1[Cc]7[Dd]8[Cc]4[Ff]08[Ff][Bb][Ee][Aa][Bb]89[Cc]5/ OR /[Cc]46[Ee][Aa]2[Ee]651[Ff][Dd]5[Ff]7[Ff]716[Cc]8867[Cc]6[Dd]13594/))","rule_id":"295c9289-acee-4503-a571-8eacaef36b28","timestamp_override":"event.ingested","references":["https://github.com/hacksysteam/HackSysExtremeVulnerableDriver"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\HEVD.sys OR related.hash:(*IMPHASH\\=f26d0b110873a1c7d8c4f08fbeab89c5* OR *IMPHASH\\=c46ea2e651fd5f7f716c8867c6d13594*) OR IMPHASH:(f26d0b110873a1c7d8c4f08fbeab89c5 OR c46ea2e651fd5f7f716c8867c6d13594))`"}
