{"id":"7bcfeece-e5ed-4ff3-a5fb-2640d8cc8647","created_by":"Florian Roth","name":"Vulnerable GIGABYTE Driver Load","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the load of a signed and vulnerable GIGABYTE driver often used by threat actors or malware for privilege escalation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(related.hash:(/.*[Mm][Dd]5\\=9[Aa][Bb]9[Ff]3[Bb]75[Aa]2[Ee][Bb]87[Ff][Aa][Ff][Bb]1[Bb]7361[Bb][Ee]9[Dd][Ff][Bb]3.*/ OR /.*[Mm][Dd]5\\=[Cc]832[Aa]4313[Ff][Ff]082258240[Bb]61[Bb]88[Ee][Ff][Aa]025.*/ OR /.*[Ss][Hh][Aa]1\\=[Ff][Ee]10018[Aa][Ff]723986[Dd][Bb]50701[Cc]8532[Dd][Ff]5[Ee][Dd]98[Bb]17[Cc]39.*/ OR /.*[Ss][Hh][Aa]1\\=1[Ff]1[Cc][Ee]28[Cc]10453[Aa][Cc][Bb][Cc]9[Dd]3844[Bb]4604[Cc]59[Cc]0[Aa][Bb]0[Aa][Dd]46.*/ OR /.*[Ss][Hh][Aa]256\\=31[Ff]4[Cc][Ff][Bb]4[Cc]71[Dd][Aa]44120752721103[Aa]16512444[Cc]13[Cc]2[Aa][Cc]2[Dd]857[Aa]7[Ee]6[Ff]13[Cc][Bb]679[Bb]427.*/ OR /.*[Ss][Hh][Aa]256\\=[Cc][Ff][Cc]5[Cc]585[Dd][Dd]4[Ee]592[Dd][Dd]1[Aa]08887[Dd][Ee][Dd]28[Bb]92[Dd]9[Aa]5820587[Bb]6[Ff]4[Ff]8[Ff][Aa]4[Ff]56[Dd]60289259[Bb].*/) OR MD5:(/9[Aa][Bb]9[Ff]3[Bb]75[Aa]2[Ee][Bb]87[Ff][Aa][Ff][Bb]1[Bb]7361[Bb][Ee]9[Dd][Ff][Bb]3/ OR /[Cc]832[Aa]4313[Ff][Ff]082258240[Bb]61[Bb]88[Ee][Ff][Aa]025/) OR SHA1:(/[Ff][Ee]10018[Aa][Ff]723986[Dd][Bb]50701[Cc]8532[Dd][Ff]5[Ee][Dd]98[Bb]17[Cc]39/ OR /1[Ff]1[Cc][Ee]28[Cc]10453[Aa][Cc][Bb][Cc]9[Dd]3844[Bb]4604[Cc]59[Cc]0[Aa][Bb]0[Aa][Dd]46/) OR SHA256:(/31[Ff]4[Cc][Ff][Bb]4[Cc]71[Dd][Aa]44120752721103[Aa]16512444[Cc]13[Cc]2[Aa][Cc]2[Dd]857[Aa]7[Ee]6[Ff]13[Cc][Bb]679[Bb]427/ OR /[Cc][Ff][Cc]5[Cc]585[Dd][Dd]4[Ee]592[Dd][Dd]1[Aa]08887[Dd][Ee][Dd]28[Bb]92[Dd]9[Aa]5820587[Bb]6[Ff]4[Ff]8[Ff][Aa]4[Ff]56[Dd]60289259[Bb]/))","rule_id":"7bcfeece-e5ed-4ff3-a5fb-2640d8cc8647","timestamp_override":"event.ingested","references":["https://medium.com/@fsx30/weaponizing-vulnerable-driver-for-privilege-escalation-gigabyte-edition-e73ee523598b","https://twitter.com/malmoeb/status/1551449425842786306","https://github.com/fengjixuchui/gdrv-loader","https://www.virustotal.com/gui/file/31f4cfb4c71da44120752721103a16512444c13c2ac2d857a7e6f13cb679b427/details","https://www.virustotal.com/gui/file/cfc5c585dd4e592dd1a08887ded28b92d9a5820587b6f4f8fa4f56d60289259b/details"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(related.hash:(*MD5\\=9AB9F3B75A2EB87FAFB1B7361BE9DFB3* OR *MD5\\=C832A4313FF082258240B61B88EFA025* OR *SHA1\\=FE10018AF723986DB50701C8532DF5ED98B17C39* OR *SHA1\\=1F1CE28C10453ACBC9D3844B4604C59C0AB0AD46* OR *SHA256\\=31F4CFB4C71DA44120752721103A16512444C13C2AC2D857A7E6F13CB679B427* OR *SHA256\\=CFC5C585DD4E592DD1A08887DED28B92D9A5820587B6F4F8FA4F56D60289259B*) OR MD5:(9ab9f3b75a2eb87fafb1b7361be9dfb3 OR c832a4313ff082258240b61b88efa025) OR SHA1:(fe10018af723986db50701c8532df5ed98b17c39 OR 1f1ce28c10453acbc9d3844b4604c59c0ab0ad46) OR SHA256:(31f4cfb4c71da44120752721103a16512444c13c2ac2d857a7e6f13cb679b427 OR cfc5c585dd4e592dd1a08887ded28b92d9a5820587b6f4f8fa4f56d60289259b))`"}
