{"id":"7c676970-af4f-43c8-80af-ec9b49952852","created_by":"Nasreddine Bencherchali","name":"Vulnerable AVAST Anti Rootkit Driver Load","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the load of a signed and vulnerable AVAST Anti Rootkit driver often used by threat actors or malware for stopping and disabling AV and EDR products","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((related.hash:(/.*[Mm][Dd]5\\=[Aa]179[Cc]4093[Dd]05[Aa]3[Ee]1[Ee][Ee]73[Ff]6[Ff][Ff]07[Ff]994[Aa][Aa].*/ OR /.*[Ss][Hh][Aa]1\\=5[Dd]6[Bb]9[Ee]80[Ee]12[Bb][Ff][Cc]595[Dd]4[Dd]26[Ff]6[Aa][Ff][Bb]099[Bb]3[Cc][Bb]471[Dd][Dd]4.*/ OR /.*[Ss][Hh][Aa]256\\=4[Bb]5229[Bb]3250[Cc]8[Cc]08[Bb]98[Cc][Bb]710[Dd]6[Cc]056144271[Dd][Ee]099[Aa]57[Aa][Ee]09[Ff]5[Dd]2097[Ff][Cc]41[Bb][Dd]4[Ff]1.*/) OR MD5:/[Aa]179[Cc]4093[Dd]05[Aa]3[Ee]1[Ee][Ee]73[Ff]6[Ff][Ff]07[Ff]994[Aa][Aa]/ OR SHA1:/5[Dd]6[Bb]9[Ee]80[Ee]12[Bb][Ff][Cc]595[Dd]4[Dd]26[Ff]6[Aa][Ff][Bb]099[Bb]3[Cc][Bb]471[Dd][Dd]4/ OR SHA256:/4[Bb]5229[Bb]3250[Cc]8[Cc]08[Bb]98[Cc][Bb]710[Dd]6[Cc]056144271[Dd][Ee]099[Aa]57[Aa][Ee]09[Ff]5[Dd]2097[Ff][Cc]41[Bb][Dd]4[Ff]1/) OR (file.path:/.*\\\\[Aa][Ss][Ww][Aa][Rr][Pp][Oo][Tt]\\.[Ss][Yy][Ss]/ AND (file.code_signature.signed:/[Ff][Aa][Ll][Ss][Ee]/ OR file.code_signature.status:/[Ee][Xx][Pp][Ii][Rr][Ee][Dd]/)))","rule_id":"7c676970-af4f-43c8-80af-ec9b49952852","timestamp_override":"event.ingested","references":["https://www.aon.com/cyber-solutions/aon_cyber_labs/yours-truly-signed-av-driver-weaponizing-an-antivirus-driver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((related.hash:(*MD5\\=a179c4093d05a3e1ee73f6ff07f994aa* OR *SHA1\\=5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4* OR *SHA256\\=4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1*) OR MD5:a179c4093d05a3e1ee73f6ff07f994aa OR SHA1:5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4 OR SHA256:4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1) OR (file.path:*\\\\aswArPot.sys AND (file.code_signature.signed:false OR file.code_signature.status:Expired)))`"}
