{"id":"fed85bf9-e075-4280-9159-fbe8a023d6fa","created_by":"@ROxPinTeddy","name":"Advanced IP Scanner","tags":["attack.discovery","attack.t1046"],"interval":"5m","description":"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\ [Ii][Pp]\\ [Ss][Cc][Aa][Nn][Nn][Ee][Rr]\\ 2.*/","rule_id":"fed85bf9-e075-4280-9159-fbe8a023d6fa","timestamp_override":"event.ingested","references":["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/","https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html","https://labs.f-secure.com/blog/prelude-to-ransomware-systembc","https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf","https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\AppData\\\\Local\\\\Temp\\\\Advanced\\ IP\\ Scanner\\ 2*`"}
