{"id":"e3f673b3-65d1-4d80-9146-466f8b63fa99","created_by":"frack113","name":"Suspicious Appended Extension","tags":["attack.impact","attack.t1486"],"interval":"5m","description":"Detects possible ransomware adding a custom extension to the encrypted files, such as \".jpg.crypted\", \".docx.locky\" etc.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Backup software"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((OriginalFilename:(/.*\\.[Ll][Nn][Kk]/ OR /.*\\.[Rr][Tt][Ff]/ OR /.*\\.[Pp][Ss][Tt]/ OR /.*\\.[Dd][Oo][Cc][Xx]/ OR /.*\\.[Xx][Ll][Ss][Xx]/ OR /.*\\.[Jj][Pp][Gg]/ OR /.*\\.[Jj][Pp][Ee][Gg]/ OR /.*\\.[Pp][Nn][Gg]/ OR /.*\\.[Pp][Dd][Ff]/) AND file.path:(/.*\\.[Ll][Nn][Kk]\\..*/ OR /.*\\.[Rr][Tt][Ff]\\..*/ OR /.*\\.[Pp][Ss][Tt]\\..*/ OR /.*\\.[Dd][Oo][Cc][Xx]\\..*/ OR /.*\\.[Xx][Ll][Ss][Xx]\\..*/ OR /.*\\.[Jj][Pp][Gg]\\..*/ OR /.*\\.[Jj][Pp][Ee][Gg]\\..*/ OR /.*\\.[Pp][Nn][Gg]\\..*/ OR /.*\\.[Pp][Dd][Ff]\\..*/)) AND (NOT (file.path:(/.*\\.[Tt][Mm][Pp]/ OR /.*\\.[Bb][Aa][Kk]/ OR /.*\\.[Oo][Ll][Dd]/ OR /.*\\.[Oo][Rr][Ii][Gg]/ OR /.*\\.[Bb][Aa][Cc][Kk][Uu][Pp]/ OR /.*\\.[Tt][Ee][Mm][Pp]/))))","rule_id":"e3f673b3-65d1-4d80-9146-466f8b63fa99","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/","https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((OriginalFilename:(*.lnk OR *.rtf OR *.pst OR *.docx OR *.xlsx OR *.jpg OR *.jpeg OR *.png OR *.pdf) AND file.path:(*.lnk.* OR *.rtf.* OR *.pst.* OR *.docx.* OR *.xlsx.* OR *.jpg.* OR *.jpeg.* OR *.png.* OR *.pdf.*)) AND (NOT (file.path:(*.tmp OR *.bak OR *.old OR *.orig OR *.backup OR *.temp))))`"}
