{"id":"0e20c89d-2264-44ae-8238-aeeaba609ece","created_by":"Max Altgelt","name":"Office Template Creation","tags":["attack.persistence","attack.t1137"],"interval":"5m","description":"Detects creation of template files for Microsoft Office from outside Office","risk_score":73,"enabled":true,"severity":"high","false_positives":["Loading a user environment from a backup or a domain controller","Synchronization of templates"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((file.path:(/.*\\.[Dd][Oo][Tt]/ OR /.*\\.[Dd][Oo][Tt][Mm]/ OR /.*\\.[Dd][Oo][Cc]/ OR /.*\\.[Dd][Oo][Cc][Mm]/ OR /.*\\.[Dd][Oo][Cc][Xx]/ OR /.*\\.[Rr][Tt][Ff]/) AND file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Oo][Rr][Dd]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/) OR (file.path:(/.*\\.[Xx][Ll][Tt]/ OR /.*\\.[Xx][Ll][Tt][Mm]/ OR /.*\\.[Xx][Ll][Ss]/ OR /.*\\.[Xx][Ll][Ss][Mm]/ OR /.*\\.[Xx][Ll][Ss][Xx]/) AND file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/)) AND (NOT (process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/))))","rule_id":"0e20c89d-2264-44ae-8238-aeeaba609ece","timestamp_override":"event.ingested","references":["https://insight-jp.nttsecurity.com/post/102hojk/operation-restylink-apt-campaign-targeting-japanese-companies"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((file.path:(*.dot OR *.dotm OR *.doc OR *.docm OR *.docx OR *.rtf) AND file.path:*\\\\Microsoft\\\\Word\\\\Startup*) OR (file.path:(*.xlt OR *.xltm OR *.xls OR *.xlsm OR *.xlsx) AND file.path:*\\\\Microsoft\\\\Excel\\\\Startup*)) AND (NOT (process.executable:(*\\\\WINWORD.exe OR *\\\\EXCEL.exe))))`"}
