{"id":"3da70954-0f2c-4103-adff-b7440368f50e","created_by":"xknow (@xknow_infosec), xorxes (@xor_xes)","name":"Suspicious PROCEXP152.sys File Created In TMP","tags":["attack.t1562.001","attack.defense_evasion"],"interval":"5m","description":"Detects the creation of the PROCEXP152.sys file in the application-data local temporary folder. This driver is used by Sysinternals Process Explorer but also by KDU (https://github.com/hfiref0x/KDU) or Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other legimate tools using this driver and filename (like Sysinternals). Note - Clever attackers may easily bypass this detection by just renaming the driver filename. Therefore just Medium-level and don't rely on it."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND file.path:/.*[Pp][Rr][Oo][Cc][Ee][Xx][Pp]152\\.[Ss][Yy][Ss]/) AND (NOT (process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]64\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]\\.[Ee][Xx][Ee].*/))))","rule_id":"3da70954-0f2c-4103-adff-b7440368f50e","timestamp_override":"event.ingested","references":["https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*PROCEXP152.sys) AND (NOT (process.executable:(*\\\\procexp64.exe* OR *\\\\procexp.exe* OR *\\\\procmon64.exe* OR *\\\\procmon.exe*))))`"}
