{"id":"92fa78e7-4d39-45f1-91a3-8b23f3f1088d","created_by":"Christopher Peacock '@securepeacock', SCYTHE","name":"PowerShell Writing Startup Shortcuts","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Attempts to detect PowerShell writing startup shortcuts. This procedure was highlighted in Red Canary Intel Insights Oct. 2021, \"We frequently observe adversaries using PowerShell to write malicious .lnk files into the startup directory to establish persistence. Accordingly, this detection opportunity is likely to identify persistence mechanisms in multiple threats. In the context of Yellow Cockatoo, this persistence mechanism eventually launches the command-line script that leads to the installation of a malicious DLL\"","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown","Depending on your environment accepted applications may leverage this at times. It is recommended to search for anomalies inidicative of malware."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND file.path:/.*\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ AND file.path:/.*\\.[Ll][Nn][Kk]/)","rule_id":"92fa78e7-4d39-45f1-91a3-8b23f3f1088d","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/intelligence-insights-october-2021/","https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1547.001/T1547.001.md#atomic-test-7---add-executable-shortcut-link-to-user-startup-folder"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND file.path:*\\\\start\\ menu\\\\programs\\\\startup\\\\* AND file.path:*.lnk)`"}
