{"id":"c3e76af5-4ce0-4a14-9c9a-25ceb8fda182","created_by":"Florian Roth","name":"WerFault LSASS Process Memory Dump","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects WerFault creating a dump file with a name that indicates that the dump file could be an LSASS process memory, which contains user credentials","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\\\[Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee].*/))","rule_id":"c3e76af5-4ce0-4a14-9c9a-25ceb8fda182","timestamp_override":"event.ingested","references":["https://github.com/helpsystems/nanodump"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\WINDOWS\\\\system32\\\\WerFault.exe AND file.path:(*\\\\lsass* OR *lsass.exe*))`"}
