{"id":"d353dac0-1b41-46c2-820c-d7d2561fc6ed","created_by":"Julia Fomina, oscd.community","name":"AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects execution of attacker-controlled WsmPty.xsl or WsmTxt.xsl via winrm.vbs and copied cscript.exe (can be renamed)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*[Ww][Ss][Mm][Pp][Tt][Yy]\\.[Xx][Ss][Ll]/ OR /.*[Ww][Ss][Mm][Tt][Xx][Tt]\\.[Xx][Ss][Ll]/) AND (NOT (file.path:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))","rule_id":"d353dac0-1b41-46c2-820c-d7d2561fc6ed","timestamp_override":"event.ingested","references":["https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*WsmPty.xsl OR *WsmTxt.xsl) AND (NOT (file.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))))`"}
