{"id":"bdd8157d-8e85-4397-bb82-f06cc9c71dbb","created_by":"Christian Burkard","name":"UAC Bypass Using IEInstal - File","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Ii][Nn][Ss][Tt][Aa][Ll]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND file.path:/.*[Cc][Oo][Nn][Ss][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"bdd8157d-8e85-4397-bb82-f06cc9c71dbb","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\Program\\ Files\\\\Internet\\ Explorer\\\\IEInstal.exe AND file.path:C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*consent.exe)`"}
