{"id":"0a1f9d29-6465-4776-b091-7f43b26e4c89","created_by":"Cedric MAURUGEON","name":"Prefetch File Deletion","tags":["attack.defense_evasion","attack.t1070.004"],"interval":"5m","description":"Detects the deletion of a prefetch file (AntiForensic)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Rr][Ee][Ff][Ee][Tt][Cc][Hh]\\\\.*/ AND file.path:/.*\\.[Pp][Ff]/) AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/))))","rule_id":"0a1f9d29-6465-4776-b091-7f43b26e4c89","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:C\\:\\\\Windows\\\\Prefetch\\\\* AND file.path:*.pf) AND (NOT (process.executable:C\\:\\\\windows\\\\system32\\\\svchost.exe AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*))))`"}
