{"id":"80e1f67a-4596-4351-98f5-a9c3efabac95","created_by":"Florian Roth","name":"Suspicious Scheduled Task Write to System32 Tasks","tags":["attack.persistence","attack.execution","attack.t1053"],"interval":"5m","description":"Detects the creation of tasks from processes executed from suspicious locations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ss].*/ AND process.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee].*/))","rule_id":"80e1f67a-4596-4351-98f5-a9c3efabac95","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\Windows\\\\System32\\\\Tasks* AND process.executable:(*\\\\AppData\\\\* OR *C\\:\\\\PerfLogs* OR *\\\\Windows\\\\System32\\\\config\\\\systemprofile*))`"}
