{"id":"28208707-fe31-437f-9a7f-4b1108b94d2e","created_by":"Nasreddine Bencherchali","name":"Suspicious Startup Folder Persistence","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects when a file with a suspicious extension is created in the startup folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare legitimate usage of some of the extensions mentioned in the rule"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ AND file.path:(/.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Vv][Bb][Ee]/ OR /.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Pp][Ss]1/ OR /.*\\.[Hh][Tt][Aa]/ OR /.*\\.[Dd][Ll][Ll]/))","rule_id":"28208707-fe31-437f-9a7f-4b1108b94d2e","timestamp_override":"event.ingested","references":["https://github.com/last-byte/PersistenceSniper"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* AND file.path:(*.vbs OR *.vbe OR *.bat OR *.ps1 OR *.hta OR *.dll))`"}
