{"id":"b1decb61-ed83-4339-8e95-53ea51901720","created_by":"frack113","name":"Delete Log from Application","tags":["attack.defense_evasion","attack.t1070.004"],"interval":"5m","description":"Deletion of log files is a known anti-forensic technique","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/.*\\.[Ll][Oo][Gg]/ AND file.path:/.*\\\\[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]_.*/) AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)))","rule_id":"b1decb61-ed83-4339-8e95-53ea51901720","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:*.log AND file.path:*\\\\TeamViewer_*) AND (NOT (process.executable:C\\:\\\\Windows\\\\system32\\\\svchost.exe)))`"}
