{"id":"e15b518d-b4ce-4410-a9cd-501f23ce4a18","created_by":"frack113","name":"Suspicious Creation with Colorcpl","tags":["attack.defense_evasion","attack.t1564"],"interval":"5m","description":"Once executed, colorcpl.exe will copy the arbitrary file to c:\\windows\\system32\\spool\\drivers\\color\\","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Oo][Ll][Oo][Rr][Cc][Pp][Ll]\\.[Ee][Xx][Ee]/ AND (NOT (file.path:(/.*\\.[Ii][Cc][Mm]/ OR /.*\\.[Gg][Mm][Mm][Pp]/ OR /.*\\.[Cc][Dd][Mm][Pp]/ OR /.*\\.[Cc][Aa][Mm][Pp]/))))","rule_id":"e15b518d-b4ce-4410-a9cd-501f23ce4a18","timestamp_override":"event.ingested","references":["https://twitter.com/eral4m/status/1480468728324231172?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\colorcpl.exe AND (NOT (file.path:(*.icm OR *.gmmp OR *.cdmp OR *.camp))))`"}
