{"id":"06125661-3814-4e03-bfa2-1e4411c60ac3","created_by":"frack113","name":"Deletes Backup Files","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Adversaries may delete or remove built-in operating system data and turn off services designed to aid in the recovery of a corrupted system to prevent recovery.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitime usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\.[Vv][Hh][Dd]/ OR /.*\\.[Bb][Aa][Cc]/ OR /.*\\.[Bb][Aa][Kk]/ OR /.*\\.[Ww][Bb][Cc][Aa][Tt]/ OR /.*\\.[Bb][Kk][Ff]/ OR /.*\\.[Ss][Ee][Tt]/ OR /.*\\.[Ww][Ii][Nn]/ OR /.*\\.[Dd][Ss][Kk]/))","rule_id":"06125661-3814-4e03-bfa2-1e4411c60ac3","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-6---windows---delete-backup-files"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cmd.exe AND file.path:(*.VHD OR *.bac OR *.bak OR *.wbcat OR *.bkf OR *.set OR *.win OR *.dsk))`"}
