{"id":"e4a74e34-ecde-4aab-b2fb-9112dd01aed0","created_by":"frack113","name":"Dynamic C Sharp Compile Artefact","tags":["attack.defense_evasion","attack.t1027.004"],"interval":"5m","description":"When C# is compiled dynamically, a .cmdline file will be created as a part of the process.\nCertain processes are not typically observed compiling C# code, but can do so without touching disk.\nThis can be used to unpack a payload for execution\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\.[Cc][Mm][Dd][Ll][Ii][Nn][Ee]/","rule_id":"e4a74e34-ecde-4aab-b2fb-9112dd01aed0","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.004/T1027.004.md#atomic-test-2---dynamic-c-compile"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*.cmdline`"}
