{"id":"63e4f530-65dc-49cc-8f80-ccfa95c69d43","created_by":"Antonio Cocomazzi (idea), Florian Roth (rule)","name":"UAC Bypass Using EventVwr","tags":["attack.defense_evasion","attack.privilege_escalation"],"interval":"5m","description":"Detects the pattern of a UAC bypass using Windows Event Viewer","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Vv][Ee][Nn][Tt]\\ [Vv][Ii][Ee][Ww][Ee][Rr]\\\\[Rr][Ee][Cc][Ee][Nn][Tt][Vv][Ii][Ee][Ww][Ss].*/ AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))","rule_id":"63e4f530-65dc-49cc-8f80-ccfa95c69d43","timestamp_override":"event.ingested","references":["https://twitter.com/orange_8361/status/1518970259868626944?s=20&t=RFXqZjtA7tWM3HxqEH78Aw","https://twitter.com/splinter_code/status/1519075134296006662?s=12&t=DLUXH86WtcmG_AZ5gY3C6g"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\AppData\\\\Local\\\\Microsoft\\\\Event\\ Viewer\\\\RecentViews* AND (NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))))`"}
