{"id":"60c0a111-787a-4e8a-9262-ee485f3ef9d5","created_by":"Florian Roth, Sittikorn S","name":"Suspicious Word Cab File Write CVE-2021-40444","tags":["attack.resource_development","attack.t1587"],"interval":"5m","description":"Detects file creation patterns noticeable during the exploitation of CVE-2021-40444","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\.[Cc][Aa][Bb]/ AND file.path:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ee][Tt][Cc][Aa][Cc][Hh][Ee].*/) OR (process.executable:/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND file.path:/.*\\.[Ii][Nn][Ff].*/)) AND (NOT (file.path:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/ AND file.path:/.*\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Ii][Nn][Ff]/)))","rule_id":"60c0a111-787a-4e8a-9262-ee485f3ef9d5","timestamp_override":"event.ingested","references":["https://twitter.com/RonnyTNL/status/1436334640617373699?s=20","https://twitter.com/vanitasnk/status/1437329511142420483?s=21"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\winword.exe AND file.path:*.cab AND file.path:*\\\\Windows\\\\INetCache*) OR (process.executable:*\\\\winword.exe AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*.inf*)) AND (NOT (file.path:C\\:\\\\Users\\\\* AND file.path:*AppData\\\\Local\\\\Temp* AND file.path:*\\\\Content.inf)))`"}
