{"id":"d7b50671-d1ad-4871-aa60-5aa5b331fe04","created_by":"Nasreddine Bencherchali","name":"Creation Suspicious File In Uncommon AppData Folder","tags":["attack.defense_evasion","attack.execution"],"interval":"5m","description":"Detects the creation of suspicious files and folders inside the user's AppData folder but not inside any of the common and well known directories (Local, Romaing, LocalLow). This method could be used as a method to bypass detection who exclude the AppData folder in fear of FPs","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ AND file.path:(/.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Vv][Bb][Ee]/ OR /.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Mm][Ss][Ii]/ OR /.*\\.[Ii][Ss][Oo]/ OR /.*\\.[Ll][Nn][Kk]/ OR /.*\\.[Cc][Mm][Dd]/)) AND (NOT (file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll][Ll][Oo][Ww]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/))))","rule_id":"d7b50671-d1ad-4871-aa60-5aa5b331fe04","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:*\\\\AppData\\\\* AND file.path:(*.exe OR *.bat OR *.vbe OR *.vbs OR *.msi OR *.iso OR *.lnk OR *.cmd)) AND (NOT (file.path:(*\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\LocalLow\\\\* OR *\\\\AppData\\\\Roaming\\\\*))))`"}
