{"id":"e074832a-eada-4fd7-94a1-10642b130e16","created_by":"Markus Neis","name":"Detection of SafetyKatz","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects possible SafetyKatz Behaviour","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Tt][Ee][Mm][Pp]\\\\[Dd][Ee][Bb][Uu][Gg]\\.[Bb][Ii][Nn]/","rule_id":"e074832a-eada-4fd7-94a1-10642b130e16","timestamp_override":"event.ingested","references":["https://github.com/GhostPack/SafetyKatz"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\Temp\\\\debug.bin`"}
