{"id":"4358e5a5-7542-4dcb-b9f3-87667371839b","created_by":"Florian Roth","name":"ISO or Image Mount Indicator in Recent Files","tags":null,"interval":"5m","description":"Detects the creation of recent element file that points to an .ISO, .IMG, .VHD or .VHDX file as often used in phishing attacks. This can be a false positive on server systems but on workstations users should rarely mount .iso or .img files.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Cases in which a user mounts an image file for legitimate reasons"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\.[Ii][Ss][Oo]\\.[Ll][Nn][Kk]/ OR /.*\\.[Ii][Mm][Gg]\\.[Ll][Nn][Kk]/ OR /.*\\.[Vv][Hh][Dd]\\.[Ll][Nn][Kk]/ OR /.*\\.[Vv][Hh][Dd][Xx]\\.[Ll][Nn][Kk]/) AND file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Rr][Ee][Cc][Ee][Nn][Tt]\\\\.*/)","rule_id":"4358e5a5-7542-4dcb-b9f3-87667371839b","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/","https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore","https://blog.emsisoft.com/en/32373/beware-new-wave-of-malware-spreads-via-iso-file-email-attachments/","https://insights.sei.cmu.edu/blog/the-dangers-of-vhd-and-vhdx-files/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*.iso.lnk OR *.img.lnk OR *.vhd.lnk OR *.vhdx.lnk) AND file.path:*\\\\Microsoft\\\\Windows\\\\Recent\\\\*)`"}
