{"id":"297afac9-5d02-4138-8c58-b977bac60556","created_by":"frack113","name":"Creation of an Executable by an Executable","tags":["attack.resource_development","attack.t1587.001"],"interval":"5m","description":"Detects the creation of an executable by another executable","risk_score":21,"enabled":true,"severity":"low","false_positives":["Software installers","Update utilities"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\.[Ee][Xx][Ee]/ AND file.path:/.*\\.[Ee][Xx][Ee]/) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ll][Ee][Aa][Nn][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Xx][Gg][Ii][Aa][Dd][Aa][Pp][Tt][Ee][Rr][Cc][Aa][Cc][Hh][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Dd][Ii][Ss][Tt][Rr][Ii][Bb][Uu][Tt][Ii][Oo][Nn]\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\\\.*/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ AND process.executable:/.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/) OR file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/) OR (file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\.*/))))","rule_id":"297afac9-5d02-4138-8c58-b977bac60556","timestamp_override":"event.ingested","references":["Malware Sandbox"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*.exe AND file.path:*.exe) AND (NOT ((process.executable:(C\\:\\\\Windows\\\\System32\\\\msiexec.exe OR C\\:\\\\Windows\\\\system32\\\\cleanmgr.exe OR C\\:\\\\Windows\\\\explorer.exe OR C\\:\\\\WINDOWS\\\\system32\\\\dxgiadaptercache.exe OR C\\:\\\\WINDOWS\\\\system32\\\\Dism.exe OR C\\:\\\\Windows\\\\System32\\\\wuauclt.exe)) OR (process.executable:C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe AND file.path:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\Install\\\\*) OR (process.executable:C\\:\\\\Windows\\\\WinSxS\\\\* AND process.executable:*\\\\TiWorker.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) OR file.path:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\*) OR (file.path:*\\\\Microsoft\\\\WindowsApps\\\\*))))`"}
