{"id":"a5a2d357-1ab8-4675-a967-ef9990a59391","created_by":"Florian Roth","name":"LSASS Process Memory Dump Files","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects file names used by different memory dumping tools to create a memory dump of the LSASS process memory, which contains user credentials","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Dd][Mm][Pp]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Zz][Ii][Pp]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Rr][Aa][Rr]/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\[Dd][Uu][Mm][Pp][Ee][Rr][Tt]\\.[Dd][Mm][Pp]/ OR /.*\\\\[Aa][Nn][Dd][Rr][Ee][Ww]\\.[Dd][Mm][Pp]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Dd][Uu][Mm][Pp]\\.[Dd][Mm][Pp]/) OR file.path:(/.*\\\\[Ll][Ss][Aa][Ss][Ss]_2.*/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss][Dd][Mm][Pp].*/) OR (file.path:/.*\\\\[Ll][Ss][Aa][Ss][Ss].*/ AND file.path:/.*\\.[Dd][Mm][Pp].*/) OR (file.path:/.*[Ss][Qq][Ll][Dd][Mm][Pp][Rr].*/ AND file.path:/.*\\.[Mm][Dd][Mm][Pp]/) OR (file.path:/[Nn][Aa][Nn][Oo][Dd][Uu][Mm][Pp].*/ AND file.path:/.*\\.[Dd][Mm][Pp]/))","rule_id":"a5a2d357-1ab8-4675-a967-ef9990a59391","timestamp_override":"event.ingested","references":["https://www.google.com/search?q=procdump+lsass","https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf","https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/credential_access_lsass_memdump_file_created.toml","https://www.whiteoaksecurity.com/blog/attacks-defenses-dumping-lsass-no-mimikatz/","https://github.com/helpsystems/nanodump"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\lsass.dmp OR *\\\\lsass.zip OR *\\\\lsass.rar OR *\\\\Temp\\\\dumpert.dmp OR *\\\\Andrew.dmp OR *\\\\Coredump.dmp) OR file.path:(*\\\\lsass_2* OR *\\\\lsassdump* OR *\\\\lsassdmp*) OR (file.path:*\\\\lsass* AND file.path:*.dmp*) OR (file.path:*SQLDmpr* AND file.path:*.mdmp) OR (file.path:nanodump* AND file.path:*.dmp))`"}
