{"id":"a6976974-ea6f-4e97-818e-ea08625c52cb","created_by":"Greg (rule)","name":"RipZip Attack on Startup Folder","tags":["attack.t1547","attack.persistence"],"interval":"5m","description":"Detects a phishing attack which expands a ZIP file containing a malicious shortcut. If the victim expands the ZIP file via the explorer process, then the explorer process expands the malicious ZIP file and drops a malicious shortcut redirected to a backdoor into the Startup folder. Additionally, the file name of the malicious shortcut in Startup folder contains {0AFACED1-E828-11D1-9187-B532F1E9575D} meaning the folder shortcut operation.","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(TargetFileName:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/ AND TargetFileName:/.*\\.[Ll][Nn][Kk]\\.\\{0[Aa][Ff][Aa][Cc][Ee][Dd]1\\-[Ee]828\\-11[Dd]1\\-9187\\-[Bb]532[Ff]1[Ee]9575[Dd]\\}.*/ AND process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)","rule_id":"a6976974-ea6f-4e97-818e-ea08625c52cb","timestamp_override":"event.ingested","references":["https://twitter.com/jonasLyk/status/1549338335243534336?t=CrmPocBGLbDyE4p6zTX1cg&s=19"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(TargetFileName:*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup* AND TargetFileName:*.lnk.\\{0AFACED1\\-E828\\-11D1\\-9187\\-B532F1E9575D\\}* AND process.executable:*\\\\explorer.exe)`"}
