{"id":"cad1fe90-2406-44dc-bd03-59d0b58fe722","created_by":"Florian Roth","name":"NPPSpy Hacktool Usage","tags":["attack.credential_access"],"interval":"5m","description":"Detects the use of NPPSpy hacktool that stores cleartext passwords of users that logged in to a local file","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/.*\\\\[Nn][Pp][Pp][Ss][Pp][Yy]\\.[Tt][Xx][Tt]/ OR /.*\\\\[Nn][Pp][Pp][Ss][Pp][Yy]\\.[Dd][Ll][Ll]/)","rule_id":"cad1fe90-2406-44dc-bd03-59d0b58fe722","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md#atomic-test-2---credential-dumping-with-nppspy","https://twitter.com/0gtweet/status/1465282548494487554"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(*\\\\NPPSpy.txt OR *\\\\NPPSpy.dll)`"}
