{"id":"558eebe5-f2ba-4104-b339-36f7902bcc1a","created_by":"frack113, Florian Roth","name":"File Creation Date Changed to Another Year","tags":["attack.t1070.006","attack.defense_evasion"],"interval":"5m","description":"Attackers may change the file creation time of a backdoor to make it look like it was installed with the operating system.\nNote that many processes legitimately change the creation time of a file; it does not necessarily indicate malicious activity.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Changes made to or by the local NTP service"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((winlog.event_data.PreviousCreationUtcTime:/2022.*/ AND (NOT (winlog.event_data.CreationUtcTime:/2022.*/))) OR (winlog.event_data.PreviousCreationUtcTime:/202.*/ AND (NOT (winlog.event_data.CreationUtcTime:/202.*/)))) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Rr][Oo][Vv][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Uu][Ss][Oo][Cc][Oo][Rr][Ee][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Mm][Mm][Ee][Rr][Ss][Ii][Vv][Ee][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Pp][Aa][Nn][Ee][Ll]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Ee][Xx][Ee]/) OR file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Uu][Ss][Oo][Pp][Rr][Ii][Vv][Aa][Tt][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss][Tt][Oo][Rr][Ee]\\\\.*/ OR file.path:(/.*\\.[Tt][Mm][Pp]/ OR /.*\\.[Tt][Ee][Mm][Pp]/)))))","rule_id":"558eebe5-f2ba-4104-b339-36f7902bcc1a","timestamp_override":"event.ingested","references":["https://www.inversecos.com/2022/04/defence-evasion-technique-timestomping.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((winlog.event_data.PreviousCreationUtcTime:2022* AND (NOT (winlog.event_data.CreationUtcTime:2022*))) OR (winlog.event_data.PreviousCreationUtcTime:202* AND (NOT (winlog.event_data.CreationUtcTime:202*)))) AND (NOT ((process.executable:(C\\:\\\\Windows\\\\system32\\\\ProvTool.exe OR C\\:\\\\Windows\\\\System32\\\\usocoreworker.exe OR C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe) OR file.path:C\\:\\\\ProgramData\\\\USOPrivate\\\\UpdateStore\\\\* OR file.path:(*.tmp OR *.temp)))))`"}
