{"id":"2f9356ae-bf43-41b8-b858-4496d83b2acb","created_by":"@sam0x90","name":"ISO File Created Within Temp Folders","tags":["attack.initial_access","attack.t1566.001"],"interval":"5m","description":"Detects the creation of a ISO file in the Outlook temp folder or in the Appdata temp folder. Typical of Qakbot TTP from end-July 2022.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Potential FP by sysadmin opening a zip file containing a legitimate ISO file"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND file.path:/.*\\.[Zz][Ii][Pp]\\\\.*/ AND file.path:/.*\\.[Ii][Ss][Oo]/) OR (file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ee][Tt][Cc][Aa][Cc][Hh][Ee]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\.*/ AND file.path:/.*\\.[Ii][Ss][Oo]/))","rule_id":"2f9356ae-bf43-41b8-b858-4496d83b2acb","timestamp_override":"event.ingested","references":["https://twitter.com/Sam0x90/status/1552011547974696960","https://securityaffairs.co/wordpress/133680/malware/dll-sideloading-spread-qakbot.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*.zip\\\\* AND file.path:*.iso) OR (file.path:*\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\INetCache\\\\Content.Outlook\\\\* AND file.path:*.iso))`"}
