{"id":"e0a41412-c69a-446f-8e6e-0e6d7483dad7","created_by":"Florian Roth","name":"CVE-2022-24527 Microsoft Connected Cache LPE","tags":["attack.privilege_escalation","attack.t1059.001","cve.2022.24527"],"interval":"5m","description":"Detects files created during the local privilege exploitation of CVE-2022-24527 Microsoft Connected Cache","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Mm][Oo][Dd][Uu][Ll][Ee][Ss]\\\\[Ww][Ee][Bb][Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ww][Ee][Bb][Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ii][Oo][Nn]\\.[Pp][Ss][Mm]1/ AND (NOT (winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/))))","rule_id":"e0a41412-c69a-446f-8e6e-0e6d7483dad7","timestamp_override":"event.ingested","references":["https://www.rapid7.com/blog/post/2022/04/12/cve-2022-24527-microsoft-connected-cache-local-privilege-escalation-fixed/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*WindowsPowerShell\\\\Modules\\\\webAdministration\\\\webAdministration.psm1 AND (NOT (winlog.event_data.User:(*AUTHORI* OR *AUTORI*))))`"}
