{"id":"c3edc6a5-d9d4-48d8-930e-aab518390917","created_by":"Tobias Michalski","name":"Outlook Form Installation","tags":["attack.persistence","attack.t1137.003"],"interval":"5m","description":"Detects the creation of new Outlook form which can contain malicious code","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ff][Oo][Rr][Mm][Ss]\\\\.*/)","rule_id":"c3edc6a5-d9d4-48d8-930e-aab518390917","timestamp_override":"event.ingested","references":["https://twitter.com/blueteamsec1/status/1401290874202382336?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\outlook.exe AND file.path:*\\\\appdata\\\\local\\\\microsoft\\\\FORMS\\\\*)`"}
