{"id":"6ea858a8-ba71-4a12-b2cc-5d83312404c7","created_by":"Florian Roth","name":"Typical HiveNightmare SAM File Export","tags":["attack.credential_access","attack.t1552.001","cve.2021.36934"],"interval":"5m","description":"Detects files written by the different tools that exploit HiveNightmare","risk_score":73,"enabled":true,"severity":"high","false_positives":["Files that accidentally contain these strings"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Hh][Ii][Vv][Ee]_[Ss][Aa][Mm]_.*/ OR /.*\\\\[Ss][Aa][Mm]\\-2021\\-.*/ OR /.*\\\\[Ss][Aa][Mm]\\-2022\\-.*/ OR /.*\\\\[Ss][Aa][Mm]\\-2023\\-.*/ OR /.*\\\\[Ss][Aa][Mm]\\-[Hh][Aa][Xx][Xx].*/ OR /.*\\\\[Ss][Aa][Mm]\\.[Ss][Aa][Vv][Ee].*/) OR file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Aa][Mm]/)","rule_id":"6ea858a8-ba71-4a12-b2cc-5d83312404c7","timestamp_override":"event.ingested","references":["https://github.com/GossiTheDog/HiveNightmare","https://github.com/FireFart/hivenightmare/","https://github.com/WiredPulse/Invoke-HiveNightmare","https://twitter.com/cube0x0/status/1418920190759378944"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\hive_sam_* OR *\\\\SAM\\-2021\\-* OR *\\\\SAM\\-2022\\-* OR *\\\\SAM\\-2023\\-* OR *\\\\SAM\\-haxx* OR *\\\\Sam.save*) OR file.path:C\\:\\\\windows\\\\temp\\\\sam)`"}
