{"id":"34986307-b7f4-49be-92f3-e7a4d01ac5db","created_by":"Aaron Greetham (@beardofbinary) - NCC Group","name":"Rclone Config File Creation","tags":["attack.exfiltration","attack.t1567.002"],"interval":"5m","description":"Detects Rclone config file being created","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Rclone usage (rare)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*\\\\\\.[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Rr][Cc][Ll][Oo][Nn][Ee]\\\\.*/)","rule_id":"34986307-b7f4-49be-92f3-e7a4d01ac5db","timestamp_override":"event.ingested","references":["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\:\\\\Users\\\\* AND file.path:*\\\\.config\\\\rclone\\\\*)`"}
