{"id":"8c3c76ca-8f8b-4b1d-aaf3-81aebcd367c9","created_by":"frack113","name":"Creation Exe for Service with Unquoted Path","tags":["attack.persistence","attack.t1547.009"],"interval":"5m","description":"Adversaries may execute their own malicious payloads by hijacking vulnerable file path references.\nAdversaries can take advantage of paths that lack surrounding quotations by placing an executable in a higher level directory within the path, so that Windows will choose the adversary's executable to launch.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\.[Ee][Xx][Ee]/","rule_id":"8c3c76ca-8f8b-4b1d-aaf3-81aebcd367c9","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.009/T1574.009.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:C\\:\\\\program.exe`"}
