{"id":"8e1cb247-6cf6-42fa-b440-3f27d57e9936","created_by":"NVISO","name":"Microsoft Office Add-In Loading","tags":["attack.persistence","attack.t1137.006"],"interval":"5m","description":"Detects add-ins that load when Microsoft Word or Excel starts (.wll/.xll are simply .dll fit for Word or Excel).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate add-ins"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Oo][Rr][Dd]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ AND file.path:/.*\\.[Ww][Ll][Ll]/) OR (file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ AND file.path:/.*\\.[Xx][Ll][Ll]/) OR (file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ AND file.path:(/.*\\.[Xx][Ll][Aa][Mm]/ OR /.*\\.[Xx][Ll][Aa]/)))","rule_id":"8e1cb247-6cf6-42fa-b440-3f27d57e9936","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:*\\\\Microsoft\\\\Word\\\\Startup\\\\* AND file.path:*.wll) OR (file.path:*\\\\Microsoft\\\\Excel\\\\Startup\\\\* AND file.path:*.xll) OR (file.path:*\\\\Microsoft\\\\Addins\\\\* AND file.path:(*.xlam OR *.xla)))`"}
