{"id":"7fff6773-2baa-46de-a24a-b6eec1aba2d1","created_by":"Christian Burkard","name":"UAC Bypass Using NTFS Reparse Point - File","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe DLL hijacking (UACMe 36)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Pp][Ii]\\-[Mm][Ss]\\-[Ww][Ii][Nn]\\-[Cc][Oo][Rr][Ee]\\-[Kk][Ee][Rr][Nn][Ee][Ll]32\\-[Ll][Ee][Gg][Aa][Cc][Yy]\\-[Ll]1\\.[Dd][Ll][Ll]/)","rule_id":"7fff6773-2baa-46de-a24a-b6eec1aba2d1","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\api\\-ms\\-win\\-core\\-kernel32\\-legacy\\-l1.DLL)`"}
