{"id":"805c55d9-31e6-4846-9878-c34c75054fe9","created_by":"NVISO","name":"Octopus Scanner Malware","tags":["attack.t1195","attack.t1195.001"],"interval":"5m","description":"Detects Octopus Scanner Malware.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Aa][Cc][Hh][Ee]134\\.[Dd][Aa][Tt]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr][Ss][Yy][Nn][Cc]\\.[Dd][Bb]/)","rule_id":"805c55d9-31e6-4846-9878-c34c75054fe9","timestamp_override":"event.ingested","references":["https://securitylab.github.com/research/octopus-scanner-malware-open-source-supply-chain"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(*\\\\AppData\\\\Local\\\\Microsoft\\\\Cache134.dat OR *\\\\AppData\\\\Local\\\\Microsoft\\\\ExplorerSync.db)`"}
