{"id":"5f87308a-0a5b-4623-ae15-d8fa1809bc60","created_by":"elhoim","name":"Suspicious Files in Default GPO Folder","tags":["attack.t1036.005","attack.defense_evasion"],"interval":"5m","description":"Detects the creation of copy of suspicious files (EXE/DLL) to the default GPO storage folder","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\\\{31[Bb]2[Ff]340\\-016[Dd]\\-11[Dd]2\\-945[Ff]\\-00[Cc]04[Ff][Bb]984[Ff]9\\}\\\\.*/ AND file.path:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Ee][Xx][Ee]/))","rule_id":"5f87308a-0a5b-4623-ae15-d8fa1809bc60","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/intelligence-insights-november-2021/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\Policies\\\\\\{31B2F340\\-016D\\-11D2\\-945F\\-00C04FB984F9\\}\\\\* AND file.path:(*.dll OR *.exe))`"}
