{"id":"8c31f563-f9a7-450c-bfa8-35f8f32f1f61","created_by":"@ScoubiMtl","name":"Outlook C2 Macro Creation","tags":["attack.persistence","attack.command_and_control","attack.t1137","attack.t1008","attack.t1546"],"interval":"5m","description":"Detects the creation of a macro file for Outlook. Goes with win_outlook_c2_registry_key. VbaProject.OTM is explicitly mentioned in T1137. Particularly interesting if both events Registry & File Creation happens at the same time.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["User genuinly creates a VB Macro for their email"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Vv][Bb][Aa][Pp][Rr][Oo][Jj][Ee][Cc][Tt]\\.[Oo][Tt][Mm]/","rule_id":"8c31f563-f9a7-450c-bfa8-35f8f32f1f61","timestamp_override":"event.ingested","references":["https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\Microsoft\\\\Outlook\\\\VbaProject.OTM`"}
