{"id":"28a452f3-786c-4fd8-b8f2-bddbe9d616d1","created_by":"frack113","name":"Creation of an WerFault.exe in Unusual Folder","tags":["attack.persistence","attack.defense_evasion","attack.t1574.001"],"interval":"5m","description":"Detects WerFault copoed to a suspicious folder, which could be a sign of WerFault DLL hijacking","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Rr]\\.[Dd][Ll][Ll]/) AND (NOT (file.path:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/))))","rule_id":"28a452f3-786c-4fd8-b8f2-bddbe9d616d1","timestamp_override":"event.ingested","references":["https://www.bleepingcomputer.com/news/security/hackers-are-now-hiding-malware-in-windows-event-logs/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\WerFault.exe OR *\\\\wer.dll) AND (NOT (file.path:(*\\\\System32\\\\* OR *\\\\SysWOW64\\\\* OR *\\\\WinSxS\\\\*))))`"}
