{"id":"9433ff9c-5d3f-4269-99f8-95fc826ea489","created_by":"Florian Roth","name":"CrackMapExec File Creation Patterns","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects suspicious file creation patterns found in logs when CrackMapExec is used","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/) AND file.path:(/.*\\.[Rr][Tt][Ff]/ OR /.*\\.[Oo][Tt][Ff]/ OR /.*\\.[Oo][Dd][Tt]/ OR /.*\\.[Tt][Xx][Tt]/ OR /.*\\.[Dd][Oo][Cc]/ OR /.*\\.[Pp][Dd][Ff]/ OR /.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Dd][Oo][Cc][Xx]/ OR /.*\\.[Ww][Pp][Dd]/ OR /.*\\.[Ii][Cc][Nn][Ss]/ OR /.*\\.[Dd][Bb]/ OR /.*\\.[Ii][Nn][Ii]/ OR /.*\\.[Tt][Ee][Xx]/ OR /.*\\.[Ss][Yy][Ss]/ OR /.*\\.[Cc][Ss][Vv]/ OR /.*\\.[Ff][Oo][Nn]/ OR /.*\\.[Tt][Aa][Rr]/ OR /.*\\.[Tt][Tt][Ff]/ OR /.*\\.[Xx][Mm][Ll]/ OR /.*\\.[Cc][Ff][Gg]/ OR /.*\\.[Cc][Pp][Ll]/ OR /.*\\.[Jj][Pp][Gg]/ OR /.*\\.[Dd][Rr][Vv]/ OR /.*\\.[Cc][Uu][Rr]/ OR /.*\\.[Tt][Mm][Pp]/)) OR (file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)))","rule_id":"9433ff9c-5d3f-4269-99f8-95fc826ea489","timestamp_override":"event.ingested","references":["https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable:C\\:\\\\WINDOWS\\\\system32\\\\rundll32.exe AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*) AND file.path:(*.rtf OR *.otf OR *.odt OR *.txt OR *.doc OR *.pdf OR *.dll OR *.docx OR *.wpd OR *.icns OR *.db OR *.ini OR *.tex OR *.sys OR *.csv OR *.fon OR *.tar OR *.ttf OR *.xml OR *.cfg OR *.cpl OR *.jpg OR *.drv OR *.cur OR *.tmp)) OR (file.path:C\\:\\\\Windows\\\\Temp\\\\procdump.exe AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)))`"}
