{"id":"8d5aca11-22b3-4f22-b7ba-90e60533e1fb","created_by":"Nasreddine Bencherchali","name":"Wmiexec Default Output File","tags":["attack.lateral_movement","attack.t1047"],"interval":"5m","description":"Detects the creation of the default output filename used by the wmicexec tool","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\Windows\\\\__1\\d{9}\\.\\d{1,7}/","rule_id":"8d5aca11-22b3-4f22-b7ba-90e60533e1fb","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/blog/how-to-detect-and-prevent-impackets-wmiexec/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:/.*\\\\Windows\\\\__1\\d{9}\\.\\d{1,7}/`"}
