{"id":"bbfd974c-248e-4435-8de6-1e938c79c5c1","created_by":"frack113","name":"Rename Common File to DLL File","tags":null,"interval":"5m","description":"Detects cases in which a file gets renamed to .dll, which often happens to bypass perimeter protection","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Application installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\.[Dd][Ll][Ll]/ AND (NOT ((OriginalFilename:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Tt][Mm][Pp]/) OR OriginalFilename:(/.*\\.[Dd][Ll][Ll]\\..*/ OR /.*\\\\[Ss][Qq][Uu][Ii][Rr][Rr][Ee][Ll][Tt][Ee][Mm][Pp]\\\\[Tt][Ee][Mm][Pp].*/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ AND process.executable:/.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/))))","rule_id":"bbfd974c-248e-4435-8de6-1e938c79c5c1","timestamp_override":"event.ingested","references":["https://twitter.com/ffforward/status/1481672378639912960","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1036/T1036.md#atomic-test-1---system-file-copied-to-unusual-location"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*.dll AND (NOT ((OriginalFilename:(*.dll OR *.tmp) OR OriginalFilename:(*.dll.* OR *\\\\SquirrelTemp\\\\temp*)) OR (process.executable:C\\:\\\\Windows\\\\WinSxS\\\\* AND process.executable:*\\\\TiWorker.exe))))`"}
