{"id":"3d0ed417-3d94-4963-a562-4a92c940656a","created_by":"frack113","name":"Creation of a Diagcab","tags":["attack.resource_development"],"interval":"5m","description":"Detects the creation of diagcab file, which could be caused by some legitimate installer or is a sign of exploitation (review the filename and its location)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate microsoft diagcab"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\.[Dd][Ii][Aa][Gg][Cc][Aa][Bb]/","rule_id":"3d0ed417-3d94-4963-a562-4a92c940656a","timestamp_override":"event.ingested","references":["https://threadreaderapp.com/thread/1533879688141086720.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*.diagcab`"}
