{"id":"91cb43db-302a-47e3-b3c8-7ede481e27bf","created_by":"frack113","name":"Browser Credential Store Access","tags":["attack.t1003","attack.credential_access"],"interval":"5m","description":"Detects suspicious processes based on name and location that access the browser credential stores which can be the sign of credential stealing","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Antivirus, Anti-Spyware, Anti-Malware Software","Backup software"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\[Cc][Oo][Oo][Kk][Ii][Ee][Ss].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\ [Ss][Tt][Aa][Tt][Ee].*/) OR file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ee][Bb][Cc][Aa][Cc][Hh][Ee]\\\\[Ww][Ee][Bb][Cc][Aa][Cc][Hh][Ee][Vv]01\\.[Dd][Aa][Tt]/ OR /.*\\\\[Cc][Oo][Oo][Kk][Ii][Ee][Ss]\\.[Ss][Qq][Ll][Ii][Tt][Ee]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Kk][Ee][Yy]3\\.[Dd][Bb]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Kk][Ee][Yy]4\\.[Dd][Bb]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Ll][Oo][Gg][Ii][Nn][Ss]\\.[Jj][Ss][Oo][Nn]/)) AND (NOT ((process.executable:(/.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/)) OR (process.executable:(/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Pp][Cc][Oo][Pp][Yy][Aa][Cc][Cc][Ee][Ll][Ee][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Ss][Yy][Ss][Tt][Ee][Mm]/ AND process.parent.executable:/[Ii][Dd][Ll][Ee]/))))","rule_id":"91cb43db-302a-47e3-b3c8-7ede481e27bf","timestamp_override":"event.ingested","references":["https://www.zscaler.com/blogs/security-research/ffdroider-stealer-targeting-social-media-platform-users","https://github.com/lclevy/firepwd"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:(*\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\User\\ Data\\\\Default\\\\Network\\\\Cookies* OR *\\\\Appdata\\\\Local\\\\Chrome\\\\User\\ Data\\\\Default\\\\Login\\ Data* OR *\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\User\\ Data\\\\Local\\ State*) OR file.path:(*\\\\Appdata\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache\\\\WebCacheV01.dat OR *\\\\cookies.sqlite OR *release\\\\key3.db OR *release\\\\key4.db OR *release\\\\logins.json)) AND (NOT ((process.executable:(*\\\\firefox.exe OR *\\\\chrome.exe)) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\WINDOWS\\\\system32\\\\*)) OR (process.executable:(*\\\\MsMpEng.exe OR *\\\\MpCopyAccelerator.exe OR *\\\\thor64.exe OR *\\\\thor.exe)) OR (process.parent.executable:C\\:\\\\Windows\\\\System32\\\\msiexec.exe) OR (process.executable:System AND process.parent.executable:Idle))))`"}
