{"id":"52753ea4-b3a0-4365-910d-36cff487b789","created_by":"Samir Bousseaden","name":"Hijack Legit RDP Session to Move Laterally","tags":["attack.command_and_control","attack.t1219"],"interval":"5m","description":"Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Tt][Ss][Cc]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/)","rule_id":"52753ea4-b3a0-4365-910d-36cff487b789","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\mstsc.exe AND file.path:*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*)`"}
