{"id":"68578b43-65df-4f81-9a9b-92f32711a951","created_by":"Christian Burkard","name":"UAC Bypass Using Windows Media Player - File","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Oo][Ss][Kk][Ss][Uu][Pp][Pp][Oo][Rr][Tt]\\.[Dd][Ll][Ll]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Mm][Ee][Dd][Ii][Aa]\\ [Pp][Ll][Aa][Yy][Ee][Rr]\\\\[Oo][Ss][Kk]\\.[Ee][Xx][Ee]/))","rule_id":"68578b43-65df-4f81-9a9b-92f32711a951","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\OskSupport.dll) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\DllHost.exe AND file.path:C\\:\\\\Program\\ Files\\\\Windows\\ Media\\ Player\\\\osk.exe))`"}
