{"id":"b5b78988-486d-4a80-b991-930eff3ff8bf","created_by":"HieuTT35, Nasreddine Bencherchali","name":"PowerShell Profile Modification","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.013"],"interval":"5m","description":"Detects the creation or modification of a powershell profile which could indicate suspicious activity as the profile can be used as a mean of persistence","risk_score":73,"enabled":true,"severity":"high","false_positives":["System administrator create Powershell profile manually"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Vv]1\\.0\\\\[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/ OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\7\\\\[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/)","rule_id":"b5b78988-486d-4a80-b991-930eff3ff8bf","timestamp_override":"event.ingested","references":["https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/","https://persistence-info.github.io/Data/powershellprofile.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(*\\\\Microsoft.PowerShell_profile.ps1 OR *\\\\WindowsPowerShell\\\\profile.ps1 OR *\\\\PowerShell\\\\profile.ps1 OR *\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\profile.ps1 OR *\\\\Program\\ Files\\\\PowerShell\\\\7\\\\profile.ps1)`"}
