{"id":"5b40a734-99b6-4b98-a1d0-1cea51a08ab2","created_by":"Florian Roth","name":"Suspicious Interactive PowerShell as SYSTEM","tags":null,"interval":"5m","description":"Detects the creation of files that indicator an interactive use of PowerShell in the SYSTEM user context","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity","PowerShell scripts running as SYSTEM user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee]\\\\[Cc][Oo][Nn][Ss][Oo][Ll][Ee][Hh][Oo][Ss][Tt]_[Hh][Ii][Ss][Tt][Oo][Rr][Yy]\\.[Tt][Xx][Tt]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp][Pp][Rr][Oo][Ff][Ii][Ll][Ee][Dd][Aa][Tt][Aa]\\-[Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee]/)","rule_id":"5b40a734-99b6-4b98-a1d0-1cea51a08ab2","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/PowerSploit_Invoke-Mimikatz.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:(C\\:\\\\Windows\\\\System32\\\\config\\\\systemprofile\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\PowerShell\\\\PSReadLine\\\\ConsoleHost_history.txt OR C\\:\\\\Windows\\\\System32\\\\config\\\\systemprofile\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\PowerShell\\\\StartupProfileData\\-Interactive)`"}
