{"id":"3be82d5d-09fe-4d6a-a275-0d40d234d324","created_by":"Florian Roth","name":"InstallerFileTakeOver LPE CVE-2021-41379 File Create Event","tags":["attack.privilege_escalation","attack.t1068"],"interval":"5m","description":"Detects signs of the exploitation of LPE CVE-2021-41379 that include an msiexec process that creates an elevation_service.exe file","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown","Possibly some Microsoft Edge upgrades"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/ AND file.path:/.*\\\\[Ee][Ll][Ee][Vv][Aa][Tt][Ii][Oo][Nn]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/)","rule_id":"3be82d5d-09fe-4d6a-a275-0d40d234d324","timestamp_override":"event.ingested","references":["https://github.com/klinix5/InstallerFileTakeOver","https://www.zerodayinitiative.com/advisories/ZDI-21-1308/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msiexec.exe AND file.path:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application* AND file.path:*\\\\elevation_service.exe)`"}
