{"id":"7d604714-e071-49ff-8726-edeb95a70679","created_by":"frack113, Florian Roth","name":"Legitimate Application Dropped Script","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects programs on a Windows system that should not write scripts to disk","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Aa][Cc][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Qq][Nn][Ee][Dd][Tt]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Ss][Ii][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Oo][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Rr][Ee][Qq]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp][Ii][Mm][Gg][Dd][Oo][Ww][Nn][Ll][Dd][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Cc][Rr][Oo][Rr][Dd]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Dd][Rr][Cc][Ee][Ff]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/) AND file.path:(/.*\\.[Pp][Ss]1/ OR /.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Ss][Cc][Ff]/ OR /.*\\.[Ww][Ss][Ff]/ OR /.*\\.[Ww][Ss][Hh]/))","rule_id":"7d604714-e071-49ff-8726-edeb95a70679","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\eqnedt32.exe OR *\\\\visio.exe OR *\\\\wordpad.exe OR *\\\\wordview.exe OR *\\\\certutil.exe OR *\\\\certoc.exe OR *\\\\CertReq.exe OR *\\\\Desktopimgdownldr.exe OR *\\\\esentutl.exe OR *\\\\finger.exe OR *\\\\AcroRd32.exe OR *\\\\RdrCEF.exe OR *\\\\mshta.exe OR *\\\\hh.exe) AND file.path:(*.ps1 OR *.bat OR *.vbs OR *.scf OR *.wsf OR *.wsh))`"}
