{"id":"8fbf3271-1ef6-4e94-8210-03c2317947f6","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Cred Dump Tools Dropped Files","tags":["attack.credential_access","attack.t1003.001","attack.t1003.002","attack.t1003.003","attack.t1003.004","attack.t1003.005"],"interval":"5m","description":"Files with well-known filenames (parts of credential dump software or files produced by them) creation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Administrator using tool for password recovery"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Pp][Ww][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Kk][Ii][Rr][Bb][Ii].*/ OR /.*\\\\[Pp][Ww][Hh][Aa][Ss][Hh][Ee][Ss].*/ OR /.*\\\\[Ww][Cc][Ee]_[Cc][Cc][Aa][Cc][Hh][Ee].*/ OR /.*\\\\[Ww][Cc][Ee]_[Kk][Rr][Bb][Tt][Kk][Tt][Ss].*/ OR /.*\\\\[Ff][Gg][Dd][Uu][Mm][Pp]\\-[Ll][Oo][Gg].*/) OR file.path:(/.*\\\\[Tt][Ee][Ss][Tt]\\.[Pp][Ww][Dd]/ OR /.*\\\\[Ll][Ss][Rr][Ee][Mm][Oo][Rr][Aa]64\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Ss][Rr][Ee][Mm][Oo][Rr][Aa]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Gg][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Cc][Ee][Aa][Uu][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Aa][Mm]\\.[Oo][Uu][Tt]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Oo][Uu][Tt]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Oo][Uu][Tt]/ OR /.*\\\\[Nn][Tt][Dd][Ss]\\.[Oo][Uu][Tt]/ OR /.*\\\\[Dd][Uu][Mm][Pp][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Uu][Mm][Pp][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Cc][Hh][Ee][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Cc][Hh][Ee][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Tt][Gg][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Pp][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Pp][Ww]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/))","rule_id":"8fbf3271-1ef6-4e94-8210-03c2317947f6","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\pwdump* OR *\\\\kirbi* OR *\\\\pwhashes* OR *\\\\wce_ccache* OR *\\\\wce_krbtkts* OR *\\\\fgdump\\-log*) OR file.path:(*\\\\test.pwd OR *\\\\lsremora64.dll OR *\\\\lsremora.dll OR *\\\\fgexec.exe OR *\\\\wceaux.dll OR *\\\\SAM.out OR *\\\\SECURITY.out OR *\\\\SYSTEM.out OR *\\\\NTDS.out OR *\\\\DumpExt.dll OR *\\\\DumpSvc.exe OR *\\\\cachedump64.exe OR *\\\\cachedump.exe OR *\\\\pstgdump.exe OR *\\\\servpw.exe OR *\\\\servpw64.exe OR *\\\\pwdump.exe OR *\\\\procdump64.exe))`"}
