{"id":"ce7066a6-508a-42d3-995b-2952c65dc2ce","created_by":"Nasreddine Bencherchali","name":"Drop Binaries Into Spool Drivers Color Folder","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects the creation of suspcious binary files inside the \"\\windows\\system32\\spool\\drivers\\color\\\" as seen in the blog referenced below","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Cc][Oo][Ll][Oo][Rr]\\\\.*/ AND file.path:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Ss][Yy][Ss]/))","rule_id":"ce7066a6-508a-42d3-995b-2952c65dc2ce","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:C\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\* AND file.path:(*.dll OR *.exe OR *.sys))`"}
