{"id":"93d94efc-d7ad-4161-ad7d-1638c4f908d8","created_by":"Florian Roth","name":"Dumpert Process Dumper","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects the use of Dumpert process dumper, which dumps the lsass.exe process memory","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Very unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Dd][Uu][Mm][Pp][Ee][Rr][Tt]\\.[Dd][Mm][Pp]/","rule_id":"93d94efc-d7ad-4161-ad7d-1638c4f908d8","timestamp_override":"event.ingested","references":["https://github.com/outflanknl/Dumpert","https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:C\\:\\\\Windows\\\\Temp\\\\dumpert.dmp`"}
