{"id":"614a7e17-5643-4d89-b6fe-f9df1a79641c","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Wmiprvse Wbemcomn DLL Hijack","tags":["attack.execution","attack.t1047","attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenario.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Ss][Yy][Ss][Tt][Ee][Mm]/ AND file.path:/.*\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Bb][Ee][Mm][Cc][Oo][Mm][Nn]\\.[Dd][Ll][Ll]/)","rule_id":"614a7e17-5643-4d89-b6fe-f9df1a79641c","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:System AND file.path:*\\\\wbem\\\\wbemcomn.dll)`"}
