{"id":"318557a5-150c-4c8d-b70e-a9910e199857","created_by":"Vadim Varganov, Florian Roth","name":"MSDT.exe Creates Files in Autorun Directory","tags":["attack.persistence","attack.t1547.001","cve.2022.30190"],"interval":"5m","description":"Detects msdt.exe creating files in suspicious directories","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/))","rule_id":"318557a5-150c-4c8d-b70e-a9910e199857","timestamp_override":"event.ingested","references":["https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd","https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msdt.exe AND file.path:(*\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* OR *C\\:\\\\Users\\\\Public\\\\* OR *C\\:\\\\PerfLogs\\\\* OR *\\\\Desktop\\\\* OR *C\\:\\\\ProgramData\\\\*))`"}
