{"id":"d5866ddf-ce8f-4aea-b28e-d96485a20d3d","created_by":"Sander Wiebing, Tim Shelton","name":"File Created with System Process Name","tags":["attack.defense_evasion","attack.t1036.005"],"interval":"5m","description":"Detects the creation of an executable with a system process name in a suspicious folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["System processes copied outside their default folders for testing purposes","Third party software naming their software with the same names as the processes mentioned here"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ii][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Tt][Ii][Mm][Ee][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Dd][Ii][Oo][Dd][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ll][Aa][Nn][Ee][Xx][Tt]\\.[Ee][Xx][Ee]/) AND (NOT ((file.path:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ OR /\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/) AND process.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (file.path:/[Cc]\\:\\\\$[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.\\~[Bb][Tt]\\\\.*/ AND process.executable:/[Cc]\\:\\\\$[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.\\~[Bb][Tt]\\\\[Ss][Oo][Uu][Rr][Cc][Ee][Ss]\\\\[Ss][Ee][Tt][Uu][Pp][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (file.path:/.*\\\\[Rr][Uu][Nn][Tt][Ii][Mm][Ee][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Ee][Xx][Ee]/) OR (file.path:/.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Dd][Ii][Ss][Tt][Rr][Ii][Bb][Uu][Tt][Ii][Oo][Nn]\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\\\.*/ AND process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"d5866ddf-ce8f-4aea-b28e-d96485a20d3d","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\svchost.exe OR *\\\\rundll32.exe OR *\\\\services.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\regsvr32.exe OR *\\\\spoolsv.exe OR *\\\\lsass.exe OR *\\\\smss.exe OR *\\\\csrss.exe OR *\\\\conhost.exe OR *\\\\wininit.exe OR *\\\\lsm.exe OR *\\\\winlogon.exe OR *\\\\explorer.exe OR *\\\\taskhost.exe OR *\\\\Taskmgr.exe OR *\\\\sihost.exe OR *\\\\RuntimeBroker.exe OR *\\\\smartscreen.exe OR *\\\\dllhost.exe OR *\\\\audiodg.exe OR *\\\\wlanext.exe) AND (NOT ((file.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR \\\\SystemRoot\\\\System32\\\\*) AND process.executable:(*\\\\Windows\\\\System32\\\\dism.exe OR *\\\\TiWorker.exe)) OR (file.path:C\\:\\\\$WINDOWS.\\~BT\\\\* AND process.executable:C\\:\\\\$WINDOWS.\\~BT\\\\Sources\\\\SetupHost.exe) OR (file.path:*\\\\RuntimeBroker.exe AND process.executable:C\\:\\\\Windows\\\\system32\\\\wbengine.exe) OR (file.path:*\\\\spoolsv.exe AND file.path:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\* AND process.executable:*\\:\\\\Windows\\\\system32\\\\svchost.exe) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\wuauclt.exe))))`"}
