{"id":"48ea844d-19b1-4642-944e-fe39c2cc1fec","created_by":"Nasreddine Bencherchali","name":"UAC Bypass Using IDiagnostic Profile - File","tags":["attack.execution","attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the creation of a file by \"dllhost.exe\" in System32 directory part of \"IDiagnosticProfileUAC\" UAC bypass technique","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ AND file.path:/.*\\.[Dd][Ll][Ll]/)","rule_id":"48ea844d-19b1-4642-944e-fe39c2cc1fec","timestamp_override":"event.ingested","references":["https://github.com/Wh04m1001/IDiagnosticProfileUAC"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\DllHost.exe AND file.path:C\\:\\\\Windows\\\\System32\\\\* AND file.path:*.dll)`"}
