{"id":"0c3fac91-5627-46e8-a6a8-a0d7b9b8ae1b","created_by":"frack113","name":"Suspicious Get-Variable.exe Creation","tags":["attack.persistence","attack.t1546","attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Get-Variable is a valid PowerShell cmdlet\nWindowsApps is by default in the path where PowerShell is executed.\nSo when the Get-Variable command is issued on PowerShell execution, the system first looks for the Get-Variable executable in the path and executes the malicious binary instead of looking for the PowerShell cmdlet.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Gg][Ee][Tt]\\-[Vv][Aa][Rr][Ii][Aa][Bb][Ll][Ee]\\.[Ee][Xx][Ee]/","rule_id":"0c3fac91-5627-46e8-a6a8-a0d7b9b8ae1b","timestamp_override":"event.ingested","references":["https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/","https://www.joesandbox.com/analysis/465533/0/html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*Local\\\\Microsoft\\\\WindowsApps\\\\Get\\-Variable.exe`"}
