{"id":"162ab1e4-6874-4564-853c-53ec3ab8be01","created_by":"Florian Roth","name":"TeamViewer Remote Session","tags":["attack.command_and_control","attack.t1219"],"interval":"5m","description":"Detects the creation of log files during a TeamViewer remote session","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate uses of TeamViewer in an organisation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Pp][Rr][Ii][Nn][Tt][Ii][Nn][Gg]\\\\[Tt][Vv][Pp][Rr][Ii][Nn][Tt]\\.[Dd][Bb]/ OR /.*\\\\[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\\\[Tt][Vv][Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\.[Ll][Oo][Gg]/) OR (file.path:/.*\\\\[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr].*/ AND file.path:/.*_[Ll][Oo][Gg][Ff][Ii][Ll][Ee]\\.[Ll][Oo][Gg].*/))","rule_id":"162ab1e4-6874-4564-853c-53ec3ab8be01","timestamp_override":"event.ingested","references":["https://www.teamviewer.com/en-us/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\TeamViewer\\\\RemotePrinting\\\\tvprint.db OR *\\\\TeamViewer\\\\TVNetwork.log) OR (file.path:*\\\\TeamViewer* AND file.path:*_Logfile.log*))`"}
