{"id":"15904280-565c-4b73-9303-3291f964e7f9","created_by":"Nasreddine Bencherchali","name":"Persistence Via ErrorHandler.Cmd","tags":["attack.persistence"],"interval":"5m","description":"Detects creation of a file named \"ErrorHandler.cmd\" in the \"C:\\WINDOWS\\Setup\\Scripts\\\" directory which could be used as a method of persistence\nThe content of C:\\WINDOWS\\Setup\\Scripts\\ErrorHandler.cmd is read whenever some tools under C:\\WINDOWS\\System32\\oobe\\ (e.g. Setup.exe) fail to run for any reason.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ee][Rr][Rr][Oo][Rr][Hh][Aa][Nn][Dd][Ll][Ee][Rr]\\.[Cc][Mm][Dd]/","rule_id":"15904280-565c-4b73-9303-3291f964e7f9","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2022/01/16/beyond-good-ol-run-key-part-135/","https://github.com/last-byte/PersistenceSniper"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\WINDOWS\\\\Setup\\\\Scripts\\\\ErrorHandler.cmd`"}
