{"id":"4aafb0fa-bff5-4b9d-b99e-8093e659c65f","created_by":"frack113","name":"Writing Local Admin Share","tags":["attack.lateral_movement","attack.t1546.002"],"interval":"5m","description":"Aversaries may use to interact with a remote network share using Server Message Block (SMB).\nThis technique is used by post-exploitation frameworks.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\\\\\127\\.0\\.0.*/ AND file.path:/.*\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\.*/)","rule_id":"4aafb0fa-bff5-4b9d-b99e-8093e659c65f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-4---execute-command-writing-output-to-local-admin-share"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\\\\\127.0.0* AND file.path:*\\\\ADMIN$\\\\*)`"}
