{"id":"7b501acf-fa98-4272-aa39-194f82edc8a3","created_by":"Nasreddine Bencherchali","name":"CVE-2021-44077 POC Default Dropped File","tags":["attack.execution","cve.2021.44077"],"interval":"5m","description":"Detects the creation of \"msiexec.exe\" in the \"bin\" directory of the ManageEngine SupportCenter Plus (Related to CVE-2021-44077) and public POC available (See references section)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Mm][Aa][Nn][Aa][Gg][Ee][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Ss][Uu][Pp][Pp][Oo][Rr][Tt][Cc][Ee][Nn][Tt][Ee][Rr][Pp][Ll][Uu][Ss]\\\\[Bb][Ii][Nn]\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/","rule_id":"7b501acf-fa98-4272-aa39-194f82edc8a3","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/","https://github.com/horizon3ai/CVE-2021-44077/blob/b7a48e25824e8ead95e028475c7fd0e107e6e6bf/exploit.py"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\ManageEngine\\\\SupportCenterPlus\\\\bin\\\\msiexec.exe`"}
