{"id":"847def9e-924d-4e90-b7c4-5f581395a2b4","created_by":"Florian Roth","name":"QuarksPwDump Dump File","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects a dump file written by QuarksPwDump password dumper","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Aa][Mm]\\-.*/ AND file.path:/.*\\.[Dd][Mm][Pp].*/)","rule_id":"847def9e-924d-4e90-b7c4-5f581395a2b4","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/QuarksPWDump.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\AppData\\\\Local\\\\Temp\\\\SAM\\-* AND file.path:*.dmp*)`"}
