{"id":"33f41cdd-35ac-4ba8-814b-c6a4244a1ad4","created_by":"Thomas Patzke","name":"WMI Persistence - Script Event Consumer File Write","tags":["attack.t1546.003","attack.persistence"],"interval":"5m","description":"Detects file writes of WMI script event consumer","risk_score":73,"enabled":true,"severity":"high","false_positives":["Dell Power Manager (C:\\Program Files\\Dell\\PowerManager\\DpmPowerPlanSetup.exe)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/","rule_id":"33f41cdd-35ac-4ba8-814b-c6a4244a1ad4","timestamp_override":"event.ingested","references":["https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe`"}
