{"id":"97aa2e88-555c-450d-85a6-229bcd87efb8","created_by":"frack113","name":"Suspicious Screensaver Binary File Creation","tags":["attack.persistence","attack.t1546.002"],"interval":"5m","description":"Adversaries may establish persistence by executing malicious content triggered by user inactivity.\nScreensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\.[Ss][Cc][Rr]/ AND (NOT ((process.executable:(/.*\\\\[Kk][Ii][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Nn]\\\\[Cc][Cc][Ss][Vv][Cc][Hh][Ss][Tt]\\.[Ee][Xx][Ee]/)))))","rule_id":"97aa2e88-555c-450d-85a6-229bcd87efb8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*.scr AND (NOT ((process.executable:(*\\\\Kindle.exe OR *\\\\Bin\\\\ccSvcHst.exe)))))`"}
