{"id":"034affe8-6170-11ec-844f-0f78aa0c4d66","created_by":"David ANDRE","name":"Mimikatz MemSSP Default Log File Creation","tags":["attack.credential_access","attack.t1003"],"interval":"5m","description":"Detects Mimikatz MemSSP default log file creation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*[Mm][Ii][Mm][Ii][Ll][Ss][Aa]\\.[Ll][Oo][Gg]/","rule_id":"034affe8-6170-11ec-844f-0f78aa0c4d66","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2019/10/21/persistence-security-support-provider/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*mimilsa.log`"}
