{"id":"39f1f9f2-9636-45de-98f6-a4046aa8e4b9","created_by":"Beyu Denis, oscd.community, Tim Shelton","name":"Windows Webshell Creation","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Possible webshell file creation on a static web site","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrator or developer creating legitimate executable files in a web application folder"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((NOT (process.executable:/[Ss][Yy][Ss][Tt][Ee][Mm]/)) AND ((((file.path:/.*\\\\[Ii][Nn][Ee][Tt][Pp][Uu][Bb]\\\\[Ww][Ww][Ww][Rr][Oo][Oo][Tt]\\\\.*/ AND file.path:(/.*\\.[Aa][Ss][Pp].*/ OR /.*\\.[Aa][Ss][Hh][Xx].*/ OR /.*\\.[Pp][Hh].*/)) AND (NOT (file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/)))) OR ((file.path:(/.*\\\\[Ww][Ww][Ww]\\\\.*/ OR /.*\\\\[Hh][Tt][Dd][Oo][Cc][Ss]\\\\.*/ OR /.*\\\\[Hh][Tt][Mm][Ll]\\\\.*/) AND file.path:/.*\\.[Pp][Hh].*/) AND (NOT (file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))))) OR ((file.path:/.*\\.[Jj][Ss][Pp]/ OR (file.path:/.*\\\\[Cc][Gg][Ii]\\-[Bb][Ii][Nn]\\\\.*/ AND file.path:/.*\\.[Pp][Ll].*/)) AND (NOT (file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))))))","rule_id":"39f1f9f2-9636-45de-98f6-a4046aa8e4b9","timestamp_override":"event.ingested","references":["PT ESC rule and personal experience"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((NOT (process.executable:System)) AND ((((file.path:*\\\\inetpub\\\\wwwroot\\\\* AND file.path:(*.asp* OR *.ashx* OR *.ph*)) AND (NOT (file.path:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\*)))) OR ((file.path:(*\\\\www\\\\* OR *\\\\htdocs\\\\* OR *\\\\html\\\\*) AND file.path:*.ph*) AND (NOT (file.path:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\*))))) OR ((file.path:*.jsp OR (file.path:*\\\\cgi\\-bin\\\\* AND file.path:*.pl*)) AND (NOT (file.path:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\*))))))`"}
