{"id":"2bd63d53-84d4-4210-80ff-bf0658f1bf78","created_by":"Bhabesh Raj","name":"Pingback Backdoor","tags":["attack.persistence","attack.t1574.001"],"interval":"5m","description":"Detects the use of Pingback backdoor that creates ICMP tunnel for C2 as described in the trustwave report","risk_score":73,"enabled":true,"severity":"high","false_positives":["Very unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*[Uu][Pp][Dd][Aa][Tt][Aa]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Oo][Cc][Ii]\\.[Dd][Ll][Ll]/)","rule_id":"2bd63d53-84d4-4210-80ff-bf0658f1bf78","timestamp_override":"event.ingested","references":["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel","https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*updata.exe AND file.path:C\\:\\\\Windows\\\\oci.dll)`"}
