{"id":"3a9fa2ec-30bc-4ebd-b49e-7c9cff225502","created_by":"Nasreddine Bencherchali","name":"VsCode Powershell Profile Modification","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.013"],"interval":"5m","description":"Detects the creation or modification of a vscode related powershell profile which could indicate suspicious activity as the profile can be used as a mean of persistence","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of the profile by developers or administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Vv][Ss][Cc][Oo][Dd][Ee]_[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Pp][Ss]1/","rule_id":"3a9fa2ec-30bc-4ebd-b49e-7c9cff225502","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-7.2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\Microsoft.VSCode_profile.ps1`"}
