{"id":"4e7050dd-e548-483f-b7d6-527ab4fa784d","created_by":"Florian Roth","name":"Suspicious NTDS.DIT Creation","tags":["attack.credential_access","attack.t1003.003"],"interval":"5m","description":"Detects suspicious creations of a file named ntds.dit, e.g. by a PowerShell parent or in a suspicious directory or a suspicious one liner","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt]/ AND (process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/) OR process.parent.executable:(/.*\\\\[Aa][Pp][Aa][Cc][Hh][Ee].*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/) OR process.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/)))","rule_id":"4e7050dd-e548-483f-b7d6-527ab4fa784d","timestamp_override":"event.ingested","references":["https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration","https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/","https://pentestlab.blog/tag/ntds-dit/","https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\ntds.dit AND (process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe) OR process.parent.executable:(*\\\\apache* OR *\\\\tomcat* OR *\\\\AppData\\\\* OR *\\\\Temp\\\\* OR *\\\\Public\\\\* OR *\\\\PerfLogs\\\\*) OR process.executable:(*\\\\AppData\\\\* OR *\\\\Temp\\\\* OR *\\\\Public\\\\* OR *\\\\PerfLogs\\\\*)))`"}
