{"id":"02773bed-83bf-469f-b7ff-e676e7d78bab","created_by":"C.J. May","name":"BloodHound Collection Files","tags":["attack.discovery","attack.t1087.001","attack.t1087.002","attack.t1482","attack.t1069.001","attack.t1069.002","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects default file names outputted by the BloodHound collection tool SharpHound","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*_[Bb][Ll][Oo][Oo][Dd][Hh][Oo][Uu][Nn][Dd]\\.[Zz][Ii][Pp]/ OR /.*_[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Cc][Oo][Nn][Tt][Aa][Ii][Nn][Ee][Rr][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Dd][Oo][Mm][Aa][Ii][Nn][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Gg][Pp][Oo][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Gg][Rr][Oo][Uu][Pp][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Oo][Uu][Ss]\\.[Jj][Ss][Oo][Nn]/ OR /.*_[Uu][Ss][Ee][Rr][Ss]\\.[Jj][Ss][Oo][Nn]/) OR (file.path:/.*[Bb][Ll][Oo][Oo][Dd][Hh][Oo][Uu][Nn][Dd].*/ AND file.path:/.*\\.[Zz][Ii][Pp].*/))","rule_id":"02773bed-83bf-469f-b7ff-e676e7d78bab","timestamp_override":"event.ingested","references":["https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*_BloodHound.zip OR *_computers.json OR *_containers.json OR *_domains.json OR *_gpos.json OR *_groups.json OR *_ous.json OR *_users.json) OR (file.path:*BloodHound* AND file.path:*.zip*))`"}
