{"id":"5e3d3601-0662-4af0-b1d2-36a05e90c40a","created_by":"Teymur Kheirkhabarov, oscd.community","name":"LSASS Memory Dump File Creation","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"LSASS memory dump creation using operating systems utilities. Procdump will use process name in output file if no name is specified","risk_score":73,"enabled":true,"severity":"high","false_positives":["Dumping lsass memory for forensic investigation purposes by legitimate incident responder or forensic invetigator","Dumps of another process that contains lsass in its process name (substring)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*[Ll][Ss][Aa][Ss][Ss].*/ AND file.path:/.*[Dd][Mm][Pp]/)","rule_id":"5e3d3601-0662-4af0-b1d2-36a05e90c40a","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*lsass* AND file.path:*dmp)`"}
