{"id":"4e87b8e2-2ee9-4b2a-a715-4727d297ece0","created_by":"Florian Roth","name":"SAM Dump File Creation","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects the creation of files that look like exports of the local SAM (Security Account Manager)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare cases of administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Ss][Aa][Mm]\\.[Ss][Aa][Vv]/ OR /.*\\\\[Ii][Nn][Tt][Ee][Ll]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Ss][Aa][Mm]\\.[Hh][Ii][Vv][Ee]/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Ss][Aa][Mm]/ OR /.*_[Ss][Hh][Aa][Dd][Oo][Ww][Ss][Tt][Ee][Aa][Ll]\\.[Zz][Ii][Pp]/ OR /.*\\\\[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss]\\\\[Ss][Aa][Mm]\\.[Ee][Xx][Pp][Oo][Rr][Tt]/) OR file.path:/[Cc]\\:\\\\[Ss][Aa][Mm]/ OR file.path:(/.*\\\\[Hh][Ii][Vv][Ee]_[Ss][Aa][Mm]_.*/ OR /.*\\\\[Ss][Aa][Mm]\\.[Ss][Aa][Vv][Ee].*/ OR /.*\\\\[Ss][Aa][Mm]\\.[Ee][Xx][Pp][Oo][Rr][Tt].*/ OR /.*\\\\\\~[Rr][Ee][Gg]_[Ss][Aa][Mm]\\.[Ss][Aa][Vv][Ee].*/ OR /.*\\\\[Ss][Aa][Mm]_[Bb][Aa][Cc][Kk][Uu][Pp].*/ OR /.*\\\\[Ss][Aa][Mm]\\.[Bb][Cc][Kk].*/ OR /.*\\\\[Ss][Aa][Mm]\\.[Bb][Aa][Cc][Kk][Uu][Pp].*/))","rule_id":"4e87b8e2-2ee9-4b2a-a715-4727d297ece0","timestamp_override":"event.ingested","references":["https://github.com/search?q=CVE-2021-36934","https://github.com/cube0x0/CVE-2021-36934","https://www.google.com/search?q=%22reg.exe+save%22+sam","https://github.com/HuskyHacks/ShadowSteal","https://github.com/FireFart/hivenightmare"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\Temp\\\\sam OR *\\\\sam.sav OR *\\\\Intel\\\\sam OR *\\\\sam.hive OR *\\\\Perflogs\\\\sam OR *\\\\ProgramData\\\\sam OR *\\\\Users\\\\Public\\\\sam OR *\\\\AppData\\\\Local\\\\sam OR *\\\\AppData\\\\Roaming\\\\sam OR *_ShadowSteal.zip OR *\\\\Documents\\\\SAM.export) OR file.path:c\\:\\\\sam OR file.path:(*\\\\hive_sam_* OR *\\\\sam.save* OR *\\\\sam.export* OR *\\\\\\~reg_sam.save* OR *\\\\sam_backup* OR *\\\\sam.bck* OR *\\\\sam.backup*))`"}
