{"id":"9e099d99-44c2-42b6-a6d8-54c3545cab29","created_by":"Florian Roth","name":"Mimikatz Kirbi File Creation","tags":["attack.credential_access","attack.t1558"],"interval":"5m","description":"Detects the creation of files that contain Kerberos tickets based on an extension used by the popular tool Mimikatz","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\.[Kk][Ii][Rr][Bb][Ii]/","rule_id":"9e099d99-44c2-42b6-a6d8-54c3545cab29","timestamp_override":"event.ingested","references":["https://cobalt.io/blog/kerberoast-attack-techniques"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*.kirbi`"}
