{"id":"11b1ed55-154d-4e82-8ad7-83739298f720","created_by":"Florian Roth","name":"Suspicious Process Writes Ntds.dit","tags":["attack.credential_access","attack.t1003.002","attack.t1003.003"],"interval":"5m","description":"Detects suspicious processes that write (copy) a Active Directory database (ntds.dit) file","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt]/ AND process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Ll]\\.[Ee][Xx][Ee]/))","rule_id":"11b1ed55-154d-4e82-8ad7-83739298f720","timestamp_override":"event.ingested","references":["https://stealthbits.com/blog/extracting-password-hashes-from-the-ntds-dit-file/","https://adsecurity.org/?p=2398"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\ntds.dit AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe OR *\\\\wsl.exe))`"}
