{"id":"b06335b3-55ac-4b41-937e-16b7f5d57dfd","created_by":"Bhabesh Raj","name":"CVE-2021-26858 Exchange Exploitation","tags":["attack.t1203","attack.execution","cve.2021.26858"],"interval":"5m","description":"Detects possible successful exploitation for vulnerability described in CVE-2021-26858 by looking for | creation of non-standard files on disk by Exchange Server’s Unified Messaging service | which could indicate dropping web shells or other malicious content","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*[Uu][Mm][Ww][Oo][Rr][Kk][Ee][Rr][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ AND (NOT (file.path:(/.*[Cc][Aa][Cc][Hh][Ee][Cc][Ll][Ee][Aa][Nn][Uu][Pp]\\.[Bb][Ii][Nn]/ OR /.*\\.[Tt][Xx][Tt]/ OR /.*\\.[Ll][Oo][Gg]/ OR /.*\\.[Cc][Ff][Gg]/ OR /.*[Cc][Ll][Ee][Aa][Nn][Uu][Pp]\\.[Bb][Ii][Nn]/))))","rule_id":"b06335b3-55ac-4b41-937e-16b7f5d57dfd","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*UMWorkerProcess.exe AND (NOT (file.path:(*CacheCleanup.bin OR *.txt OR *.LOG OR *.cfg OR *cleanup.bin))))`"}
