{"id":"b8fd0e93-ff58-4cbd-8f48-1c114e342e62","created_by":"Nasreddine Bencherchali","name":"Windows Binaries Write Suspicious Extensions","tags":null,"interval":"5m","description":"Detects windows executables that writes files with suspicious extensions","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Tt][Ii][Mm][Ee][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ii][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/) AND file.path:(/.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Vv][Bb][Ee]/ OR /.*\\.[Tt][Xx][Tt]/ OR /.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Pp][Ss]1/ OR /.*\\.[Hh][Tt][Aa]/ OR /.*\\.[Ii][Ss][Oo]/))","rule_id":"b8fd0e93-ff58-4cbd-8f48-1c114e342e62","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\rundll32.exe OR *\\\\dllhost.exe OR *\\\\smss.exe OR *\\\\RuntimeBroker.exe OR *\\\\sihost.exe OR *\\\\lsass.exe OR *\\\\csrss.exe OR *\\\\winlogon.exe OR *\\\\wininit.exe) AND file.path:(*.bat OR *.vbe OR *.txt OR *.vbs OR *.exe OR *.ps1 OR *.hta OR *.iso))`"}
