{"id":"7280c9f3-a5af-45d0-916a-bc01cb4151c9","created_by":"Florian Roth","name":"Suspicious MSExchangeMailboxReplication ASPX Write","tags":["attack.initial_access","attack.t1190","attack.persistence","attack.t1505.003"],"interval":"5m","description":"Detects suspicious activity in which the MSExchangeMailboxReplication process writes .asp and .apsx files to disk, which could be a sign of ProxyShell exploitation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Mm][Aa][Ii][Ll][Bb][Oo][Xx][Rr][Ee][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\.[Aa][Ss][Pp][Xx]/ OR /.*\\.[Aa][Ss][Pp]/))","rule_id":"7280c9f3-a5af-45d0-916a-bc01cb4151c9","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blackbyte-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\MSExchangeMailboxReplication.exe AND file.path:(*.aspx OR *.asp))`"}
