{"id":"74babdd6-a758-4549-9632-26535279e654","created_by":"frack113","name":"Suspicious Executable File Creation","tags":["attack.defense_evasion","attack.t1564"],"interval":"5m","description":"Detect creation of suspicious executable file name. Some strings look for suspicious file extensions, others look for filenames that exploit unquoted service paths.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\.[Bb][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\.[Ss][Yy][Ss]\\.[Ee][Xx][Ee]/) OR file.path:(/[Cc]\\:\\\\$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss]\\ [Aa][Nn][Dd]\\ [Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Mm][Ss][Oo][Cc][Aa][Cc][Hh][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\.[Ee][Xx][Ee]/))","rule_id":"74babdd6-a758-4549-9632-26535279e654","timestamp_override":"event.ingested","references":["https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae","https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*.bat.exe OR *.sys.exe) OR file.path:(C\\:\\\\$Recycle.Bin.exe OR C\\:\\\\Documents\\ and\\ Settings.exe OR C\\:\\\\MSOCache.exe OR C\\:\\\\Recovery.exe OR C\\:\\\\PerfLogs.exe))`"}
