{"id":"409f8a98-4496-4aaa-818a-c931c0a8b832","created_by":"elhoim","name":"Created Files by Microsoft Sync Center","tags":["attack.t1055","attack.t1218","attack.execution","attack.defense_evasion"],"interval":"5m","description":"This rule detects suspicious files created by Microsoft Sync Center (mobsync)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Oo][Bb][Ss][Yy][Nn][Cc]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Ee][Xx][Ee]/))","rule_id":"409f8a98-4496-4aaa-818a-c931c0a8b832","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/intelligence-insights-november-2021/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\mobsync.exe AND file.path:(*.dll OR *.exe))`"}
