{"id":"5b2bbc47-dead-4ef7-8908-0cf73fcbecbf","created_by":"Bhabesh Raj","name":"Windows Spooler Service Suspicious File Deletion","tags":["attack.persistence","attack.defense_evasion","attack.privilege_escalation","attack.t1574","cve.2021.1675"],"interval":"5m","description":"Detect DLL deletions from Spooler Service driver folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND file.path:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\3\\\\.*/)","rule_id":"5b2bbc47-dead-4ef7-8908-0cf73fcbecbf","timestamp_override":"event.ingested","references":["https://github.com/hhlxf/PrintNightmare","https://github.com/cube0x0/CVE-2021-1675"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\spoolsv.exe AND file.path:*C\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\*)`"}
