{"id":"93a19907-d4f9-4deb-9f91-aac4692776a6","created_by":"Christian Burkard","name":"UAC Bypass Using .NET Code Profiler on MMC","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using .NET Code Profiler and mmc.exe DLL hijacking (UACMe 39)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Pp][Ee]386\\.[Dd][Ll][Ll]/)","rule_id":"93a19907-d4f9-4deb-9f91-aac4692776a6","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\pe386.dll)`"}
