{"id":"a1507d71-0b60-44f6-b17c-bf53220fdd88","created_by":"Bhabesh Raj","name":"Moriya Rootkit","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Mm][Oo][Rr][Ii][Yy][Aa][Ss][Tt][Rr][Ee][Aa][Mm][Ww][Aa][Tt][Cc][Hh][Mm][Ee][Nn]\\.[Ss][Yy][Ss]/","rule_id":"a1507d71-0b60-44f6-b17c-bf53220fdd88","timestamp_override":"event.ingested","references":["https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:C\\:\\\\Windows\\\\System32\\\\drivers\\\\MoriyaStreamWatchmen.sys`"}
