{"id":"e94b9ddc-eec5-4bb8-8a58-b9dc5f4e185f","created_by":"Nasreddine Bencherchali","name":"UEFI Persistence Via Wpbbin - FileCreation","tags":["attack.persistence","attack.defense_evasion","attack.t1542.001"],"interval":"5m","description":"Detects creation of a file named \"wpbbin\" in the \"%systemroot%\\system32\\\" directory. Which could be indicative of UEFI based persistence method","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet for the tip)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Pp][Bb][Bb][Ii][Nn]\\.[Ee][Xx][Ee]/","rule_id":"e94b9ddc-eec5-4bb8-8a58-b9dc5f4e185f","timestamp_override":"event.ingested","references":["https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c","https://persistence-info.github.io/Data/wpbbin.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:C\\:\\\\Windows\\\\System32\\\\wpbbin.exe`"}
