{"id":"e6ce8457-68b1-485b-9bdd-3c2b5d679aa9","created_by":"Antonlovesdnb","name":"VBA DLL Loaded Via Microsoft Word","tags":["attack.execution","attack.t1204.002"],"interval":"5m","description":"Detects DLL's Loaded Via Word Containing VBA Macros","risk_score":73,"enabled":true,"severity":"high","false_positives":["Alerts on legitimate macro usage as well, will need to filter as appropriate"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/) AND file.path:(/.*\\\\[Vv][Bb][Ee]7\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Bb][Ee][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Bb][Ee]7[Ii][Nn][Tt][Ll]\\.[Dd][Ll][Ll]/))","rule_id":"e6ce8457-68b1-485b-9bdd-3c2b5d679aa9","timestamp_override":"event.ingested","references":["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe OR *\\\\outlook.exe) AND file.path:(*\\\\VBE7.DLL OR *\\\\VBEUI.DLL OR *\\\\VBE7INTL.DLL))`"}
