{"id":"fe6e002f-f244-4278-9263-20e4b593827f","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Alternate PowerShell Hosts","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.pe.description:/[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]/ AND file.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn].*/) AND (NOT (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Cc][Oo][Rr][Ss][Vv][Ww]\\.[Ee][Xx][Ee]/) OR process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc]\\\\.*/))))","rule_id":"fe6e002f-f244-4278-9263-20e4b593827f","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190610201010.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.pe.description:System.Management.Automation AND file.path:*System.Management.Automation*) AND (NOT (process.executable:(*\\\\powershell.exe OR *\\\\mscorsvw.exe) OR process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Program\\ Files\\\\Citrix\\\\ConfigSync\\\\*))))`"}
