{"id":"ec8c4047-fad9-416a-8c81-0f479353d7f6","created_by":"Greg (rule)","name":"MSDT.exe Loading Diagnostic Library","tags":["attack.defense_evasion","attack.t1202","cve.2022.30190"],"interval":"5m","description":"Detects both of CVE-2022-30190 / Follina and DogWalk vulnerability exploiting msdt.exe binary to load sdiageng.dll binary","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Ss][Dd][Ii][Aa][Gg][Ee][Nn][Gg]\\.[Dd][Ll][Ll]/)","rule_id":"ec8c4047-fad9-416a-8c81-0f479353d7f6","timestamp_override":"event.ingested","references":["https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msdt.exe AND file.path:*\\\\sdiageng.dll)`"}
