{"id":"50f852e6-af22-4c78-9ede-42ef36aa3453","created_by":"Den Iuzvyk","name":"Abusing Azure Browser SSO","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1574.002"],"interval":"5m","description":"Detects abusing Azure Browser SSO by requesting OAuth 2.0 refresh tokens for an Azure-AD-authenticated Windows user (i.e. the machine is joined to Azure AD and a user logs in with their Azure AD account) wanting to perform SSO authentication in the browser. An attacker can use this to authenticate to Azure AD in a browser as that user.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Oo][Kk][Ee][Nn][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\.[Dd][Ll][Ll]/ AND (NOT (process.executable:(/.*\\\\[Bb][Aa][Cc][Kk][Gg][Rr][Oo][Uu][Nn][Dd][Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Vv][Ee][Nn][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\.[Ee][Xx][Ee]/) OR process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/)))","rule_id":"50f852e6-af22-4c78-9ede-42ef36aa3453","timestamp_override":"event.ingested","references":["https://posts.specterops.io/requesting-azure-ad-request-tokens-on-azure-ad-joined-machines-for-browser-sso-2b0409caad30"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*MicrosoftAccountTokenProvider.dll AND (NOT (process.executable:(*\\\\BackgroundTaskHost.exe OR *\\\\devenv.exe OR *\\\\iexplore.exe OR *\\\\MicrosoftEdge.exe OR *\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe OR *\\\\msedgewebview2.exe OR *\\\\OneDrive.exe) OR process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*)))`"}
