{"id":"092bc4b9-3d1d-43b4-a6b4-8c8acd83522f","created_by":"Tom Kern, oscd.community, Natalia Shornikova, Tim Shelton","name":"In-memory PowerShell","tags":["attack.t1059.001","attack.execution"],"interval":"5m","description":"Detects loading of essential DLL used by PowerShell, but not by the process powershell.exe. Detects meterpreter's \"load powershell\" extension.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Used by some .NET binaries, minimal on user workstation.","Used by Microsoft SQL Server Management Studio"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Nn][Ii]\\.[Dd][Ll][Ll]/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ss][Aa][Cc]\\.[Ee][Xx][Ee]/ OR process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Cc][Oo][Rr][Ss][Vv][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Ff][Xx][Vv][Gg][Pp][Uu][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Mm][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Nn][Cc][Aa][Pp][Pp][Vv][Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Ss][Cc][Rr][Ii][Pp][Tt][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\ .*\\\\[Cc][Oo][Mm][Mm][Oo][Nn].*\\\\[Ii][Dd][Ee]\\\\[Ss][Ss][Mm][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Dd][Ee]\\\\[Dd][Ee][Vv][Ee][Nn][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Hh][Uu][Bb]\\.[Vv][Ss][Dd][Ee][Tt][Oo][Uu][Rr][Ee][Dd][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Hh][Uu][Bb]\\.[Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Hh][Uu][Bb]\\.[Hh][Oo][Ss][Tt]\\.[Cc][Ll][Rr]\\.[Xx]86\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/)))))","rule_id":"092bc4b9-3d1d-43b4-a6b4-8c8acd83522f","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2921","https://github.com/p3nt4/PowerShdll"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\System.Management.Automation.Dll OR *\\\\System.Management.Automation.ni.Dll) AND (NOT ((process.executable:C\\:\\\\Windows\\\\System32\\\\dsac.exe OR process.executable:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\WINDOWS\\\\System32\\\\sdiagnhost.exe OR *\\\\mscorsvw.exe OR *\\\\WINDOWS\\\\System32\\\\RemoteFXvGPUDisablement.exe OR *\\\\sqlps.exe OR *\\\\wsmprovhost.exe OR *\\\\winrshost.exe OR *\\\\syncappvpublishingserver.exe OR *\\\\runscripthelper.exe OR *\\\\ServerManager.exe OR *\\\\Microsoft\\ SQL\\ Server\\ Management\\ Studio\\ *\\\\Common*\\\\IDE\\\\Ssms.exe OR *\\\\IDE\\\\devenv.exe OR *\\\\ServiceHub.VSDetouredHost.exe OR *\\\\ServiceHub.SettingsHost.exe OR *\\\\ServiceHub.Host.CLR.x86.exe OR *\\\\Citrix\\\\ConfigSync\\\\ConfigSyncRun.exe) OR process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\*)) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe)))))`"}
