{"id":"9313dc13-d04c-46d8-af4a-a930cc55d93b","created_by":"Nasreddine Bencherchali","name":"VMware Xfer Loading DLL from Nondefault Path","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects loading of a DLL by the VMware Xfer utility from the non-default directory which may be an attempt to sideload arbitrary DLL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee][Xx][Ff][Ee][Rr][Ll][Oo][Gg][Ss]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Gg][Ll][Ii][Bb]\\-2\\.0\\.[Dd][Ll][Ll]/) AND (NOT (file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\.*/)))","rule_id":"9313dc13-d04c-46d8-af4a-a930cc55d93b","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\VMwareXferlogs.exe AND file.path:*\\\\glib\\-2.0.dll) AND (NOT (file.path:C\\:\\\\Program\\ Files\\\\VMware\\\\*)))`"}
