{"id":"a5ea83a7-05a5-44c1-be2e-addccbbd8c03","created_by":"oscd.community, Dmitry Uchakin","name":"UAC Bypass With Fake DLL","tags":["attack.persistence","attack.defense_evasion","attack.privilege_escalation","attack.t1548.002","attack.t1574.002"],"interval":"5m","description":"Attempts to load dismcore.dll after dropping it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Actions of a legitimate telnet client"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Dd][Ii][Ss][Mm][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/) AND (NOT (file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\\\[Dd][Ii][Ss][Mm][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/)))","rule_id":"a5ea83a7-05a5-44c1-be2e-addccbbd8c03","timestamp_override":"event.ingested","references":["https://steemit.com/utopian-io/@ah101/uac-bypassing-utility"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\dism.exe AND file.path:*\\\\dismcore.dll) AND (NOT (file.path:C\\:\\\\Windows\\\\System32\\\\Dism\\\\dismcore.dll)))`"}
