{"id":"72ca7c75-bf85-45cd-aca7-255d360e423c","created_by":"Nasreddine Bencherchali, Wietze Beukema (project and research)","name":"Web Browsers DLL Sideloading","tags":["attack.defense_evasion","attack.persistence","attack.privilege_escalation","attack.t1574.001","attack.t1574.002"],"interval":"5m","description":"Detects DLL sideloading of DLLs that are part of web browsers","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]_[Ff][Rr][Aa][Mm][Ee]_[Hh][Ee][Ll][Pp][Ee][Rr]\\.[Dd][Ll][Ll]/ AND (NOT (file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/ OR file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/))))","rule_id":"72ca7c75-bf85-45cd-aca7-255d360e423c","timestamp_override":"event.ingested","references":["https://hijacklibs.net/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\chrome_frame_helper.dll AND (NOT (file.path:*\\\\AppData\\\\local\\\\Google\\\\Chrome\\\\Application\\\\* OR file.path:(C\\:\\\\Program\\ Files\\\\Google\\\\Chrome\\\\Application\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Google\\\\Chrome\\\\Application\\\\*))))`"}
