{"id":"0e277796-5f23-4e49-a490-483131d4f6e1","created_by":"Perez Diego (@darkquassar), oscd.community, Ecco","name":"Load of dbghelp/dbgcore DLL from Suspicious Process","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects the load of dbghelp/dbgcore DLL (used to make memory dumps) by suspicious processes. Tools like ProcessHacker and some attacker tradecract use MiniDumpWriteDump API found in dbghelp.dll or dbgcore.dll. As an example, SilentTrynity C2 Framework has a module that leverages this API to dump the contents of Lsass.exe and transfer it over the network back to the attacker's machine.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((file.path:(/.*\\\\[Dd][Bb][Gg][Hh][Ee][Ll][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Bb][Gg][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/) AND process.executable:(/.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (file.path:(/.*\\\\[Dd][Bb][Gg][Hh][Ee][Ll][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Bb][Gg][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/) AND file.code_signature.signed:/[Ff][Aa][Ll][Ss][Ee]/)) AND (NOT ((process.executable:/.*[Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR process.command_line:(/.*\\-[Kk]\\ [Ll][Oo][Cc][Aa][Ll][Ss][Yy][Ss][Tt][Ee][Mm][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ee][Dd].*/ OR /.*\\-[Kk]\\ [Uu][Nn][Ii][Ss][Tt][Aa][Cc][Kk][Ss][Vv][Cc][Gg][Rr][Oo][Uu][Pp]\\ \\-[Ss]\\ [Ww][Pp][Nn][Uu][Ss][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/)) OR (process.command_line:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss]\\ \\-[Pp]\\ \\-[Ss]\\ [Ww][Uu][Aa][Uu][Ss][Ee][Rr][Vv]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Ww][Ee][Rr][Ss][Vv][Cc][Gg][Rr][Oo][Uu][Pp]/)) OR (process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg]/))))","rule_id":"0e277796-5f23-4e49-a490-483131d4f6e1","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump","https://www.pinvoke.net/default.aspx/dbghelp/MiniDumpWriteDump.html","https://medium.com/@fsx30/bypass-edrs-memory-protection-introduction-to-hooking-2efb21acffd6"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((file.path:(*\\\\dbghelp.dll OR *\\\\dbgcore.dll) AND process.executable:(*\\\\msbuild.exe OR *\\\\cmd.exe OR *\\\\rundll32.exe OR *\\\\word.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\outlook.exe OR *\\\\monitoringhost.exe OR *\\\\wmic.exe OR *\\\\bash.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe OR *\\\\schtasks.exe OR *\\\\dnx.exe OR *\\\\regsvcs.exe OR *\\\\sc.exe OR *\\\\scriptrunner.exe)) OR (file.path:(*\\\\dbghelp.dll OR *\\\\dbgcore.dll) AND file.code_signature.signed:FALSE)) AND (NOT ((process.executable:*Visual\\ Studio* OR process.command_line:(*\\-k\\ LocalSystemNetworkRestricted* OR *\\-k\\ UnistackSvcGroup\\ \\-s\\ WpnUserService*)) OR (process.command_line:(C\\:\\\\Windows\\\\system32\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ wuauserv OR C\\:\\\\Windows\\\\System32\\\\svchost.exe\\ \\-k\\ WerSvcGroup)) OR (process.command_line:C\\:\\\\WINDOWS\\\\winsxs\\\\* AND process.command_line:*\\\\TiWorker.exe\\ \\-Embedding))))`"}
