{"id":"e32ce4f5-46c6-4c47-ba69-5de3c9193cd7","created_by":"Markus Neis","name":"Possible Process Hollowing Image Loading","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects Loading of samlib.dll, WinSCard.dll from untypical process e.g. through process hollowing by Mimikatz","risk_score":73,"enabled":true,"severity":"high","false_positives":["Very likely, needs more tuning"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\\\[Ss][Aa][Mm][Ll][Ii][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Cc][Aa][Rr][Dd]\\.[Dd][Ll][Ll]/))","rule_id":"e32ce4f5-46c6-4c47-ba69-5de3c9193cd7","timestamp_override":"event.ingested","references":["https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\notepad.exe AND file.path:(*\\\\samlib.dll OR *\\\\WinSCard.dll))`"}
