{"id":"7417e29e-c2e7-4cf6-a2e8-767228c64837","created_by":"Antonlovesdnb","name":"Active Directory Kerberos DLL Loaded Via Office Applications","tags":["attack.execution","attack.t1204.002"],"interval":"5m","description":"Detects Kerberos DLL being loaded by an Office Product","risk_score":73,"enabled":true,"severity":"high","false_positives":["Alerts on legitimate macro usage as well, will need to filter as appropriate"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/) AND file.path:/.*\\\\[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Ss]\\.[Dd][Ll][Ll]/)","rule_id":"7417e29e-c2e7-4cf6-a2e8-767228c64837","timestamp_override":"event.ingested","references":["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe OR *\\\\outlook.exe) AND file.path:*\\\\kerberos.dll)`"}
