{"id":"75e508f7-932d-4ebc-af77-269237a84ce1","created_by":"Nasreddine Bencherchali","name":"Cmstp Suspicious DLL Load","tags":["attack.defense_evasion","attack.t1218.003"],"interval":"5m","description":"Detects cmstp loading \"dll\" or \"ocx\" files from suspicious locations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/) AND file.path:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Oo][Cc][Xx]/) AND process.executable:/.*\\\\[Cc][Mm][Ss][Tt][Pp]\\.[Ee][Xx][Ee]/)","rule_id":"75e508f7-932d-4ebc-af77-269237a84ce1","timestamp_override":"event.ingested","references":["https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\Users\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Windows\\\\Temp\\\\*) AND file.path:(*.dll OR *.ocx) AND process.executable:*\\\\cmstp.exe)`"}
