{"id":"4fc0deee-0057-4998-ab31-d24e46e0aba4","created_by":"Nasreddine Bencherchali, Wietze Beukema (project and research), Chris Spehn (research WFH Dridex)","name":"System DLL Sideloading From Non System Locations","tags":["attack.defense_evasion","attack.persistence","attack.privilege_escalation","attack.t1574.001","attack.t1574.002"],"interval":"5m","description":"Detects DLL sideloading of DLLs usually located in system locations (System32, SysWOW64...)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate applications loading their own versions of the DLLs mentioned in this rule"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:(/.*\\\\[Ss][Hh][Ff][Oo][Ll][Dd][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Cc][Tt][Ii][Vv][Ee][Dd][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Dd][Ss][Ll][Dd][Pp][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Ee][Pp][Ii][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Pp][Pp][Hh][Ee][Ll][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ff][Rr][Aa][Mm][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Pp][Pp][Xx][Aa][Ll][Ll][Uu][Ss][Ee][Rr][Ss][Tt][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Pp][Pp][Xx][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ii][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Tt][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Uu][Dd][Ii][Oo][Ss][Ee][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Uu][Dd][Ii][Tt][Pp][Oo][Ll][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ff][Ww][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Uu][Tt][Hh][Zz]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Vv][Rr][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Cc][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Cc][Pp]47[Ll][Aa][Nn][Gg][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Cc][Pp]47[Mm][Rr][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Cc][Rr][Yy][Pp][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Aa][Bb][Ii][Nn][Ee][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Aa][Bb][Vv][Ii][Ee][Ww]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Ee][Nn][Rr][Oo][Ll][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ll][Dd][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ll][Ii][Pp][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ll][Uu][Ss][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Mm][Pp][Bb][Kk]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Ll][Oo][Rr][Aa][Dd][Aa][Pp][Tt][Ee][Rr][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Ll][Oo][Rr][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Mm][Dd][Ll][Gg]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Mm][Ee][Ss][Ss][Aa][Gg][Ii][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Ee][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Yy][Pp][Tt][Bb][Aa][Ss][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Yy][Pp][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Yy][Pp][Tt][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Yy][Pp][Tt][Xx][Mm][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ss][Cc][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ss][Cc][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Ss][Cc][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]2[Dd]1\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]10\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]10_1\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]10_1[Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]10[Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]10[Ww][Aa][Rr][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]11\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]12\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd]3[Dd]9\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Aa][Tt][Aa][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Aa][Vv][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Cc][Oo][Mm][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Ff][Rr][Aa][Gg][Pp][Rr][Oo][Xx][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp][Ss][Hh][Ee][Ll][Ll][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Aa][Ss][Ss][Oo][Cc][Ii][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Pp][Aa][Ii][Rr][Ii][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Vv][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ee][Vv][Rr][Tt][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Hh][Cc][Pp][Cc][Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Hh][Cc][Pp][Cc][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Hh][Cc][Pp][Cc][Ss][Vv][Cc]6\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ii][Rr][Ee][Cc][Tt][Mm][Aa][Nn][Ii][Pp][Uu][Ll][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ii][Ss][Mm][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ii][Ss][Mm][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Cc][Ff][Gg][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Cc][Mm][Nn][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Ee][Nn][Rr][Oo][Ll][Ll][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee][Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Ii][Ss][Oo]8601[Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Oo][Ll][Ee][Aa][Uu][Tt][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Xx][Mm][Ll][Ff][Ii][Ll][Tt][Ee][Rr][Ee][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Pp][Uu][Ss][Hh][Pp][Rr][Oo][Xx][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Xx][Mm][Ll][Hh][Ee][Ll][Pp][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Nn][Ss][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Oo][Tt]3[Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Oo][Tt]3[Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Rr][Pp][Rr][Oo][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ss][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ss][Pp][Aa][Rr][Ss][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ss][Rr][Ee][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ss][Rr][Oo][Ll][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Uu][Ii]70\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Uu][Ss][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Uu][Ss][Mm][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ww][Mm][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ww][Rr][Ii][Tt][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Xx][Gg][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Xx][Vv][Aa]2\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Aa][Pp][Pp][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Aa][Pp][Pp][Pp][Rr][Xx][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Dd][Pp][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Ff][Ss][Aa][Dd][Uu]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Ff][Ss][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Ss][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Xx][Ee][Cc][Mm][Oo][Dd][Ee][Ll][Pp][Rr][Oo][Xx][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr][Ff][Rr][Aa][Mm][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Aa][Ss][Tt][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Aa][Uu][Ll][Tt][Rr][Ee][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Dd][Dd][Ee][Vv][Qq][Uu][Ee][Rr][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ee][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Hh][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ll][Ii][Gg][Hh][Tt][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ll][Tt][Ll][Ii][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Vv][Ee][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ww][Bb][Aa][Ss][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ww][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ww][Pp][Oo][Ll][Ii][Cc][Yy][Ii][Oo][Mm][Gg][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Ww][Pp][Uu][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Gg][Ee][Tt][Uu][Nn][Aa][Mm][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Hh][Ii][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Hh][Nn][Ee][Tt][Mm][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Dd][Ss][Tt][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ee][Aa][Dd][Vv][Pp][Aa][Cc][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ee][Dd][Kk][Cc][Ss]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ff][Mm][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Pp][Hh][Ll][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Rr][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ss][Cc][Ss][Ii][Dd][Ss][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ss][Cc][Ss][Ii][Uu][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ss][Vv]\\.[Ee][Xx][Ee]_[Rr][Ss][Aa][Ee][Nn][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Jj][Oo][Ii][Nn][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Kk][Ss][Uu][Ss][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Kk][Tt][Mm][Ww]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Ii][Cc][Ee][Nn][Ss][Ee][Mm][Aa][Nn][Aa][Gg][Ee][Rr][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Ii][Cc][Ee][Nn][Ss][Ii][Nn][Gg][Dd][Ii][Aa][Gg][Ss][Pp][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Ii][Nn][Kk][Ii][Nn][Ff][Oo]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Oo][Aa][Dd][Pp][Ee][Rr][Ff]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Oo][Gg][Oo][Nn][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Oo][Gg][Oo][Nn][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Pp][Kk][Ss][Ee][Tt][Uu][Pp][Pp][Rr][Oo][Xx][Yy][Ss][Ee][Rr][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Aa][Gg][Nn][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Aa][Pp][Ii][Ss][Tt][Uu][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ff][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ff][Pp][Ll][Aa][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ii][Dd][Ii][Mm][Aa][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ii][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ll][Aa][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Mm][Dd][Ee][Vv][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Oo][Bb][Ii][Ll][Ee][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ii][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Pp][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Pp][Rr][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Rr][Mm][Cc][Oo][Rr][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Aa][Cc][Mm]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Mm][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Oo][Rr][Ee][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Tt][Ff]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Tt][Ff][Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Dd][Rr][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Ff][Tt][Ee][Dd][Ii][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Uu][Tt][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Ww][Bb]7\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Ww][Ss][Oo][Cc][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Xx][Mm][Ll]3\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Tt][Xx][Cc][Ll][Uu]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Aa][Pp][Ii][Nn][Ss][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Cc][Rr][Yy][Pp][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Dd][Ff][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Ii][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Ii][Oo][Hh][Ll][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Pp][Ll][Ww][Ii][Zz]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Pp][Rr][Oo][Ff][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Ee][Tt][Uu][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Hh][Ee][Ll][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Ww][Dd][Ee][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ii][Nn][Pp][Uu][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ll][Aa][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ll][Aa][Nn][Ss][Pp]_[Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Pp][Mm][Pp][Rr][Oo][Xx][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ss][Hh][Hh][Tt][Tt][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ss][Hh][Ii][Pp][Ss][Ee][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ss][Hh][Ww][Ff][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Tt][Dd][Ss][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Tt][Ll][Aa][Nn][Mm][Aa][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Tt][Ll][Mm][Ss][Hh][Aa][Rr][Ee][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Tt][Mm][Aa][Rr][Tt][Aa]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Tt][Ss][Hh][Rr][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Ll][Ee][Aa][Cc][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Mm][Aa][Dd][Mm][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Nn][Ee][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Ss][Bb][Aa][Ss][Ee][Ll][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Ss][Uu][Nn][Ii][Nn][Ss][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp]2[Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp]2[Pp][Nn][Ee][Tt][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp]9[Nn][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Cc][Aa][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Dd][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Ee][Ee][Rr][Dd][Ii][Ss][Tt][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Ll][Aa]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Nn][Rr][Pp][Nn][Ss][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Yy][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Oo][Ll][Ss][Tt][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Ii][Nn][Tt][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Oo][Pp][Ss][Yy][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Vv][Dd][Mm][Oo][Ff][Cc][Oo][Mm][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Uu][Ii][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Dd][Cc][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Ss][Aa][Pp][Ii]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Ss][Gg][Cc][Ww]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Ss][Mm][Aa][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Ss][Mm][Oo][Nn][Tt][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ee][Aa][Gg][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ee][Gg][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ee][Ss][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Mm][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Pp][Cc][Nn][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ss][Aa][Ee][Nn][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Tt][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Tt][Ww][Oo][Rr][Kk][Qq]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Aa][Mm][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Aa][Mm][Ll][Ii][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Aa][Pp][Ii]_[Oo][Nn][Ee][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Aa][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Cc][Aa][Nn][Ss][Ee][Tt][Tt][Ii][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Cc][Ee][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Cc][Hh][Ee][Dd][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ll][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Nn][Mm][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Pp][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Pp][Pp][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Rr][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Rr][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Rr][Vv][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ss][Pp]\\.[Ee][Xx][Ee]_[Rr][Ss][Aa][Ee][Nn][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ss][Pp]_[Ii][Ss][Vv]\\.[Ee][Xx][Ee]_[Rr][Ss][Aa][Ee][Nn][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ss][Pp][Ii][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ss][Ss][Hh][Ii][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Tt][Aa][Tt][Ee][Rr][Ee][Pp][Oo][Ss][Ii][Tt][Oo][Rr][Yy]\\.[Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Tt][Rr][Uu][Cc][Tt][Uu][Rr][Ee][Dd][Qq][Uu][Ee][Rr][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Xx][Ss][Hh][Aa][Rr][Ee][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Aa][Pp][Ii]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Bb][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Dd][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Qq][Uu][Ee][Rr][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ss][Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Tt][Dd][Rr][Ee][Cc][Oo][Rr][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ww][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ww][Ii][Nn][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ww][Ii][Nn][Uu][Ii]\\.[Aa][Pp][Pp][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Ii][Aa][Nn][Ii][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Ii][Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Ii][Rr][Ee][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Ii][Rr][Ii][Bb][Bb][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ee][Nn][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Tt][Ii][Ll][Dd][Ll][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Xx][Ii][Nn][Ii][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Xx][Tt][Hh][Ee][Mm][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Aa][Uu][Ll][Tt][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Ii][Rr][Tt][Dd][Ii][Ss][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Ss][Ss][Tt][Rr][Aa][Cc][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Cc][Mm][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Cc][Nn][Nn][Ee][Tt][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Dd][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Dd][Ss][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ee][Bb][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ee][Cc][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ee][Vv][Tt][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Hh][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Mm][Gg][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Bb][Rr][Aa][Nn][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Ss][Ee][Aa][Rr][Cc][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Cc][Oo][Dd][Ee][Cc][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Cc][Oo][Dd][Ee][Cc][Ss][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Uu][Dd][Kk]\\.[Ss][Hh][Ee][Ll][Ll][Cc][Oo][Mm][Mm][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Hh][Tt][Tt][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ee][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Pp][Ss][Ee][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Mm][Dd][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Mm][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Nn][Ss][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Nn][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Qq][Ll][Ii][Tt][Ee]3\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Tt][Aa]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Kk][Ss][Cc][Ll][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ll][Aa][Nn][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ll][Aa][Nn][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ll][Dd][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ll][Ii][Dd][Pp][Rr][Oo][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Dd][Cc][Oo][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ss][Gg][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Oo][Ff][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Pp][Dd][Ss][Hh][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ss][Hh][Bb][Tt][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ss][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Tt][Ss][Aa][Pp][Ii]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ww][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx][Mm][Ll][Ll][Ii][Tt][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx][Oo][Ll][Ee][Hh][Ll][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx][Ww][Ii][Zz][Aa][Rr][Dd][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx][Ww][Tt][Pp][Ww]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Cc][Ll][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Dd][Ee][Rr][Ee][Pp][Aa][Ii][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Oo][Oo][Tt][Mm][Ee][Nn][Uu][Uu][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Cc][Nn][Tt][Ee][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ww][Mm][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Yy][Nn][Aa][Mm][Oo][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Hh][Ss][Vv][Cc][Cc][Tt][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Xx][Ss][Ss][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ll][Oo][Gg][Gg][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Uu][Mm][Bb][Aa][Ss][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Kk][Dd][Ss][Tt][Uu][Bb]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Aa][Ii][Nn][Tt][Ee][Nn][Aa][Nn][Cc][Ee][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Dd][Mm][Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ii][Nn][Tt][Dd][Hh]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Dd][Tt][Cc][Tt][Mm]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Tt][Rr][Aa][Cc][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Ss][Kk][Ss][Uu][Pp][Pp][Oo][Rr][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ee][Ss][Ee][Tt][Ee][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Ee][Ss][Ee][Tt][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Pp][Ee][Cc][Tt][Rr][Uu][Mm][Ss][Yy][Nn][Cc][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Rr][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss][Tt][Hh][Rr][Ee][Ss][Hh][Oo][Ll][Dd][Aa][Dd][Mm][Ii][Nn][Ff][Ll][Oo][Ww][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ii][Mm][Ee][Ss][Yy][Nn][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Pp][Ss][Hh][Aa][Rr][Ee][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Pp][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ww][Aa][Nn][Cc][Ff][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Pp][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Xx][Ss][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Xx][Ss][Tt][Ii][Ff][Ff]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx][Pp][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Aa][Pp][Pp][Vv][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Aa][Tt][Mm][Ee][Tt][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Bb][Oo][Oo][Tt][Uu][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Mm][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Mm][Aa][Nn][Aa][Gg][Ee][Rr]2\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Dd][Pp][Ll][Uu][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Uu][Ii][Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Rr][Yy][Pp][Tt][Ss][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Mm][Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Rr][Vv][Ss][Tt][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Ss][Pp][Rr][Oo][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Dd][Xx][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ee][Dd][Gg][Ee][Ii][Ss][Oo]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Rr][Aa][Mm][Ee][Dd][Yy][Nn][Oo][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Vv][Ee][Ss][Kk][Yy][Bb][Aa][Cc][Kk][Uu][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ff][Vv][Ee][Ww][Ii][Zz]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Gg][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Cc][Mm][Pp]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Ff][Ss][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ii][Uu][Mm][Ss][Dd][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Oo][Cc][Kk][Hh][Oo][Ss][Tt][Ii][Nn][Gg][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Rr][Ww][Ii][Zz][Dd][Ll][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Bb][Aa][Ee][Xx][Mm][Ll][Pp][Aa][Rr][Ss][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ff][Cc]42[Uu]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Ii][Ss][Oo]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Vv][Cc][Pp]110_[Ww][Ii][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Aa][Pp][Ii]32\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Jj][Oo][Ii][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Nn][Ee][Tt][Pp][Rr][Oo][Vv][Ff][Ww]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Oo][Pp][Cc][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Kk][Ee][Yy][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Ll][Aa][Yy][Ss][Nn][Dd][Ss][Rr][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Oo][Ww][Rr][Pp][Rr][Oo][Ff]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Nn][Tt][Vv][Pp][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Oo][Ff][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Oo][Xx][Ii][Mm][Ii][Tt][Yy][Cc][Oo][Mm][Mm][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Pp][Rr][Oo][Xx][Ii][Mm][Ii][Tt][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Aa][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Rr][Aa][Ss][Dd][Ll][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Pp][Pp][Cc][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ss][Rr][Mm][Tt][Rr][Aa][Cc][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Pp][Mm][Cc][Oo][Rr][Ee][Pp][Rr][Oo][Vv][Ii][Ss][Ii][Oo][Nn][Ii][Nn][Gg]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Mm][Pp][Dd][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Nn][Aa][Tt][Tt][Ee][Nn][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Uu][Rr][Ll][Mm][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Dd][Ss][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Bb][Ii][Oo]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Uu][Ii]\\.[Ii][Mm][Mm][Ee][Rr][Ss][Ii][Vv][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Cc][Aa][Rr][Dd]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Yy][Nn][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ss][Cc][Aa][Pp][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ss][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/) AND (NOT ((file.path:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Dd][Ii][Ss][Tt][Rr][Ii][Bb][Uu][Tt][Ii][Oo][Nn]\\\\.*/)) OR (file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Tt][Ee][Mm][Pp]\\\\.*/) OR (file.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Aa][Pp][Pp][Vv][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Dd][Ll][Ll]/ AND process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/))))","rule_id":"4fc0deee-0057-4998-ab31-d24e46e0aba4","timestamp_override":"event.ingested","references":["https://hijacklibs.net/","https://blog.cyble.com/2022/07/21/qakbot-resurfaces-with-new-playbook/","https://blog.cyble.com/2022/07/27/targeted-attacks-being-carried-out-via-dll-sideloading/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:(*\\\\shfolder.dll OR *\\\\activeds.dll OR *\\\\adsldpc.dll OR *\\\\aepic.dll OR *\\\\apphelp.dll OR *\\\\applicationframe.dll OR *\\\\appxalluserstore.dll OR *\\\\appxdeploymentclient.dll OR *\\\\archiveint.dll OR *\\\\atl.dll OR *\\\\audioses.dll OR *\\\\auditpolcore.dll OR *\\\\authfwcfg.dll OR *\\\\authz.dll OR *\\\\avrt.dll OR *\\\\bcd.dll OR *\\\\bcp47langs.dll OR *\\\\bcp47mrm.dll OR *\\\\bcrypt.dll OR *\\\\cabinet.dll OR *\\\\cabview.dll OR *\\\\certenroll.dll OR *\\\\cldapi.dll OR *\\\\clipc.dll OR *\\\\clusapi.dll OR *\\\\cmpbk32.dll OR *\\\\coloradapterclient.dll OR *\\\\colorui.dll OR *\\\\comdlg32.dll OR *\\\\connect.dll OR *\\\\coremessaging.dll OR *\\\\credui.dll OR *\\\\cryptbase.dll OR *\\\\cryptdll.dll OR *\\\\cryptui.dll OR *\\\\cryptxml.dll OR *\\\\cscapi.dll OR *\\\\cscobj.dll OR *\\\\cscui.dll OR *\\\\d2d1.dll OR *\\\\d3d10.dll OR *\\\\d3d10_1.dll OR *\\\\d3d10_1core.dll OR *\\\\d3d10core.dll OR *\\\\d3d10warp.dll OR *\\\\d3d11.dll OR *\\\\d3d12.dll OR *\\\\d3d9.dll OR *\\\\dataexchange.dll OR *\\\\davclnt.dll OR *\\\\dcomp.dll OR *\\\\defragproxy.dll OR *\\\\desktopshellext.dll OR *\\\\deviceassociation.dll OR *\\\\devicecredential.dll OR *\\\\devicepairing.dll OR *\\\\devobj.dll OR *\\\\devrtl.dll OR *\\\\dhcpcmonitor.dll OR *\\\\dhcpcsvc.dll OR *\\\\dhcpcsvc6.dll OR *\\\\directmanipulation.dll OR *\\\\dismapi.dll OR *\\\\dismcore.dll OR *\\\\dmcfgutils.dll OR *\\\\dmcmnutils.dll OR *\\\\dmenrollengine.dll OR *\\\\dmenterprisediagnostics.dll OR *\\\\dmiso8601utils.dll OR *\\\\dmoleaututils.dll OR *\\\\dmprocessxmlfiltered.dll OR *\\\\dmpushproxy.dll OR *\\\\dmxmlhelputils.dll OR *\\\\dnsapi.dll OR *\\\\dot3api.dll OR *\\\\dot3cfg.dll OR *\\\\drprov.dll OR *\\\\dsclient.dll OR *\\\\dsparse.dll OR *\\\\dsreg.dll OR *\\\\dsrole.dll OR *\\\\dui70.dll OR *\\\\duser.dll OR *\\\\dusmapi.dll OR *\\\\dwmapi.dll OR *\\\\dwrite.dll OR *\\\\dxgi.dll OR *\\\\dxva2.dll OR *\\\\eappcfg.dll OR *\\\\eappprxy.dll OR *\\\\edputil.dll OR *\\\\efsadu.dll OR *\\\\efsutil.dll OR *\\\\esent.dll OR *\\\\execmodelproxy.dll OR *\\\\explorerframe.dll OR *\\\\fastprox.dll OR *\\\\faultrep.dll OR *\\\\fddevquery.dll OR *\\\\feclient.dll OR *\\\\fhcfg.dll OR *\\\\firewallapi.dll OR *\\\\flightsettings.dll OR *\\\\fltlib.dll OR *\\\\fveapi.dll OR *\\\\fwbase.dll OR *\\\\fwcfg.dll OR *\\\\fwpolicyiomgr.dll OR *\\\\fwpuclnt.dll OR *\\\\getuname.dll OR *\\\\hid.dll OR *\\\\hnetmon.dll OR *\\\\httpapi.dll OR *\\\\idstore.dll OR *\\\\ieadvpack.dll OR *\\\\iedkcs32.dll OR *\\\\iertutil.dll OR *\\\\ifmon.dll OR *\\\\iphlpapi.dll OR *\\\\iri.dll OR *\\\\iscsidsc.dll OR *\\\\iscsium.dll OR *\\\\isv.exe_rsaenh.dll OR *\\\\joinutil.dll OR *\\\\ksuser.dll OR *\\\\ktmw32.dll OR *\\\\licensemanagerapi.dll OR *\\\\licensingdiagspp.dll OR *\\\\linkinfo.dll OR *\\\\loadperf.dll OR *\\\\logoncli.dll OR *\\\\logoncontroller.dll OR *\\\\lpksetupproxyserv.dll OR *\\\\magnification.dll OR *\\\\mapistub.dll OR *\\\\mfcore.dll OR *\\\\mfplat.dll OR *\\\\mi.dll OR *\\\\midimap.dll OR *\\\\miutils.dll OR *\\\\mlang.dll OR *\\\\mmdevapi.dll OR *\\\\mobilenetworking.dll OR *\\\\mpr.dll OR *\\\\mprapi.dll OR *\\\\mrmcorer.dll OR *\\\\msacm32.dll OR *\\\\mscms.dll OR *\\\\mscoree.dll OR *\\\\msctf.dll OR *\\\\msctfmonitor.dll OR *\\\\msdrm.dll OR *\\\\msftedit.dll OR *\\\\msi.dll OR *\\\\msutb.dll OR *\\\\mswb7.dll OR *\\\\mswsock.dll OR *\\\\msxml3.dll OR *\\\\mtxclu.dll OR *\\\\napinsp.dll OR *\\\\ncrypt.dll OR *\\\\ndfapi.dll OR *\\\\netid.dll OR *\\\\netiohlp.dll OR *\\\\netplwiz.dll OR *\\\\netprofm.dll OR *\\\\netsetupapi.dll OR *\\\\netshell.dll OR *\\\\netutils.dll OR *\\\\networkexplorer.dll OR *\\\\newdev.dll OR *\\\\ninput.dll OR *\\\\nlaapi.dll OR *\\\\nlansp_c.dll OR *\\\\npmproxy.dll OR *\\\\nshhttp.dll OR *\\\\nshipsec.dll OR *\\\\nshwfp.dll OR *\\\\ntdsapi.dll OR *\\\\ntlanman.dll OR *\\\\ntlmshared.dll OR *\\\\ntmarta.dll OR *\\\\ntshrui.dll OR *\\\\oleacc.dll OR *\\\\omadmapi.dll OR *\\\\onex.dll OR *\\\\osbaseln.dll OR *\\\\osuninst.dll OR *\\\\p2p.dll OR *\\\\p2pnetsh.dll OR *\\\\p9np.dll OR *\\\\pcaui.dll OR *\\\\pdh.dll OR *\\\\peerdistsh.dll OR *\\\\pla.dll OR *\\\\pnrpnsp.dll OR *\\\\policymanager.dll OR *\\\\polstore.dll OR *\\\\printui.dll OR *\\\\propsys.dll OR *\\\\prvdmofcomp.dll OR *\\\\puiapi.dll OR *\\\\radcui.dll OR *\\\\rasapi32.dll OR *\\\\rasgcw.dll OR *\\\\rasman.dll OR *\\\\rasmontr.dll OR *\\\\reagent.dll OR *\\\\regapi.dll OR *\\\\resutils.dll OR *\\\\rmclient.dll OR *\\\\rpcnsh.dll OR *\\\\rsaenh.dll OR *\\\\rtutils.dll OR *\\\\rtworkq.dll OR *\\\\samcli.dll OR *\\\\samlib.dll OR *\\\\sapi_onecore.dll OR *\\\\sas.dll OR *\\\\scansetting.dll OR *\\\\scecli.dll OR *\\\\schedcli.dll OR *\\\\secur32.dll OR *\\\\shell32.dll OR *\\\\slc.dll OR *\\\\snmpapi.dll OR *\\\\spp.dll OR *\\\\sppc.dll OR *\\\\srclient.dll OR *\\\\srpapi.dll OR *\\\\srvcli.dll OR *\\\\ssp.exe_rsaenh.dll OR *\\\\ssp_isv.exe_rsaenh.dll OR *\\\\sspicli.dll OR *\\\\ssshim.dll OR *\\\\staterepository.core.dll OR *\\\\structuredquery.dll OR *\\\\sxshared.dll OR *\\\\tapi32.dll OR *\\\\tbs.dll OR *\\\\tdh.dll OR *\\\\tquery.dll OR *\\\\tsworkspace.dll OR *\\\\ttdrecord.dll OR *\\\\twext.dll OR *\\\\twinapi.dll OR *\\\\twinui.appcore.dll OR *\\\\uianimation.dll OR *\\\\uiautomationcore.dll OR *\\\\uireng.dll OR *\\\\uiribbon.dll OR *\\\\updatepolicy.dll OR *\\\\userenv.dll OR *\\\\utildll.dll OR *\\\\uxinit.dll OR *\\\\uxtheme.dll OR *\\\\vaultcli.dll OR *\\\\virtdisk.dll OR *\\\\vssapi.dll OR *\\\\vsstrace.dll OR *\\\\wbemprox.dll OR *\\\\wbemsvc.dll OR *\\\\wcmapi.dll OR *\\\\wcnnetsh.dll OR *\\\\wdi.dll OR *\\\\wdscore.dll OR *\\\\webservices.dll OR *\\\\wecapi.dll OR *\\\\wer.dll OR *\\\\wevtapi.dll OR *\\\\whhelper.dll OR *\\\\wimgapi.dll OR *\\\\winbrand.dll OR *\\\\windows.storage.dll OR *\\\\windows.storage.search.dll OR *\\\\windowscodecs.dll OR *\\\\windowscodecsext.dll OR *\\\\windowsudk.shellcommon.dll OR *\\\\winhttp.dll OR *\\\\wininet.dll OR *\\\\winipsec.dll OR *\\\\winmde.dll OR *\\\\winmm.dll OR *\\\\winnsi.dll OR *\\\\winrnr.dll OR *\\\\winsqlite3.dll OR *\\\\winsta.dll OR *\\\\wkscli.dll OR *\\\\wlanapi.dll OR *\\\\wlancfg.dll OR *\\\\wldp.dll OR *\\\\wlidprov.dll OR *\\\\wmiclnt.dll OR *\\\\wmidcom.dll OR *\\\\wmiutils.dll OR *\\\\wmsgapi.dll OR *\\\\wofutil.dll OR *\\\\wpdshext.dll OR *\\\\wshbth.dll OR *\\\\wshelper.dll OR *\\\\wtsapi32.dll OR *\\\\wwapi.dll OR *\\\\xmllite.dll OR *\\\\xolehlp.dll OR *\\\\xwizards.dll OR *\\\\xwtpw32.dll OR *\\\\aclui.dll OR *\\\\bderepair.dll OR *\\\\bootmenuux.dll OR *\\\\dcntel.dll OR *\\\\dwmcore.dll OR *\\\\dynamoapi.dll OR *\\\\fhsvcctl.dll OR *\\\\fxsst.dll OR *\\\\inproclogger.dll OR *\\\\iumbase.dll OR *\\\\kdstub.dll OR *\\\\maintenanceui.dll OR *\\\\mdmdiagnostics.dll OR *\\\\mintdh.dll OR *\\\\msdtctm.dll OR *\\\\nettrace.dll OR *\\\\osksupport.dll OR *\\\\reseteng.dll OR *\\\\resetengine.dll OR *\\\\spectrumsyncclient.dll OR *\\\\srcore.dll OR *\\\\systemsettingsthresholdadminflowui.dll OR *\\\\timesync.dll OR *\\\\upshared.dll OR *\\\\wmpdui.dll OR *\\\\wwancfg.dll OR *\\\\dpx.dll OR *\\\\fxsapi.dll OR *\\\\fxstiff.dll OR *\\\\xpsservices.dll OR *\\\\appvpolicy.dll OR *\\\\batmeter.dll OR *\\\\bootux.dll OR *\\\\cmutil.dll OR *\\\\configmanager2.dll OR *\\\\coredplus.dll OR *\\\\coreuicomponents.dll OR *\\\\cryptsp.dll OR *\\\\dmcommandlineutils.dll OR *\\\\drvstore.dll OR *\\\\dsprop.dll OR *\\\\dxcore.dll OR *\\\\edgeiso.dll OR *\\\\framedynos.dll OR *\\\\fveskybackup.dll OR *\\\\fvewiz.dll OR *\\\\gpapi.dll OR *\\\\icmp.dll OR *\\\\ifsutil.dll OR *\\\\iumsdk.dll OR *\\\\lockhostingframework.dll OR *\\\\lrwizdll.dll OR *\\\\mbaexmlparser.dll OR *\\\\mfc42u.dll OR *\\\\msiso.dll OR *\\\\msvcp110_win.dll OR *\\\\netapi32.dll OR *\\\\netjoin.dll OR *\\\\netprovfw.dll OR *\\\\opcservices.dll OR *\\\\pkeyhelper.dll OR *\\\\playsndsrv.dll OR *\\\\powrprof.dll OR *\\\\prntvpt.dll OR *\\\\profapi.dll OR *\\\\proximitycommon.dll OR *\\\\proximityservicepal.dll OR *\\\\rasdlg.dll OR *\\\\security.dll OR *\\\\sppcext.dll OR *\\\\srmtrace.dll OR *\\\\tpmcoreprovisioning.dll OR *\\\\umpdc.dll OR *\\\\unattend.dll OR *\\\\urlmon.dll OR *\\\\vdsutil.dll OR *\\\\version.dll OR *\\\\winbio.dll OR *\\\\windows.ui.immersive.dll OR *\\\\winscard.dll OR *\\\\winsync.dll OR *\\\\wscapi.dll OR *\\\\wsmsvc.dll) AND (NOT ((file.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\SoftwareDistribution\\\\*)) OR (file.path:C\\:\\\\Windows\\\\SystemTemp\\\\*) OR (file.path:C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\microsoft\\ shared\\\\ClickToRun\\\\AppVPolicy.dll AND process.executable:C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\microsoft\\ shared\\\\ClickToRun\\\\OfficeClickToRun.exe))))`"}
