{"id":"552b6b65-df37-4d3e-a258-f2fc4771ae54","created_by":"Nasreddine Bencherchali, Wietze Beukema (project and research)","name":"Antivirus Software DLL Sideloading","tags":["attack.defense_evasion","attack.persistence","attack.privilege_escalation","attack.t1574.001","attack.t1574.002"],"interval":"5m","description":"Detects DLL sideloading of DLLs that are part of antivirus software suchas McAfee, Symantec...etc","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((file.path:/.*\\\\[Ll][Oo][Gg]\\.[Dd][Ll][Ll]/ AND (NOT (file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Bb][Ii][Tt][Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Ff][Rr][Ee][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Bb][Ii][Tt][Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Ff][Rr][Ee][Ee]\\\\.*/)))) OR (file.path:/.*\\\\[Qq][Rr][Tt]\\.[Dd][Ll][Ll]/ AND (NOT (file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ff]\\-[Ss][Ee][Cc][Uu][Rr][Ee]\\\\[Aa][Nn][Tt][Ii]\\-[Vv][Ii][Rr][Uu][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Ff]\\-[Ss][Ee][Cc][Uu][Rr][Ee]\\\\[Aa][Nn][Tt][Ii]\\-[Vv][Ii][Rr][Uu][Ss]\\\\.*/))))) OR (file.path:(/.*\\\\[Aa][Ss][Hh][Ll][Dd][Rr][Ee][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ll][Oo][Cc][Kk][Dd][Oo][Ww][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Vv][Ss][Oo][Dd][Ss][Cc][Pp][Ll]\\.[Dd][Ll][Ll]/) AND (NOT (file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\.*/)))))","rule_id":"552b6b65-df37-4d3e-a258-f2fc4771ae54","timestamp_override":"event.ingested","references":["https://hijacklibs.net/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((file.path:*\\\\log.dll AND (NOT (file.path:(C\\:\\\\Program\\ Files\\\\Bitdefender\\ Antivirus\\ Free\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Bitdefender\\ Antivirus\\ Free\\\\*)))) OR (file.path:*\\\\qrt.dll AND (NOT (file.path:(C\\:\\\\Program\\ Files\\\\F\\-Secure\\\\Anti\\-Virus\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\F\\-Secure\\\\Anti\\-Virus\\\\*))))) OR (file.path:(*\\\\ashldres.dll OR *\\\\lockdown.dll OR *\\\\vsodscpl.dll) AND (NOT (file.path:(C\\:\\\\Program\\ Files\\\\McAfee\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\McAfee\\\\*)))))`"}
