{"id":"02fb90de-c321-4e63-a6b9-25f4b03dfd14","created_by":"FPT.EagleEye, Thomas Patzke (improvements)","name":"Windows Spooler Service Suspicious Binary Load","tags":["attack.persistence","attack.defense_evasion","attack.privilege_escalation","attack.t1574","cve.2021.1675","cve.2021.34527"],"interval":"5m","description":"Detect DLL Load from Spooler Service backup folder","risk_score":73,"enabled":true,"severity":"informational","false_positives":["Loading of legitimate driver"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\3\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\4\\\\.*/) AND file.path:/.*\\.[Dd][Ll][Ll]/)","rule_id":"02fb90de-c321-4e63-a6b9-25f4b03dfd14","timestamp_override":"event.ingested","references":["https://github.com/hhlxf/PrintNightmare","https://github.com/ly4k/SpoolFool"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\spoolsv.exe AND file.path:(*\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\* OR *\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\4\\\\*) AND file.path:*.dll)`"}
