{"id":"9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c","created_by":"Nasreddine Bencherchali","name":"DLL Load By System Process From Suspicious Locations","tags":["attack.defense_evasion","attack.t1070"],"interval":"5m","description":"Detects when a system process (ie located in system32, syswow64...etc) loads a DLL from a suspicious location such as %temp%","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ AND file.path:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/)) AND (NOT (process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/))))","rule_id":"9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c","timestamp_override":"event.ingested","references":["https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:C\\:\\\\Windows\\\\* AND file.path:(*\\\\Users\\\\Public\\\\* OR *\\\\Downloads\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\PerfLogs\\\\*)) AND (NOT (process.executable:*\\\\msiexec.exe OR file.path:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*))))`"}
