{"id":"75c505b1-711d-4f68-a357-8c3fe37dbf2d","created_by":"Aleksey Potapov, oscd.community","name":"SILENTTRINITY Stager Execution","tags":["attack.command_and_control","attack.t1071"],"interval":"5m","description":"Detects SILENTTRINITY stager use","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.pe.description:/.*[Ss][Tt]2[Ss][Tt][Aa][Gg][Ee][Rr].*/","rule_id":"75c505b1-711d-4f68-a357-8c3fe37dbf2d","timestamp_override":"event.ingested","references":["https://github.com/byt3bl33d3r/SILENTTRINITY"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.pe.description:*st2stager*`"}
