{"id":"418dc89a-9808-4b87-b1d7-e5ae0cb6effc","created_by":"Bhabesh Raj","name":"Microsoft Defender Loading DLL from Nondefault Path","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects loading of Microsoft Defender's DLLs by its processes (MpCmdRun and NisSrv) from the non-default directory which may be an attempt to sideload arbitrary DLL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Very unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ii][Ss][Ss][Rr][Vv]\\.[Ee][Xx][Ee]/) AND file.path:/.*\\\\[Mm][Pp][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/) AND (NOT (file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\.*/))))","rule_id":"418dc89a-9808-4b87-b1d7-e5ae0cb6effc","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\MpCmdRun.exe OR *\\\\NisSrv.exe) AND file.path:*\\\\mpclient.dll) AND (NOT (file.path:(C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Windows\\ Defender\\\\* OR C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\*))))`"}
