{"id":"9ae01559-cf7e-4f8e-8e14-4c290a1b4784","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"UIPromptForCredentials DLLs","tags":["attack.credential_access","attack.collection","attack.t1056.002"],"interval":"5m","description":"Detects potential use of UIPromptForCredentials functions by looking for some of the DLLs needed for it.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other legitimate processes loading those DLLs in your environment."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((file.path:(/.*\\\\[Cc][Rr][Ee][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ii][Nn][Cc][Rr][Ee][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/) OR file.pe.original_file_name:(/[Cc][Rr][Ee][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /[Ww][Ii][Nn][Cc][Rr][Ee][Dd][Uu][Ii]\\.[Dd][Ll][Ll]/)) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)) OR (process.executable:/.*\\\\[Oo][Pp][Ee][Rr][Aa]_[Aa][Uu][Tt][Oo][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Mm][Mm][Ee][Rr][Ss][Ii][Vv][Ee][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Pp][Aa][Nn][Ee][Ll]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\.*/))))","rule_id":"9ae01559-cf7e-4f8e-8e14-4c290a1b4784","timestamp_override":"event.ingested","references":["https://securitydatasets.com/notebooks/small/windows/06_credential_access/SDWIN-201020013208.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password","https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((file.path:(*\\\\credui.dll OR *\\\\wincredui.dll) OR file.pe.original_file_name:(credui.dll OR wincredui.dll)) AND (NOT ((process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\explorer.exe* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable:*\\\\opera_autoupdate.exe) OR (process.executable:C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe) OR (process.executable:C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe) OR (process.executable:*\\\\Local\\\\Microsoft\\\\OneDrive\\\\*))))`"}
