{"id":"7707a579-e0d8-4886-a853-ce47e4575aaa","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Wmiprvse Wbemcomn DLL Hijack","tags":["attack.execution","attack.t1047","attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenario.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Bb][Ee][Mm][Cc][Oo][Mm][Nn]\\.[Dd][Ll][Ll]/)","rule_id":"7707a579-e0d8-4886-a853-ce47e4575aaa","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wmiprvse.exe AND file.path:*\\\\wbem\\\\wbemcomn.dll)`"}
