{"id":"84b0a8f3-680b-4096-a45b-e9a89221727c","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"PCRE.NET Package Image Load","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects processes loading modules related to PCRE.NET package","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Bb][Aa]9[Ee][Aa]7344[Aa]4[Aa]5[Ff]591[Dd]6[Ee]5[Dd][Cc]32[Aa]13494[Bb]\\\\.*/","rule_id":"84b0a8f3-680b-4096-a45b-e9a89221727c","timestamp_override":"event.ingested","references":["https://twitter.com/rbmaslen/status/1321859647091970051","https://twitter.com/tifkin_/status/1321916444557365248"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.path:*\\\\AppData\\\\Local\\\\Temp\\\\ba9ea7344a4a5f591d6e5dc32a13494b\\\\*`"}
