{"id":"8cde342c-ba48-4b74-b615-172c330f2e93","created_by":"Nasreddine Bencherchali","name":"Rundll32 Loading Renamed Comsvcs DLL","tags":["attack.credential_access","attack.defense_evasion","attack.t1003.001"],"interval":"5m","description":"Detects rundll32 loading a renamed comsvcs.dll to dump process memory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ee][Ee][Dd]93054[Cc][Bb]555[Ff]3[Dd][Ee]70[Ee][Aa][Aa]9787[Ff]32[Ee][Bb][Bb].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=5[Ee]0[Dd][Bb][Dd][Ee][Cc]1[Ff][Cc][Ee]52[Dd][Aa][Aa][Ee]251[Aa]110[Bb]4[Ff]309[Dd].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ee][Aa][Dd][Bb][Cc][Cc][Bb][Bb]324829[Aa][Cc][Bb]5[Ff]2[Bb][Bb][Ee]87[Ee]5549[Aa]8.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=407[Cc][Aa]0[Ff]7[Bb]523319[Dd]758[Aa]40[Dd]7[Cc]0193699.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=281[Dd]618[Ff]4[Ee]6271[Ee]527[Ee]6386[Ee][Aa]6[Ff]748[Dd][Ee].*/)) AND (NOT (file.path:/.*\\\\[Cc][Oo][Mm][Ss][Vv][Cc][Ss]\\.[Dd][Ll][Ll]/)))","rule_id":"8cde342c-ba48-4b74-b615-172c330f2e93","timestamp_override":"event.ingested","references":["https://twitter.com/sbousseaden/status/1555200155351228419"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rundll32.exe AND related.hash:(*IMPHASH\\=eed93054cb555f3de70eaa9787f32ebb* OR *IMPHASH\\=5e0dbdec1fce52daae251a110b4f309d* OR *IMPHASH\\=eadbccbb324829acb5f2bbe87e5549a8* OR *IMPHASH\\=407ca0f7b523319d758a40d7c0193699* OR *IMPHASH\\=281d618f4e6271e527e6386ea6f748de*)) AND (NOT (file.path:*\\\\comsvcs.dll)))`"}
