{"id":"829a3bdf-34da-4051-9cf4-8ed221a8ae4f","created_by":"Nasreddine Bencherchali, Wietze Beukema (project and research)","name":"Microsoft Office DLL Sideload","tags":["attack.defense_evasion","attack.persistence","attack.privilege_escalation","attack.t1574.001","attack.t1574.002"],"interval":"5m","description":"Detects DLL sideloading of DLLs that are part of Microsoft Office from non standard location","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Oo][Uu][Tt][Ll][Ll][Ii][Bb]\\.[Dd][Ll][Ll]/ AND (NOT (file.path:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/))))","rule_id":"829a3bdf-34da-4051-9cf4-8ed221a8ae4f","timestamp_override":"event.ingested","references":["https://hijacklibs.net/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\outllib.dll AND (NOT (file.path:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\OFFICE* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\OFFICE* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\Root\\\\OFFICE* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\Root\\\\OFFICE*))))`"}
