{"id":"33a2d1dd-f3b0-40bd-8baf-7974468927cc","created_by":"Florian Roth","name":"APT PRIVATELOG Image Load Pattern","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects an image load pattern as seen when a tool named PRIVATELOG is used and rarely observed under legitimate circumstances","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rarely observed"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Cc][Ll][Ff][Ss][Ww]32\\.[Dd][Ll][Ll]/)","rule_id":"33a2d1dd-f3b0-40bd-8baf-7974468927cc","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2021/09/unknown-actor-using-clfs-log-files-for-stealth.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\svchost.exe AND file.path:*\\\\clfsw32.dll)`"}
