{"id":"640dc51c-7713-4faa-8a0e-e7c0d9d4654c","created_by":"Florian Roth","name":"FoggyWeb Backdoor DLL Loading","tags":["attack.resource_development","attack.t1587"],"interval":"5m","description":"Detects DLL image load activity as used by FoggyWeb backdoor loader","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Ff][Ss]\\\\[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/","rule_id":"640dc51c-7713-4faa-8a0e-e7c0d9d4654c","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/09/27/foggyweb-targeted-nobelium-malware-leads-to-persistent-backdoor/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:C\\:\\\\Windows\\\\ADFS\\\\version.dll`"}
