{"id":"90217a70-13fc-48e4-b3db-0d836c5824ac","created_by":"Antonlovesdnb","name":"GAC DLL Loaded Via Office Applications","tags":["attack.execution","attack.t1204.002"],"interval":"5m","description":"Detects any GAC DLL being loaded by an Office Product","risk_score":73,"enabled":true,"severity":"high","false_positives":["Alerts on legitimate macro usage as well, will need to filter as appropriate"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/) AND file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\\\[Gg][Aa][Cc]_[Mm][Ss][Ii][Ll].*/)","rule_id":"90217a70-13fc-48e4-b3db-0d836c5824ac","timestamp_override":"event.ingested","references":["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe OR *\\\\outlook.exe) AND file.path:C\\:\\\\Windows\\\\Microsoft.NET\\\\assembly\\\\GAC_MSIL*)`"}
