{"id":"49329257-089d-46e6-af37-4afce4290685","created_by":"Florian Roth","name":"SharpEvtMute EvtMuteHook Load","tags":["attack.defense_evasion","attack.t1562.002"],"interval":"5m","description":"Detects the load of EvtMuteHook.dll, a key component of SharpEvtHook, a tool to tamper with Windows event logs","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other DLLs with that import hash"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=330768[Aa]4[Ff]172[Ee]10[Aa][Cc][Bb]6287[Bb]87289[Dd]83[Bb].*/ OR file.hash.imphash:/330768[Aa]4[Ff]172[Ee]10[Aa][Cc][Bb]6287[Bb]87289[Dd]83[Bb]/)","rule_id":"49329257-089d-46e6-af37-4afce4290685","timestamp_override":"event.ingested","references":["https://github.com/bats3c/EvtMute"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(related.hash:*IMPHASH\\=330768A4F172E10ACB6287B87289D83B* OR file.hash.imphash:330768a4f172e10acb6287b87289d83b)`"}
