{"id":"cbb56d62-4060-40f7-9466-d8aaf3123f83","created_by":"Patrick St. John, OTR (Open Threat Research)","name":"Python Py2Exe Image Load","tags":["attack.defense_evasion","attack.t1027.002"],"interval":"5m","description":"Detects the image load of Python Core indicative of a Python script bundled with Py2Exe.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legit Py2Exe Binaries"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.pe.description:/[Pp][Yy][Tt][Hh][Oo][Nn]\\ [Cc][Oo][Rr][Ee]/ AND (NOT (process.executable:/.*[Pp][Yy][Tt][Hh][Oo][Nn].*/ OR process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/))))","rule_id":"cbb56d62-4060-40f7-9466-d8aaf3123f83","timestamp_override":"event.ingested","references":["https://www.py2exe.org/","https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.pe.description:Python\\ Core AND (NOT (process.executable:*Python* OR process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*))))`"}
