{"id":"602a1f13-c640-4d73-b053-be9a2fa58b77","created_by":"SBousseaden","name":"Svchost DLL Search Order Hijack","tags":["attack.persistence","attack.defense_evasion","attack.t1574.002","attack.t1574.001"],"interval":"5m","description":"IKEEXT and SessionEnv service, as they call LoadLibrary on files that do not exist within C:\\Windows\\System32\\ by default. An attacker can place their malicious logic within the PROCESS_ATTACH block of their library and restart the aforementioned services \"svchost.exe -k netsvcs\" to gain code execution on a remote machine.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.path:(/.*\\\\[Tt][Ss][Mm][Ss][Ii][Ss][Rr][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Tt][Ss][Vv][Ii][Pp][Ss][Rr][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ll][Bb][Ss][Cc][Tt][Rr][Ll]\\.[Dd][Ll][Ll]/)) AND (NOT (file.path:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/)))","rule_id":"602a1f13-c640-4d73-b053-be9a2fa58b77","timestamp_override":"event.ingested","references":["https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\svchost.exe AND file.path:(*\\\\tsmsisrv.dll OR *\\\\tsvipsrv.dll OR *\\\\wlbsctrl.dll)) AND (NOT (file.path:C\\:\\\\Windows\\\\WinSxS\\\\*)))`"}
