{"id":"333cdbe8-27bb-4246-bf82-b41a0dca4b70","created_by":"Markus Neis, @markus_neis","name":"Image Load of VSS_PS.dll by Uncommon Executable","tags":["attack.defense_evasion","attack.impact","attack.t1490"],"interval":"5m","description":"Detects the image load of vss_ps.dll by uncommon executables using OriginalFileName datapoint","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.path:/.*\\\\[Vv][Ss][Ss]_[Pp][Ss]\\.[Dd][Ll][Ll]/ AND (NOT ((process.executable:(/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Rr][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Ii][Nn][Dd][Ee][Xx][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Mm][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ll][Uu][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Nn][Ee][Tt][Ss][Rr][Vv]\\\\[Ii][Ii][Ss][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Nn][Ee][Tt][Ss][Rr][Vv]\\\\[Aa][Pp][Pp][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND process.executable:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/) OR (process.command_line:/[Cc]\\:\\\\$[Ww][Ii][Nn][Rr][Ee][Aa][Gg][Ee][Nn][Tt]\\\\[Ss][Cc][Rr][Aa][Tt][Cc][Hh]\\\\.*/ AND process.command_line:/.*\\\\[Dd][Ii][Ss][Mm][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\{.*/))))","rule_id":"333cdbe8-27bb-4246-bf82-b41a0dca4b70","timestamp_override":"event.ingested","references":["1bd85e1caa1415ebdc8852c91e37bbb7","https://twitter.com/am0nsec/status/1412232114980982787"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.path:*\\\\vss_ps.dll AND (NOT ((process.executable:(*\\\\svchost.exe OR *\\\\msiexec.exe OR *\\\\vssvc.exe OR *\\\\srtasks.exe OR *\\\\tiworker.exe OR *\\\\dllhost.exe OR *\\\\searchindexer.exe OR *\\\\dismhost.exe OR *\\\\taskhostw.exe OR *\\\\clussvc.exe OR *\\\\thor64.exe OR *\\\\thor.exe OR *\\\\rundll32.exe OR *\\\\inetsrv\\\\iissetup.exe OR *\\\\inetsrv\\\\appcmd.exe) AND process.executable:*c\\:\\\\windows\\\\*) OR (process.command_line:C\\:\\\\$WinREAgent\\\\Scratch\\\\* AND process.command_line:*\\\\dismhost.exe\\ \\{*))))`"}
