{"id":"05936ce2-ee05-4dae-9d03-9a391cf2d2c6","created_by":"Thomas Patzke","name":"WMI Persistence - Command Line Event Consumer","tags":["attack.t1546.003","attack.persistence"],"interval":"5m","description":"Detects WMI command line event consumers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown (data set is too small; further testing needed)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Ww][Bb][Ee][Mm][Cc][Oo][Nn][Ss]\\.[Dd][Ll][Ll]/)","rule_id":"05936ce2-ee05-4dae-9d03-9a391cf2d2c6","timestamp_override":"event.ingested","references":["https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe AND file.path:*\\\\wbemcons.dll)`"}
