{"id":"857c8db3-c89b-42fb-882b-f681c7cf4da2","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Unsigned Image Loaded Into LSASS Process","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Loading unsigned image (DLL, EXE) into LSASS process","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Valid user connecting using RDP"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND file.code_signature.signed:/[Ff][Aa][Ll][Ss][Ee]/)","rule_id":"857c8db3-c89b-42fb-882b-f681c7cf4da2","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\lsass.exe AND file.code_signature.signed:false)`"}
