{"id":"ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Suspicious WSMAN Provider Image Loads","tags":["attack.execution","attack.t1059.001","attack.lateral_movement","attack.t1021.003"],"interval":"5m","description":"Detects signs of potential use of the WSMAN provider from uncommon processes locally and remote execution.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((file.path:(/.*\\\\[Ww][Ss][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Ss][Mm][Aa][Uu][Tt][Oo]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ss][Mm][Aa][Nn]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Nn][Ii]\\.[Dd][Ll][Ll]/) OR file.pe.original_file_name:(/[Ww][Ss][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /[Ww][Ss][Mm][Aa][Nn][Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ss][Mm][Aa][Nn]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Dd][Ll][Ll]/)) OR (process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND file.pe.original_file_name:/[Ww][Ss][Mm][Ww][Mm][Ii][Pp][Ll]\\.[Dd][Ll][Ll]/)) AND (NOT ((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/)) OR (process.command_line:(/.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss]\\ \\-[Pp]\\ \\-[Ss]\\ [Bb][Ii][Tt][Ss].*/ OR /.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Gg][Rr][Aa][Pp][Hh][Ii][Cc][Ss][Pp][Ee][Rr][Ff][Ss][Vv][Cc][Gg][Rr][Oo][Uu][Pp]\\ \\-[Ss]\\ [Gg][Rr][Aa][Pp][Hh][Ii][Cc][Ss][Pp][Ee][Rr][Ff][Ss][Vv][Cc].*/ OR /.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ \\-[Pp]\\ \\-[Ss]\\ [Ww][Ee][Cc][Ss][Vv][Cc].*/ OR /.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss].*/)) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\[Vv].*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\[Vv].*/) AND process.executable:/.*\\\\[Mm][Ss][Cc][Oo][Rr][Ss][Vv][Ww]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Ee]\\-[Ss][Mm][Rr][Ee][Mm][Oo][Tt][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\.*/)))) AND (NOT ((process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND NOT _exists_:process.command_line))))","rule_id":"ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94","timestamp_override":"event.ingested","references":["https://twitter.com/chadtilbury/status/1275851297770610688","https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/","https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture","https://github.com/bohops/WSMan-WinRM"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((file.path:(*\\\\WsmSvc.dll OR *\\\\WsmAuto.dll OR *\\\\Microsoft.WSMan.Management.ni.dll) OR file.pe.original_file_name:(WsmSvc.dll OR WSMANAUTOMATION.DLL OR Microsoft.WSMan.Management.dll)) OR (process.executable:*\\\\svchost.exe AND file.pe.original_file_name:WsmWmiPl.dll)) AND (NOT ((process.executable:(*\\\\powershell.exe OR *C\\:\\\\Windows\\\\System32\\\\sdiagnhost.exe OR *C\\:\\\\Windows\\\\System32\\\\services.exe)) OR (process.command_line:(*svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ BITS* OR *svchost.exe\\ \\-k\\ GraphicsPerfSvcGroup\\ \\-s\\ GraphicsPerfSvc* OR *svchost.exe\\ \\-k\\ NetworkService\\ \\-p\\ \\-s\\ Wecsvc* OR *svchost.exe\\ \\-k\\ netsvcs*)) OR (process.executable:(C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v*) AND process.executable:*\\\\mscorsvw.exe) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\Configure\\-SMRemoting.exe OR C\\:\\\\Windows\\\\System32\\\\ServerManager.exe)) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\*) OR (process.executable:C\\:\\\\Program\\ Files\\\\Citrix\\\\*)))) AND (NOT ((process.executable:*\\\\svchost.exe AND NOT _exists_:process.command_line))))`"}
