{"id":"4508a70e-97ef-4300-b62b-ff27992990ea","created_by":"omkar72, oscd.community","name":"CLR DLL Loaded Via Scripting Applications","tags":["attack.execution","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects CLR DLL being loaded by an scripting applications","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/) AND file.path:(/.*\\\\[Cc][Ll][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Oo][Rr][Ee][Ee]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Mm][Ss][Cc][Oo][Rr][Ll][Ii][Bb]\\.[Dd][Ll][Ll]/))","rule_id":"4508a70e-97ef-4300-b62b-ff27992990ea","timestamp_override":"event.ingested","references":["https://github.com/tyranid/DotNetToJScript","https://thewover.github.io/Introducing-Donut/","https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe) AND file.path:(*\\\\clr.dll OR *\\\\mscoree.dll OR *\\\\mscorlib.dll))`"}
