{"id":"50e54b8d-ad73-43f8-96a1-5191685b17a4","created_by":"Kiran kumar s, oscd.community","name":"Silenttrinity Stager Msbuild Activity","tags":["attack.execution","attack.t1127.001"],"interval":"5m","description":"Detects a possible remote connections to Silenttrinity c2","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee]/ AND destination.port:(80 OR 443) AND network.direction:/[Tt][Rr][Uu][Ee]/)","rule_id":"50e54b8d-ad73-43f8-96a1-5191685b17a4","timestamp_override":"event.ingested","references":["https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msbuild.exe AND destination.port:(80 OR 443) AND network.direction:true)`"}
