{"id":"8e5e38e4-5350-4c0b-895a-e872ce0dd54f","created_by":"frack113","name":"Msiexec Initiated Connection","tags":["attack.defense_evasion","attack.t1218.007"],"interval":"5m","description":"Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate msiexec over networks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(network.direction:/[Tt][Rr][Uu][Ee]/ AND process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/)","rule_id":"8e5e38e4-5350-4c0b-895a-e872ce0dd54f","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(network.direction:true AND process.executable:*\\\\msiexec.exe)`"}
