{"id":"e54979bd-c5f9-4d6c-967b-a04b19ac4c74","created_by":"Ilyas Ochkov, oscd.community","name":"Suspicious Outbound Kerberos Connection","tags":["attack.credential_access","attack.t1558","attack.lateral_movement","attack.t1550.003"],"interval":"5m","description":"Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other browsers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((destination.port:88 AND network.direction:/[Tt][Rr][Uu][Ee]/) AND (NOT (process.executable:(/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt]\\\\[Bb][Ii][Nn]\\\\[Tt][Oo][Mm][Cc][Aa][Tt]8\\.[Ee][Xx][Ee]/))))","rule_id":"e54979bd-c5f9-4d6c-967b-a04b19ac4c74","timestamp_override":"event.ingested","references":["https://github.com/GhostPack/Rubeus"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((destination.port:88 AND network.direction:true) AND (NOT (process.executable:(*\\\\lsass.exe OR *\\\\opera.exe OR *\\\\chrome.exe OR *\\\\firefox.exe OR *\\\\tomcat\\\\bin\\\\tomcat8.exe))))`"}
