{"id":"fa5b1358-b040-4403-9868-15f7d9ab6329","created_by":"Florian Roth","name":"Windows Crypto Mining Pool Connections","tags":["attack.impact","attack.t1496"],"interval":"5m","description":"Detects process connections to a Monero crypto mining pool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of crypto miners"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"destination.domain:(/[Pp][Oo][Oo][Ll]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Ff][Rr]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Dd][Ee]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Ss][Gg]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Cc][Aa]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Uu][Ss]\\-[Ww][Ee][Ss][Tt]\\.[Mm][Ii][Nn][Ee][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Pp][Oo][Oo][Ll]\\.[Ss][Uu][Pp][Pp][Oo][Rr][Tt][Xx][Mm][Rr]\\.[Cc][Oo][Mm]/ OR /[Mm][Ii][Nn][Ee]\\.[Cc]3[Pp][Oo][Oo][Ll]\\.[Cc][Oo][Mm]/ OR /[Xx][Mm][Rr]\\-[Ee][Uu]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Ee][Uu]2\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Uu][Ss]\\-[Ee][Aa][Ss][Tt]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Uu][Ss]\\-[Ww][Ee][Ss][Tt]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Aa][Ss][Ii][Aa]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Jj][Pp]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\-[Aa][Uu]1\\.[Nn][Aa][Nn][Oo][Pp][Oo][Oo][Ll]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\.2[Mm][Ii][Nn][Ee][Rr][Ss]\\.[Cc][Oo][Mm]/ OR /[Xx][Mm][Rr]\\.[Hh][Aa][Ss][Hh][Cc][Ii][Tt][Yy]\\.[Oo][Rr][Gg]/ OR /[Xx][Mm][Rr]\\.[Ff]2[Pp][Oo][Oo][Ll]\\.[Cc][Oo][Mm]/ OR /[Xx][Mm][Rr][Pp][Oo][Oo][Ll]\\.[Ee][Uu]/ OR /[Pp][Oo][Oo][Ll]\\.[Hh][Aa][Ss][Hh][Vv][Aa][Uu][Ll][Tt]\\.[Pp][Rr][Oo]/ OR /[Mm][Oo][Nn][Ee][Rr][Oo][Oo][Cc][Ee][Aa][Nn]\\.[Ss][Tt][Rr][Ee][Aa][Mm]/ OR /[Mm][Oo][Nn][Ee][Rr][Oo][Cc][Ee][Aa][Nn]\\.[Ss][Tt][Rr][Ee][Aa][Mm]/)","rule_id":"fa5b1358-b040-4403-9868-15f7d9ab6329","timestamp_override":"event.ingested","references":["https://www.poolwatch.io/coin/monero"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`destination.domain:(pool.minexmr.com OR fr.minexmr.com OR de.minexmr.com OR sg.minexmr.com OR ca.minexmr.com OR us\\-west.minexmr.com OR pool.supportxmr.com OR mine.c3pool.com OR xmr\\-eu1.nanopool.org OR xmr\\-eu2.nanopool.org OR xmr\\-us\\-east1.nanopool.org OR xmr\\-us\\-west1.nanopool.org OR xmr\\-asia1.nanopool.org OR xmr\\-jp1.nanopool.org OR xmr\\-au1.nanopool.org OR xmr.2miners.com OR xmr.hashcity.org OR xmr.f2pool.com OR xmrpool.eu OR pool.hashvault.pro OR moneroocean.stream OR monerocean.stream)`"}
