{"id":"628d7a0b-7b84-4466-8552-e6138bc03b43","created_by":"frack113, Tim Shelton (fps)","name":"Suspicious Epmap Connection","tags":["attack.lateral_movement"],"interval":"5m","description":"Detects suspicious \"epmap\" connection to a remote computer via remote procedure call (RPC)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((network.transport:/[Tt][Cc][Pp]/ AND network.direction:/[Tt][Rr][Uu][Ee]/ AND destination.port:135) AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ss][Ss][Mm]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\-[Ss][Ss][Mm]\\-[Aa][Gg][Ee][Nn][Tt]\\-[Uu][Pp][Dd][Aa][Tt][Ee][Rr].*/))))","rule_id":"628d7a0b-7b84-4466-8552-e6138bc03b43","timestamp_override":"event.ingested","references":["https://github.com/RiccardoAncarani/TaskShell/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((network.transport:tcp AND network.direction:true AND destination.port:135) AND (NOT (process.executable:(C\\:\\\\Windows\\\\* OR C\\:\\\\ProgramData\\\\Amazon\\\\SSM\\\\Update\\\\amazon\\-ssm\\-agent\\-updater*))))`"}
