{"id":"7b434893-c57d-4f41-908d-6a17bf1ae98f","created_by":"Florian Roth, Tim Shelton","name":"Suspicious Program Location with Network Connections","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects programs with network connections running in suspicious files system locations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Aa][Ll][Ll]\\ [Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Cc][Oo][Nn][Tt][Aa][Cc][Tt][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Ee][Ss]\\\\.*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Oo][Nn][Tt][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Mm][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/) OR process.executable:/.*\\\\$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]/ OR process.executable:/[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\[Ii][Bb][Mm]\\\\[Cc][Ll][Ii][Ee][Nn][Tt][Ss][Oo][Ll][Uu][Tt][Ii][Oo][Nn][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]_[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\.*/))))","rule_id":"7b434893-c57d-4f41-908d-6a17bf1ae98f","timestamp_override":"event.ingested","references":["https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Users\\\\Contacts\\\\* OR *\\\\Users\\\\Searches\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\addins\\\\*) OR process.executable:*\\\\$Recycle.bin OR process.executable:C\\:\\\\Perflogs\\\\*) AND (NOT ((process.executable:C\\:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\*))))`"}
