{"id":"992a6cae-db6a-43c8-9cec-76d7195c96fc","created_by":"frack113, Florian Roth","name":"Script Initiated Connection to Non-Local Network","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects a script interpreter wscript/cscript opening a network connection to a non-local network. Adversaries may use script to download malicious payloads.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((network.direction:/[Tt][Rr][Uu][Ee]/ AND process.executable:(/.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/)) AND (NOT ((destination.ip:(/127\\..*/ OR /10\\..*/ OR /172\\..*/ OR /192\\..*/ OR /169\\.254\\..*/ OR /20\\..*/)) OR (destination.ip:(/\\:\\:1.*/ OR /0\\:0\\:0\\:0\\:0\\:0\\:0\\:1.*/ OR /[Ff][Ee]80\\:.*/ OR /[Ff][Cc].*/ OR /[Ff][Dd].*/)))))","rule_id":"992a6cae-db6a-43c8-9cec-76d7195c96fc","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((network.direction:true AND process.executable:(*\\\\wscript.exe OR *\\\\cscript.exe)) AND (NOT ((destination.ip:(127.* OR 10.* OR 172.* OR 192.* OR 169.254.* OR 20.*)) OR (destination.ip:(\\:\\:1* OR 0\\:0\\:0\\:0\\:0\\:0\\:0\\:1* OR fe80\\:* OR fc* OR fd*)))))`"}
