{"id":"297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7","created_by":"Sorina Ionescu","name":"Dead Drop Resolvers","tags":["attack.command_and_control","attack.t1102","attack.t1102.001"],"interval":"5m","description":"Detects an executable, which is not an internet browser, making DNS request to legit popular websites, which were seen to be used as dead drop resolvers in previous attacks.","risk_score":73,"enabled":true,"severity":"high","false_positives":["One might need to exclude other internet browsers found in it's network or other applications like ones mentioned above from Microsoft Defender."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((network.direction:/[Tt][Rr][Uu][Ee]/ AND destination.domain:(/.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Yy][Oo][Uu][Tt][Uu][Bb][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Tt][Ee][Cc][Hh][Nn][Ee][Tt]\\.[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Aa][Cc][Ee][Bb][Oo][Oo][Kk]\\.[Cc][Oo][Mm]/ OR /.*\\.[Cc][Ll][Oo][Uu][Dd][Ff][Ll][Aa][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Oo][Cc][Ss]\\.[Gg][Oo][Oo][Gg][Ll][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Ee][Aa][Mm][Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\.[Cc][Oo][Mm]/ OR /.*[Rr][Ee][Dd][Dd][Ii][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Oo][Tt][Oo][Ll][Oo][Gg]\\.[Cc][Oo][Mm]/ OR /.*[Tt][Ww][Ii][Tt][Tt][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Ii][Mm][Gg][Uu][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Ee][Ee][Dd][Ss]\\.[Rr][Aa][Pp][Ii][Dd][Ff][Ee][Ee][Dd][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Ll][Ii][Vv][Ee][Jj][Oo][Uu][Rr][Nn][Aa][Ll]\\.[Cc][Oo][Mm]/ OR /.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/)) AND (NOT ((process.executable:(/.*\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Aa][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ss][Ee][Nn][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Tt][Gg]\\ [Pp][Rr][Oo][Bb][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Nn][Gg][Ii][Nn][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/)))))","rule_id":"297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7","timestamp_override":"event.ingested","references":["https://content.fireeye.com/apt-41/rpt-apt41","https://securelist.com/the-tetrade-brazilian-banking-malware/97779/","https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((network.direction:true AND destination.domain:(*cdn.discordapp.com OR *pastebin.com OR *youtube.com OR *technet.microsoft.com OR *facebook.com OR *.cloudflare.com OR *docs.google.com OR *steamcommunity.com OR *reddit.com OR *fotolog.com OR *twitter.com OR *imgur.com OR *feeds.rapidfeeds.com OR *livejournal.com OR *.githubusercontent.com)) AND (NOT ((process.executable:(*\\\\iexplore.exe OR *\\\\msedge.exe OR *\\\\edge.exe OR *\\\\opera.exe OR *\\\\brave.exe OR *\\\\vivaldi.exe OR *\\\\whale.exe OR *\\\\chrome.exe OR *\\\\firefox.exe)) OR (process.executable:(*\\\\MsMpEng.exe OR *\\\\MsSense.exe OR *\\\\PRTG\\ Probe.exe OR *\\\\Engine.exe OR *\\\\msedgewebview2.exe)))))`"}
