{"id":"1f21ec3f-810d-4b0e-8045-322202e22b4b","created_by":"Florian Roth","name":"PowerShell Network Connections","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a Powershell process that opens network connections - check for suspicious target ports and target systems - adjust to your environment (e.g. extend filters with company's ip range')","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND network.direction:/[Tt][Rr][Uu][Ee]/ AND DestinationIsIpv6:/[Ff][Aa][Ll][Ss][Ee]/) AND (NOT (destination.ip:(/10\\..*/ OR /192\\.168\\..*/ OR /172\\.16\\..*/ OR /172\\.17\\..*/ OR /172\\.18\\..*/ OR /172\\.19\\..*/ OR /172\\.20\\..*/ OR /172\\.21\\..*/ OR /172\\.22\\..*/ OR /172\\.23\\..*/ OR /172\\.24\\..*/ OR /172\\.25\\..*/ OR /172\\.26\\..*/ OR /172\\.27\\..*/ OR /172\\.28\\..*/ OR /172\\.29\\..*/ OR /172\\.30\\..*/ OR /172\\.31\\..*/ OR /127\\.0\\.0\\.1.*/) AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/))))","rule_id":"1f21ec3f-810d-4b0e-8045-322202e22b4b","timestamp_override":"event.ingested","references":["https://www.youtube.com/watch?v=DLtJTxMWZ2o"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND network.direction:true AND DestinationIsIpv6:false) AND (NOT (destination.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.* OR 127.0.0.1*) AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*))))`"}
