{"id":"25eabf56-22f0-4915-a1ed-056b8dae0a68","created_by":"Florian Roth","name":"Suspicious Dropbox API Usage","tags":null,"interval":"5m","description":"Detects an executable that isn't dropbox but communicates with the Dropbox API","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of the API with a tool that the author wasn't aware of"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((network.direction:/[Tt][Rr][Uu][Ee]/ AND destination.domain:(/.*[Aa][Pp][Ii]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Aa][Pp][Ii]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Aa][Pp][Ii]\\.[Cc][Oo][Mm]/)) AND (NOT (process.executable:/.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx].*/)))","rule_id":"25eabf56-22f0-4915-a1ed-056b8dae0a68","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/7e906adc-9d11-447f-8641-5f40375ecebb","https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((network.direction:true AND destination.domain:(*api.dropboxapi.com OR *content.dropboxapi.com)) AND (NOT (process.executable:*\\\\Dropbox*)))`"}
