{"id":"ed74fe75-7594-4b4b-ae38-e38e3fd2eb23","created_by":"Markus Neis","name":"Suspicious Outbound RDP Connections","tags":["attack.lateral_movement","attack.t1021.001","car.2013-07-002"],"interval":"5m","description":"Detects Non-Standard Tools Connecting to TCP port 3389 indicating possible lateral movement","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other Remote Desktop RDP tools","Domain controller using dns.exe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((destination.port:3389 AND network.direction:/[Tt][Rr][Uu][Ee]/) AND (NOT (process.executable:(/.*\\\\[Mm][Ss][Tt][Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Tt][Ss][Aa][Pp][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Tt][Ss]2[Aa][Pp][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Dd][Cc][Mm][Aa][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss]_[Tt][Uu][Nn][Nn][Ee][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ss][Ss][Ee][Nn][Ss][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Dd][Ee][Ss][Kk][Tt][Oo][Pp][Mm][Aa][Nn][Aa][Gg][Ee][Rr][Ff][Rr][Ee][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Dd][Ee][Ss][Kk][Tt][Oo][Pp][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Dd][Ee][Ss][Kk][Tt][Oo][Pp][Mm][Aa][Nn][Aa][Gg][Ee][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Rr][Ee][Mm][Oo][Tt][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Rr][Ee][Mm][Oo][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Ii][Cc][Ee][Ww][Oo][Rr][Kk][Ss]\\-[Ff][Ii][Nn][Dd][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ss][Dd][Ii][Ss][Cc][Oo][Vv][Ee][Rr][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ss][Aa][Ss][Ss][Ee][Ss][Ss][Mm][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Oo][Bb][Aa][Rr][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Ss][Tt][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Aa][Vv][Aa][Ss][Tt]\\\\[Aa][Vv][Aa][Ss][Tt][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Aa][Nn][Gg][Ee][Rr]\\\\[Ss][Ee][Nn][Tt][Ii][Nn][Ee][Ll][Rr][Aa][Nn][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Vv][Aa][Ss][Tt]\\\\[Aa][Vv][Aa][Ss][Tt][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/) OR process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ss][Pp][Ll][Uu][Nn][Kk][Uu][Nn][Ii][Vv][Ee][Rr][Ss][Aa][Ll][Ff][Oo][Rr][Ww][Aa][Rr][Dd][Ee][Rr]\\\\[Bb][Ii][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee].*/))))","rule_id":"ed74fe75-7594-4b4b-ae38-e38e3fd2eb23","timestamp_override":"event.ingested","references":["https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((destination.port:3389 AND network.direction:true) AND (NOT (process.executable:(*\\\\mstsc.exe OR *\\\\RTSApp.exe OR *\\\\RTS2App.exe OR *\\\\RDCMan.exe OR *\\\\ws_TunnelService.exe OR *\\\\RSSensor.exe OR *\\\\RemoteDesktopManagerFree.exe OR *\\\\RemoteDesktopManager.exe OR *\\\\RemoteDesktopManager64.exe OR *\\\\mRemoteNG.exe OR *\\\\mRemote.exe OR *\\\\Terminals.exe OR *\\\\spiceworks\\-finder.exe OR *\\\\FSDiscovery.exe OR *\\\\FSAssessment.exe OR *\\\\MobaRTE.exe OR *\\\\chrome.exe OR *\\\\System32\\\\dns.exe OR *\\\\thor.exe OR *\\\\thor64.exe OR *\\\\Passwordstate.exe OR *\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe OR *\\\\Ranger\\\\SentinelRanger.exe OR *\\\\Avast\\\\AvastSvc.exe) OR process.executable:(C\\:\\\\Program\\ Files\\\\SplunkUniversalForwarder\\\\bin\\\\* OR C\\:\\\\Program\\ Files\\\\Mozilla\\ Firefox\\\\firefox.exe*))))`"}
