{"id":"9f2cc74d-78af-4eb2-bb64-9cd1d292b87b","created_by":"elhoim","name":"Microsoft Sync Center Suspicious Network Connections","tags":["attack.t1055","attack.t1218","attack.execution","attack.defense_evasion"],"interval":"5m","description":"Detects suspicious connections from Microsoft Sync Center to non-private IPs.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Oo][Bb][Ss][Yy][Nn][Cc]\\.[Ee][Xx][Ee]/ AND (NOT (destination.ip:(/10\\..*/ OR /192\\.168\\..*/ OR /172\\.16\\..*/ OR /172\\.17\\..*/ OR /172\\.18\\..*/ OR /172\\.19\\..*/ OR /172\\.20\\..*/ OR /172\\.21\\..*/ OR /172\\.22\\..*/ OR /172\\.23\\..*/ OR /172\\.24\\..*/ OR /172\\.25\\..*/ OR /172\\.26\\..*/ OR /172\\.27\\..*/ OR /172\\.28\\..*/ OR /172\\.29\\..*/ OR /172\\.30\\..*/ OR /172\\.31\\..*/) AND DestinationIsIpv6:/[Ff][Aa][Ll][Ss][Ee]/)))","rule_id":"9f2cc74d-78af-4eb2-bb64-9cd1d292b87b","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/intelligence-insights-november-2021/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\mobsync.exe AND (NOT (destination.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.*) AND DestinationIsIpv6:false)))`"}
