{"id":"8d7e392e-9b28-49e1-831d-5949c6281228","created_by":"frack113","name":"Download a File with IMEWDBLD.exe","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Use IMEWDBLD.exe (built-in to windows) to download a file","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(network.direction:/[Tt][Rr][Uu][Ee]/ AND process.executable:/.*\\\\[Ii][Mm][Ee][Ww][Dd][Bb][Ll][Dd]\\.[Ee][Xx][Ee]/)","rule_id":"8d7e392e-9b28-49e1-831d-5949c6281228","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download","https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(network.direction:true AND process.executable:*\\\\IMEWDBLD.exe)`"}
