{"id":"a66bc059-c370-472c-a0d7-f8fd1bf9d583","created_by":"Max Altgelt","name":"Equation Editor Network Connection","tags":["attack.execution","attack.t1203"],"interval":"5m","description":"Detects network connections from Equation Editor","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Ee][Qq][Nn][Ee][Dd][Tt]32\\.[Ee][Xx][Ee]/","rule_id":"a66bc059-c370-472c-a0d7-f8fd1bf9d583","timestamp_override":"event.ingested","references":["https://twitter.com/forensicitguy/status/1513538712986079238","https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\eqnedt32.exe`"}
