{"id":"5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4","created_by":"Samir Bousseaden","name":"RDP Over Reverse SSH Tunnel","tags":["attack.command_and_control","attack.t1572","attack.lateral_movement","attack.t1021.001","car.2013-07-002"],"interval":"5m","description":"Detects svchost hosting RDP termsvcs communicating with the loopback address and on TCP port 3389","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND network.direction:/[Tt][Rr][Uu][Ee]/ AND source.port:3389) AND (destination.ip:/127\\..*/ OR destination.ip:\\:\\:1))","rule_id":"5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1096148422984384514"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\svchost.exe AND network.direction:true AND source.port:3389) AND (destination.ip:127.* OR destination.ip:\\:\\:1))`"}
