{"id":"fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4","created_by":"Florian Roth","name":"Communication To Mega.nz","tags":["attack.exfiltration","attack.t1567.001"],"interval":"5m","description":"Detects an executable accessing mega.co.nz, which could be a sign of forbidden file sharing use of data exfiltration by malicious actors","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of mega.nz uploaders and tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(network.direction:/[Tt][Rr][Uu][Ee]/ AND destination.domain:/.*[Aa][Pp][Ii]\\.[Mm][Ee][Gg][Aa]\\.[Cc][Oo]\\.[Nn][Zz]/)","rule_id":"fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4","timestamp_override":"event.ingested","references":["https://megatools.megous.com/","https://www.mandiant.com/resources/russian-targeting-gov-business"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(network.direction:true AND destination.domain:*api.mega.co.nz)`"}
