{"id":"c539afac-c12a-46ed-b1bd-5a5567c9f045","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Remote PowerShell Session (Network)","tags":["attack.execution","attack.t1059.001","attack.lateral_movement","attack.t1021.006"],"interval":"5m","description":"Detects remote PowerShell connections by monitoring network outbound connections to ports 5985 or 5986 from a non-network service account.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.","Network Service user name of a not-covered localization"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((destination.port:(5985 OR 5986) AND network.direction:/[Tt][Rr][Uu][Ee]/) AND (NOT ((winlog.event_data.User:(/.*[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Nn][Ee][Tt][Zz][Ww][Ee][Rr][Kk][Dd][Ii][Ee][Nn][Ss][Tt].*/ OR /.*[Ss][Ee][Rr][Vv][Ii][Zz][Ii][Oo]\\ [Dd][Ii]\\ [Rr][Ee][Tt][Ee].*/ OR /.*[Ss][Ee][Rr][Vv][Ii][Cc][Ii][Oo]\\ [Dd][Ee]\\ [Rr][Ee][Dd].*/) OR winlog.event_data.User:/.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Rr].*/ AND winlog.event_data.User:/.*[Ss][Ee][Aa][Uu].*/ OR source.ip:/0\\:0\\:.*/ OR process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Aa][Vv][Aa][Ss][Tt]\\\\[Aa][Vv][Aa][Ss][Tt][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Aa][Vv][Aa][Ss][Tt]\\\\[Aa][Vv][Aa][Ss][Tt][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/)) OR (source.ip:\\:\\:1 AND destination.ip:\\:\\:1))))","rule_id":"c539afac-c12a-46ed-b1bd-5a5567c9f045","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((destination.port:(5985 OR 5986) AND network.direction:true) AND (NOT ((winlog.event_data.User:(*NETWORK\\ SERVICE* OR *NETZWERKDIENST* OR *SERVIZIO\\ DI\\ RETE* OR *SERVICIO\\ DE\\ RED*) OR winlog.event_data.User:*SERVICE\\ R* AND winlog.event_data.User:*SEAU* OR source.ip:0\\:0\\:* OR process.executable:(C\\:\\\\Program\\ Files\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe)) OR (source.ip:\\:\\:1 AND destination.ip:\\:\\:1))))`"}
