{"id":"20384606-a124-4fec-acbb-8bd373728613","created_by":"Florian Roth","name":"Suspicious Network Connection Binary No CommandLine","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious network connections made by a well-known Windows binary run with no command line parameters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((network.direction:/[Tt][Rr][Uu][Ee]/ AND process.executable:(/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.command_line:\"\") OR (NOT _exists_:process.command_line))))","rule_id":"20384606-a124-4fec-acbb-8bd373728613","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/raspberry-robin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((network.direction:true AND process.executable:(*\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\dllhost.exe) AND process.command_line:(*\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\dllhost.exe)) AND (NOT ((process.command_line:\"\") OR (NOT _exists_:process.command_line))))`"}
