{"id":"c7e91a02-d771-4a6d-a700-42587e0b1095","created_by":"Dmitriy Lifanov, oscd.community","name":"Regsvr32 Network Activity","tags":["attack.execution","attack.t1559.001","attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects network connections and DNS queries initiated by Regsvr32.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/","rule_id":"c7e91a02-d771-4a6d-a700-42587e0b1095","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/","https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\regsvr32.exe`"}
