{"id":"b1e5da3b-ca8e-4adf-915c-9921f3d85481","created_by":"Florian Roth","name":"RDP to HTTP or HTTPS Target Ports","tags":["attack.command_and_control","attack.t1572","attack.lateral_movement","attack.t1021.001","car.2013-07-002"],"interval":"5m","description":"Detects svchost hosting RDP termsvcs communicating to target systems on TCP port 80 or 443","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND network.direction:/[Tt][Rr][Uu][Ee]/ AND source.port:3389 AND destination.port:(80 OR 443))","rule_id":"b1e5da3b-ca8e-4adf-915c-9921f3d85481","timestamp_override":"event.ingested","references":["https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg","https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\svchost.exe AND network.direction:true AND source.port:3389 AND destination.port:(80 OR 443))`"}
