{"id":"0dba975d-a193-4ed1-a067-424df57570d1","created_by":"frack113, Florian Roth","name":"Certutil Initiated Connection","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects a network connection intitiated by the certutil.exe tool. Attackers can abuse `certutil.exe` to download malware or offensive security tools.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate certutil network connection"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR OriginalFilename:/[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) AND (network.direction:/[Tt][Rr][Uu][Ee]/ AND destination.port:(80 OR 443 OR 135 OR 445)))","rule_id":"0dba975d-a193-4ed1-a067-424df57570d1","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\certutil.exe OR OriginalFilename:CertUtil.exe) AND (network.direction:true AND destination.port:(80 OR 443 OR 135 OR 445)))`"}
