{"id":"9976fa64-2804-423c-8a5b-646ade840773","created_by":"frack113","name":"Suspicious Outbound SMTP Connections","tags":["attack.exfiltration","attack.t1048.003"],"interval":"5m","description":"Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.\nThe data may also be sent to an alternate network location from the main command and control server.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other SMTP tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((destination.port:(25 OR 587 OR 465 OR 2525) AND network.direction:/[Tt][Rr][Uu][Ee]/) AND (NOT ((process.executable:(/.*\\\\[Tt][Hh][Uu][Nn][Dd][Ee][Rr][Bb][Ii][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/))))","rule_id":"9976fa64-2804-423c-8a5b-646ade840773","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp","https://www.ietf.org/rfc/rfc2821.txt"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((destination.port:(25 OR 587 OR 465 OR 2525) AND network.direction:true) AND (NOT ((process.executable:(*\\\\thunderbird.exe OR *\\\\outlook.exe)) OR (process.executable:C\\:\\\\Program\\ Files\\\\Microsoft\\\\Exchange\\ Server\\\\*))))`"}
