{"id":"58cb02d5-78ce-4692-b3e1-dce850aae41a","created_by":"Roberto Rodriguez @Cyb3rWard0g, Tim Shelton","name":"Alternate PowerShell Hosts Pipe","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Programs using PowerShell directly without invocation of a dedicated interpreter."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.name:/\\\\[Pp][Ss][Hh][Oo][Ss][Tt].*/ AND (NOT ((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ss][Aa][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ee][Ff][Rr][Oo][Nn][Tt][Aa][Cc][Tt][Ii][Vv][Ee][Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Nn][Ee][Tt][Ss][Rr][Vv]\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/)) OR (NOT _exists_:process.executable) OR (process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/ AND process.executable:/.*\\\\[Tt][Oo][Oo][Ll][Ss]\\\\[Bb][Ii][Nn][Nn]\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/))))","rule_id":"58cb02d5-78ce-4692-b3e1-dce850aae41a","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.name:\\\\PSHost* AND (NOT ((process.executable:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\WINDOWS\\\\System32\\\\sdiagnhost.exe OR *\\\\WINDOWS\\\\System32\\\\wsmprovhost.exe OR *\\\\Windows\\\\system32\\\\dsac.exe OR *\\\\Windows\\\\system32\\\\wbem\\\\wmiprvse.exe OR *\\\\ForefrontActiveDirectoryConnector.exe OR *c\\:\\\\windows\\\\system32\\\\inetsrv\\\\w3wp.exe)) OR (NOT _exists_:process.executable) OR (process.executable:*\\:\\\\Program\\ Files* AND process.executable:*\\\\Microsoft\\ SQL\\ Server\\\\* AND process.executable:*\\\\Tools\\\\Binn\\\\SQLPS.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Citrix\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\\\Exchange\\ Server\\\\*)) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\ServerManager.exe))))`"}
