{"id":"41504465-5e3a-4a5b-a5b4-2a0baadd4463","created_by":"Nasreddine Bencherchali","name":"PsExec Tool Execution From Suspicious Locations - PipeName","tags":["attack.execution","attack.t1569.002","attack.s0029"],"interval":"5m","description":"Detects PsExec default pipe creation where the image executed is located in a suspicious location. Which could indicate that the tool is being used in an attack","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare legitimate use of psexec from the locations mentioned above"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.name:/\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]/ AND process.executable:(/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))","rule_id":"41504465-5e3a-4a5b-a5b4-2a0baadd4463","timestamp_override":"event.ingested","references":["https://www.jpcert.or.jp/english/pub/sr/ir_research.html","https://jpcertcc.github.io/ToolAnalysisResultSheet"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.name:\\\\PSEXESVC AND process.executable:(*C\\:\\\\Users\\\\Public\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\Temp\\\\*))`"}
