{"id":"f3f3a972-f982-40ad-b63c-bca6afdfad7c","created_by":"Thomas Patzke","name":"PsExec Tool Execution","tags":["attack.execution","attack.t1569.002","attack.s0029"],"interval":"5m","description":"Detects PsExec service installation and execution events (service and Sysmon)","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:/\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]/","rule_id":"f3f3a972-f982-40ad-b63c-bca6afdfad7c","timestamp_override":"event.ingested","references":["https://www.jpcert.or.jp/english/pub/sr/ir_research.html","https://jpcertcc.github.io/ToolAnalysisResultSheet"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:\\\\PSEXESVC`"}
