{"id":"0adc67e0-a68f-4ffd-9c43-28905aad5d6a","created_by":"Nasreddine Bencherchali","name":"Koh Default Named Pipes","tags":["attack.privilege_escalation","attack.credential_access","attack.t1528","attack.t1134.001"],"interval":"5m","description":"Detects creation of default named pipes used by the Koh tool","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:(/.*\\\\[Ii][Mm][Pp][Oo][Ss][Ee][Cc][Oo][Ss][Tt].*/ OR /.*\\\\[Ii][Mm][Pp][Oo][Ss][Ii][Nn][Gg][Cc][Oo][Ss][Tt].*/)","rule_id":"0adc67e0-a68f-4ffd-9c43-28905aad5d6a","timestamp_override":"event.ingested","references":["https://github.com/GhostPack/Koh/blob/0283d9f3f91cf74732ad377821986cfcb088e20a/Clients/BOF/KohClient.c#L12"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:(*\\\\imposecost* OR *\\\\imposingcost*)`"}
