{"id":"ac7102b4-9e1e-4802-9b4f-17c5524c015c","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"PowerShell Execution Via Named Pipe","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects execution of PowerShell via creation of named pipe starting with PSHost","risk_score":99,"enabled":true,"severity":"informational","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:/\\\\[Pp][Ss][Hh][Oo][Ss][Tt].*/","rule_id":"ac7102b4-9e1e-4802-9b4f-17c5524c015c","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:\\\\PSHost*`"}
