{"id":"85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7","created_by":"Florian Roth, Christian Burkard","name":"CobaltStrike Named Pipe Patterns","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects the creation of a named pipe with a pattern found in CobaltStrike malleable C2 profiles","risk_score":73,"enabled":true,"severity":"high","false_positives":["Chrome instances using the exactly same name pipe named mojo.something"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((file.name:(/\\\\[Mm][Oo][Jj][Oo]\\.5688\\.8052\\.183894939787088877.*/ OR /\\\\[Mm][Oo][Jj][Oo]\\.5688\\.8052\\.35780273329370473.*/ OR /\\\\[Mm][Yy][Pp][Ii][Pp][Ee]\\-[Ff].*/ OR /\\\\[Mm][Yy][Pp][Ii][Pp][Ee]\\-[Hh].*/ OR /\\\\[Nn][Tt][Ss][Vv][Cc][Ss].*/ OR /\\\\[Ss][Cc][Ee][Rr][Pp][Cc].*/ OR /\\\\[Ww][Ii][Nn]_[Ss][Vv][Cc].*/ OR /\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Ss].*/ OR /\\\\[Mm][Ss][Rr][Pp][Cc]_.*/ OR /\\\\[Ww][Ii][Nn]\\\\[Mm][Ss][Rr][Pp][Cc]_.*/ OR /\\\\[Ww][Kk][Ss][Ss][Vv][Cc].*/ OR /\\\\[Ff]53[Ff].*/ OR /\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ OR /\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Tt][Ee][Xx][Tt][Hh][Aa][Rr][Vv][Ee][Ss][Tt][Ee][Rr].*/ OR /\\\\[Dd][Ss][Ee][Rr][Nn][Aa][Mm][Ee][Pp][Ii][Pp][Ee].*/ OR /\\\\[Pp][Gg][Mm][Ee][Ss][Ss][Aa][Gg][Ee][Pp][Ii][Pp][Ee].*/ OR /\\\\[Mm][Ss][Ff][Tt][Ee][Ww][Dd][Ss].*/ OR /\\\\[Ff]4[Cc]3.*/ OR /\\\\[Ff][Uu][Ll][Ll][Dd][Uu][Pp][Ll][Ee][Xx]_.*/ OR /\\\\[Rr][Pp][Cc]_.*/) OR file.name:(/\\\\[Dd][Ee][Mm][Oo][Aa][Gg][Ee][Nn][Tt]_11/ OR /\\\\[Dd][Ee][Mm][Oo][Aa][Gg][Ee][Nn][Tt]_22/)) OR (file.name:/\\\\[Ww][Ii][Nn][Ss][Oo][Cc][Kk]2\\\\[Cc][Aa][Tt][Aa][Ll][Oo][Gg][Cc][Hh][Aa][Nn][Gg][Ee][Ll][Ii][Ss][Tt][Ee][Nn][Ee][Rr]\\-.*/ AND file.name:/.*\\-0,/)) AND (NOT (file.name:(/\\\\[Ww][Kk][Ss][Ss][Vv][Cc]/ OR /\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Ss]/ OR /\\\\[Ss][Cc][Ee][Rr][Pp][Cc]/ OR /\\\\[Nn][Tt][Ss][Vv][Cc][Ss]/ OR /\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Tt][Ee][Xx][Tt][Hh][Aa][Rr][Vv][Ee][Ss][Tt][Ee][Rr]/ OR /\\\\[Pp][Gg][Mm][Ee][Ss][Ss][Aa][Gg][Ee][Pp][Ii][Pp][Ee]/ OR /\\\\[Mm][Ss][Ff][Tt][Ee][Ww][Dd][Ss]/))))","rule_id":"85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7","timestamp_override":"event.ingested","references":["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575","https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((file.name:(\\\\mojo.5688.8052.183894939787088877* OR \\\\mojo.5688.8052.35780273329370473* OR \\\\mypipe\\-f* OR \\\\mypipe\\-h* OR \\\\ntsvcs* OR \\\\scerpc* OR \\\\win_svc* OR \\\\spoolss* OR \\\\msrpc_* OR \\\\win\\\\msrpc_* OR \\\\wkssvc* OR \\\\f53f* OR \\\\windows.update.manager* OR \\\\SearchTextHarvester* OR \\\\DserNamePipe* OR \\\\PGMessagePipe* OR \\\\MsFteWds* OR \\\\f4c3* OR \\\\fullduplex_* OR \\\\rpc_*) OR file.name:(\\\\demoagent_11 OR \\\\demoagent_22)) OR (file.name:\\\\Winsock2\\\\CatalogChangeListener\\-* AND file.name:*\\-0,)) AND (NOT (file.name:(\\\\wkssvc OR \\\\spoolss OR \\\\scerpc OR \\\\ntsvcs OR \\\\SearchTextHarvester OR \\\\PGMessagePipe OR \\\\MsFteWds))))`"}
