{"id":"739915e4-1e70-4778-8b8a-17db02f66db1","created_by":"Markus Neis","name":"Turla Group Named Pipes","tags":["attack.g0010","attack.execution","attack.t1106"],"interval":"5m","description":"Detects a named pipe used by Turla group samples","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:(/\\\\[Aa][Tt][Cc][Tt][Ll]/ OR /\\\\[Uu][Ss][Ee][Rr][Pp][Ii][Pp][Ee]/ OR /\\\\[Ii][Ee][Hh][Ee][Ll][Pp][Ee][Rr]/ OR /\\\\[Ss][Dd][Ll][Rr][Pp][Cc]/ OR /\\\\[Cc][Oo][Mm][Nn][Aa][Pp]/)","rule_id":"739915e4-1e70-4778-8b8a-17db02f66db1","timestamp_override":"event.ingested","references":["Internal Research","https://attack.mitre.org/groups/G0010/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:(\\\\atctl OR \\\\userpipe OR \\\\iehelper OR \\\\sdlrpc OR \\\\comnap)`"}
