{"id":"0e7163d4-9e19-4fa7-9be6-000c61aad77a","created_by":"Florian Roth","name":"CobaltStrike Named Pipe Pattern Regex","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects the creation of a named pipe matching a pattern used by CobaltStrike Malleable C2 profiles","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(file.name:/\\\\\\\\mojo\\.5688\\.8052\\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}/ OR file.name:/\\\\\\\\wkssvc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\ntsvcs[0-9a-f]{2}/ OR file.name:/\\\\\\\\DserNamePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\SearchTextHarvester[0-9a-f]{2}/ OR file.name:/\\\\\\\\mypipe\\-(?:f|h)[0-9a-f]{2}/ OR file.name:/\\\\\\\\windows\\.update\\.manager[0-9a-f]{2,3}/ OR file.name:/\\\\\\\\ntsvcs_[0-9a-f]{2}/ OR file.name:/\\\\\\\\scerpc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\PGMessagePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\MsFteWds[0-9a-f]{2}/ OR file.name:/\\\\\\\\f4c3[0-9a-f]{2}/ OR file.name:/\\\\\\\\fullduplex_[0-9a-f]{2}/ OR file.name:/\\\\\\\\msrpc_[0-9a-f]{4}/ OR file.name:/\\\\\\\\win\\\\\\\\msrpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\f53f[0-9a-f]{2}/ OR file.name:/\\\\\\\\rpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\spoolss_[0-9a-f]{2}/ OR file.name:/\\\\\\\\Winsock2\\\\\\\\CatalogChangeListener-[0-9a-f]{3}-0,/)","rule_id":"0e7163d4-9e19-4fa7-9be6-000c61aad77a","timestamp_override":"event.ingested","references":["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575","https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(file.name:/\\\\\\\\mojo\\.5688\\.8052\\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}/ OR file.name:/\\\\\\\\wkssvc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\ntsvcs[0-9a-f]{2}/ OR file.name:/\\\\\\\\DserNamePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\SearchTextHarvester[0-9a-f]{2}/ OR file.name:/\\\\\\\\mypipe\\-(?:f|h)[0-9a-f]{2}/ OR file.name:/\\\\\\\\windows\\.update\\.manager[0-9a-f]{2,3}/ OR file.name:/\\\\\\\\ntsvcs_[0-9a-f]{2}/ OR file.name:/\\\\\\\\scerpc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\PGMessagePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\MsFteWds[0-9a-f]{2}/ OR file.name:/\\\\\\\\f4c3[0-9a-f]{2}/ OR file.name:/\\\\\\\\fullduplex_[0-9a-f]{2}/ OR file.name:/\\\\\\\\msrpc_[0-9a-f]{4}/ OR file.name:/\\\\\\\\win\\\\\\\\msrpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\f53f[0-9a-f]{2}/ OR file.name:/\\\\\\\\rpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\spoolss_[0-9a-f]{2}/ OR file.name:/\\\\\\\\Winsock2\\\\\\\\CatalogChangeListener-[0-9a-f]{3}-0,/)`"}
