{"id":"961d0ba2-3eea-4303-a930-2cf78bbfcc5e","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Cred Dump-Tools Named Pipes","tags":["attack.credential_access","attack.t1003.001","attack.t1003.002","attack.t1003.004","attack.t1003.005"],"interval":"5m","description":"Detects well-known credential dumping tools execution via specific named pipes","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Legitimate Administrator using tool for password recovery"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:(/.*\\\\[Ll][Ss][Aa][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Cc][Aa][Cc][Hh][Ee][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Ww][Cc][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Ii][Pp][Ee].*/)","rule_id":"961d0ba2-3eea-4303-a930-2cf78bbfcc5e","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:(*\\\\lsadump* OR *\\\\cachedump* OR *\\\\wceservicepipe*)`"}
