{"id":"9e77ed63-2ecf-4c7b-b09d-640834882028","created_by":"Nikita Nazarov, oscd.community","name":"PsExec Pipes Artifacts","tags":["attack.lateral_movement","attack.t1021.002","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detecting use PsExec via Pipe Creation/Access to pipes","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate Administrator activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:(/[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /[Pp][Aa][Ee][Xx][Ee][Cc].*/ OR /[Rr][Ee][Mm][Cc][Oo][Mm].*/ OR /[Cc][Ss][Ee][Xx][Ee][Cc].*/)","rule_id":"9e77ed63-2ecf-4c7b-b09d-640834882028","timestamp_override":"event.ingested","references":["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:(psexec* OR paexec* OR remcom* OR csexec*)`"}
