{"id":"fe3ac066-98bb-432a-b1e7-a5229cb39d4a","created_by":"Florian Roth, blueteam0ps, elhoim","name":"Malicious Named Pipe","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects the creation of a named pipe used by known APT malware","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"file.name:(/\\\\[Ii][Ss][Aa][Pp][Ii]_[Hh][Tt][Tt][Pp]/ OR /\\\\[Ii][Ss][Aa][Pp][Ii]_[Dd][Gg]/ OR /\\\\[Ii][Ss][Aa][Pp][Ii]_[Dd][Gg]2/ OR /\\\\[Ss][Dd][Ll][Rr][Pp][Cc]/ OR /\\\\[Aa][Hh][Ee][Xx][Ee][Cc]/ OR /\\\\[Ww][Ii][Nn][Ss][Ee][Ss][Ss][Ii][Oo][Nn]/ OR /\\\\[Ll][Ss][Aa][Ss][Ss][Ww]/ OR /\\\\46[Aa]676[Aa][Bb]7[Ff]179[Ee]511[Ee]30[Dd][Dd]2[Dd][Cc]41[Bb][Dd]388/ OR /\\\\9[Ff]81[Ff]59[Bb][Cc]58452127884[Cc][Ee]513865[Ee][Dd]20/ OR /\\\\[Ee]710[Ff]28[Dd]59[Aa][Aa]529[Dd]6792[Cc][Aa]6[Ff][Ff]0[Cc][Aa]1[Bb]34/ OR /\\\\[Rr][Pp][Cc][Hh][Ll][Pp]_3/ OR /\\\\[Nn][Aa][Mm][Ee][Pp][Ii][Pp][Ee]_[Mm][Oo][Rr][Ee][Ww][Ii][Nn][Dd][Oo][Ww][Ss]/ OR /\\\\[Pp][Cc][Hh][Ee][Aa][Pp]_[Rr][Ee][Uu][Ss][Ee]/ OR /\\\\[Gg][Rr][Uu][Nn][Tt][Ss][Vv][Cc]/ OR /\\\\583[Dd][Aa]945\\-62[Aa][Ff]\\-10[Ee]8\\-4902\\-[Aa]8[Ff]205[Cc]72[Bb]2[Ee]/ OR /\\\\[Bb][Ii][Zz][Kk][Aa][Zz]/ OR /\\\\[Ss][Vv][Cc][Cc][Tt][Ll]/ OR /\\\\[Pp][Oo][Ss][Hh].*/ OR /\\\\[Jj][Aa][Cc][Cc][Dd][Pp][Qq][Nn][Vv][Bb][Rr][Rr][Xx][Ll][Aa][Ff]/ OR /\\\\[Cc][Ss][Ee][Xx][Ee][Cc][Ss][Vv][Cc]/ OR /\\\\6[Ee]7645[Cc]4\\-32[Cc]5\\-4[Ff][Ee]3\\-[Aa][Aa][Bb][Ff]\\-[Ee]94[Cc]2[Ff]4370[Ee]7/ OR /\\\\[Aa][Dd][Ss][Cc][Hh][Ee][Mm][Ee][Rr][Pp][Cc]/ OR /\\\\[Aa][Nn][Oo][Nn][Yy][Mm][Oo][Uu][Ss][Pp][Ii][Pp][Ee]/ OR /\\\\[Bb][Cc]367/ OR /\\\\[Bb][Cc]31[Aa]7/ OR /\\\\[Tt][Ee][Ss][Tt][Pp][Ii][Pp][Ee]/ OR /\\\\[Dd][Cc][Ee]_3[Dd]/)","rule_id":"fe3ac066-98bb-432a-b1e7-a5229cb39d4a","timestamp_override":"event.ingested","references":["https://securelist.com/wild-neutron-economic-espionage-threat-actor-returns-with-new-tricks/71275/","https://securelist.com/faq-the-projectsauron-apt/75533/","https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf","https://www.us-cert.gov/ncas/alerts/TA17-117A","https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html","https://thedfirreport.com/2020/06/21/snatch-ransomware/","https://github.com/RiccardoAncarani/LiquidSnake","https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity","https://us-cert.cisa.gov/ncas/analysis-reports/ar19-304a","https://download.bitdefender.com/resources/files/News/CaseStudies/study/115/Bitdefender-Whitepaper-PAC-A4-en-EN1.pdf","https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/","https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`file.name:(\\\\isapi_http OR \\\\isapi_dg OR \\\\isapi_dg2 OR \\\\sdlrpc OR \\\\ahexec OR \\\\winsession OR \\\\lsassw OR \\\\46a676ab7f179e511e30dd2dc41bd388 OR \\\\9f81f59bc58452127884ce513865ed20 OR \\\\e710f28d59aa529d6792ca6ff0ca1b34 OR \\\\rpchlp_3 OR \\\\NamePipe_MoreWindows OR \\\\pcheap_reuse OR \\\\gruntsvc OR \\\\583da945\\-62af\\-10e8\\-4902\\-a8f205c72b2e OR \\\\bizkaz OR \\\\svcctl OR \\\\Posh* OR \\\\jaccdpqnvbrrxlaf OR \\\\csexecsvc OR \\\\6e7645c4\\-32c5\\-4fe3\\-aabf\\-e94c2f4370e7 OR \\\\adschemerpc OR \\\\AnonymousPipe OR \\\\bc367 OR \\\\bc31a7 OR \\\\testPipe OR \\\\dce_3d)`"}
