{"id":"8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090","created_by":"Florian Roth (rule), Jonhnathan Ribeiro","name":"Suspicious PowerShell Invocations - Specific","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell invocation command parameters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((winlog.event_data.ContextInfo:/.*\\-[Nn][Oo][Pp].*/ AND winlog.event_data.ContextInfo:/.*\\ \\-[Ww]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND winlog.event_data.ContextInfo:/.*\\ \\-[Cc]\\ .*/ AND winlog.event_data.ContextInfo:/.*\\[[Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\]\\:\\:[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/) OR (winlog.event_data.ContextInfo:/.*\\ \\-[Ww]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND winlog.event_data.ContextInfo:/.*\\-[Nn][Oo][Nn][Ii].*/ AND winlog.event_data.ContextInfo:/.*\\-[Nn][Oo][Pp].*/ AND winlog.event_data.ContextInfo:/.*\\ \\-[Cc]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Ii][Ee][Xx].*/ AND winlog.event_data.ContextInfo:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/) OR (winlog.event_data.ContextInfo:/.*\\ \\-[Ww]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND winlog.event_data.ContextInfo:/.*\\-[Ee][Pp].*/ AND winlog.event_data.ContextInfo:/.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ AND winlog.event_data.ContextInfo:/.*\\-[Ee][Nn][Cc].*/) OR (winlog.event_data.ContextInfo:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND winlog.event_data.ContextInfo:/.*[Rr][Ee][Gg].*/ AND winlog.event_data.ContextInfo:/.*[Aa][Dd][Dd].*/ AND winlog.event_data.ContextInfo:/.*[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/) OR (winlog.event_data.ContextInfo:/.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ AND winlog.event_data.ContextInfo:/.*\\-[Nn][Oo][Pp][Rr][Oo][Ff][Ii][Ll][Ee].*/ AND winlog.event_data.ContextInfo:/.*\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee].*/ AND winlog.event_data.ContextInfo:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND winlog.event_data.ContextInfo:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND winlog.event_data.ContextInfo:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND winlog.event_data.ContextInfo:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd].*/) OR (winlog.event_data.ContextInfo:/.*[Ii][Ee][Xx].*/ AND winlog.event_data.ContextInfo:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND winlog.event_data.ContextInfo:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND winlog.event_data.ContextInfo:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd].*/)) AND (NOT ((winlog.event_data.ContextInfo:(/.*\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\('[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\.[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\.[Oo][Rr][Gg]\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Pp][Ss]1.*/ OR /.*[Ww][Rr][Ii][Tt][Ee]\\-[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy][Ww][Aa][Rr][Nn][Ii][Nn][Gg].*/)))))","rule_id":"8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((winlog.event_data.ContextInfo:*\\-nop* AND winlog.event_data.ContextInfo:*\\ \\-w\\ * AND winlog.event_data.ContextInfo:*hidden* AND winlog.event_data.ContextInfo:*\\ \\-c\\ * AND winlog.event_data.ContextInfo:*\\[Convert\\]\\:\\:FromBase64String*) OR (winlog.event_data.ContextInfo:*\\ \\-w\\ * AND winlog.event_data.ContextInfo:*hidden* AND winlog.event_data.ContextInfo:*\\-noni* AND winlog.event_data.ContextInfo:*\\-nop* AND winlog.event_data.ContextInfo:*\\ \\-c\\ * AND winlog.event_data.ContextInfo:*iex* AND winlog.event_data.ContextInfo:*New\\-Object*) OR (winlog.event_data.ContextInfo:*\\ \\-w\\ * AND winlog.event_data.ContextInfo:*hidden* AND winlog.event_data.ContextInfo:*\\-ep* AND winlog.event_data.ContextInfo:*bypass* AND winlog.event_data.ContextInfo:*\\-Enc*) OR (winlog.event_data.ContextInfo:*powershell* AND winlog.event_data.ContextInfo:*reg* AND winlog.event_data.ContextInfo:*add* AND winlog.event_data.ContextInfo:*HKCU\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run*) OR (winlog.event_data.ContextInfo:*bypass* AND winlog.event_data.ContextInfo:*\\-noprofile* AND winlog.event_data.ContextInfo:*\\-windowstyle* AND winlog.event_data.ContextInfo:*hidden* AND winlog.event_data.ContextInfo:*new\\-object* AND winlog.event_data.ContextInfo:*system.net.webclient* AND winlog.event_data.ContextInfo:*.download*) OR (winlog.event_data.ContextInfo:*iex* AND winlog.event_data.ContextInfo:*New\\-Object* AND winlog.event_data.ContextInfo:*Net.WebClient* AND winlog.event_data.ContextInfo:*.Download*)) AND (NOT ((winlog.event_data.ContextInfo:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1* OR *Write\\-ChocolateyWarning*)))))`"}
