{"id":"f62176f3-8128-4faa-bf6c-83261322e5eb","created_by":"Sean Metcalf (source), Florian Roth (rule)","name":"Malicious PowerShell Keywords","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects keywords from well-known PowerShell exploitation frameworks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Aa][Dd][Jj][Uu][Ss][Tt][Tt][Oo][Kk][Ee][Nn][Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Ii][Mm][Aa][Gg][Ee]_[Nn][Tt]_[Oo][Pp][Tt][Ii][Oo][Nn][Aa][Ll]_[Hh][Dd][Rr]64_[Mm][Aa][Gg][Ii][Cc].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn]32\\.[Uu][Nn][Ss][Aa][Ff][Ee][Nn][Aa][Tt][Ii][Vv][Ee][Mm][Ee][Tt][Hh][Oo][Dd][Ss].*/ OR /.*[Rr][Ee][Aa][Dd][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Mm][Ee][Mm][Oo][Rr][Yy]\\.[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Ss][Ee]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee]_[Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*[Ll][Ss][Aa]_[Uu][Nn][Ii][Cc][Oo][Dd][Ee]_[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp][Ww][Rr][Ii][Tt][Ee][Dd][Uu][Mm][Pp].*/ OR /.*[Pp][Aa][Gg][Ee]_[Ee][Xx][Ee][Cc][Uu][Tt][Ee]_[Rr][Ee][Aa][Dd].*/ OR /.*[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]_[Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Dd][Jj][Uu][Ss][Tt]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Ll][Ll]_[Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Ss][Ss][Ii][Gg][Nn]_[Pp][Rr][Ii][Mm][Aa][Rr][Yy].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Dd][Uu][Pp][Ll][Ii][Cc][Aa][Tt][Ee].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ee][Ll][Ee][Vv][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ee].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn]_[Cc][Ll][Aa][Ss][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Qq][Uu][Ee][Rr][Yy].*/ OR /.*[Mm][Ee][Tt][Aa][Ss][Pp][Ll][Oo][Ii][Tt].*/ OR /.*[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz].*/)","rule_id":"f62176f3-8128-4faa-bf6c-83261322e5eb","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2921"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*AdjustTokenPrivileges* OR *IMAGE_NT_OPTIONAL_HDR64_MAGIC* OR *Microsoft.Win32.UnsafeNativeMethods* OR *ReadProcessMemory.Invoke* OR *SE_PRIVILEGE_ENABLED* OR *LSA_UNICODE_STRING* OR *MiniDumpWriteDump* OR *PAGE_EXECUTE_READ* OR *SECURITY_DELEGATION* OR *TOKEN_ADJUST_PRIVILEGES* OR *TOKEN_ALL_ACCESS* OR *TOKEN_ASSIGN_PRIMARY* OR *TOKEN_DUPLICATE* OR *TOKEN_ELEVATION* OR *TOKEN_IMPERSONATE* OR *TOKEN_INFORMATION_CLASS* OR *TOKEN_PRIVILEGES* OR *TOKEN_QUERY* OR *Metasploit* OR *Mimikatz*)`"}
