{"id":"4fdc44df-bfe9-4fcc-b041-68f5a2d3031c","created_by":"frack113","name":"Powershell LocalAccount Manipulation","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"Adversaries may manipulate accounts to maintain access to victim systems.\nAccount manipulation may consist of any action that preserves adversary access to a compromised account, such as modifying credentials or permission groups\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Ee][Nn][Aa][Bb][Ll][Ee]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Ss][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Nn][Ee][Ww]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Rr][Ee][Nn][Aa][Mm][Ee]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/)","rule_id":"4fdc44df-bfe9-4fcc-b041-68f5a2d3031c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1098/T1098.md#atomic-test-1---admin-account-manipulate","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.localaccounts/?view=powershell-5.1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Disable\\-LocalUser* OR *Enable\\-LocalUser* OR *Get\\-LocalUser* OR *Set\\-LocalUser* OR *New\\-LocalUser* OR *Rename\\-LocalUser* OR *Remove\\-LocalUser*)`"}
