{"id":"902cedee-0398-4e3a-8183-6f3a89773a96","created_by":"frack113","name":"Suspicious Invoke-Item From Mount-DiskImage","tags":["attack.defense_evasion","attack.t1553.005"],"interval":"5m","description":"Adversaries may abuse container files such as disk image (.iso, .vhd) file formats to deliver malicious payloads that may not be tagged with MOTW.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Mm][Oo][Uu][Nn][Tt]\\-[Dd][Ii][Ss][Kk][Ii][Mm][Aa][Gg][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]\\ .*/ AND powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Vv][Oo][Ll][Uu][Mm][Ee].*/ AND powershell.file.script_block_text:/.*\\.[Dd][Rr][Ii][Vv][Ee][Ll][Ee][Tt][Tt][Ee][Rr].*/ AND powershell.file.script_block_text:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ii][Tt][Ee][Mm]\\ .*/ AND powershell.file.script_block_text:/.*\\)\\:\\\\.*/)","rule_id":"902cedee-0398-4e3a-8183-6f3a89773a96","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.005/T1553.005.md#atomic-test-2---mount-an-iso-image-and-run-executable-from-the-iso","https://docs.microsoft.com/en-us/powershell/module/storage/mount-diskimage?view=windowsserver2022-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Mount\\-DiskImage\\ * AND powershell.file.script_block_text:*\\-ImagePath\\ * AND powershell.file.script_block_text:*Get\\-Volume* AND powershell.file.script_block_text:*.DriveLetter* AND powershell.file.script_block_text:*invoke\\-item\\ * AND powershell.file.script_block_text:*\\)\\:\\\\*)`"}
