{"id":"d93129cd-1ee0-479f-bc03-ca6f129882e3","created_by":"frack113, Duc.Le-GTSC","name":"Powershell Detect Virtualization Environment","tags":["attack.defense_evasion","attack.t1497.001"],"interval":"5m","description":"Adversaries may employ various system checks to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Gg][Ww][Mm][Ii].*/) AND powershell.file.script_block_text:(/.*[Mm][Ss][Aa][Cc][Pp][Ii]_[Tt][Hh][Ee][Rr][Mm][Aa][Ll][Zz][Oo][Nn][Ee][Tt][Ee][Mm][Pp][Ee][Rr][Aa][Tt][Uu][Rr][Ee].*/ OR /.*[Ww][Ii][Nn]32_[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss][Yy][Ss][Tt][Ee][Mm].*/))","rule_id":"d93129cd-1ee0-479f-bc03-ca6f129882e3","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1497.001/T1497.001.md","https://techgenix.com/malicious-powershell-scripts-evade-detection/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*Get\\-WmiObject* OR *gwmi*) AND powershell.file.script_block_text:(*MSAcpi_ThermalZoneTemperature* OR *Win32_ComputerSystem*))`"}
