{"id":"c70e019b-1479-4b65-b0cc-cd0c6093a599","created_by":"Sean Metcalf (source), Florian Roth (rule)","name":"PowerShell Called from an Executable Version Mismatch","tags":["attack.defense_evasion","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects PowerShell called from an executable by the version mismatch method","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EngineVersion:(/2\\..*/ OR /4\\..*/ OR /5\\..*/) AND winlog.event_data.HostVersion:/3\\..*/)","rule_id":"c70e019b-1479-4b65-b0cc-cd0c6093a599","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2921"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EngineVersion:(2.* OR 4.* OR 5.*) AND winlog.event_data.HostVersion:3.*)`"}
