{"id":"60167e5c-84b2-4c95-a7ac-86281f27c445","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Remote PowerShell Session (PS Classic)","tags":["attack.execution","attack.t1059.001","attack.lateral_movement","attack.t1021.006"],"interval":"5m","description":"Detects remote PowerShell sessions","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use remote PowerShell sessions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.title:/[Ss][Ee][Rr][Vv][Ee][Rr][Rr][Ee][Mm][Oo][Tt][Ee][Hh][Oo][Ss][Tt]/ AND process.command_line:/.*[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/)","rule_id":"60167e5c-84b2-4c95-a7ac-86281f27c445","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.title:ServerRemoteHost AND process.command_line:*wsmprovhost.exe*)`"}
