{"id":"dcd74b95-3f36-4ed9-9598-0490951643aa","created_by":"Bhabesh Raj","name":"Malicious PowerView PowerShell Commandlets","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Commandlet names from PowerView of PowerSploit exploitation framework.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Should not be any as administrators do not use this tool"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ee][Xx][Pp][Oo][Rr][Tt]\\-[Pp][Oo][Ww][Ee][Rr][Vv][Ii][Ee][Ww][Cc][Ss][Vv].*/ OR /.*[Gg][Ee][Tt]\\-[Ii][Pp][Aa][Dd][Dd][Rr][Ee][Ss][Ss].*/ OR /.*[Rr][Ee][Ss][Oo][Ll][Vv][Ee]\\-[Ii][Pp][Aa][Dd][Dd][Rr][Ee][Ss][Ss].*/ OR /.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\-[Nn][Aa][Mm][Ee][Tt][Oo][Ss][Ii][Dd].*/ OR /.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt][Tt][Oo]\\-[Ss][Ii][Dd].*/ OR /.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\-[Aa][Dd][Nn][Aa][Mm][Ee].*/ OR /.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt][Ff][Rr][Oo][Mm]\\-[Uu][Aa][Cc][Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Aa][Dd][Dd]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Uu][Ss][Ee][Rr][Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Rr][Ee][Vv][Ee][Rr][Tt][Tt][Oo][Ss][Ee][Ll][Ff].*/ OR /.*[Rr][Ee][Qq][Uu][Ee][Ss][Tt]\\-[Ss][Pp][Nn][Tt][Ii][Cc][Kk][Ee][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ss][Pp][Nn][Tt][Ii][Cc][Kk][Ee][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Aa][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Pp][Aa][Tt][Hh][Aa][Cc][Ll].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Nn][Ss][Zz][Oo][Nn][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Dd][Nn][Ss][Zz][Oo][Nn][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Nn][Ss][Rr][Ee][Cc][Oo][Rr][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Dd][Nn][Ss][Rr][Ee][Cc][Oo][Rr][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Dd][Oo][Mm][Aa][Ii][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Dd][Oo][Mm][Aa][Ii][Nn][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ff][Oo][Rr][Ee][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Ff][Oo][Rr][Ee][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ff][Oo][Rr][Ee][Ss][Tt][Dd][Oo][Mm][Aa][Ii][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Ff][Oo][Rr][Ee][Ss][Tt][Dd][Oo][Mm][Aa][Ii][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ff][Oo][Rr][Ee][Ss][Tt][Cc][Aa][Tt][Aa][Ll][Oo][Gg].*/ OR /.*[Gg][Ee][Tt]\\-[Ff][Oo][Rr][Ee][Ss][Tt][Gg][Ll][Oo][Bb][Aa][Ll][Cc][Aa][Tt][Aa][Ll][Oo][Gg].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Bb][Jj][Ee][Cc][Tt][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy][Oo][Uu][Tt][Ll][Ii][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Uu][Ss][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr].*/ OR /.*[Nn][Ee][Ww]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr].*/ OR /.*[Ss][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Uu][Ss][Ee][Rr][Ee][Vv][Ee][Nn][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr][Ee][Vv][Ee][Nn][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Aa][Dd][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Ss][Ee][Tt]\\-[Aa][Dd][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Ss][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Oo][Bb][Jj][Ee][Cc][Tt][Aa][Cc][Ll].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Bb][Jj][Ee][Cc][Tt][Aa][Cc][Ll].*/ OR /.*[Aa][Dd][Dd]\\-[Oo][Bb][Jj][Ee][Cc][Tt][Aa][Cc][Ll].*/ OR /.*[Aa][Dd][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Bb][Jj][Ee][Cc][Tt][Aa][Cc][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Cc][Ll][Ss][Cc][Aa][Nn][Nn][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ii][Nn][Tt][Ee][Rr][Ee][Ss][Tt][Ii][Nn][Gg][Dd][Oo][Mm][Aa][Ii][Nn][Aa][Cc][Ll].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Oo][Uu].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Oo][Uu].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ss][Ii][Tt][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ss][Ii][Tt][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ss][Uu][Bb][Nn][Ee][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ss][Uu][Bb][Nn][Ee][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ss][Ii][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Nn][Ee][Ww]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Mm][Aa][Nn][Aa][Gg][Ee][Dd][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Gg][Rr][Oo][Uu][Pp][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Dd][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Aa][Dd][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ff][Ii][Ll][Ee][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ff][Ii][Ll][Ee][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Ff][Ss][Ss][Hh][Aa][Rr][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Dd][Ff][Ss][Ss][Hh][Aa][Rr][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Gg][Pp][Oo].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Pp][Oo].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Gg][Pp][Oo][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Pp][Oo][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Gg][Pp][Oo][Ll][Oo][Cc][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Pp][Oo][Uu][Ss][Ee][Rr][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Aa][Pp][Pp][Ii][Nn][Gg].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Gg][Pp][Oo][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Pp][Oo][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Aa][Pp][Pp][Ii][Nn][Gg].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Pp][Oo][Ll][Ii][Cc][Yy].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ss][Hh][Aa][Rr][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ss][Ee][Ss][Ss][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn][Ll][Oo][Cc][Aa][Ll].*/ OR /.*[Gg][Ee][Tt]\\-[Rr][Ee][Gg][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Rr][Dd][Pp][Ss][Ee][Ss][Ss][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Hh][Ee][Cc][Kk][Ll][Oo][Cc][Aa][Ll][Aa][Dd][Mm][Ii][Nn][Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Tt][Ee][Ss][Tt]\\-[Aa][Dd][Mm][Ii][Nn][Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ii][Tt][Ee][Nn][Aa][Mm][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss][Ii][Tt][Ee][Nn][Aa][Mm][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Pp][Rr][Oo][Xx][Yy].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Rr][Ee][Gg][Pp][Rr][Oo][Xx][Yy].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Aa][Ss][Tt][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Rr][Ee][Gg][Ll][Aa][Ss][Tt][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Cc][Aa][Cc][Hh][Ee][Dd][Rr][Dd][Pp][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Rr][Ee][Gg][Cc][Aa][Cc][Hh][Ee][Dd][Rr][Dd][Pp][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy][Mm][Oo][Uu][Nn][Tt][Ee][Dd][Dd][Rr][Ii][Vv][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Rr][Ee][Gg][Mm][Oo][Uu][Nn][Tt][Ee][Dd][Dd][Rr][Ii][Vv][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ii][Nn][Tt][Ee][Rr][Ee][Ss][Tt][Ii][Nn][Gg][Ff][Ii][Ll][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Uu][Ss][Ee][Rr][Hh][Uu][Nn][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr][Ll][Oo][Cc][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Hh][Uu][Nn][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Vv][Ee][Nn][Tt][Hh][Uu][Nn][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Uu][Ss][Ee][Rr][Ee][Vv][Ee][Nn][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Ee][Ff][Ii][Nn][Dd][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ss][Hh][Aa][Rr][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ff][Ii][Ll][Ee][Ff][Ii][Nn][Dd][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ii][Nn][Tt][Ee][Rr][Ee][Ss][Tt][Ii][Nn][Gg][Dd][Oo][Mm][Aa][Ii][Nn][Ss][Hh][Aa][Rr][Ee][Ff][Ii][Ll][Ee].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ll][Oo][Cc][Aa][Ll][Aa][Dd][Mm][Ii][Nn][Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Nn][Uu][Mm][Ee][Rr][Aa][Tt][Ee][Ll][Oo][Cc][Aa][Ll][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Dd][Oo][Mm][Aa][Ii][Nn][Tt][Rr][Uu][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Tt][Rr][Uu][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Ff][Oo][Rr][Ee][Ss][Tt][Tt][Rr][Uu][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Ff][Oo][Rr][Ee][Ss][Tt][Tt][Rr][Uu][Ss][Tt].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ff][Oo][Rr][Ee][Ii][Gg][Nn][Uu][Ss][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ff][Oo][Rr][Ee][Ii][Gg][Nn][Uu][Ss][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ff][Oo][Rr][Ee][Ii][Gg][Nn][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Ff][Oo][Rr][Ee][Ii][Gg][Nn][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Aa][Pp][Dd][Oo][Mm][Aa][Ii][Nn][Tt][Rr][Uu][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Dd][Oo][Mm][Aa][Ii][Nn][Tt][Rr][Uu][Ss][Tt][Mm][Aa][Pp][Pp][Ii][Nn][Gg].*/)","rule_id":"dcd74b95-3f36-4ed9-9598-0490951643aa","timestamp_override":"event.ingested","references":["https://powersploit.readthedocs.io/en/stable/Recon/README","https://github.com/PowerShellMafia/PowerSploit/tree/master/Recon","https://thedfirreport.com/2020/10/08/ryuks-return","https://adsecurity.org/?p=2277"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Export\\-PowerViewCSV* OR *Get\\-IPAddress* OR *Resolve\\-IPAddress* OR *Convert\\-NameToSid* OR *ConvertTo\\-SID* OR *Convert\\-ADName* OR *ConvertFrom\\-UACValue* OR *Add\\-RemoteConnection* OR *Remove\\-RemoteConnection* OR *Invoke\\-UserImpersonation* OR *Invoke\\-RevertToSelf* OR *Request\\-SPNTicket* OR *Get\\-DomainSPNTicket* OR *Invoke\\-Kerberoast* OR *Get\\-PathAcl* OR *Get\\-DNSZone* OR *Get\\-DomainDNSZone* OR *Get\\-DNSRecord* OR *Get\\-DomainDNSRecord* OR *Get\\-NetDomain* OR *Get\\-Domain* OR *Get\\-NetDomainController* OR *Get\\-DomainController* OR *Get\\-NetForest* OR *Get\\-Forest* OR *Get\\-NetForestDomain* OR *Get\\-ForestDomain* OR *Get\\-NetForestCatalog* OR *Get\\-ForestGlobalCatalog* OR *Find\\-DomainObjectPropertyOutlier* OR *Get\\-NetUser* OR *Get\\-DomainUser* OR *New\\-DomainUser* OR *Set\\-DomainUserPassword* OR *Get\\-UserEvent* OR *Get\\-DomainUserEvent* OR *Get\\-NetComputer* OR *Get\\-DomainComputer* OR *Get\\-ADObject* OR *Get\\-DomainObject* OR *Set\\-ADObject* OR *Set\\-DomainObject* OR *Get\\-ObjectAcl* OR *Get\\-DomainObjectAcl* OR *Add\\-ObjectAcl* OR *Add\\-DomainObjectAcl* OR *Invoke\\-ACLScanner* OR *Find\\-InterestingDomainAcl* OR *Get\\-NetOU* OR *Get\\-DomainOU* OR *Get\\-NetSite* OR *Get\\-DomainSite* OR *Get\\-NetSubnet* OR *Get\\-DomainSubnet* OR *Get\\-DomainSID* OR *Get\\-NetGroup* OR *Get\\-DomainGroup* OR *New\\-DomainGroup* OR *Find\\-ManagedSecurityGroups* OR *Get\\-DomainManagedSecurityGroup* OR *Get\\-NetGroupMember* OR *Get\\-DomainGroupMember* OR *Add\\-DomainGroupMember* OR *Get\\-NetFileServer* OR *Get\\-DomainFileServer* OR *Get\\-DFSshare* OR *Get\\-DomainDFSShare* OR *Get\\-NetGPO* OR *Get\\-DomainGPO* OR *Get\\-NetGPOGroup* OR *Get\\-DomainGPOLocalGroup* OR *Find\\-GPOLocation* OR *Get\\-DomainGPOUserLocalGroupMapping* OR *Find\\-GPOComputerAdmin* OR *Get\\-DomainGPOComputerLocalGroupMapping* OR *Get\\-DomainPolicy* OR *Get\\-NetLocalGroup* OR *Get\\-NetLocalGroupMember* OR *Get\\-NetShare* OR *Get\\-NetLoggedon* OR *Get\\-NetSession* OR *Get\\-LoggedOnLocal* OR *Get\\-RegLoggedOn* OR *Get\\-NetRDPSession* OR *Invoke\\-CheckLocalAdminAccess* OR *Test\\-AdminAccess* OR *Get\\-SiteName* OR *Get\\-NetComputerSiteName* OR *Get\\-Proxy* OR *Get\\-WMIRegProxy* OR *Get\\-LastLoggedOn* OR *Get\\-WMIRegLastLoggedOn* OR *Get\\-CachedRDPConnection* OR *Get\\-WMIRegCachedRDPConnection* OR *Get\\-RegistryMountedDrive* OR *Get\\-WMIRegMountedDrive* OR *Get\\-NetProcess* OR *Get\\-WMIProcess* OR *Find\\-InterestingFile* OR *Invoke\\-UserHunter* OR *Find\\-DomainUserLocation* OR *Invoke\\-ProcessHunter* OR *Find\\-DomainProcess* OR *Invoke\\-EventHunter* OR *Find\\-DomainUserEvent* OR *Invoke\\-ShareFinder* OR *Find\\-DomainShare* OR *Invoke\\-FileFinder* OR *Find\\-InterestingDomainShareFile* OR *Find\\-LocalAdminAccess* OR *Invoke\\-EnumerateLocalAdmin* OR *Find\\-DomainLocalGroupMember* OR *Get\\-NetDomainTrust* OR *Get\\-DomainTrust* OR *Get\\-NetForestTrust* OR *Get\\-ForestTrust* OR *Find\\-ForeignUser* OR *Get\\-DomainForeignUser* OR *Find\\-ForeignGroup* OR *Get\\-DomainForeignGroupMember* OR *Invoke\\-MapDomainTrust* OR *Get\\-DomainTrustMapping*)`"}
