{"id":"91109523-17f0-4248-a800-f81d9e7c081d","created_by":"frack113","name":"PowerShell WMI Win32_Product Install MSI","tags":["attack.defense_evasion","attack.t1218.007"],"interval":"5m","description":"Detects the execution of an MSI file using PowerShell and the WMI Win32_Product class","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Ii][Mm][Mm][Ee][Tt][Hh][Oo][Dd]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Cc][Ll][Aa][Ss][Ss][Nn][Aa][Mm][Ee]\\ .*/ AND powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Pp][Rr][Oo][Dd][Uu][Cc][Tt]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Mm][Ee][Tt][Hh][Oo][Dd][Nn][Aa][Mm][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\.[Mm][Ss][Ii].*/)","rule_id":"91109523-17f0-4248-a800-f81d9e7c081d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Invoke\\-CimMethod\\ * AND powershell.file.script_block_text:*\\-ClassName\\ * AND powershell.file.script_block_text:*Win32_Product\\ * AND powershell.file.script_block_text:*\\-MethodName\\ * AND powershell.file.script_block_text:*.msi*)`"}
