{"id":"84c174ab-d3ef-481f-9c86-a50d0b8e3edb","created_by":"Florian Roth","name":"PowerShell Get-Process LSASS in ScriptBlock","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects a Get-Process command on lsass process, which is in almost all cases a sign of malicious activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate certificate exports invoked by administrators or users (depends on processes in the environment - filter if unusable)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ll][Ss][Aa][Ss][Ss].*/","rule_id":"84c174ab-d3ef-481f-9c86-a50d0b8e3edb","timestamp_override":"event.ingested","references":["https://twitter.com/PythonResponder/status/1385064506049630211"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Get\\-Process\\ lsass*`"}
