{"id":"9a7afa56-4762-43eb-807d-c3dc9ffe211b","created_by":"frack113","name":"Powershell Exfiltration Over SMTP","tags":["attack.exfiltration","attack.t1048.003"],"interval":"5m","description":"Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.\nThe data may also be sent to an alternate network location from the main command and control server.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ss][Ee][Nn][Dd]\\-[Mm][Aa][Ii][Ll][Mm][Ee][Ss][Ss][Aa][Gg][Ee].*/","rule_id":"9a7afa56-4762-43eb-807d-c3dc9ffe211b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/send-mailmessage?view=powershell-7.2","https://www.ietf.org/rfc/rfc2821.txt"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Send\\-MailMessage*`"}
