{"id":"a6d67db4-6220-436d-8afc-f3842fe05d43","created_by":"Daniil Yugoslavskiy, oscd.community","name":"Dnscat Execution","tags":["attack.exfiltration","attack.t1048","attack.execution","attack.t1059.001"],"interval":"5m","description":"Dnscat exfiltration tool execution","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Legitimate usage of PowerShell Dnscat2 — DNS Exfiltration tool (unlikely)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ss][Tt][Aa][Rr][Tt]\\-[Dd][Nn][Ss][Cc][Aa][Tt]2.*/","rule_id":"a6d67db4-6220-436d-8afc-f3842fe05d43","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Start\\-Dnscat2*`"}
