{"id":"8d31a8ce-46b5-4dd6-bdc3-680931f1db86","created_by":"ok @securonix invrep_de, oscd.community","name":"Bad Opsec Powershell Code Artifacts","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Focuses on trivial artifacts observed in variants of prevalent offensive ps1 payloads, including Cobalt Strike Beacon, PoshC2, Powerview, Letmein, Empire, Powersploit, and other attack payloads that often undergo minimal changes by attackers due to bad opsec.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Moderate-to-low; Despite the shorter length/lower entropy for some of these, because of high specificity, fp appears to be fairly limited in many environments."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.Payload:(/.*$[Dd][Oo][Ii][Tt].*/ OR /.*[Hh][Aa][Rr][Mm][Jj]0[Yy].*/ OR /.*[Mm][Aa][Tt][Tt][Ii][Ff][Ee][Ss][Tt][Aa][Tt][Ii][Oo][Nn].*/ OR /.*_[Rr][Aa][Ss][Tt][Aa][Mm][Oo][Uu][Ss][Ee].*/ OR /.*[Tt][Ii][Ff][Kk][Ii][Nn]_.*/ OR /.*0[Xx][Dd][Ee][Aa][Dd][Bb][Ee][Ee][Ff].*/)","rule_id":"8d31a8ce-46b5-4dd6-bdc3-680931f1db86","timestamp_override":"event.ingested","references":["https://newtonpaul.com/analysing-fileless-malware-cobalt-strike-beacon/","https://labs.sentinelone.com/top-tier-russian-organized-cybercrime-group-unveils-fileless-stealthy-powertrick-backdoor-for-high-value-targets/","https://www.mdeditor.tw/pl/pgRt"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.Payload:(*$DoIt* OR *harmj0y* OR *mattifestation* OR *_RastaMouse* OR *tifkin_* OR *0xdeadbeef*)`"}
