{"id":"daf7eb81-35fd-410d-9d7a-657837e602bb","created_by":"frack113","name":"Zip A Folder With PowerShell For Staging In Temp","tags":["attack.collection","attack.t1074.001"],"interval":"5m","description":"Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.ContextInfo:/.*[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss]\\-[Aa][Rr][Cc][Hh][Ii][Vv][Ee]\\ .*/ AND winlog.event_data.ContextInfo:/.*\\ \\-[Pp][Aa][Tt][Hh]\\ .*/ AND winlog.event_data.ContextInfo:/.*\\ \\-[Dd][Ee][Ss][Tt][Ii][Nn][Aa][Tt][Ii][Oo][Nn][Pp][Aa][Tt][Hh]\\ .*/ AND winlog.event_data.ContextInfo:/.*$[Ee][Nn][Vv]\\:[Tt][Ee][Mm][Pp]\\\\.*/)","rule_id":"daf7eb81-35fd-410d-9d7a-657837e602bb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1074.001/T1074.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.ContextInfo:*Compress\\-Archive\\ * AND winlog.event_data.ContextInfo:*\\ \\-Path\\ * AND winlog.event_data.ContextInfo:*\\ \\-DestinationPath\\ * AND winlog.event_data.ContextInfo:*$env\\:TEMP\\\\*)`"}
