{"id":"e3818659-5016-4811-a73c-dde4679169d2","created_by":"frack113","name":"Suspicious Computer Machine Password by PowerShell","tags":["attack.initial_access","attack.t1078"],"interval":"5m","description":"The Reset-ComputerMachinePassword cmdlet changes the computer account password that the computers use to authenticate to the domain controllers in the domain. You can use it to reset the password of the local computer.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.ContextInfo:/.*[Rr][Ee][Ss][Ee][Tt]\\-[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Mm][Aa][Cc][Hh][Ii][Nn][Ee][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/","rule_id":"e3818659-5016-4811-a73c-dde4679169d2","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1","https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.ContextInfo:*Reset\\-ComputerMachinePassword*`"}
