{"id":"e0565f5d-d420-4e02-8a68-ac00d864f9cf","created_by":"frack113","name":"Automated Collection Bookmarks Using Get-ChildItem PowerShell","tags":["attack.discovery","attack.t1217"],"interval":"5m","description":"Adversaries may enumerate browser bookmarks to learn more about compromised hosts.\nBrowser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about\ninternal network resources such as servers, tools/dashboards, or other related infrastructure.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Cc][Hh][Ii][Ll][Dd][Ii][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*\\ \\-[Rr][Ee][Cc][Uu][Rr][Ss][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\ \\-[Pp][Aa][Tt][Hh]\\ .*/ AND powershell.file.script_block_text:/.*\\ \\-[Ff][Ii][Ll][Tt][Ee][Rr]\\ [Bb][Oo][Oo][Kk][Mm][Aa][Rr][Kk][Ss].*/ AND powershell.file.script_block_text:/.*\\ \\-[Ee][Rr][Rr][Oo][Rr][Aa][Cc][Tt][Ii][Oo][Nn]\\ [Ss][Ii][Ll][Ee][Nn][Tt][Ll][Yy][Cc][Oo][Nn][Tt][Ii][Nn][Uu][Ee].*/ AND powershell.file.script_block_text:/.*\\ \\-[Ff][Oo][Rr][Cc][Ee].*/)","rule_id":"e0565f5d-d420-4e02-8a68-ac00d864f9cf","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Get\\-ChildItem* AND powershell.file.script_block_text:*\\ \\-Recurse\\ * AND powershell.file.script_block_text:*\\ \\-Path\\ * AND powershell.file.script_block_text:*\\ \\-Filter\\ Bookmarks* AND powershell.file.script_block_text:*\\ \\-ErrorAction\\ SilentlyContinue* AND powershell.file.script_block_text:*\\ \\-Force*)`"}
