{"id":"b7a3c9a3-09ea-4934-8864-6a32cacd98d9","created_by":"frack113","name":"Zip A Folder With PowerShell For Staging In Temp","tags":["attack.collection","attack.t1074.001"],"interval":"5m","description":"Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss]\\-[Aa][Rr][Cc][Hh][Ii][Vv][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\ \\-[Pp][Aa][Tt][Hh]\\ .*/ AND powershell.file.script_block_text:/.*\\ \\-[Dd][Ee][Ss][Tt][Ii][Nn][Aa][Tt][Ii][Oo][Nn][Pp][Aa][Tt][Hh]\\ .*/ AND powershell.file.script_block_text:/.*$[Ee][Nn][Vv]\\:[Tt][Ee][Mm][Pp]\\\\.*/)","rule_id":"b7a3c9a3-09ea-4934-8864-6a32cacd98d9","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1074.001/T1074.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Compress\\-Archive\\ * AND powershell.file.script_block_text:*\\ \\-Path\\ * AND powershell.file.script_block_text:*\\ \\-DestinationPath\\ * AND powershell.file.script_block_text:*$env\\:TEMP\\\\*)`"}
