{"id":"ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71","created_by":"Florian Roth (rule), Jonhnathan Ribeiro","name":"Suspicious PowerShell Invocations - Specific","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell invocation command parameters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((powershell.file.script_block_text:/.*\\-[Nn][Oo][Pp].*/ AND powershell.file.script_block_text:/.*\\ \\-[Ww]\\ .*/ AND powershell.file.script_block_text:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND powershell.file.script_block_text:/.*\\ \\-[Cc]\\ .*/ AND powershell.file.script_block_text:/.*\\[[Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\]\\:\\:[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/) OR (powershell.file.script_block_text:/.*\\ \\-[Ww]\\ .*/ AND powershell.file.script_block_text:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND powershell.file.script_block_text:/.*\\-[Nn][Oo][Nn][Ii].*/ AND powershell.file.script_block_text:/.*\\-[Nn][Oo][Pp].*/ AND powershell.file.script_block_text:/.*\\ \\-[Cc]\\ .*/ AND powershell.file.script_block_text:/.*[Ii][Ee][Xx].*/ AND powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/) OR (powershell.file.script_block_text:/.*\\ \\-[Ww]\\ .*/ AND powershell.file.script_block_text:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND powershell.file.script_block_text:/.*\\-[Ee][Pp].*/ AND powershell.file.script_block_text:/.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ AND powershell.file.script_block_text:/.*\\-[Ee][Nn][Cc].*/) OR (powershell.file.script_block_text:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND powershell.file.script_block_text:/.*[Rr][Ee][Gg].*/ AND powershell.file.script_block_text:/.*[Aa][Dd][Dd].*/ AND powershell.file.script_block_text:/.*[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/) OR (powershell.file.script_block_text:/.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ AND powershell.file.script_block_text:/.*\\-[Nn][Oo][Pp][Rr][Oo][Ff][Ii][Ll][Ee].*/ AND powershell.file.script_block_text:/.*\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee].*/ AND powershell.file.script_block_text:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND powershell.file.script_block_text:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd].*/) OR (powershell.file.script_block_text:/.*[Ii][Ee][Xx].*/ AND powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND powershell.file.script_block_text:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd].*/)) AND (NOT ((powershell.file.script_block_text:(/.*\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\('[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\.[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\.[Oo][Rr][Gg]\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Pp][Ss]1.*/ OR /.*\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\('[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\.[Oo][Rr][Gg]\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Pp][Ss]1'\\).*/ OR /.*[Ww][Rr][Ii][Tt][Ee]\\-[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy][Ww][Aa][Rr][Nn][Ii][Nn][Gg].*/)))))","rule_id":"ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((powershell.file.script_block_text:*\\-nop* AND powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\ \\-c\\ * AND powershell.file.script_block_text:*\\[Convert\\]\\:\\:FromBase64String*) OR (powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\-noni* AND powershell.file.script_block_text:*\\-nop* AND powershell.file.script_block_text:*\\ \\-c\\ * AND powershell.file.script_block_text:*iex* AND powershell.file.script_block_text:*New\\-Object*) OR (powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\-ep* AND powershell.file.script_block_text:*bypass* AND powershell.file.script_block_text:*\\-Enc*) OR (powershell.file.script_block_text:*powershell* AND powershell.file.script_block_text:*reg* AND powershell.file.script_block_text:*add* AND powershell.file.script_block_text:*HKCU\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run*) OR (powershell.file.script_block_text:*bypass* AND powershell.file.script_block_text:*\\-noprofile* AND powershell.file.script_block_text:*\\-windowstyle* AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*new\\-object* AND powershell.file.script_block_text:*system.net.webclient* AND powershell.file.script_block_text:*.download*) OR (powershell.file.script_block_text:*iex* AND powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*Net.WebClient* AND powershell.file.script_block_text:*.Download*)) AND (NOT ((powershell.file.script_block_text:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1* OR *\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/chocolatey.org\\/install.ps1'\\)* OR *Write\\-ChocolateyWarning*)))))`"}
