{"id":"48a45d45-8112-416b-8a67-46e03a4b2107","created_by":"frack113","name":"Remove Account From Domain Admin Group","tags":["attack.impact","attack.t1531"],"interval":"5m","description":"Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users.\nAccounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Aa][Dd][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/ AND powershell.file.script_block_text:/.*\\-[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Mm][Ee][Mm][Bb][Ee][Rr][Ss]\\ .*/)","rule_id":"48a45d45-8112-416b-8a67-46e03a4b2107","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1531/T1531.md#atomic-test-3---remove-account-from-domain-admin-group"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Remove\\-ADGroupMember* AND powershell.file.script_block_text:*\\-Identity\\ * AND powershell.file.script_block_text:*\\-Members\\ *)`"}
