{"id":"89819aa4-bbd6-46bc-88ec-c7f7fe30efa6","created_by":"Sean Metcalf (source), Florian Roth (rule), Bartlomiej Czyz @bczyz1 (update), oscd.community (update), Nasreddine Bencherchali (update), Tim Shelton (fp)","name":"Malicious PowerShell Commandlets","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Commandlet names from well-known PowerShell exploitation frameworks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Ll][Ll][Ii][Nn][Jj][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Ee][Ll][Ll][Cc][Oo][Dd][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Mm][Ii][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Gg][Pp][Pp][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Kk][Ee][Yy][Ss][Tt][Rr][Oo][Kk][Ee][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Tt][Ii][Mm][Ee][Dd][Ss][Cc][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Vv][Aa][Uu][Ll][Tt][Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ii][Nn][Jj][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Nn][Ii][Nn][Jj][Aa][Cc][Oo][Pp][Yy].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Oo][Kk][Ee][Nn][Mm][Aa][Nn][Ii][Pp][Uu][Ll][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Oo][Uu][Tt]\\-[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp].*/ OR /.*[Vv][Oo][Ll][Uu][Mm][Ee][Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy][Tt][Oo][Oo][Ll][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Vv][Ee][Pp][Ee][Ii][Nn][Jj][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Uu][Ss][Ee][Rr][Hh][Uu][Nn][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Gg][Pp][Oo][Ll][Oo][Cc][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Cc][Ll][Ss][Cc][Aa][Nn][Nn][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Oo][Ww][Nn][Gg][Rr][Aa][Dd][Ee][Aa][Cc][Cc][Oo][Uu][Nn][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Uu][Nn][Qq][Uu][Oo][Tt][Ee][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ff][Ii][Ll][Ee][Pp][Ee][Rr][Mm][Ii][Ss][Ss][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Ee][Rr][Mm][Ii][Ss][Ss][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Aa][Bb][Uu][Ss][Ee].*/ OR /.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Bb][Ii][Nn][Aa][Rr][Yy].*/ OR /.*[Gg][Ee][Tt]\\-[Rr][Ee][Gg][Aa][Uu][Tt][Oo][Ll][Oo][Gg][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Vv][Uu][Ll][Nn][Aa][Uu][Tt][Oo][Rr][Uu][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Vv][Uu][Ll][Nn][Ss][Cc][Hh][Tt][Aa][Ss][Kk].*/ OR /.*[Gg][Ee][Tt]\\-[Uu][Nn][Aa][Tt][Tt][Ee][Nn][Dd][Ee][Dd][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ff][Ii][Ll][Ee].*/ OR /.*[Gg][Ee][Tt]\\-[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Hh][Oo][Ss][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Rr][Ee][Gg][Aa][Ll][Ww][Aa][Yy][Ss][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Ll][Ee][Vv][Aa][Tt][Ee][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Uu][Nn][Cc][Oo][Nn][Ss][Tt][Rr][Aa][Ii][Nn][Ee][Dd].*/ OR /.*[Aa][Dd][Dd]\\-[Rr][Ee][Gg][Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Aa][Dd][Dd]\\-[Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee][Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Gg][Uu][Pp][Tt]\\-[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Dd][Ss][Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Ee][Nn][Aa][Bb][Ll][Ee][Dd]\\-[Dd][Uu][Pp][Ll][Ii][Cc][Aa][Tt][Ee][Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ss][Uu][Aa][Cc][Mm][Ee].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Uu][Pp][Dd][Aa][Tt][Ee].*/ OR /.*[Cc][Hh][Ee][Cc][Kk]\\-[Vv][Mm].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Ss][Aa][Ss][Ee][Cc][Rr][Ee][Tt].*/ OR /.*[Gg][Ee][Tt]\\-[Pp][Aa][Ss][Ss][Hh][Aa][Ss][Hh][Ee][Ss].*/ OR /.*[Ss][Hh][Oo][Ww]\\-[Tt][Aa][Rr][Gg][Ee][Tt][Ss][Cc][Rr][Ee][Ee][Nn].*/ OR /.*[Pp][Oo][Rr][Tt]\\-[Ss][Cc][Aa][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ss][Hh][Rr][Aa][Tt][Hh][Tt][Tt][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll][Tt][Cc][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll][Ww][Mm][Ii].*/ OR /.*[Aa][Dd][Dd]\\-[Ee][Xx][Ff][Ii][Ll][Tt][Rr][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Aa][Dd][Dd]\\-[Pp][Ee][Rr][Ss][Ii][Ss][Tt][Ee][Nn][Cc][Ee].*/ OR /.*[Dd][Oo]\\-[Ee][Xx][Ff][Ii][Ll][Tt][Rr][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ss][Tt][Aa][Rr][Tt]\\-[Cc][Aa][Pp][Tt][Uu][Rr][Ee][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Cc][Hh][Rr][Oo][Mm][Ee][Dd][Uu][Mm][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd][Cc][Oo][Nn][Tt][Ee][Nn][Tt][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Ff][Oo][Xx][Dd][Uu][Mm][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Ii][Nn][Dd][Ee][Xx][Ee][Dd][Ii][Tt][Ee][Mm].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ii][Nn][Vv][Ee][Ii][Gg][Hh].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Nn][Ee][Tt][Rr][Ii][Pp][Pp][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Gg][Rr][Ee][Ss][Ss][Cc][Hh][Ee][Cc][Kk].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ss][Tt][Ee][Xx][Ff][Ii][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ss][Ii][Nn][Jj][Ee][Cc][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Rr][Uu][Nn][Aa][Ss].*/ OR /.*[Mm][Aa][Ii][Ll][Rr][Aa][Ii][Dd][Ee][Rr].*/ OR /.*[Nn][Ee][Ww]\\-[Hh][Oo][Nn][Ee][Yy][Hh][Aa][Ss][Hh].*/ OR /.*[Ss][Ee][Tt]\\-[Mm][Aa][Cc][Aa][Tt][Tt][Rr][Ii][Bb][Uu][Tt][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Cc][Ss][Yy][Nn][Cc].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Dd][Uu][Mm][Pp].*/ OR /.*[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\-[Jj][Bb][Oo][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Hh][Uu][Nn][Dd][Ee][Rr][Ss][Tt][Rr][Uu][Cc][Kk].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Vv][Oo][Ii][Cc][Ee][Tt][Rr][Oo][Ll][Ll].*/ OR /.*[Ss][Ee][Tt]\\-[Ww][Aa][Ll][Ll][Pp][Aa][Pp][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ii][Nn][Vv][Ee][Ii][Gg][Hh][Rr][Ee][Ll][Aa][Yy].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Ss][Hh][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss].*/ OR /.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\-[Ss][Ss][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr][Ll][Nn][Kk].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Bb][Rr][Ee][Aa][Cc][Hh].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Ii][Tt][Ee][Ll][Ii][Ss][Tt][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Yy][Pp][Aa][Ss][Ss][Uu][Aa][Cc].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Aa][Tt][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ss][Cc][Rr][Ii][Pp][Tt][Bb][Yy][Pp][Aa][Ss][Ss][Uu][Aa][Cc].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Uu][Pp].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Vv][Ii][Ee][Ww].*/ OR /.*[Gg][Ee][Tt]\\-[Rr][Ii][Cc][Kk][Aa][Ss][Tt][Ll][Ee][Yy].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Ff][Rr][Uu][Ii][Tt].*/ OR /.*[Hh][Tt][Tt][Pp]\\-[Ll][Oo][Gg][Ii][Nn].*/ OR /.*[Ff][Ii][Nn][Dd]\\-[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Aa][Rr][Aa][Nn][Oo][Ii][Aa].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ii][Nn][Ee][Nn][Uu][Mm].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Rr][Pp][Ss][Cc][Aa][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Rr][Tt][Ss][Cc][Aa][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Rr][Ee][Vv][Ee][Rr][Ss][Ee][Dd][Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Mm][Bb][Ss][Cc][Aa][Nn][Nn][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Ii][Mm][Ii][Kk][Ii][Tt][Tt][Ee][Nn][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Ll][Ll][Cc][Hh][Ee][Cc][Kk][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Aa][Dd][Pp][Oo][Tt][Aa][Tt][Oo].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Ee][Tt][Tt][Ee][Rr][Ss][Aa][Ff][Ee][Tt][Yy][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Aa][Rr][Bb][Uu][Nn][Cc][Ll][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Ee][Rr][Tt][Ii][Ff][Yy].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Aa][Ff][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Ii][Nn][Vv][Oo][Kk][Ee][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Yy][Ee][Ww][Ii][Tt][Nn][Ee][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ff][Aa][Kk][Ee][Ll][Oo][Gg][Oo][Nn][Ss][Cc][Rr][Ee][Ee][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ff][Aa][Rr][Mm][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Gg][Ee][Tt]\\-[Rr][Bb][Cc][Dd]\\-[Tt][Hh][Rr][Ee][Aa][Dd][Ee][Dd].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Gg][Oo][Pp][Hh][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Gg][Rr][Oo][Uu][Pp][Ee][Rr]2.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Hh][Aa][Nn][Dd][Ll][Ee][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Mm][Oo][Nn][Oo][Ll][Oo][Gg][Uu][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Kk][Rr][Bb][Rr][Ee][Ll][Aa][Yy][Uu][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ll][Dd][Aa][Pp][Ss][Ii][Gg][Nn][Cc][Hh][Ee][Cc][Kk].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ll][Oo][Cc][Kk][Ll][Ee][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Ii][Tt][Mm]6.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Nn][Aa][Nn][Oo][Dd][Uu][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Oo][Xx][Ii][Dd][Rr][Ee][Ss][Oo][Ll][Vv][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp]0[Ww][Nn][Ee][Dd][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Pp][Ll][Dd][Uu][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Rr][Uu][Bb][Ee][Uu][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Cc][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Aa][Ff][Ee][Tt][Yy][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Aa][Uu][Rr][Oo][Nn][Ee][Yy][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Ee][Aa][Tt][Bb][Ee][Ll][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ee][Rr][Ss][Ii][Ss][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Aa][Cc][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Bb][Ll][Oo][Cc][Kk].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Bb][Yy][Pp][Aa][Ss][Ss][Uu][Aa][Cc].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Cc][Hh][Rr][Oo][Mm][Ii][Uu][Mm].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Cc][Ll][Oo][Uu][Dd].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Dd][Pp][Aa][Pp][Ii].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Dd][Uu][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Gg][Pp][Oo]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Aa][Cc][Cc][Ee][Ss][Ss][Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Gg][Pp][Oo][Aa][Bb][Uu][Ss][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Hh][Aa][Nn][Dd][Ll][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Hh][Ii][Dd][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd]4.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ii][Oo][Nn][Nn][Oo][Ss][Pp][Aa][Cc][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Kk][Aa][Tt][Zz].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ll][Dd][Aa][Pp][Rr][Ee][Ll][Aa][Yy][Ss][Cc][Aa][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ll][Oo][Gg][Ii][Nn][Pp][Rr][Oo][Mm][Pp][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Mm][Oo][Vv][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Pp][Rr][Ii][Nn][Tt][Nn][Ii][Gg][Hh][Tt][Mm][Aa][Rr][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Pp][Rr][Ii][Nn][Tt][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Rr][Dd][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Ss][Dd][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Ee][Cc][Dd][Uu][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Nn][Ii][Pp][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Pp][Ll][Oo][Ii][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Pp][Rr][Aa][Yy].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Tt][Aa][Yy].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Uu][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ww][Aa][Tt][Ss][Oo][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd]2.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd]3.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ll][Oo][Cc][Kk][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ss][Hh][Aa][Rr][Ee][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Vv][Ii][Ee][Ww].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Pp][Ww][Ee][Bb].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Nn][Aa][Ff][Ff][Ll][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Pp][Oo][Oo][Ll][Ss][Aa][Mm][Pp][Ll][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Tt][Aa][Nn][Dd][Ii][Nn].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Tt][Ii][Cc][Kk][Yy][Nn][Oo][Tt][Ee][Ss][Ee][Xx][Tt][Rr][Aa][Cc][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Hh][Uu][Nn][Dd][Ee][Rr][Ff][Oo][Xx].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Oo][Kk][Ee][Nn][Vv][Aa][Tt][Oo][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Uu][Rr][Bb][Aa][Nn][Bb][Ii][Ss][Hh][Oo][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Hh][Ii][Ss][Kk][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ii][Rr][Ee][Tt][Aa][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ii][Nn][Pp][Ee][Aa][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Zz][Ee][Rr][Oo][Ll][Oo][Gg][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Uu][Ss][Bb][Kk][Ee][Yy][Ss][Tt][Rr][Oo][Kk][Ee][Ss].*/ OR /.*[Ss][Tt][Aa][Rr][Tt]\\-[Ww][Ee][Bb][Cc][Aa][Mm][Rr][Ee][Cc][Oo][Rr][Dd][Ee][Rr].*/) AND (NOT ((powershell.file.script_block_text:(/.*[Gg][Ee][Tt]\\-[Ss][Yy][Ss][Tt][Ee][Mm][Dd][Rr][Ii][Vv][Ee][Ii][Nn][Ff][Oo].*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ee][Cc]2\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ll][Aa][Uu][Nn][Cc][Hh]\\\\[Mm][Oo][Dd][Uu][Ll][Ee]\\\\.*/)) OR (powershell.file.script_block_text:/#\\ [Cc][Oo][Pp][Yy][Rr][Ii][Gg][Hh][Tt]\\ 2016\\ [Aa][Mm][Aa][Zz][Oo][Nn]\\.[Cc][Oo][Mm],\\ [Ii][Nn][Cc]\\.\\ [Oo][Rr]\\ [Ii][Tt][Ss]\\ [Aa][Ff][Ff][Ii][Ll][Ii][Aa][Tt][Ee][Ss]\\.\\ [Aa][Ll][Ll]\\ [Rr][Ii][Gg][Hh][Tt][Ss]\\ [Rr][Ee][Ss][Ee][Rr][Vv][Ee][Dd].*/))))","rule_id":"89819aa4-bbd6-46bc-88ec-c7f7fe30efa6","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2921","https://github.com/S3cur3Th1sSh1t/PowerSharpPack/tree/master/PowerSharpBinaries","https://github.com/BC-SECURITY/Invoke-ZeroLogon/blob/111d17c7fec486d9bb23387e2e828b09a26075e4/Invoke-ZeroLogon.ps1","https://github.com/xorrior/RandomPS-Scripts/blob/848c919bfce4e2d67b626cbcf4404341cfe3d3b6/Get-DXWebcamVideo.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*Invoke\\-DllInjection* OR *Invoke\\-Shellcode* OR *Invoke\\-WmiCommand* OR *Get\\-GPPPassword* OR *Get\\-Keystrokes* OR *Get\\-TimedScreenshot* OR *Get\\-VaultCredential* OR *Invoke\\-CredentialInjection* OR *Invoke\\-Mimikatz* OR *Invoke\\-NinjaCopy* OR *Invoke\\-TokenManipulation* OR *Out\\-Minidump* OR *VolumeShadowCopyTools* OR *Invoke\\-ReflectivePEInjection* OR *Invoke\\-UserHunter* OR *Find\\-GPOLocation* OR *Invoke\\-ACLScanner* OR *Invoke\\-DowngradeAccount* OR *Get\\-ServiceUnquoted* OR *Get\\-ServiceFilePermission* OR *Get\\-ServicePermission* OR *Invoke\\-ServiceAbuse* OR *Install\\-ServiceBinary* OR *Get\\-RegAutoLogon* OR *Get\\-VulnAutoRun* OR *Get\\-VulnSchTask* OR *Get\\-UnattendedInstallFile* OR *Get\\-ApplicationHost* OR *Get\\-RegAlwaysInstallElevated* OR *Get\\-Unconstrained* OR *Add\\-RegBackdoor* OR *Add\\-ScrnSaveBackdoor* OR *Gupt\\-Backdoor* OR *Invoke\\-ADSBackdoor* OR *Enabled\\-DuplicateToken* OR *Invoke\\-PsUaCme* OR *Remove\\-Update* OR *Check\\-VM* OR *Get\\-LSASecret* OR *Get\\-PassHashes* OR *Show\\-TargetScreen* OR *Port\\-Scan* OR *Invoke\\-PoshRatHttp* OR *Invoke\\-PowerShellTCP* OR *Invoke\\-PowerShellWMI* OR *Add\\-Exfiltration* OR *Add\\-Persistence* OR *Do\\-Exfiltration* OR *Start\\-CaptureServer* OR *Get\\-ChromeDump* OR *Get\\-ClipboardContents* OR *Get\\-FoxDump* OR *Get\\-IndexedItem* OR *Get\\-Screenshot* OR *Invoke\\-Inveigh* OR *Invoke\\-NetRipper* OR *Invoke\\-EgressCheck* OR *Invoke\\-PostExfil* OR *Invoke\\-PSInject* OR *Invoke\\-RunAs* OR *MailRaider* OR *New\\-HoneyHash* OR *Set\\-MacAttribute* OR *Invoke\\-DCSync* OR *Invoke\\-PowerDump* OR *Exploit\\-Jboss* OR *Invoke\\-ThunderStruck* OR *Invoke\\-VoiceTroll* OR *Set\\-Wallpaper* OR *Invoke\\-InveighRelay* OR *Invoke\\-PsExec* OR *Invoke\\-SSHCommand* OR *Get\\-SecurityPackages* OR *Install\\-SSP* OR *Invoke\\-BackdoorLNK* OR *PowerBreach* OR *Get\\-SiteListPassword* OR *Get\\-System* OR *Invoke\\-BypassUAC* OR *Invoke\\-Tater* OR *Invoke\\-WScriptBypassUAC* OR *PowerUp* OR *PowerView* OR *Get\\-RickAstley* OR *Find\\-Fruit* OR *HTTP\\-Login* OR *Find\\-TrustedDocuments* OR *Invoke\\-Paranoia* OR *Invoke\\-WinEnum* OR *Invoke\\-ARPScan* OR *Invoke\\-PortScan* OR *Invoke\\-ReverseDNSLookup* OR *Invoke\\-SMBScanner* OR *Invoke\\-Mimikittenz* OR *Invoke\\-AllChecks* OR *Invoke\\-BadPotato* OR *Invoke\\-BetterSafetyKatz* OR *Invoke\\-Carbuncle* OR *Invoke\\-Certify* OR *Invoke\\-DAFT* OR *Invoke\\-DinvokeKatz* OR *Invoke\\-Eyewitness* OR *Invoke\\-FakeLogonScreen* OR *Invoke\\-Farmer* OR *Invoke\\-Get\\-RBCD\\-Threaded* OR *Invoke\\-Gopher* OR *Invoke\\-Grouper2* OR *Invoke\\-HandleKatz* OR *Invoke\\-Internalmonologue* OR *Invoke\\-KrbRelayUp* OR *Invoke\\-LdapSignCheck* OR *Invoke\\-Lockless* OR *Invoke\\-MITM6* OR *Invoke\\-NanoDump* OR *Invoke\\-OxidResolver* OR *Invoke\\-P0wnedshell* OR *Invoke\\-PPLDump* OR *Invoke\\-Rubeus* OR *Invoke\\-SCShell* OR *Invoke\\-SafetyKatz* OR *Invoke\\-SauronEye* OR *Invoke\\-Seatbelt* OR *Invoke\\-SharPersist* OR *Invoke\\-SharpAllowedToAct* OR *Invoke\\-SharpBlock* OR *Invoke\\-SharpBypassUAC* OR *Invoke\\-SharpChromium* OR *Invoke\\-SharpClipboard* OR *Invoke\\-SharpCloud* OR *Invoke\\-SharpDPAPI* OR *Invoke\\-SharpDump* OR *Invoke\\-SharpGPO\\-RemoteAccessPolicies* OR *Invoke\\-SharpGPOAbuse* OR *Invoke\\-SharpHandler* OR *Invoke\\-SharpHide* OR *Invoke\\-SharpHound4* OR *Invoke\\-SharpImpersonation* OR *Invoke\\-SharpImpersonationNoSpace* OR *Invoke\\-SharpKatz* OR *Invoke\\-SharpLdapRelayScan* OR *Invoke\\-SharpLoginPrompt* OR *Invoke\\-SharpMove* OR *Invoke\\-SharpPrintNightmare* OR *Invoke\\-SharpPrinter* OR *Invoke\\-SharpRDP* OR *Invoke\\-SharpSSDP* OR *Invoke\\-SharpSecDump* OR *Invoke\\-SharpSniper* OR *Invoke\\-SharpSploit* OR *Invoke\\-SharpSpray* OR *Invoke\\-SharpStay* OR *Invoke\\-SharpUp* OR *Invoke\\-SharpWatson* OR *Invoke\\-Sharphound2* OR *Invoke\\-Sharphound3* OR *Invoke\\-Sharplocker* OR *Invoke\\-Sharpshares* OR *Invoke\\-Sharpview* OR *Invoke\\-Sharpweb* OR *Invoke\\-Snaffler* OR *Invoke\\-Spoolsample* OR *Invoke\\-StandIn* OR *Invoke\\-StickyNotesExtract* OR *Invoke\\-Thunderfox* OR *Invoke\\-Tokenvator* OR *Invoke\\-UrbanBishop* OR *Invoke\\-Whisker* OR *Invoke\\-WireTap* OR *Invoke\\-winPEAS* OR *Invoke\\-Zerologon* OR *Get\\-USBKeystrokes* OR *Start\\-WebcamRecorder*) AND (NOT ((powershell.file.script_block_text:(*Get\\-SystemDriveInfo* OR *C\\:\\\\ProgramData\\\\Amazon\\\\EC2\\-Windows\\\\Launch\\\\Module\\\\*)) OR (powershell.file.script_block_text:#\\ Copyright\\ 2016\\ Amazon.com,\\ Inc.\\ or\\ its\\ affiliates.\\ All\\ Rights\\ Reserved*))))`"}
