{"id":"61d0475c-173f-4844-86f7-f3eebae1c66b","created_by":"frack113","name":"Change PowerShell Policies to an Insecure Level","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects use of Set-ExecutionPolicy to set insecure policies","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Ss][Ee][Tt]\\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy].*/ AND powershell.file.script_block_text:(/.*[Uu][Nn][Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ee][Dd].*/ OR /.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee][Ss][Ii][Gg][Nn][Ee][Dd].*/)) AND (NOT (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\\\[Cc][Hh][Oo][Cc][Oo]\\.[Ee][Xx][Ee]/ OR powershell.file.script_block_text:(/.*\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\('[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\.[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\.[Oo][Rr][Gg]\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Pp][Ss]1'\\).*/ OR /.*\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\('[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Cc][Hh][Oo][Cc][Oo][Ll][Aa][Tt][Ee][Yy]\\.[Oo][Rr][Gg]\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Pp][Ss]1'\\).*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Cc][Oo][Dd][Ee]\\\\.*/))))","rule_id":"61d0475c-173f-4844-86f7-f3eebae1c66b","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.1","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1","https://adsecurity.org/?p=2604"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*Set\\-ExecutionPolicy* AND powershell.file.script_block_text:(*Unrestricted* OR *bypass* OR *RemoteSigned*)) AND (NOT (process.parent.executable:C\\:\\\\ProgramData\\\\chocolatey\\\\choco.exe OR powershell.file.script_block_text:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1'\\)* OR *\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/chocolatey.org\\/install.ps1'\\)* OR *\\\\AppData\\\\Roaming\\\\Code\\\\*))))`"}
