{"id":"f99276ad-d122-4989-a09a-d00904a5f9d2","created_by":"Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Clear PowerShell History","tags":["attack.defense_evasion","attack.t1070.003"],"interval":"5m","description":"Detects keywords that could indicate clearing PowerShell history","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((winlog.event_data.Payload:/.*[Ss][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn].*/ AND winlog.event_data.Payload:/.*–[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Ss][Tt][Yy][Ll][Ee].*/ AND winlog.event_data.Payload:/.*[Ss][Aa][Vv][Ee][Nn][Oo][Tt][Hh][Ii][Nn][Gg].*/) OR (winlog.event_data.Payload:/.*[Ss][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn].*/ AND winlog.event_data.Payload:/.*\\-[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Ss][Tt][Yy][Ll][Ee].*/ AND winlog.event_data.Payload:/.*[Ss][Aa][Vv][Ee][Nn][Oo][Tt][Hh][Ii][Nn][Gg].*/)) OR (winlog.event_data.Payload:(/.*[Dd][Ee][Ll].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ii][Tt][Ee][Mm].*/ OR /.*[Rr][Mm].*/) AND winlog.event_data.Payload:/.*\\([Gg][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn]\\)\\.[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Pp][Aa][Tt][Hh].*/))","rule_id":"f99276ad-d122-4989-a09a-d00904a5f9d2","timestamp_override":"event.ingested","references":["https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((winlog.event_data.Payload:*Set\\-PSReadlineOption* AND winlog.event_data.Payload:*–HistorySaveStyle* AND winlog.event_data.Payload:*SaveNothing*) OR (winlog.event_data.Payload:*Set\\-PSReadlineOption* AND winlog.event_data.Payload:*\\-HistorySaveStyle* AND winlog.event_data.Payload:*SaveNothing*)) OR (winlog.event_data.Payload:(*del* OR *Remove\\-Item* OR *rm*) AND winlog.event_data.Payload:*\\(Get\\-PSReadlineOption\\).HistorySavePath*))`"}
