{"id":"1883444f-084b-419b-ac62-e0d0c5b3693f","created_by":"frack113","name":"Suspicious Connection to Remote Account","tags":["attack.credential_access","attack.t1110.001"],"interval":"5m","description":"Adversaries with no prior knowledge of legitimate credentials within the system or environment may guess passwords to attempt access to accounts.\nWithout knowledge of the password for an account, an adversary may opt to systematically guess the password using a repetitive or iterative mechanism\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\.[Ll][Dd][Aa][Pp][Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\.[Ll][Dd][Aa][Pp][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/)","rule_id":"1883444f-084b-419b-ac62-e0d0c5b3693f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.001/T1110.001.md#atomic-test-2---brute-force-credentials-of-single-active-directory-domain-user-via-ldap-against-domain-controller-ntlm-or-kerberos"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*System.DirectoryServices.Protocols.LdapDirectoryIdentifier* OR *System.Net.NetworkCredential* OR *System.DirectoryServices.Protocols.LdapConnection*)`"}
