{"id":"8bc063d5-3a3a-4f01-a140-bc15e55e8437","created_by":"frack113","name":"Suspicious GetTypeFromCLSID ShellExecute","tags":["attack.privilege_escalation","attack.persistence","attack.t1546.015"],"interval":"5m","description":"Detects suspicious Powershell code that execute COM Objects","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*\\:\\:[Gg][Ee][Tt][Tt][Yy][Pp][Ee][Ff][Rr][Oo][Mm][Cc][Ll][Ss][Ii][Dd]\\(.*/ AND powershell.file.script_block_text:/.*\\.[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\(.*/)","rule_id":"8bc063d5-3a3a-4f01-a140-bc15e55e8437","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.015/T1546.015.md#atomic-test-2---powershell-execute-com-object"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*\\:\\:GetTypeFromCLSID\\(* AND powershell.file.script_block_text:*.ShellExecute\\(*)`"}
