{"id":"603c6630-5225-49c1-8047-26c964553e0e","created_by":"frack113","name":"Enumerate Credentials from Windows Credential Manager With PowerShell","tags":["attack.credential_access","attack.t1555"],"interval":"5m","description":"Adversaries may search for common password storage locations to obtain user credentials.\nPasswords are stored in several places on a system, depending on the operating system or application holding the credentials.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Vv][Aa][Uu][Ll][Tt][Cc][Mm][Dd].*/ AND powershell.file.script_block_text:/.*\\/[Ll][Ii][Ss][Tt][Cc][Rr][Ee][Dd][Ss]\\:.*/ AND powershell.file.script_block_text:(/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ss].*/ OR /.*[Ww][Ee][Bb]\\ [Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ss].*/))","rule_id":"603c6630-5225-49c1-8047-26c964553e0e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*vaultcmd* AND powershell.file.script_block_text:*\\/listcreds\\:* AND powershell.file.script_block_text:(*Windows\\ Credentials* OR *Web\\ Credentials*))`"}
