{"id":"29e1c216-6408-489d-8a06-ee9d151ef819","created_by":"frack113","name":"Suspicious Mount-DiskImage","tags":["attack.defense_evasion","attack.t1553.005"],"interval":"5m","description":"Adversaries may abuse container files such as disk image (.iso, .vhd) file formats to deliver malicious payloads that may not be tagged with MOTW.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Mm][Oo][Uu][Nn][Tt]\\-[Dd][Ii][Ss][Kk][Ii][Mm][Aa][Gg][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]\\ .*/)","rule_id":"29e1c216-6408-489d-8a06-ee9d151ef819","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image","https://docs.microsoft.com/en-us/powershell/module/storage/mount-diskimage?view=windowsserver2022-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Mount\\-DiskImage\\ * AND powershell.file.script_block_text:*\\-ImagePath\\ *)`"}
