{"id":"eb2fd349-ec67-4caa-9143-d79c7fb34441","created_by":"frack113","name":"Suspicious GPO Discovery With Get-GPO","tags":["attack.discovery","attack.t1615"],"interval":"5m","description":"Detect use of Get-GPO to get one GPO or all the GPOs in a domain.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Gg][Pp][Oo].*/","rule_id":"eb2fd349-ec67-4caa-9143-d79c7fb34441","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1615/T1615.md","https://docs.microsoft.com/en-us/powershell/module/grouppolicy/get-gpo?view=windowsserver2022-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Get\\-GPO*`"}
