{"id":"815bfc17-7fc6-4908-a55e-2f37b98cedb4","created_by":"frack113","name":"AD Groups Or Users Enumeration Using PowerShell - PoshModule","tags":["attack.discovery","attack.t1069.001"],"interval":"5m","description":"Adversaries may attempt to find domain-level groups and permission settings.\nThe knowledge of domain-level permission groups can help adversaries determine which groups exist and which users belong to a particular group.\nAdversaries may use this information to determine which users have elevated permissions, such as domain administrators.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr][Ss][Hh][Ii][Pp].*/ OR winlog.event_data.ContextInfo:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr][Ss][Hh][Ii][Pp].*/ OR (winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Uu][Ss][Ee][Rr].*/ AND winlog.event_data.Payload:/.*\\-[Ff]\\ .*/ AND winlog.event_data.Payload:/.*\\-[Pp][Rr]\\ .*/ AND winlog.event_data.Payload:/.*[Dd][Oo][Ee][Ss][Nn][Oo][Tt][Rr][Ee][Qq][Uu][Ii][Rr][Ee][Pp][Rr][Ee][Aa][Uu][Tt][Hh].*/) OR (winlog.event_data.ContextInfo:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Uu][Ss][Ee][Rr].*/ AND winlog.event_data.ContextInfo:/.*\\-[Ff]\\ .*/ AND winlog.event_data.ContextInfo:/.*\\-[Pp][Rr]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Dd][Oo][Ee][Ss][Nn][Oo][Tt][Rr][Ee][Qq][Uu][Ii][Rr][Ee][Pp][Rr][Ee][Aa][Uu][Tt][Hh].*/))","rule_id":"815bfc17-7fc6-4908-a55e-2f37b98cedb4","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:*get\\-ADPrincipalGroupMembership* OR winlog.event_data.ContextInfo:*get\\-ADPrincipalGroupMembership* OR (winlog.event_data.Payload:*get\\-aduser* AND winlog.event_data.Payload:*\\-f\\ * AND winlog.event_data.Payload:*\\-pr\\ * AND winlog.event_data.Payload:*DoesNotRequirePreAuth*) OR (winlog.event_data.ContextInfo:*get\\-aduser* AND winlog.event_data.ContextInfo:*\\-f\\ * AND winlog.event_data.ContextInfo:*\\-pr\\ * AND winlog.event_data.ContextInfo:*DoesNotRequirePreAuth*))`"}
