{"id":"70ad982f-67c8-40e0-a955-b920c2fa05cb","created_by":"frack113","name":"Suspicious IO.FileStream","tags":["attack.defense_evasion","attack.t1070.003"],"interval":"5m","description":"Open a handle on the drive volume via the \\\\.\\ DOS device path specifier and perform direct access read of the first few bytes of the volume.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ii][Oo]\\.[Ff][Ii][Ll][Ee][Ss][Tt][Rr][Ee][Aa][Mm].*/ AND powershell.file.script_block_text:/.*\\\\\\\\\\.\\\\\\*/)","rule_id":"70ad982f-67c8-40e0-a955-b920c2fa05cb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1006/T1006.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*IO.FileStream* AND powershell.file.script_block_text:*\\\\\\\\.\\\\\\*)`"}
