{"id":"35f41cd7-c98e-469f-8a02-ec4ba0cc7a7e","created_by":"Nasreddine Bencherchali","name":"PowerShell Write-EventLog Usage","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects usage of the \"Write-EventLog\" cmdlet with 'RawData' flag. The cmdlet can be levreage to write malicious payloads to the EventLog and then retrieve them later for later use","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate applications writing events via this cmdlet. Investigate alerts to determine if the action is benign"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ww][Rr][Ii][Tt][Ee]\\-[Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg].*/ AND powershell.file.script_block_text:/.*\\-[Rr][Aa][Ww][Dd][Aa][Tt][Aa]\\ .*/)","rule_id":"35f41cd7-c98e-469f-8a02-ec4ba0cc7a7e","timestamp_override":"event.ingested","references":["https://www.blackhillsinfosec.com/windows-event-logs-for-red-teams/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Write\\-EventLog* AND powershell.file.script_block_text:*\\-RawData\\ *)`"}
