{"id":"a861d835-af37-4930-bcd6-5b178bfb54df","created_by":"frack113","name":"Request A Single Ticket via PowerShell","tags":["attack.credential_access","attack.t1558.003"],"interval":"5m","description":"utilize native PowerShell Identity modules to query the domain to extract the Service Principal Names for a single computer.\nThis behavior is typically used during a kerberos or silver ticket attack.\nA successful execution will output the SPNs for the endpoint in question.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy][Mm][Oo][Dd][Ee][Ll]\\.[Tt][Oo][Kk][Ee][Nn][Ss]\\.[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Ss][Rr][Ee][Qq][Uu][Ee][Ss][Tt][Oo][Rr][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Tt][Oo][Kk][Ee][Nn].*/","rule_id":"a861d835-af37-4930-bcd6-5b178bfb54df","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1558.003/T1558.003.md#atomic-test-4---request-a-single-ticket-via-powershell"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*System.IdentityModel.Tokens.KerberosRequestorSecurityToken*`"}
