{"id":"313fbb0a-a341-4682-848d-6d6f8c4fab7c","created_by":"frack113","name":"Suspicious PowerShell WindowStyle Option","tags":["attack.defense_evasion","attack.t1564.003"],"interval":"5m","description":"Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND powershell.file.script_block_text:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee].*/ AND powershell.file.script_block_text:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/)","rule_id":"313fbb0a-a341-4682-848d-6d6f8c4fab7c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.003/T1564.003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*powershell* AND powershell.file.script_block_text:*WindowStyle* AND powershell.file.script_block_text:*Hidden*)`"}
