{"id":"fc028194-969d-4122-8abe-0470d5b8f12f","created_by":"frack113","name":"Access to Browser Login Data","tags":["attack.credential_access","attack.t1555.003"],"interval":"5m","description":"Adversaries may acquire credentials from web browsers by reading files specific to the target browser.\nWeb browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.\nWeb browsers typically store the credentials in an encrypted format within a credential store.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Cc][Oo][Pp][Yy]\\-[Ii][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*\\-[Dd][Ee][Ss][Tt][Ii][Nn][Aa][Tt][Ii][Oo][Nn].*/ AND powershell.file.script_block_text:(/.*\\\\[Oo][Pp][Ee][Rr][Aa]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Oo][Pp][Ee][Rr][Aa]\\ [Ss][Tt][Aa][Bb][Ll][Ee]\\\\[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa].*/ OR /.*\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Pp][Rr][Oo][Ff][Ii][Ll][Ee][Ss].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt].*/ OR /.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa].*/ OR /.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa]\\ [Ff][Oo][Rr]\\ [Aa][Cc][Cc][Oo][Uu][Nn][Tt].*/))","rule_id":"fc028194-969d-4122-8abe-0470d5b8f12f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Copy\\-Item* AND powershell.file.script_block_text:*\\-Destination* AND powershell.file.script_block_text:(*\\\\Opera\\ Software\\\\Opera\\ Stable\\\\Login\\ Data* OR *\\\\Mozilla\\\\Firefox\\\\Profiles* OR *\\\\Microsoft\\\\Edge\\\\User\\ Data\\\\Default* OR *\\\\Google\\\\Chrome\\\\User\\ Data\\\\Default\\\\Login\\ Data* OR *\\\\Google\\\\Chrome\\\\User\\ Data\\\\Default\\\\Login\\ Data\\ For\\ Account*))`"}
