{"id":"f772cee9-b7c2-4cb2-8f07-49870adc02e0","created_by":"Alec Costello","name":"Malicious Nishang PowerShell Commandlets","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Commandlet names and arguments from the Nishang exploitation framework","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Aa][Dd][Dd]\\-[Cc][Oo][Nn][Ss][Tt][Rr][Aa][Ii][Nn][Ee][Dd][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ii][Oo][Nn][Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Ss][Ee][Tt]\\-[Dd][Cc][Ss][Hh][Aa][Dd][Oo][Ww][Pp][Ee][Rr][Mm][Ii][Ss][Ss][Ii][Oo][Nn][Ss].*/ OR /.*[Dd][Nn][Ss]_[Tt][Xx][Tt]_[Pp][Ww][Nn][Aa][Gg][Ee].*/ OR /.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\-[Oo][Nn][Tt][Ii][Mm][Ee].*/ OR /.*[Hh][Tt][Tt][Pp]\\-[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr].*/ OR /.*[Ss][Ee][Tt]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Pp][Ss][Rr][Ee][Mm][Oo][Tt][Ii][Nn][Gg].*/ OR /.*[Ss][Ee][Tt]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Ww][Mm][Ii].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Mm][Ss][Ii][Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*[Oo][Uu][Tt]\\-[Cc][Hh][Mm].*/ OR /.*[Oo][Uu][Tt]\\-[Hh][Tt][Aa].*/ OR /.*[Oo][Uu][Tt]\\-[Ss][Cc][Ff].*/ OR /.*[Oo][Uu][Tt]\\-[Ss][Cc][Tt].*/ OR /.*[Oo][Uu][Tt]\\-[Ss][Hh][Oo][Rr][Tt][Cc][Uu][Tt].*/ OR /.*[Oo][Uu][Tt]\\-[Ww][Ee][Bb][Qq][Uu][Ee][Rr][Yy].*/ OR /.*[Oo][Uu][Tt]\\-[Ww][Oo][Rr][Dd].*/ OR /.*[Ee][Nn][Aa][Bb][Ll][Ee]\\-[Dd][Uu][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Uu][Pp][Dd][Aa][Tt][Ee].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\-[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\-[Pp][Ss].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]_[Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\-[Mm][Ss][Ss][Qq][Ll].*/ OR /.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\-[Dd][Nn][Ss][Tt][Xx][Tt]\\-[Cc][Oo][Dd][Ee].*/ OR /.*[Oo][Uu][Tt]\\-[Rr][Uu][Nn][Dd][Ll][Ll][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*[Cc][Oo][Pp][Yy]\\-[Vv][Ss][Ss].*/ OR /.*[Ff][Ii][Rr][Ee][Bb][Uu][Ss][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Rr][Ee][Ll][Ii][Ss][Tt][Ee][Nn][Ee][Rr].*/ OR /.*[Gg][Ee][Tt]\\-[Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Gg][Ee][Tt]\\-[Pp][Aa][Ss][Ss][Hh][Ii][Nn][Tt][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Ll][Aa][Nn]\\-[Kk][Ee][Yy][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Ww][Ee][Bb]\\-[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ss][Pp][Hh][Ii][Ss][Hh].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz][Ww][Dd][Ii][Gg][Ee][Ss][Tt][Dd][Oo][Ww][Nn][Gg][Rr][Aa][Dd][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Ss][Ii][Dd][Ee][Xx][Ff][Ii][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Gg][Oo][Pp][Hh][Ee][Rr].*/ OR /.*[Kk][Ee][Yy][Ll][Oo][Gg][Gg][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ii][Nn][Tt][Ee][Rr][Cc][Ee][Pp][Tt][Oo][Rr].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee]\\-[Mm][Uu][Ll][Tt][Ii][Pp][Ll][Ee][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Rr][Ee][Ll][Aa][Yy].*/ OR /.*[Rr][Uu][Nn]\\-[Ee][Xx][Ee][Oo][Nn][Rr][Ee][Mm][Oo][Tt][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Rr][Aa][Ss][Aa][Dd][Hh][Aa][Kk].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Rr][Uu][Tt][Ee][Ff][Oo][Rr][Cc][Ee].*/ OR /.*[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]\\-[Ll][Ii][Ss][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Jj][Ss][Rr][Aa][Tt][Rr][Ee][Gg][Ss][Vv][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Jj][Ss][Rr][Aa][Tt][Rr][Uu][Nn][Dd][Ll][Ll].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ss][Hh][Rr][Aa][Tt][Hh][Tt][Tt][Pp][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll][Ii][Cc][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll][Uu][Dd][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ss][Gg][Cc][Aa][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ss][Gg][Cc][Aa][Tt][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Pp][Oo][Ss][Hh][Rr][Aa][Tt].*/ OR /.*[Aa][Dd][Dd]\\-[Pp][Ee][Rr][Ss][Ii][Ss][Tt][Ee][Nn][Cc][Ee].*/ OR /.*[Ee][Xx][Ee][Tt][Oo][Tt][Ee][Xx][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Dd][Ee][Cc][Oo][Dd][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Nn][Cc][Oo][Dd][Ee].*/ OR /.*[Pp][Aa][Rr][Ss][Ee]_[Kk][Ee][Yy][Ss].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Pp][Ee][Rr][Ss][Ii][Ss][Tt][Ee][Nn][Cc][Ee].*/ OR /.*[Ss][Tt][Rr][Ii][Nn][Gg][Tt][Oo][Bb][Aa][Ss][Ee]64.*/ OR /.*[Tt][Ee][Xx][Tt][Tt][Oo][Ee][Xx][Ee].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Pp][Rr][Ee][Tt][Ee][Rr].*/ OR /.*[Nn][Ii][Ss][Hh][Aa][Nn][Gg].*/ OR /.*[Dd][Aa][Tt][Aa][Tt][Oo][Ee][Nn][Cc][Oo][Dd][Ee].*/ OR /.*[Ll][Oo][Gg][Gg][Ee][Dd][Kk][Ee][Yy][Ss].*/ OR /.*[Oo][Uu][Tt]\\-[Dd][Nn][Ss][Tt][Xx][Tt].*/ OR /.*[Ee][Xx][Ff][Ii][Ll][Oo][Pp][Tt][Ii][Oo][Nn].*/ OR /.*[Dd][Uu][Mm][Pp][Cc][Ee][Rr][Tt][Ss].*/ OR /.*[Dd][Uu][Mm][Pp][Cc][Rr][Ee][Dd][Ss].*/ OR /.*[Ss][Hh][Ee][Ll][Ll][Cc][Oo][Dd][Ee]32.*/ OR /.*[Ss][Hh][Ee][Ll][Ll][Cc][Oo][Dd][Ee]64.*/ OR /.*[Nn][Oo][Tt][Aa][Ll][Ll][Nn][Aa][Mm][Ee][Ss][Pp][Aa][Cc][Ee][Ss].*/ OR /.*[Ee][Xx][Ff][Ii][Ll][Ll].*/ OR /.*[Ff][Aa][Kk][Ee][Dd][Cc].*/)","rule_id":"f772cee9-b7c2-4cb2-8f07-49870adc02e0","timestamp_override":"event.ingested","references":["https://github.com/samratashok/nishang"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Add\\-ConstrainedDelegationBackdoor* OR *Set\\-DCShadowPermissions* OR *DNS_TXT_Pwnage* OR *Execute\\-OnTime* OR *HTTP\\-Backdoor* OR *Set\\-RemotePSRemoting* OR *Set\\-RemoteWMI* OR *Invoke\\-AmsiBypass* OR *Out\\-CHM* OR *Out\\-HTA* OR *Out\\-SCF* OR *Out\\-SCT* OR *Out\\-Shortcut* OR *Out\\-WebQuery* OR *Out\\-Word* OR *Enable\\-Duplication* OR *Remove\\-Update* OR *Download\\-Execute\\-PS* OR *Download_Execute* OR *Execute\\-Command\\-MSSQL* OR *Execute\\-DNSTXT\\-Code* OR *Out\\-RundllCommand* OR *Copy\\-VSS* OR *FireBuster* OR *FireListener* OR *Get\\-Information* OR *Get\\-PassHints* OR *Get\\-WLAN\\-Keys* OR *Get\\-Web\\-Credentials* OR *Invoke\\-CredentialsPhish* OR *Invoke\\-MimikatzWDigestDowngrade* OR *Invoke\\-SSIDExfil* OR *Invoke\\-SessionGopher* OR *Keylogger* OR *Invoke\\-Interceptor* OR *Create\\-MultipleSessions* OR *Invoke\\-NetworkRelay* OR *Run\\-EXEonRemote* OR *Invoke\\-Prasadhak* OR *Invoke\\-BruteForce* OR *Password\\-List* OR *Invoke\\-JSRatRegsvr* OR *Invoke\\-JSRatRundll* OR *Invoke\\-PoshRatHttps* OR *Invoke\\-PowerShellIcmp* OR *Invoke\\-PowerShellUdp* OR *Invoke\\-PSGcat* OR *Invoke\\-PsGcatAgent* OR *Remove\\-PoshRat* OR *Add\\-Persistence* OR *ExetoText* OR *Invoke\\-Decode* OR *Invoke\\-Encode* OR *Parse_Keys* OR *Remove\\-Persistence* OR *StringtoBase64* OR *TexttoExe* OR *Powerpreter* OR *Nishang* OR *DataToEncode* OR *LoggedKeys* OR *OUT\\-DNSTXT* OR *ExfilOption* OR *DumpCerts* OR *DumpCreds* OR *Shellcode32* OR *Shellcode64* OR *NotAllNameSpaces* OR *exfill* OR *FakeDC*)`"}
