{"id":"63bf8794-9917-45bc-88dd-e1b5abc0ecfd","created_by":"frack113, Nasreddine Bencherchali","name":"Powershell Install a DLL in System32","tags":["attack.credential_access","attack.t1556.002"],"interval":"5m","description":"Uses PowerShell to install/copy a a file into a system directory such as \"System32\" or \"SysWOW64\"","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Cc][Oo][Pp][Yy]\\-[Ii][Tt][Ee][Mm]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Dd][Ee][Ss][Tt][Ii][Nn][Aa][Tt][Ii][Oo][Nn]\\ .*/ AND powershell.file.script_block_text:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64.*/))","rule_id":"63bf8794-9917-45bc-88dd-e1b5abc0ecfd","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1556.002/T1556.002.md#atomic-test-1---install-and-register-password-filter-dll"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Copy\\-Item\\ * AND powershell.file.script_block_text:*\\-Destination\\ * AND powershell.file.script_block_text:(*\\\\Windows\\\\System32* OR *\\\\Windows\\\\SysWOW64*))`"}
