{"id":"6331d09b-4785-4c13-980f-f96661356249","created_by":"Florian Roth (rule), Lee Holmes (idea), Harish Segar (improvements)","name":"PowerShell Downgrade Attack","tags":["attack.defense_evasion","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EngineVersion:/2\\..*/ AND (NOT (winlog.event_data.HostVersion:/2\\..*/)))","rule_id":"6331d09b-4785-4c13-980f-f96661356249","timestamp_override":"event.ingested","references":["http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EngineVersion:2.* AND (NOT (winlog.event_data.HostVersion:2.*)))`"}
