{"id":"f5d1def8-1de0-4a0e-9794-1f6f27dd605c","created_by":"Nasreddine Bencherchali","name":"PowerShell Hotfix Enumeration","tags":["attack.discovery"],"interval":"5m","description":"Detects call to \"Win32_QuickFixEngineering\" in order to enumerate installed hotfixes often used in \"enum\" scripts by attackers","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Qq][Uu][Ii][Cc][Kk][Ff][Ii][Xx][Ee][Nn][Gg][Ii][Nn][Ee][Ee][Rr][Ii][Nn][Gg].*/ AND powershell.file.script_block_text:/.*[Hh][Oo][Tt][Ff][Ii][Xx][Ii][Dd].*/)","rule_id":"f5d1def8-1de0-4a0e-9794-1f6f27dd605c","timestamp_override":"event.ingested","references":["https://github.com/411Hall/JAWS/blob/233f142fcb1488172aa74228a666f6b3c5c48f1d/jaws-enum.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Win32_QuickFixEngineering* AND powershell.file.script_block_text:*HotFixID*)`"}
