{"id":"1f49f2ab-26bc-48b3-96cc-dcffbc93eadf","created_by":"Florian Roth, Perez Diego (@darkquassar)","name":"Suspicious PowerShell Keywords","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects keywords that could indicate the use of some PowerShell exploitation framework","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Oo][Nn]\\.[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\.[Ll][Oo][Aa][Dd]\\($.*/ OR /.*\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Oo][Nn]\\.[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\]\\:\\:[Ll][Oo][Aa][Dd]\\($.*/ OR /.*\\[[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Oo][Nn]\\.[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\]\\:\\:[Ll][Oo][Aa][Dd]\\($.*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Oo][Nn]\\.[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy][Nn][Aa][Mm][Ee].*/ OR /.*[Rr][Ee][Ff][Ll][Ee][Cc][Tt][Ii][Oo][Nn]\\.[Ee][Mm][Ii][Tt]\\.[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy][Bb][Uu][Ii][Ll][Dd][Ee][Rr][Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Rr][Uu][Nn][Tt][Ii][Mm][Ee]\\.[Ii][Nn][Tt][Ee][Rr][Oo][Pp][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Dd][Ll][Ll][Ii][Mm][Pp][Oo][Rr][Tt][Aa][Tt][Tt][Rr][Ii][Bb][Uu][Tt][Ee].*/ OR /.*[Ss][Uu][Ss][Pp][Ee][Nn][Dd][Tt][Hh][Rr][Ee][Aa][Dd].*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Mm][Ii][Mm][Ee][Tt][Hh][Oo][Dd].*/ OR /.*[Hh][Tt][Tt][Pp]\\:\\/\\/127\\.0\\.0\\.1.*/)","rule_id":"1f49f2ab-26bc-48b3-96cc-dcffbc93eadf","timestamp_override":"event.ingested","references":["https://posts.specterops.io/entering-a-covenant-net-command-and-control-e11038bcf462","https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/CodeExecution/Invoke-ReflectivePEInjection.ps1","https://github.com/hlldz/Phant0m/blob/30c2935d8cf4aafda17ee2fab7cd0c4aa9a607c2/old/Invoke-Phant0m.ps1","https://gist.github.com/MHaggis/0dbe00ad401daa7137c81c99c268cfb7"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*System.Reflection.Assembly.Load\\($* OR *\\[System.Reflection.Assembly\\]\\:\\:Load\\($* OR *\\[Reflection.Assembly\\]\\:\\:Load\\($* OR *System.Reflection.AssemblyName* OR *Reflection.Emit.AssemblyBuilderAccess* OR *Runtime.InteropServices.DllImportAttribute* OR *SuspendThread* OR *rundll32* OR *Invoke\\-WMIMethod* OR *http\\:\\/\\/127.0.0.1*)`"}
