{"id":"bd33d2aa-497e-4651-9893-5c5364646595","created_by":"Nasreddine Bencherchali","name":"Suspicious TCP Tunnel Via PowerShell Script","tags":["attack.command_and_control","attack.t1090"],"interval":"5m","description":"Detects powershell scripts that creates sockets/listeners which could be indicative of tunneling activity","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Hh][Tt][Tt][Pp][Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt]\\].*/ AND powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ss][Oo][Cc][Kk][Ee][Tt][Ss]\\.[Tt][Cc][Pp][Ll][Ii][Ss][Tt][Ee][Nn][Ee][Rr].*/ AND powershell.file.script_block_text:/.*[Aa][Cc][Cc][Ee][Pp][Tt][Tt][Cc][Pp][Cc][Ll][Ii][Ee][Nn][Tt].*/)","rule_id":"bd33d2aa-497e-4651-9893-5c5364646595","timestamp_override":"event.ingested","references":["https://github.com/Arno0x/PowerShellScripts/blob/a6b7d5490fbf0b20f91195838f3a11156724b4f7/proxyTunnel.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*\\[System.Net.HttpWebRequest\\]* AND powershell.file.script_block_text:*System.Net.Sockets.TcpListener* AND powershell.file.script_block_text:*AcceptTcpClient*)`"}
