{"id":"e55a5195-4724-480e-a77e-3ebe64bd3759","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use MSHTA","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use MSHTA in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ss][Ee][Tt].*/ AND powershell.file.script_block_text:/.*\\&\\&.*/ AND powershell.file.script_block_text:/.*[Mm][Ss][Hh][Tt][Aa].*/ AND powershell.file.script_block_text:/.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\:[Cc][Rr][Ee][Aa][Tt][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*\\.[Rr][Uu][Nn].*/ AND powershell.file.script_block_text:/.*\\([Ww][Ii][Nn][Dd][Oo][Ww]\\.[Cc][Ll][Oo][Ss][Ee]\\).*/)","rule_id":"e55a5195-4724-480e-a77e-3ebe64bd3759","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*set* AND powershell.file.script_block_text:*\\&&* AND powershell.file.script_block_text:*mshta* AND powershell.file.script_block_text:*vbscript\\:createobject* AND powershell.file.script_block_text:*.run* AND powershell.file.script_block_text:*\\(window.close\\)*)`"}
