{"id":"3236fcd0-b7e3-4433-b4f8-86ad61a9af2d","created_by":"Florian Roth","name":"Suspicious PowerShell Download","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell download command","risk_score":47,"enabled":true,"severity":"medium","false_positives":["PowerShell scripts that download content from the Internet"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND process.command_line:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/) OR (process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND process.command_line:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/))","rule_id":"3236fcd0-b7e3-4433-b4f8-86ad61a9af2d","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*System.Net.WebClient* AND process.command_line:*.DownloadFile\\(*) OR (process.command_line:*System.Net.WebClient* AND process.command_line:*.DownloadString\\(*))`"}
