{"id":"b8af5f36-1361-4ebe-9e76-e36128d947bf","created_by":"frack113","name":"Use Remove-Item to Delete File","tags":["attack.defense_evasion","attack.t1070.004"],"interval":"5m","description":"Powershell Remove-Item  with -Path to delete a file or a folder with \"-Recurse\"","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ii][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*\\-[Pp][Aa][Tt][Hh]\\ .*/) AND (NOT (powershell.file.script_block_text:(/.*[Hh][Kk][Cc][Uu]\\:\\\\.*/ OR /.*[Hh][Kk][Ll][Mm]\\:\\\\.*/))))","rule_id":"b8af5f36-1361-4ebe-9e76-e36128d947bf","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/Remove-Item?view=powershell-5.1&viewFallbackFrom=powershell-7"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*Remove\\-Item* AND powershell.file.script_block_text:*\\-Path\\ *) AND (NOT (powershell.file.script_block_text:(*HKCU\\:\\\\* OR *HKLM\\:\\\\*))))`"}
