{"id":"83083ac6-1816-4e76-97d7-59af9a9ae46e","created_by":"Austin Songer (@austinsonger)","name":"AzureHound PowerShell Commands","tags":["attack.discovery","attack.t1482","attack.t1087","attack.t1087.001","attack.t1087.002","attack.t1069.001","attack.t1069.002","attack.t1069"],"interval":"5m","description":"Detects the execution of AzureHound in PowerShell, a tool to gather data from Azure for BloodHound","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Zz][Uu][Rr][Ee][Hh][Oo][Uu][Nn][Dd].*/","rule_id":"83083ac6-1816-4e76-97d7-59af9a9ae46e","timestamp_override":"event.ingested","references":["https://github.com/BloodHoundAD/BloodHound/blob/0927441f67161cc6dc08a53c63ceb8e333f55874/Collectors/AzureHound.ps1","https://bloodhound.readthedocs.io/en/latest/data-collection/azurehound.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Invoke\\-AzureHound*`"}
