{"id":"a5a30a6e-75ca-4233-8b8c-42e0f2037d3b","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Rundll32","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Rundll32 in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*\\&\\&.*/ AND powershell.file.script_block_text:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND powershell.file.script_block_text:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND powershell.file.script_block_text:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND powershell.file.script_block_text:(/.*[Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Cc][Oo][Mm][Ss][Pp][Ee][Cc].*/ OR /.*[Ii][Ee][Xx].*/))","rule_id":"a5a30a6e-75ca-4233-8b8c-42e0f2037d3b","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*\\&&* AND powershell.file.script_block_text:*rundll32* AND powershell.file.script_block_text:*shell32.dll* AND powershell.file.script_block_text:*shellexec_rundll* AND powershell.file.script_block_text:(*value* OR *invoke* OR *comspec* OR *iex*))`"}
