{"id":"bde47d4b-9987-405c-94c7-b080410e8ea7","created_by":"Austin Songer @austinsonger","name":"Clearing Windows Console History","tags":["attack.defense_evasion","attack.t1070","attack.t1070.003"],"interval":"5m","description":"Identifies when a user attempts to clear console history. An adversary may clear the command history of a compromised account to conceal the actions undertaken during an intrusion.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Cc][Ll][Ee][Aa][Rr]\\-[Hh][Ii][Ss][Tt][Oo][Rr][Yy].*/ OR (powershell.file.script_block_text:(/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ii][Tt][Ee][Mm].*/ OR /.*[Rr][Mm].*/) AND powershell.file.script_block_text:(/.*[Cc][Oo][Nn][Ss][Oo][Ll][Ee][Hh][Oo][Ss][Tt]_[Hh][Ii][Ss][Tt][Oo][Rr][Yy]\\.[Tt][Xx][Tt].*/ OR /.*\\([Gg][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn]\\)\\.[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Pp][Aa][Tt][Hh].*/)))","rule_id":"bde47d4b-9987-405c-94c7-b080410e8ea7","timestamp_override":"event.ingested","references":["https://stefanos.cloud/blog/kb/how-to-clear-the-powershell-command-history/","https://www.shellhacks.com/clear-history-powershell/","https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Clear\\-History* OR (powershell.file.script_block_text:(*Remove\\-Item* OR *rm*) AND powershell.file.script_block_text:(*ConsoleHost_history.txt* OR *\\(Get\\-PSReadlineOption\\).HistorySavePath*)))`"}
