{"id":"402e1e1d-ad59-47b6-bf80-1ee44985b3a7","created_by":"Max Altgelt, Tobias Michalski","name":"Malicious ShellIntel PowerShell Commandlets","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Commandlet names from ShellIntel exploitation scripts.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Mm][Bb][Aa][Uu][Tt][Oo][Bb][Rr][Uu][Tt][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Gg][Pp][Oo][Ll][Ii][Nn][Kk][Ss].*/ OR /.*[Oo][Uu][Tt]\\-[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Oo][Tt][Aa][Tt][Oo].*/)","rule_id":"402e1e1d-ad59-47b6-bf80-1ee44985b3a7","timestamp_override":"event.ingested","references":["https://github.com/Shellntel/scripts/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Invoke\\-SMBAutoBrute* OR *Invoke\\-GPOLinks* OR *Out\\-Minidump* OR *Invoke\\-Potato*)`"}
