{"id":"5947497f-1aa4-41dd-9693-c9848d58727d","created_by":"frack113","name":"Suspicious Unblock-File","tags":["attack.defense_evasion","attack.t1553.005"],"interval":"5m","description":"Remove the Zone.Identifier alternate data stream which identifies the file as downloaded from the internet.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Uu][Nn][Bb][Ll][Oo][Cc][Kk]\\-[Ff][Ii][Ll][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Pp][Aa][Tt][Hh]\\ .*/)","rule_id":"5947497f-1aa4-41dd-9693-c9848d58727d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.005/T1553.005.md#atomic-test-3---remove-the-zoneidentifier-alternate-data-stream","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/unblock-file?view=powershell-7.2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Unblock\\-File\\ * AND powershell.file.script_block_text:*\\-Path\\ *)`"}
