{"id":"03409c93-a7c7-49ba-9a4c-a00badf2a153","created_by":"Nasreddine Bencherchali","name":"Troubleshooting Pack Cmdlet Execution","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects execution of \"TroubleshootingPack\" cmdlets to leverage CVE-2022-30190 or action similar to \"msdt\" lolbin (as described in LOLBAS)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of \"TroubleshootingPack\" cmdlet for troubleshooting purposes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Rr][Oo][Uu][Bb][Ll][Ee][Ss][Hh][Oo][Oo][Tt][Ii][Nn][Gg][Pp][Aa][Cc][Kk].*/ AND powershell.file.script_block_text:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Pp][Cc][Ww].*/ AND powershell.file.script_block_text:/.*\\-[Aa][Nn][Ss][Ww][Ee][Rr][Ff][Ii][Ll][Ee].*/ AND powershell.file.script_block_text:/.*\\-[Uu][Nn][Aa][Tt][Tt][Ee][Nn][Dd][Ee][Dd].*/)","rule_id":"03409c93-a7c7-49ba-9a4c-a00badf2a153","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1537919885031772161","https://lolbas-project.github.io/lolbas/Binaries/Msdt/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Invoke\\-TroubleshootingPack* AND powershell.file.script_block_text:*C\\:\\\\Windows\\\\Diagnostics\\\\System\\\\PCW* AND powershell.file.script_block_text:*\\-AnswerFile* AND powershell.file.script_block_text:*\\-Unattended*)`"}
