{"id":"26b692dc-1722-49b2-b496-a8258aa6371d","created_by":"Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Clear PowerShell History","tags":["attack.defense_evasion","attack.t1070.003"],"interval":"5m","description":"Detects keywords that could indicate clearing PowerShell history","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((powershell.file.script_block_text:/.*[Ss][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn].*/ AND powershell.file.script_block_text:/.*–[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Ss][Tt][Yy][Ll][Ee].*/ AND powershell.file.script_block_text:/.*[Ss][Aa][Vv][Ee][Nn][Oo][Tt][Hh][Ii][Nn][Gg].*/) OR (powershell.file.script_block_text:/.*[Ss][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn].*/ AND powershell.file.script_block_text:/.*\\-[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Ss][Tt][Yy][Ll][Ee].*/ AND powershell.file.script_block_text:/.*[Ss][Aa][Vv][Ee][Nn][Oo][Tt][Hh][Ii][Nn][Gg].*/)) OR (powershell.file.script_block_text:(/.*[Dd][Ee][Ll].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ii][Tt][Ee][Mm].*/ OR /.*[Rr][Mm].*/) AND powershell.file.script_block_text:/.*\\([Gg][Ee][Tt]\\-[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee][Oo][Pp][Tt][Ii][Oo][Nn]\\)\\.[Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ss][Aa][Vv][Ee][Pp][Aa][Tt][Hh].*/))","rule_id":"26b692dc-1722-49b2-b496-a8258aa6371d","timestamp_override":"event.ingested","references":["https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((powershell.file.script_block_text:*Set\\-PSReadlineOption* AND powershell.file.script_block_text:*–HistorySaveStyle* AND powershell.file.script_block_text:*SaveNothing*) OR (powershell.file.script_block_text:*Set\\-PSReadlineOption* AND powershell.file.script_block_text:*\\-HistorySaveStyle* AND powershell.file.script_block_text:*SaveNothing*)) OR (powershell.file.script_block_text:(*del* OR *Remove\\-Item* OR *rm*) AND powershell.file.script_block_text:*\\(Get\\-PSReadlineOption\\).HistorySavePath*))`"}
