{"id":"87df9ee1-5416-453a-8a08-e8d4a51e9ce1","created_by":"frack113","name":"Delete Volume Shadow Copies Via WMI With PowerShell","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Shadow Copies deletion using operating systems utilities via PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Administrator deletes Shadow Copies using operating systems utilities for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.command_line:/.*\\ [Ww][Ii][Nn]32_[Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/ AND process.command_line:(/.*[Dd][Ee][Ll][Ee][Tt][Ee]\\(\\).*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/))","rule_id":"87df9ee1-5416-453a-8a08-e8d4a51e9ce1","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md","https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Get\\-WmiObject* AND process.command_line:*\\ Win32_Shadowcopy* AND process.command_line:(*Delete\\(\\)* OR *Remove\\-WmiObject*))`"}
