{"id":"66a4d409-451b-4151-94f4-a55d559c49b0","created_by":"oscd.community, @redcanary, Zach Stanford @svch0st","name":"PowerShell Deleted Mounted Share","tags":["attack.defense_evasion","attack.t1070.005"],"interval":"5m","description":"Detects when when a mounted share is removed. Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrators or Power users may remove their shares via cmd line"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ss][Mm][Bb][Ss][Hh][Aa][Rr][Ee].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ff][Ii][Ll][Ee][Ss][Hh][Aa][Rr][Ee].*/)","rule_id":"66a4d409-451b-4151-94f4-a55d559c49b0","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Remove\\-SmbShare* OR *Remove\\-FileShare*)`"}
