{"id":"2837e152-93c8-43d2-85ba-c3cd3c2ae614","created_by":"frack113","name":"Powershell Local Email Collection","tags":["attack.collection","attack.t1114.001"],"interval":"5m","description":"Adversaries may target user email on local systems to collect sensitive information. Files containing email data can be acquired from a users local system, such as Outlook storage or cache files.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Gg][Ee][Tt]\\-[Ii][Nn][Bb][Oo][Xx]\\.[Pp][Ss]1.*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Oo][Ff][Ff][Ii][Cc][Ee]\\.[Ii][Nn][Tt][Ee][Rr][Oo][Pp]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Oo][Ff][Ff][Ii][Cc][Ee]\\.[Ii][Nn][Tt][Ee][Rr][Oo][Pp]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Oo][Ll][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Ff][Oo][Ll][Dd][Ee][Rr][Ss].*/ OR /.*\\-[Cc][Oo][Mm][Oo][Bb][Jj][Ee][Cc][Tt]\\ [Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/)","rule_id":"2837e152-93c8-43d2-85ba-c3cd3c2ae614","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1114.001/T1114.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Get\\-Inbox.ps1* OR *Microsoft.Office.Interop.Outlook* OR *Microsoft.Office.Interop.Outlook.olDefaultFolders* OR *\\-comobject\\ outlook.application*)`"}
