{"id":"812837bb-b17f-45e9-8bd0-0ec35d2e3bd6","created_by":"Teymur Kheirkhabarov, Harish Segar (rule)","name":"Suspicious XOR Encoded PowerShell Command Line","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.title:/[Cc][Oo][Nn][Ss][Oo][Ll][Ee][Hh][Oo][Ss][Tt]/ AND process.command_line:(/.*[Bb][Xx][Oo][Rr].*/ OR /.*[Jj][Oo][Ii][Nn].*/ OR /.*[Cc][Hh][Aa][Rr].*/))","rule_id":"812837bb-b17f-45e9-8bd0-0ec35d2e3bd6","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=46"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.title:ConsoleHost AND process.command_line:(*bxor* OR *join* OR *char*))`"}
