{"id":"403c2cc0-7f6b-4925-9423-bfa573bed7eb","created_by":"Florian Roth","name":"Suspicious PowerShell Download","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell download command","risk_score":47,"enabled":true,"severity":"medium","false_positives":["PowerShell scripts that download content from the Internet"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND powershell.file.script_block_text:(/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/))","rule_id":"403c2cc0-7f6b-4925-9423-bfa573bed7eb","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*System.Net.WebClient* AND powershell.file.script_block_text:(*.DownloadFile\\(* OR *.DownloadString\\(*))`"}
