{"id":"e54f5149-6ba3-49cf-b153-070d24679126","created_by":"Timur Zinniatullin, oscd.community","name":"Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via VAR++ LAUNCHER","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/(?i).*&&set.*(\\{\\d\\}){2,}\\\\\\\"\\s+?\\-f.*&&.*cmd.*\\/c/","rule_id":"e54f5149-6ba3-49cf-b153-070d24679126","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:/(?i).*&&set.*(\\{\\d\\}){2,}\\\\\\\"\\s+?\\-f.*&&.*cmd.*\\/c/`"}
