{"id":"aa7a3fce-bef5-4311-9cc1-5f04bb8c308c","created_by":"Florian Roth","name":"Suspicious Export-PfxCertificate","tags":["attack.credential_access","attack.t1552.004"],"interval":"5m","description":"Detects Commandlet that is used to export certificates from the local certificate store and sometimes used by threat actors to steal private keys from compromised machines","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate certificate exports invoked by administrators or users (depends on processes in the environment - filter if unusable)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ee][Xx][Pp][Oo][Rr][Tt]\\-[Pp][Ff][Xx][Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee].*/","rule_id":"aa7a3fce-bef5-4311-9cc1-5f04bb8c308c","timestamp_override":"event.ingested","references":["https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a","https://docs.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Export\\-PfxCertificate*`"}
