{"id":"bbb80e91-5746-4fbe-8898-122e2cafdbf4","created_by":"Florian Roth (rule)","name":"Suspicious PowerShell Invocations - Generic","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell invocation command parameters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Very special / sneaky PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.ContextInfo:(/.*\\ \\-[Ee][Nn][Cc]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ .*/) AND winlog.event_data.ContextInfo:(/.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/) AND winlog.event_data.ContextInfo:(/.*\\ \\-[Nn][Oo][Nn][Ii]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee]\\ .*/))","rule_id":"bbb80e91-5746-4fbe-8898-122e2cafdbf4","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.ContextInfo:(*\\ \\-enc\\ * OR *\\ \\-EncodedCommand\\ *) AND winlog.event_data.ContextInfo:(*\\ \\-w\\ hidden\\ * OR *\\ \\-window\\ hidden\\ * OR *\\ \\-windowstyle\\ hidden\\ *) AND winlog.event_data.ContextInfo:(*\\ \\-noni\\ * OR *\\ \\-noninteractive\\ *))`"}
