{"id":"b140afd9-474b-4072-958e-2ebb435abd68","created_by":"Florian Roth","name":"Suspicious Get-ADDBAccount Usage","tags":["attack.credential_access","attack.t1003.003"],"interval":"5m","description":"Detects suspicious invocation of the Get-ADDBAccount script that reads from a ntds.dit file and may be used to get access to credentials without using any credential dumpers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Dd][Bb][Aa][Cc][Cc][Oo][Uu][Nn][Tt].*/ AND winlog.event_data.Payload:/.*[Bb][Oo][Oo][Tt][Kk][Ee][Yy]\\ .*/ AND winlog.event_data.Payload:/.*[Dd][Aa][Tt][Aa][Bb][Aa][Ss][Ee][Pp][Aa][Tt][Hh]\\ .*/)","rule_id":"b140afd9-474b-4072-958e-2ebb435abd68","timestamp_override":"event.ingested","references":["https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/","https://github.com/MichaelGrafnetter/DSInternals/blob/7ba59c12ee9a1cb430d7dc186a3366842dd612c8/Documentation/PowerShell/Get-ADDBAccount.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:*Get\\-ADDBAccount* AND winlog.event_data.Payload:*BootKey\\ * AND winlog.event_data.Payload:*DatabasePath\\ *)`"}
