{"id":"e17121b4-ef2a-4418-8a59-12fb1631fa9e","created_by":"frack113","name":"Delete Volume Shadow Copies via WMI with PowerShell","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Deletes Windows Volume Shadow Copies with PowerShell code and Get-WMIObject. This technique is used by numerous ransomware families such as Sodinokibi/REvil","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/ AND powershell.file.script_block_text:/.*\\.[Dd][Ee][Ll][Ee][Tt][Ee]\\(\\).*/)","rule_id":"e17121b4-ef2a-4418-8a59-12fb1631fa9e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Get\\-WmiObject* AND powershell.file.script_block_text:*Win32_Shadowcopy* AND powershell.file.script_block_text:*.Delete\\(\\)*)`"}
