{"id":"904e8e61-8edf-4350-b59c-b905fc8e810c","created_by":"frack113","name":"Security Software Discovery by Powershell","tags":["attack.discovery","attack.t1518.001"],"interval":"5m","description":"Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment.\nThis may include things such as firewall rules and anti-viru\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ AND powershell.file.script_block_text:/.*\\.[Dd][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Oo][Nn].*/ AND powershell.file.script_block_text:/.*\\-[Ll][Ii][Kk][Ee].*/ AND powershell.file.script_block_text:(/.*\\\".*[Vv][Ii][Rr][Uu][Ss].*\\\".*/ OR /.*\\\".*[Cc][Aa][Rr][Bb][Oo][Nn][Bb][Ll][Aa][Cc][Kk].*\\\".*/ OR /.*\\\".*[Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*\\\".*/ OR /.*\\\".*[Cc][Yy][Ll][Aa][Nn][Cc][Ee].*\\\".*/))","rule_id":"904e8e61-8edf-4350-b59c-b905fc8e810c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*get\\-process* AND powershell.file.script_block_text:*.Description* AND powershell.file.script_block_text:*\\-like* AND powershell.file.script_block_text:(*\\\"*virus*\\\"* OR *\\\"*carbonblack*\\\"* OR *\\\"*defender*\\\"* OR *\\\"*cylance*\\\"*))`"}
