{"id":"cd185561-4760-45d6-a63e-a51325112cae","created_by":"Max Altgelt","name":"Live Memory Dump Using Powershell","tags":["attack.t1003"],"interval":"5m","description":"Detects usage of a PowerShell command to dump the live memory of a Windows machine","risk_score":73,"enabled":true,"severity":"high","false_positives":["Diagnostics"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Ss][Tt][Oo][Rr][Aa][Gg][Ee][Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ii][Nn][Ff][Oo].*/ AND powershell.file.script_block_text:/.*\\-[Ii][Nn][Cc][Ll][Uu][Dd][Ee][Ll][Ii][Vv][Ee][Dd][Uu][Mm][Pp].*/)","rule_id":"cd185561-4760-45d6-a63e-a51325112cae","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/powershell/module/storage/get-storagediagnosticinfo"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Get\\-StorageDiagnosticInfo* AND powershell.file.script_block_text:*\\-IncludeLiveDump*)`"}
