{"id":"03d83090-8cba-44a0-b02f-0b756a050306","created_by":"Nikita Nazarov, oscd.community, Tim Shelton","name":"Accessing WinAPI in PowerShell","tags":["attack.execution","attack.t1059.001","attack.t1106"],"interval":"5m","description":"Detecting use WinAPI Functions in PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Carbon PowerShell Module (https://github.com/webmd-health-services/Carbon)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Ww][Aa][Ii][Tt][Ff][Oo][Rr][Ss][Ii][Nn][Gg][Ll][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Qq][Uu][Ee][Uu][Ee][Uu][Ss][Ee][Rr][Aa][Pp][Cc].*/ OR /.*[Rr][Tt][Ll][Cc][Rr][Ee][Aa][Tt][Ee][Uu][Ss][Ee][Rr][Tt][Hh][Rr][Ee][Aa][Dd].*/ OR /.*[Oo][Pp][Ee][Nn][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Vv][Ii][Rr][Tt][Uu][Aa][Ll][Aa][Ll][Ll][Oo][Cc].*/ OR /.*[Vv][Ii][Rr][Tt][Uu][Aa][Ll][Ff][Rr][Ee][Ee].*/ OR /.*[Ww][Rr][Ii][Tt][Ee][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Mm][Ee][Mm][Oo][Rr][Yy].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Uu][Ss][Ee][Rr][Tt][Hh][Rr][Ee][Aa][Dd].*/ OR /.*[Cc][Ll][Oo][Ss][Ee][Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*[Gg][Ee][Tt][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Ff][Oo][Rr][Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn][Pp][Oo][Ii][Nn][Tt][Ee][Rr].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Tt][Hh][Rr][Ee][Aa][Dd].*/ OR /.*[Mm][Ee][Mm][Cc][Pp][Yy].*/ OR /.*[Ll][Oo][Aa][Dd][Ll][Ii][Bb][Rr][Aa][Rr][Yy].*/ OR /.*[Gg][Ee][Tt][Mm][Oo][Dd][Uu][Ll][Ee][Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*[Gg][Ee][Tt][Pp][Rr][Oo][Cc][Aa][Dd][Dd][Rr][Ee][Ss][Ss].*/ OR /.*[Vv][Ii][Rr][Tt][Uu][Aa][Ll][Pp][Rr][Oo][Tt][Ee][Cc][Tt].*/ OR /.*[Ff][Rr][Ee][Ee][Ll][Ii][Bb][Rr][Aa][Rr][Yy].*/ OR /.*[Rr][Ee][Aa][Dd][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Mm][Ee][Mm][Oo][Rr][Yy].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Rr][Ee][Mm][Oo][Tt][Ee][Tt][Hh][Rr][Ee][Aa][Dd].*/ OR /.*[Aa][Dd][Jj][Uu][Ss][Tt][Tt][Oo][Kk][Ee][Nn][Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Ww][Rr][Ii][Tt][Ee][Ii][Nn][Tt]32.*/ OR /.*[Oo][Pp][Ee][Nn][Tt][Hh][Rr][Ee][Aa][Dd][Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Pp][Tt][Rr][Tt][Oo][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ff][Rr][Ee][Ee][Hh][Gg][Ll][Oo][Bb][Aa][Ll].*/ OR /.*[Zz][Ee][Rr][Oo][Ff][Rr][Ee][Ee][Gg][Ll][Oo][Bb][Aa][Ll][Aa][Ll][Ll][Oo][Cc][Uu][Nn][Ii][Cc][Oo][Dd][Ee].*/ OR /.*[Oo][Pp][Ee][Nn][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Gg][Ee][Tt][Tt][Oo][Kk][Ee][Nn][Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ss][Ee][Tt][Tt][Hh][Rr][Ee][Aa][Dd][Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ee][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn][Uu][Ss][Ee][Rr].*/ OR /.*[Rr][Ee][Vv][Ee][Rr][Tt][Tt][Oo][Ss][Ee][Ll][Ff].*/ OR /.*[Gg][Ee][Tt][Ll][Oo][Gg][Oo][Nn][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Dd][Aa][Tt][Aa].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ww][Ii][Tt][Hh][Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Dd][Uu][Pp][Ll][Ii][Cc][Aa][Tt][Ee][Tt][Oo][Kk][Ee][Nn][Ee][Xx].*/ OR /.*[Oo][Pp][Ee][Nn][Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Oo][Pp][Ee][Nn][Dd][Ee][Ss][Kk][Tt][Oo][Pp].*/ OR /.*[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp][Ww][Rr][Ii][Tt][Ee][Dd][Uu][Mm][Pp].*/ OR /.*[Aa][Dd][Dd][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Aa][Cc][Kk][Aa][Gg][Ee].*/ OR /.*[Ee][Nn][Uu][Mm][Ee][Rr][Aa][Tt][Ee][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss].*/ OR /.*[Gg][Ee][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*[Dd][Aa][Nn][Gg][Ee][Rr][Oo][Uu][Ss][Gg][Ee][Tt][Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*[Kk][Ee][Rr][Nn][Ee][Ll]32.*/ OR /.*[Aa][Dd][Vv][Aa][Pp][Ii]32.*/ OR /.*[Mm][Ss][Vv][Cc][Rr][Tt].*/ OR /.*[Nn][Tt][Dd][Ll][Ll].*/ OR /.*[Ss][Ee][Cc][Uu][Rr]32.*/) AND (NOT ((powershell.file.script_block_text:/#\\ [Cc][Oo][Pp][Yy][Rr][Ii][Gg][Hh][Tt]\\ 2016\\ [Aa][Mm][Aa][Zz][Oo][Nn]\\.[Cc][Oo][Mm],\\ [Ii][Nn][Cc]\\.\\ [Oo][Rr]\\ [Ii][Tt][Ss]\\ [Aa][Ff][Ff][Ii][Ll][Ii][Aa][Tt][Ee][Ss]\\..*/))))","rule_id":"03d83090-8cba-44a0-b02f-0b756a050306","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*WaitForSingleObject* OR *QueueUserApc* OR *RtlCreateUserThread* OR *OpenProcess* OR *VirtualAlloc* OR *VirtualFree* OR *WriteProcessMemory* OR *CreateUserThread* OR *CloseHandle* OR *GetDelegateForFunctionPointer* OR *CreateThread* OR *memcpy* OR *LoadLibrary* OR *GetModuleHandle* OR *GetProcAddress* OR *VirtualProtect* OR *FreeLibrary* OR *ReadProcessMemory* OR *CreateRemoteThread* OR *AdjustTokenPrivileges* OR *WriteInt32* OR *OpenThreadToken* OR *PtrToString* OR *FreeHGlobal* OR *ZeroFreeGlobalAllocUnicode* OR *OpenProcessToken* OR *GetTokenInformation* OR *SetThreadToken* OR *ImpersonateLoggedOnUser* OR *RevertToSelf* OR *GetLogonSessionData* OR *CreateProcessWithToken* OR *DuplicateTokenEx* OR *OpenWindowStation* OR *OpenDesktop* OR *MiniDumpWriteDump* OR *AddSecurityPackage* OR *EnumerateSecurityPackages* OR *GetProcessHandle* OR *DangerousGetHandle* OR *kernel32* OR *Advapi32* OR *msvcrt* OR *ntdll* OR *secur32*) AND (NOT ((powershell.file.script_block_text:#\\ Copyright\\ 2016\\ Amazon.com,\\ Inc.\\ or\\ its\\ affiliates.*))))`"}
