{"id":"4096a49c-7de4-4da0-a230-c66ccd56ea5a","created_by":"frack113","name":"Suspicious PowerShell Get Current User","tags":["attack.discovery","attack.t1033"],"interval":"5m","description":"Detects the use of PowerShell to identify the current logged user.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt]\\]\\:\\:[Uu][Ss][Ee][Rr][Nn][Aa][Mm][Ee].*/ OR /.*$[Ee][Nn][Vv]\\:[Uu][Ss][Ee][Rr][Nn][Aa][Mm][Ee].*/ OR /.*\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\]\\:\\:[Gg][Ee][Tt][Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\(\\).*/)","rule_id":"4096a49c-7de4-4da0-a230-c66ccd56ea5a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md#atomic-test-4---user-discovery-with-env-vars-powershell-script","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md#atomic-test-5---getcurrent-user-with-powershell-script"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*\\[System.Environment\\]\\:\\:UserName* OR *$env\\:UserName* OR *\\[System.Security.Principal.WindowsIdentity\\]\\:\\:GetCurrent\\(\\)*)`"}
