{"id":"4c4af3cd-2115-479c-8193-6b8bfce9001c","created_by":"Bartlomiej Czyz @bczyz1, oscd.community","name":"PowerShell ICMP Exfiltration","tags":["attack.exfiltration","attack.t1048.003"],"interval":"5m","description":"Detects Exfiltration Over Alternative Protocol - ICMP. Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of System.Net.NetworkInformation.Ping class"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Pp][Ii][Nn][Gg].*/ AND powershell.file.script_block_text:/.*\\.[Ss][Ee][Nn][Dd]\\(.*/)","rule_id":"4c4af3cd-2115-479c-8193-6b8bfce9001c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-2---exfiltration-over-alternative-protocol---icmp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*System.Net.NetworkInformation.Ping* AND powershell.file.script_block_text:*.Send\\(*)`"}
