{"id":"df9a0e0e-fedb-4d6c-8668-d765dfc92aa7","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Suspicious Non PowerShell WSMAN COM Provider","tags":["attack.execution","attack.t1059.001","attack.lateral_movement","attack.t1021.003"],"interval":"5m","description":"Detects suspicious use of the WSMAN provider without PowerShell.exe as the host application.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Windows\\ PowerShell AND powershell.provider.name:/[Ww][Ss][Mm][Aa][Nn]/ AND (NOT (process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/)))","rule_id":"df9a0e0e-fedb-4d6c-8668-d765dfc92aa7","timestamp_override":"event.ingested","references":["https://twitter.com/chadtilbury/status/1275851297770610688","https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/","https://github.com/bohops/WSMan-WinRM"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Windows\\ PowerShell AND powershell.provider.name:WSMan AND (NOT (process.command_line:*powershell*)))`"}
