{"id":"4cbd4f12-2e22-43e3-882f-bff3247ffb78","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"PowerShell Get Clipboard","tags":["attack.collection","attack.t1115"],"interval":"5m","description":"A General detection for the Get-Clipboard commands in PowerShell logs. This could be an adversary capturing clipboard contents.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd].*/","rule_id":"4cbd4f12-2e22-43e3-882f-bff3247ffb78","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/16","https://threathunterplaybook.com/evals/apt29/detections/7.A.2_F4609F7E-C4DB-4327-91D4-59A58C962A02.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.Payload:*Get\\-Clipboard*`"}
