{"id":"8c521530-5169-495d-a199-0a3a881ad24e","created_by":"Sami Ruohonen","name":"NTFS Alternate Data Stream","tags":["attack.defense_evasion","attack.t1564.004","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects writing data into NTFS alternate data streams from powershell. Needs Script Block Logging.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Ss][Ee][Tt]\\-[Cc][Oo][Nn][Tt][Ee][Nn][Tt].*/ OR /.*[Aa][Dd][Dd]\\-[Cc][Oo][Nn][Tt][Ee][Nn][Tt].*/) AND powershell.file.script_block_text:/.*\\-[Ss][Tt][Rr][Ee][Aa][Mm].*/)","rule_id":"8c521530-5169-495d-a199-0a3a881ad24e","timestamp_override":"event.ingested","references":["http://www.powertheshell.com/ntfsstreams/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*set\\-content* OR *add\\-content*) AND powershell.file.script_block_text:*\\-stream*)`"}
