{"id":"ebdf49d8-b89c-46c9-8fdf-2c308406f6bd","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Clip","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Clip.exe in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.Payload:/(?i).*?echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?).*/","rule_id":"ebdf49d8-b89c-46c9-8fdf-2c308406f6bd","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.Payload:/(?i).*?echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?).*/`"}
