{"id":"195626f3-5f1b-4403-93b7-e6cfd4d6a078","created_by":"frack113","name":"Suspicious SSL Connection","tags":["attack.command_and_control","attack.t1573"],"interval":"5m","description":"Adversaries may employ a known encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrative script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Ss][Ss][Ll][Ss][Tt][Rr][Ee][Aa][Mm].*/ AND powershell.file.script_block_text:/.*[Nn][Ee][Tt]\\.[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Rr][Ee][Mm][Oo][Tt][Ee][Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee][Vv][Aa][Ll][Ii][Dd][Aa][Tt][Ii][Oo][Nn][Cc][Aa][Ll][Ll][Bb][Aa][Cc][Kk].*/ AND powershell.file.script_block_text:/.*\\.[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ee][Aa][Ss][Cc][Ll][Ii][Ee][Nn][Tt].*/)","rule_id":"195626f3-5f1b-4403-93b7-e6cfd4d6a078","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1573/T1573.md#atomic-test-1---openssl-c2","https://medium.com/walmartglobaltech/openssl-server-reverse-shell-from-windows-client-aee2dbfa0926"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*System.Net.Security.SslStream* AND powershell.file.script_block_text:*Net.Security.RemoteCertificateValidationCallback* AND powershell.file.script_block_text:*.AuthenticateAsClient*)`"}
