{"id":"2650dd1a-eb2a-412d-ac36-83f06c4f2282","created_by":"Nikita Nazarov, oscd.community","name":"Detected Windows Software Discovery","tags":["attack.discovery","attack.t1518"],"interval":"5m","description":"Adversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration activities"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/ AND powershell.file.script_block_text:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\.*/ AND powershell.file.script_block_text:/.*[Ss][Ee][Ll][Ee][Cc][Tt]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ff][Oo][Rr][Mm][Aa][Tt]\\-[Tt][Aa][Bb][Ll][Ee].*/)","rule_id":"2650dd1a-eb2a-412d-ac36-83f06c4f2282","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518/T1518.md","https://github.com/harleyQu1nn/AggressorScripts"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*get\\-itemProperty* AND powershell.file.script_block_text:*\\\\software\\\\* AND powershell.file.script_block_text:*select\\-object* AND powershell.file.script_block_text:*format\\-table*)`"}
