{"id":"f65e22f9-819e-4f96-9c7b-498364ae7a25","created_by":"frack113","name":"Abusable Invoke-ATHRemoteFXvGPUDisablementCommand","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Windows\\ PowerShell AND process.command_line:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Aa][Tt][Hh][Rr][Ee][Mm][Oo][Tt][Ee][Ff][Xx][Vv][Gg][Pp][Uu][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Mm][Ee][Nn][Tt][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ .*/ AND process.command_line:(/.*\\-[Mm][Oo][Dd][Uu][Ll][Ee][Nn][Aa][Mm][Ee]\\ .*/ OR /.*\\-[Mm][Oo][Dd][Uu][Ll][Ee][Pp][Aa][Tt][Hh]\\ .*/ OR /.*\\-[Ss][Cc][Rr][Ii][Pp][Tt][Bb][Ll][Oo][Cc][Kk]\\ .*/ OR /.*\\-[Rr][Ee][Mm][Oo][Tt][Ee][Ff][Xx][Vv][Gg][Pp][Uu][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Mm][Ee][Nn][Tt][Ff][Ii][Ll][Ee][Pp][Aa][Tt][Hh].*/))","rule_id":"f65e22f9-819e-4f96-9c7b-498364ae7a25","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md","https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Windows\\ PowerShell AND process.command_line:*Invoke\\-ATHRemoteFXvGPUDisablementCommand\\ * AND process.command_line:(*\\-ModuleName\\ * OR *\\-ModulePath\\ * OR *\\-ScriptBlock\\ * OR *\\-RemoteFXvGPUDisablementFilePath*))`"}
