{"id":"88a22f69-62f9-4b8a-aa00-6b0212f2f05a","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Rundll32","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Rundll32 in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:/.*\\&\\&.*/ AND winlog.event_data.Payload:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND winlog.event_data.Payload:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND winlog.event_data.Payload:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND winlog.event_data.Payload:(/.*[Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Cc][Oo][Mm][Ss][Pp][Ee][Cc].*/ OR /.*[Ii][Ee][Xx].*/))","rule_id":"88a22f69-62f9-4b8a-aa00-6b0212f2f05a","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:*\\&&* AND winlog.event_data.Payload:*rundll32* AND winlog.event_data.Payload:*shell32.dll* AND winlog.event_data.Payload:*shellexec_rundll* AND winlog.event_data.Payload:(*value* OR *invoke* OR *comspec* OR *iex*))`"}
