{"id":"de41232e-12e8-49fa-86bc-c05c7e722df9","created_by":"Florian Roth","name":"Suspicious PowerShell Download","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell download command","risk_score":47,"enabled":true,"severity":"medium","false_positives":["PowerShell scripts that download content from the Internet"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.ContextInfo:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND winlog.event_data.ContextInfo:(/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/))","rule_id":"de41232e-12e8-49fa-86bc-c05c7e722df9","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.ContextInfo:*System.Net.WebClient* AND winlog.event_data.ContextInfo:(*.DownloadFile\\(* OR *.DownloadString\\(*))`"}
