{"id":"ec19ebab-72dc-40e1-9728-4c0b805d722c","created_by":"frack113","name":"Tamper Windows Defender - PSClassic","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Attempting to disable scheduled scanning and other parts of windows defender atp. Or set default actions to allow.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee].*/ AND process.command_line:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Mm][Oo][Vv][Aa][Bb][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Mm][Aa][Pp][Pp][Ee][Dd][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Dd][Rr][Ii][Vv][Ee][Ss][Ff][Oo][Rr][Ff][Uu][Ll][Ll][Ss][Cc][Aa][Nn]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ff][Ii][Ll][Ee][Ss]\\ 1.*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Mm][Oo][Vv][Aa][Bb][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Mm][Aa][Pp][Pp][Ee][Dd][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Dd][Rr][Ii][Vv][Ee][Ss][Ff][Oo][Rr][Ff][Uu][Ll][Ll][Ss][Cc][Aa][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ff][Ii][Ll][Ee][Ss]\\ $[Tt][Rr][Uu][Ee].*/)) OR (process.command_line:/.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee].*/ AND process.command_line:/.*[Aa][Ll][Ll][Oo][Ww].*/ AND process.command_line:(/.*[Ll][Oo][Ww][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Mm][Oo][Dd][Ee][Rr][Aa][Tt][Ee][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Hh][Ii][Gg][Hh][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn].*/)))","rule_id":"ec19ebab-72dc-40e1-9728-4c0b805d722c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*Set\\-MpPreference* AND process.command_line:(*DisableRealtimeMonitoring\\ 1* OR *DisableBehaviorMonitoring\\ 1* OR *DisableScriptScanning\\ 1* OR *DisableArchiveScanning\\ 1* OR *DisableBlockAtFirstSeen\\ 1* OR *DisableIOAVProtection\\ 1* OR *DisableIntrusionPreventionSystem\\ 1* OR *DisableRemovableDriveScanning\\ 1* OR *DisableScanningMappedNetworkDrivesForFullScan\\ 1* OR *DisableScanningNetworkFiles\\ 1* OR *DisableRealtimeMonitoring\\ $true* OR *DisableBehaviorMonitoring\\ $true* OR *DisableScriptScanning\\ $true* OR *DisableArchiveScanning\\ $true* OR *DisableBlockAtFirstSeen\\ $true* OR *DisableIOAVProtection\\ $true* OR *DisableIntrusionPreventionSystem\\ $true* OR *DisableRemovableDriveScanning\\ $true* OR *DisableScanningMappedNetworkDrivesForFullScan\\ $true* OR *DisableScanningNetworkFiles\\ $true*)) OR (process.command_line:*Set\\-MpPreference* AND process.command_line:*Allow* AND process.command_line:(*LowThreatDefaultAction* OR *ModerateThreatDefaultAction* OR *HighThreatDefaultAction*)))`"}
