{"id":"1c563233-030e-4a07-af8c-ee0490a66d3a","created_by":"frack113","name":"Suspicious New-PSDrive to Admin Share","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Adversaries may use to interact with a remote network share using Server Message Block (SMB). The adversary may then perform actions as the logged-on user.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Pp][Ss][Dd][Rr][Ii][Vv][Ee].*/ AND powershell.file.script_block_text:/.*\\-[Pp][Ss][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\ .*/ AND powershell.file.script_block_text:/.*[Ff][Ii][Ll][Ee][Ss][Yy][Ss][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*\\-[Rr][Oo][Oo][Tt]\\ .*/ AND powershell.file.script_block_text:/.*\\\\\\\\\\*/ AND powershell.file.script_block_text:/.*$.*/)","rule_id":"1c563233-030e-4a07-af8c-ee0490a66d3a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-2---map-admin-share-powershell","https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/new-psdrive?view=powershell-7.2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*New\\-PSDrive* AND powershell.file.script_block_text:*\\-psprovider\\ * AND powershell.file.script_block_text:*filesystem* AND powershell.file.script_block_text:*\\-root\\ * AND powershell.file.script_block_text:*\\\\\\\\\\* AND powershell.file.script_block_text:*$*)`"}
