{"id":"fe5ce7eb-dad8-467c-84a9-31ec23bd644a","created_by":"Ensar Şamil, @sblmsrsn, OSCD Community","name":"SyncAppvPublishingServer Execution to Bypass Powershell Restriction","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects SyncAppvPublishingServer process execution which usually utilized by adversaries to bypass PowerShell execution restrictions.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["App-V clients"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.ContextInfo:/.*[Ss][Yy][Nn][Cc][Aa][Pp][Pp][Vv][Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee].*/","rule_id":"fe5ce7eb-dad8-467c-84a9-31ec23bd644a","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.ContextInfo:*SyncAppvPublishingServer.exe*`"}
