{"id":"bbb9495b-58fc-4016-b9df-9a3a1b67ca82","created_by":"frack113","name":"Password Policy Discovery With Get-AdDefaultDomainPasswordPolicy","tags":["attack.discovery","attack.t1201"],"interval":"5m","description":"Detetcts PowerShell activity in which Get-Addefaultdomainpasswordpolicy is used to get the default password policy for an Active Directory domain.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Dd][Oo][Mm][Aa][Ii][Nn][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Pp][Oo][Ll][Ii][Cc][Yy].*/","rule_id":"bbb9495b-58fc-4016-b9df-9a3a1b67ca82","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md#atomic-test-9---enumerate-active-directory-password-policy-with-get-addefaultdomainpasswordpolicy","https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-addefaultdomainpasswordpolicy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Get\\-AdDefaultDomainPasswordPolicy*`"}
