{"id":"c1dda054-d638-4c16-afc8-53e007f3fbc5","created_by":"frack113","name":"Automated Collection Command PowerShell","tags":["attack.collection","attack.t1119"],"interval":"5m","description":"Once established within a system or network, an adversary may use automated techniques for collecting internal data.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*\\.[Dd][Oo][Cc].*/ OR /.*\\.[Dd][Oo][Cc][Xx].*/ OR /.*\\.[Xx][Ll][Ss].*/ OR /.*\\.[Xx][Ll][Ss][Xx].*/ OR /.*\\.[Pp][Pp][Tt].*/ OR /.*\\.[Pp][Pp][Tt][Xx].*/ OR /.*\\.[Rr][Tt][Ff].*/ OR /.*\\.[Pp][Dd][Ff].*/ OR /.*\\.[Tt][Xx][Tt].*/) AND powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Cc][Hh][Ii][Ll][Dd][Ii][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*\\ \\-[Rr][Ee][Cc][Uu][Rr][Ss][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\ \\-[Ii][Nn][Cc][Ll][Uu][Dd][Ee]\\ .*/)","rule_id":"c1dda054-d638-4c16-afc8-53e007f3fbc5","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*.doc* OR *.docx* OR *.xls* OR *.xlsx* OR *.ppt* OR *.pptx* OR *.rtf* OR *.pdf* OR *.txt*) AND powershell.file.script_block_text:*Get\\-ChildItem* AND powershell.file.script_block_text:*\\ \\-Recurse\\ * AND powershell.file.script_block_text:*\\ \\-Include\\ *)`"}
