{"id":"6dc5d284-69ea-42cf-9311-fb1c3932a69a","created_by":"Timur Zinniatullin, oscd.community","name":"Data Compressed - PowerShell","tags":["attack.exfiltration","attack.t1560"],"interval":"5m","description":"An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Highly likely if archive operations are done via PowerShell."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*\\-[Rr][Ee][Cc][Uu][Rr][Ss][Ee].*/ AND powershell.file.script_block_text:/.*|.*/ AND powershell.file.script_block_text:/.*[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss]\\-[Aa][Rr][Cc][Hh][Ii][Vv][Ee].*/)","rule_id":"6dc5d284-69ea-42cf-9311-fb1c3932a69a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560/T1560.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*\\-Recurse* AND powershell.file.script_block_text:*|* AND powershell.file.script_block_text:*Compress\\-Archive*)`"}
