{"id":"78aa1347-1517-4454-9982-b338d6df8343","created_by":"frack113, MatilJ","name":"Powershell MsXml COM Object","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Adversaries may abuse PowerShell commands and scripts for execution.\nPowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. (Citation: TechNet PowerShell)\nAdversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*\\-[Cc][Oo][Mm][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Mm][Ss][Xx][Mm][Ll]2\\..*/ AND powershell.file.script_block_text:/.*[Xx][Mm][Ll][Hh][Tt][Tt][Pp].*/)","rule_id":"78aa1347-1517-4454-9982-b338d6df8343","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-7---powershell-msxml-com-object---with-prompt","https://docs.microsoft.com/en-us/previous-versions/windows/desktop/ms766431(v=vs.85)","https://www.trendmicro.com/en_id/research/22/e/uncovering-a-kingminer-botnet-attack-using-trend-micro-managed-x.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*\\-ComObject* AND powershell.file.script_block_text:*MsXml2.* AND powershell.file.script_block_text:*XmlHttp*)`"}
