{"id":"d23f2ba5-9da0-4463-8908-8ee47f614bb9","created_by":"frack113","name":"Powershell File and Directory Discovery","tags":["attack.discovery","attack.t1083"],"interval":"5m","description":"Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system.\nAdversaries may use the information from [File and Directory Discovery](https://attack.mitre.org/techniques/T1083) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Ll][Ss].*/ OR /.*[Gg][Ee][Tt]\\-[Cc][Hh][Ii][Ll][Dd][Ii][Tt][Ee][Mm].*/ OR /.*[Gg][Cc][Ii].*/) AND powershell.file.script_block_text:/.*\\-[Rr][Ee][Cc][Uu][Rr][Ss][Ee].*/)","rule_id":"d23f2ba5-9da0-4463-8908-8ee47f614bb9","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*ls* OR *get\\-childitem* OR *gci*) AND powershell.file.script_block_text:*\\-recurse*)`"}
