{"id":"96c982fe-3d08-4df4-bed2-eb14e02f21c8","created_by":"frack113","name":"Get-ADUser Enumeration Using UserAccountControl Flags","tags":["attack.discovery","attack.t1057"],"interval":"5m","description":"Detects AS-REP roasting is an attack that is often-overlooked. It is not very common as you have to explicitly set accounts that do not require pre-authentication.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Uu][Ss][Ee][Rr].*/ AND powershell.file.script_block_text:/.*\\-[Ff][Ii][Ll][Tt][Ee][Rr].*/ AND powershell.file.script_block_text:/.*[Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll].*/ AND powershell.file.script_block_text:/.*\\-[Bb][Aa][Nn][Dd].*/ AND powershell.file.script_block_text:/.*4194304.*/)","rule_id":"96c982fe-3d08-4df4-bed2-eb14e02f21c8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md#atomic-test-11---get-aduser-enumeration-using-useraccountcontrol-flags-as-rep-roasting","https://shellgeek.com/useraccountcontrol-flags-to-manipulate-properties/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Get\\-ADUser* AND powershell.file.script_block_text:*\\-Filter* AND powershell.file.script_block_text:*useraccountcontrol* AND powershell.file.script_block_text:*\\-band* AND powershell.file.script_block_text:*4194304*)`"}
