{"id":"243de76f-4725-4f2e-8225-a8a69b15ad61","created_by":"@ROxPinTeddy","name":"PowerShell Create Local User","tags":["attack.execution","attack.t1059.001","attack.persistence","attack.t1136.001"],"interval":"5m","description":"Detects creation of a local user via PowerShell","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate user creation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Ll][Oo][Cc][Aa][Ll][Uu][Ss][Ee][Rr].*/","rule_id":"243de76f-4725-4f2e-8225-a8a69b15ad61","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*New\\-LocalUser*`"}
