{"id":"9e07f6e7-83aa-45c6-998e-0af26efd0a85","created_by":"frack113","name":"Powershell WMI Persistence","tags":["attack.privilege_escalation","attack.t1546.003"],"interval":"5m","description":"Adversaries may establish persistence and elevate privileges by executing malicious content triggered by a Windows Management Instrumentation (WMI) event subscription.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Cc][Ii][Mm][Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Nn][Aa][Mm][Ee][Ss][Pp][Aa][Cc][Ee]\\ [Rr][Oo][Oo][Tt]\\/[Ss][Uu][Bb][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Oo][Nn]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Cc][Ll][Aa][Ss][Ss][Nn][Aa][Mm][Ee]\\ __[Ee][Vv][Ee][Nn][Tt][Ff][Ii][Ll][Tt][Ee][Rr]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy]\\ .*/) OR (powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Cc][Ii][Mm][Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Nn][Aa][Mm][Ee][Ss][Pp][Aa][Cc][Ee]\\ [Rr][Oo][Oo][Tt]\\/[Ss][Uu][Bb][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Oo][Nn]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Cc][Ll][Aa][Ss][Ss][Nn][Aa][Mm][Ee]\\ [Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee][Ee][Vv][Ee][Nn][Tt][Cc][Oo][Nn][Ss][Uu][Mm][Ee][Rr]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy]\\ .*/))","rule_id":"9e07f6e7-83aa-45c6-998e-0af26efd0a85","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.003/T1546.003.md","https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/data/module_source/persistence/Persistence.psm1#L545"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*New\\-CimInstance\\ * AND powershell.file.script_block_text:*\\-Namespace\\ root\\/subscription\\ * AND powershell.file.script_block_text:*\\-ClassName\\ __EventFilter\\ * AND powershell.file.script_block_text:*\\-Property\\ *) OR (powershell.file.script_block_text:*New\\-CimInstance\\ * AND powershell.file.script_block_text:*\\-Namespace\\ root\\/subscription\\ * AND powershell.file.script_block_text:*\\-ClassName\\ CommandLineEventConsumer\\ * AND powershell.file.script_block_text:*\\-Property\\ *))`"}
