{"id":"a699b30e-d010-46c8-bbd1-ee2e26765fe9","created_by":"frack113","name":"Powershell Store File In Alternate Data Stream","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Storing files in Alternate Data Stream (ADS) similar to Astaroth malware.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Ss][Tt][Aa][Rr][Tt]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ AND powershell.file.script_block_text:/.*\\-[Ff][Ii][Ll][Ee][Pp][Aa][Tt][Hh]\\ \\\"$[Ee][Nn][Vv]\\:[Cc][Oo][Mm][Ss][Pp][Ee][Cc]\\\"\\ .*/ AND powershell.file.script_block_text:/.*\\-[Aa][Rr][Gg][Uu][Mm][Ee][Nn][Tt][Ll][Ii][Ss][Tt]\\ .*/ AND powershell.file.script_block_text:/.*\\>.*/)","rule_id":"a699b30e-d010-46c8-bbd1-ee2e26765fe9","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Start\\-Process* AND powershell.file.script_block_text:*\\-FilePath\\ \\\"$env\\:comspec\\\"\\ * AND powershell.file.script_block_text:*\\-ArgumentList\\ * AND powershell.file.script_block_text:*>*)`"}
