{"id":"16b37b70-6fcf-4814-a092-c36bd3aafcbd","created_by":"David Ledbetter (shellcode), Florian Roth (rule)","name":"PowerShell ShellCode","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Base64 encoded Shellcode","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/ AND powershell.file.script_block_text:(/.*[Oo][Ii][Cc][Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/ OR /.*[Oo][Ii][Jj][Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/))","rule_id":"16b37b70-6fcf-4814-a092-c36bd3aafcbd","timestamp_override":"event.ingested","references":["https://twitter.com/cyb3rops/status/1063072865992523776"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*AAAAYInlM* AND powershell.file.script_block_text:(*OiCAAAAYInlM* OR *OiJAAAAYInlM*))`"}
