{"id":"8028c2c3-e25a-46e3-827f-bbb5abf181d7","created_by":"NVISO","name":"WMImplant Hack Tool","tags":["attack.execution","attack.t1047","attack.t1059.001"],"interval":"5m","description":"Detects parameters used by WMImplant","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative scripts that use the same keywords."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ww][Mm][Ii][Mm][Pp][Ll][Aa][Nn][Tt].*/ OR /.*\\ [Cc][Hh][Aa][Nn][Gg][Ee]_[Uu][Ss][Ee][Rr]\\ .*/ OR /.*\\ [Gg][Ee][Nn]_[Cc][Ll][Ii]\\ .*/ OR /.*\\ [Cc][Oo][Mm][Mm][Aa][Nn][Dd]_[Ee][Xx][Ee][Cc]\\ .*/ OR /.*\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee]_[Ww][Dd][Ii][Gg][Ee][Ss][Tt]\\ .*/ OR /.*\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee]_[Ww][Ii][Nn][Rr][Mm]\\ .*/ OR /.*\\ [Ee][Nn][Aa][Bb][Ll][Ee]_[Ww][Dd][Ii][Gg][Ee][Ss][Tt]\\ .*/ OR /.*\\ [Ee][Nn][Aa][Bb][Ll][Ee]_[Ww][Ii][Nn][Rr][Mm]\\ .*/ OR /.*\\ [Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]_[Mm][Oo][Dd]\\ .*/ OR /.*\\ [Rr][Ee][Mm][Oo][Tt][Ee]_[Pp][Oo][Ss][Hh]\\ .*/ OR /.*\\ [Ss][Cc][Hh][Ee][Dd]_[Jj][Oo][Bb]\\ .*/ OR /.*\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]_[Mm][Oo][Dd]\\ .*/ OR /.*\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss]_[Kk][Ii][Ll][Ll]\\ .*/ OR /.*\\ [Aa][Cc][Tt][Ii][Vv][Ee]_[Uu][Ss][Ee][Rr][Ss]\\ .*/ OR /.*\\ [Bb][Aa][Ss][Ii][Cc]_[Ii][Nn][Ff][Oo]\\ .*/ OR /.*\\ [Pp][Oo][Ww][Ee][Rr]_[Oo][Ff][Ff]\\ .*/ OR /.*\\ [Vv][Aa][Cc][Aa][Nn][Tt]_[Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/ OR /.*\\ [Ll][Oo][Gg][Oo][Nn]_[Ee][Vv][Ee][Nn][Tt][Ss]\\ .*/)","rule_id":"8028c2c3-e25a-46e3-827f-bbb5abf181d7","timestamp_override":"event.ingested","references":["https://github.com/FortyNorthSecurity/WMImplant"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*WMImplant* OR *\\ change_user\\ * OR *\\ gen_cli\\ * OR *\\ command_exec\\ * OR *\\ disable_wdigest\\ * OR *\\ disable_winrm\\ * OR *\\ enable_wdigest\\ * OR *\\ enable_winrm\\ * OR *\\ registry_mod\\ * OR *\\ remote_posh\\ * OR *\\ sched_job\\ * OR *\\ service_mod\\ * OR *\\ process_kill\\ * OR *\\ active_users\\ * OR *\\ basic_info\\ * OR *\\ power_off\\ * OR *\\ vacant_system\\ * OR *\\ logon_events\\ *)`"}
