{"id":"adf876b3-f1f8-4aa9-a4e4-a64106feec06","created_by":"frack113","name":"Testing Usage of Uncommonly Used Port","tags":["attack.command_and_control","attack.t1571"],"interval":"5m","description":"Adversaries may communicate using a protocol and port paring that are typically not associated.\nFor example, HTTPS over port 8088(Citation: Symantec Elfin Mar 2019) or port 587(Citation: Fortinet Agent Tesla April 2018) as opposed to the traditional port 443.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Tt][Ee][Ss][Tt]\\-[Nn][Ee][Tt][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ AND powershell.file.script_block_text:/.*\\-[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Nn][Aa][Mm][Ee]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Pp][Oo][Rr][Tt]\\ .*/) AND (NOT (powershell.file.script_block_text:(/.*\\ 443\\ .*/ OR /.*\\ 80\\ .*/))))","rule_id":"adf876b3-f1f8-4aa9-a4e4-a64106feec06","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1571/T1571.md#atomic-test-1---testing-usage-of-uncommonly-used-port-with-powershell","https://docs.microsoft.com/en-us/powershell/module/nettcpip/test-netconnection?view=windowsserver2022-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*Test\\-NetConnection* AND powershell.file.script_block_text:*\\-ComputerName\\ * AND powershell.file.script_block_text:*\\-port\\ *) AND (NOT (powershell.file.script_block_text:(*\\ 443\\ * OR *\\ 80\\ *))))`"}
