{"id":"c5ac6a1e-9407-45f5-a0ce-ca9a0806a287","created_by":"frack113","name":"Replace Desktop Wallpaper by Powershell","tags":["attack.impact","attack.t1491.001"],"interval":"5m","description":"An adversary may deface systems internal to an organization in an attempt to intimidate or mislead users.\nThis may take the form of modifications to internal websites, or directly to user systems with the replacement of the desktop wallpaper\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/ AND powershell.file.script_block_text:/.*[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\:\\:.*/ AND powershell.file.script_block_text:/.*[Hh][Kk][Ee][Yy]_[Cc][Uu][Rr][Rr][Ee][Nn][Tt]_[Uu][Ss][Ee][Rr]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ AND powershell.file.script_block_text:/.*[Ww][Aa][Ll][Ll][Pp][Aa][Pp][Ee][Rr].*/) OR powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss][Ii][Nn][Ff][Oo]\\(20,0,.*,3\\).*/)","rule_id":"c5ac6a1e-9407-45f5-a0ce-ca9a0806a287","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1491.001/T1491.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*Get\\-ItemProperty* AND powershell.file.script_block_text:*Registry\\:\\:* AND powershell.file.script_block_text:*HKEY_CURRENT_USER\\\\Control\\ Panel\\\\Desktop\\\\* AND powershell.file.script_block_text:*WallPaper*) OR powershell.file.script_block_text:*SystemParametersInfo\\(20,0,*,3\\)*)`"}
