{"id":"96b9f619-aa91-478f-bacb-c3e50f8df575","created_by":"Roberto Rodriguez @Cyb3rWard0g, Tim Shelton","name":"Remote PowerShell Session (PS Module)","tags":["attack.execution","attack.t1059.001","attack.lateral_movement","attack.t1021.006"],"interval":"5m","description":"Detects remote PowerShell sessions","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use remote PowerShell sessions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.ContextInfo:/.*\\ \\=\\ [Ss][Ee][Rr][Vv][Ee][Rr][Rr][Ee][Mm][Oo][Tt][Ee][Hh][Oo][Ss][Tt]\\ .*/ AND winlog.event_data.ContextInfo:/.*[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/) AND (NOT ((winlog.event_data.ContextInfo:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Vv]1\\.0\\\\[Mm][Oo][Dd][Uu][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Aa][Rr][Cc][Hh][Ii][Vv][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Aa][Rr][Cc][Hh][Ii][Vv][Ee]\\.[Pp][Ss][Mm]1.*/))))","rule_id":"96b9f619-aa91-478f-bacb-c3e50f8df575","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.ContextInfo:*\\ \\=\\ ServerRemoteHost\\ * AND winlog.event_data.ContextInfo:*wsmprovhost.exe*) AND (NOT ((winlog.event_data.ContextInfo:*\\\\Windows\\\\system32\\\\WindowsPowerShell\\\\v1.0\\\\Modules\\\\Microsoft.PowerShell.Archive\\\\Microsoft.PowerShell.Archive.psm1*))))`"}
