{"id":"1ddc1472-8e52-4f7d-9f11-eab14fc171f5","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"PowerShell Decompress Commands","tags":["attack.defense_evasion","attack.t1140"],"interval":"5m","description":"A General detection for specific decompress commands in PowerShell logs. This could be an adversary decompressing files.","risk_score":47,"enabled":true,"severity":"informational","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.Payload:/.*[Ee][Xx][Pp][Aa][Nn][Dd]\\-[Aa][Rr][Cc][Hh][Ii][Vv][Ee].*/","rule_id":"1ddc1472-8e52-4f7d-9f11-eab14fc171f5","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/8","https://threathunterplaybook.com/evals/apt29/detections/4.A.3_09F29912-8E93-461E-9E89-3F06F6763383.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.Payload:*Expand\\-Archive*`"}
