{"id":"86b896ba-ffa1-4fea-83e3-ee28a4c915c7","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Stdin","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via Stdin in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/(?i).*(set).*&&\\s?set.*(environment|invoke|\\${?input).*&&.*\"/","rule_id":"86b896ba-ffa1-4fea-83e3-ee28a4c915c7","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:/(?i).*(set).*&&\\s?set.*(environment|invoke|\\${?input).*&&.*\"/`"}
