{"id":"b26647de-4feb-4283-af6b-6117661283c5","created_by":"frack113","name":"Powershell Suspicious Win32_PnPEntity","tags":["attack.discovery","attack.t1120"],"interval":"5m","description":"Adversaries may attempt to gather information about attached peripheral devices and components connected to a computer system.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Admin script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Pp][Nn][Pp][Ee][Nn][Tt][Ii][Tt][Yy].*/","rule_id":"b26647de-4feb-4283-af6b-6117661283c5","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1120/T1120.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*Win32_PnPEntity*`"}
