{"id":"05b3e303-faf0-4f4a-9b30-46cc13e69152","created_by":"frack113","name":"Powershell Trigger Profiles by Add_Content","tags":["attack.privilege_escalation","attack.t1546.013"],"interval":"5m","description":"Adversaries may gain persistence and elevate privileges by executing malicious content triggered by PowerShell profiles.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Aa][Dd][Dd]\\-[Cc][Oo][Nn][Tt][Ee][Nn][Tt].*/ AND powershell.file.script_block_text:/.*$[Pp][Rr][Oo][Ff][Ii][Ll][Ee].*/ AND powershell.file.script_block_text:/.*\\-[Vv][Aa][Ll][Uu][Ee].*/ AND powershell.file.script_block_text:(/.*[Ss][Tt][Aa][Rr][Tt]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*\\\"\\\".*/))","rule_id":"05b3e303-faf0-4f4a-9b30-46cc13e69152","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.013/T1546.013.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Add\\-Content* AND powershell.file.script_block_text:*$profile* AND powershell.file.script_block_text:*\\-Value* AND powershell.file.script_block_text:(*Start\\-Process* OR *\\\"\\\"*))`"}
