{"id":"36bed6b2-e9a0-4fff-beeb-413a92b86138","created_by":"frack113","name":"Suspicious Enumerate Active Directory Computers with Get-AdComputer","tags":["attack.discovery","attack.t1018"],"interval":"5m","description":"utilize Get-AdComputer to enumerate Computers within Active Directory.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Aa][Dd][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]\\ .*/ AND powershell.file.script_block_text:/.*\\-[Ff][Ii][Ll][Tt][Ee][Rr].*/)","rule_id":"36bed6b2-e9a0-4fff-beeb-413a92b86138","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Get\\-AdComputer\\ * AND powershell.file.script_block_text:*\\-Filter*)`"}
