{"id":"42821614-9264-4761-acfc-5772c3286f76","created_by":"oscd.community, @redcanary, Zach Stanford @svch0st","name":"Root Certificate Installed","tags":["attack.defense_evasion","attack.t1553.004"],"interval":"5m","description":"Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to test if GPO push doesn't trigger FP"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Mm][Oo][Vv][Ee]\\-[Ii][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:/.*[Cc][Ee][Rr][Tt]\\:\\\\[Ll][Oo][Cc][Aa][Ll][Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Rr][Oo][Oo][Tt].*/) OR (powershell.file.script_block_text:/.*[Ii][Mm][Pp][Oo][Rr][Tt]\\-[Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee].*/ AND powershell.file.script_block_text:/.*[Cc][Ee][Rr][Tt]\\:\\\\[Ll][Oo][Cc][Aa][Ll][Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Rr][Oo][Oo][Tt].*/))","rule_id":"42821614-9264-4761-acfc-5772c3286f76","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*Move\\-Item* AND powershell.file.script_block_text:*Cert\\:\\\\LocalMachine\\\\Root*) OR (powershell.file.script_block_text:*Import\\-Certificate* AND powershell.file.script_block_text:*Cert\\:\\\\LocalMachine\\\\Root*))`"}
