{"id":"cef24b90-dddc-4ae1-a09a-8764872f69fc","created_by":"frack113","name":"Suspicious Get Local Groups Information","tags":["attack.discovery","attack.t1069.001"],"interval":"5m","description":"Adversaries may attempt to find local system groups and permission settings.\nThe knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.\nAdversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:(/.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/) OR winlog.event_data.ContextInfo:(/.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/) OR (winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND winlog.event_data.Payload:/.*[Ww][Ii][Nn]32_[Gg][Rr][Oo][Uu][Pp].*/) OR (winlog.event_data.ContextInfo:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND winlog.event_data.ContextInfo:/.*[Ww][Ii][Nn]32_[Gg][Rr][Oo][Uu][Pp].*/))","rule_id":"cef24b90-dddc-4ae1-a09a-8764872f69fc","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:(*get\\-localgroup* OR *Get\\-LocalGroupMember*) OR winlog.event_data.ContextInfo:(*get\\-localgroup* OR *Get\\-LocalGroupMember*) OR (winlog.event_data.Payload:*Get\\-WMIObject* AND winlog.event_data.Payload:*Win32_Group*) OR (winlog.event_data.ContextInfo:*Get\\-WMIObject* AND winlog.event_data.ContextInfo:*Win32_Group*))`"}
