{"id":"6c6c6282-7671-4fe9-a0ce-a2dcebdc342b","created_by":"frack113","name":"Powershell XML Execute Command","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Adversaries may abuse PowerShell commands and scripts for execution.\nPowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. (Citation: TechNet PowerShell)\nAdversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Xx][Mm][Ll]\\.[Xx][Mm][Ll][Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt].*/ AND powershell.file.script_block_text:/.*\\.[Ll][Oo][Aa][Dd].*/) AND \\*.keyword:(/.*[Ii][Ee][Xx].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Xx][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn].*/))","rule_id":"6c6c6282-7671-4fe9-a0ce-a2dcebdc342b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-8---powershell-xml-requests"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*System.Xml.XmlDocument* AND powershell.file.script_block_text:*.Load*) AND \\*.keyword:(*IEX* OR *Invoke\\-Expression*))`"}
