{"id":"a23791fe-8846-485a-b16b-ca691e1b03d4","created_by":"Timur Zinniatullin, oscd.community","name":"Invoke-Obfuscation RUNDLL LAUNCHER","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via RUNDLL LAUNCHER","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND winlog.event_data.Payload:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND winlog.event_data.Payload:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND winlog.event_data.Payload:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/)","rule_id":"a23791fe-8846-485a-b16b-ca691e1b03d4","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:*rundll32.exe* AND winlog.event_data.Payload:*shell32.dll* AND winlog.event_data.Payload:*shellexec_rundll* AND winlog.event_data.Payload:*powershell*)`"}
