{"id":"b7216a7d-687e-4c8d-82b1-3080b2ad961f","created_by":"frack113","name":"Modify Group Policy Settings - ScriptBlockLogging","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1484.001"],"interval":"5m","description":"Detect malicious GPO modifications can be used to implement many other malicious behaviors.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm].*/ AND powershell.file.script_block_text:(/.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Dd][Cc].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Oo][Ff][Ff][Ss][Ee][Tt][Dd][Cc].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Oo][Ff][Ff][Ss][Ee][Tt].*/ OR /.*[Ee][Nn][Aa][Bb][Ll][Ee][Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn].*/ OR /.*[Ss][Hh][Ee][Ll][Ll][Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn][Ll][Ee][Vv][Ee][Ll].*/))","rule_id":"b7216a7d-687e-4c8d-82b1-3080b2ad961f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1484.001/T1484.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System* AND powershell.file.script_block_text:(*GroupPolicyRefreshTimeDC* OR *GroupPolicyRefreshTimeOffsetDC* OR *GroupPolicyRefreshTime* OR *GroupPolicyRefreshTimeOffset* OR *EnableSmartScreen* OR *ShellSmartScreenLevel*))`"}
