{"id":"363eccc0-279a-4ccf-a3ab-24c2e63b11fb","created_by":"frack113","name":"Powershell Create Scheduled Task","tags":["attack.persistence","attack.t1053.005"],"interval":"5m","description":"Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Nn][Ee][Ww]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk][Aa][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Nn][Ee][Ww]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk][Tt][Rr][Ii][Gg][Gg][Ee][Rr].*/ OR /.*[Nn][Ee][Ww]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk][Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll].*/ OR /.*[Nn][Ee][Ww]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss][Ss][Ee][Tt].*/ OR /.*[Nn][Ee][Ww]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk].*/ OR /.*[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk].*/) OR (powershell.file.script_block_text:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Ii][Mm][Mm][Ee][Tt][Hh][Oo][Dd].*/ AND powershell.file.script_block_text:/.*\\-[Cc][Ll][Aa][Ss][Ss][Nn][Aa][Mm][Ee].*/ AND powershell.file.script_block_text:/.*[Pp][Ss]_[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk].*/ AND powershell.file.script_block_text:/.*\\-[Nn][Aa][Mm][Ee][Ss][Pp][Aa][Cc][Ee].*/ AND powershell.file.script_block_text:/.*[Rr][Oo][Oo][Tt]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Aa][Ss][Kk][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/))","rule_id":"363eccc0-279a-4ccf-a3ab-24c2e63b11fb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*New\\-ScheduledTaskAction* OR *New\\-ScheduledTaskTrigger* OR *New\\-ScheduledTaskPrincipal* OR *New\\-ScheduledTaskSettingsSet* OR *New\\-ScheduledTask* OR *Register\\-ScheduledTask*) OR (powershell.file.script_block_text:*Invoke\\-CimMethod* AND powershell.file.script_block_text:*\\-ClassName* AND powershell.file.script_block_text:*PS_ScheduledTask* AND powershell.file.script_block_text:*\\-NameSpace* AND powershell.file.script_block_text:*Root\\\\Microsoft\\\\Windows\\\\TaskScheduler*))`"}
