{"id":"20e5497e-331c-4cd5-8d36-935f6e2a9a07","created_by":"Timur Zinniatullin, oscd.community","name":"Invoke-Obfuscation COMPRESS OBFUSCATION","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via COMPRESS OBFUSCATION","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Tt][Ee][Xx][Tt]\\.[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg]\\]\\:\\:[Aa][Ss][Cc][Ii][Ii].*/ AND powershell.file.script_block_text:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn]\\.[Dd][Ee][Ff][Ll][Aa][Tt][Ee][Ss][Tt][Rr][Ee][Aa][Mm].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Ss][Tt][Rr][Ee][Aa][Mm][Rr][Ee][Aa][Dd][Ee][Rr].*/) AND powershell.file.script_block_text:/.*[Rr][Ee][Aa][Dd][Tt][Oo][Ee][Nn][Dd]/)","rule_id":"20e5497e-331c-4cd5-8d36-935f6e2a9a07","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*new\\-object* AND powershell.file.script_block_text:*text.encoding\\]\\:\\:ascii* AND powershell.file.script_block_text:(*system.io.compression.deflatestream* OR *system.io.streamreader*) AND powershell.file.script_block_text:*readtoend)`"}
