{"id":"fa6a5a45-3ee2-4529-aa14-ee5edc9e29cb","created_by":"frack113","name":"Suspicious Get Local Groups Information","tags":["attack.discovery","attack.t1069.001"],"interval":"5m","description":"Adversaries may attempt to find local system groups and permission settings.\nThe knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.\nAdversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:(/.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ OR /.*[Gg][Ee][Tt]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr].*/) OR (powershell.file.script_block_text:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Gg][Rr][Oo][Uu][Pp].*/))","rule_id":"fa6a5a45-3ee2-4529-aa14-ee5edc9e29cb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:(*get\\-localgroup* OR *Get\\-LocalGroupMember*) OR (powershell.file.script_block_text:*Get\\-WMIObject* AND powershell.file.script_block_text:*Win32_Group*))`"}
