{"id":"c6438007-e081-42ce-9483-b067fbef33c3","created_by":"frack113","name":"Powershell Timestomp","tags":["attack.defense_evasion","attack.t1070.006"],"interval":"5m","description":"Adversaries may modify file time attributes to hide new or changes to existing files. Timestomping is a technique that modifies the timestamps of a file (the modify, access, create, and change times), often to mimic files that are in the same folder.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate admin script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*\\.[Cc][Rr][Ee][Aa][Tt][Ii][Oo][Nn][Tt][Ii][Mm][Ee]\\ \\=.*/ OR /.*\\.[Ll][Aa][Ss][Tt][Ww][Rr][Ii][Tt][Ee][Tt][Ii][Mm][Ee]\\ \\=.*/ OR /.*\\.[Ll][Aa][Ss][Tt][Aa][Cc][Cc][Ee][Ss][Ss][Tt][Ii][Mm][Ee]\\ \\=.*/ OR /.*\\[[Ii][Oo]\\.[Ff][Ii][Ll][Ee]\\]\\:\\:[Ss][Ee][Tt][Cc][Rr][Ee][Aa][Tt][Ii][Oo][Nn][Tt][Ii][Mm][Ee].*/ OR /.*\\[[Ii][Oo]\\.[Ff][Ii][Ll][Ee]\\]\\:\\:[Ss][Ee][Tt][Ll][Aa][Ss][Tt][Aa][Cc][Cc][Ee][Ss][Ss][Tt][Ii][Mm][Ee].*/ OR /.*\\[[Ii][Oo]\\.[Ff][Ii][Ll][Ee]\\]\\:\\:[Ss][Ee][Tt][Ll][Aa][Ss][Tt][Ww][Rr][Ii][Tt][Ee][Tt][Ii][Mm][Ee].*/)","rule_id":"c6438007-e081-42ce-9483-b067fbef33c3","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md","https://www.offensive-security.com/metasploit-unleashed/timestomp/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*.CreationTime\\ \\=* OR *.LastWriteTime\\ \\=* OR *.LastAccessTime\\ \\=* OR *\\[IO.File\\]\\:\\:SetCreationTime* OR *\\[IO.File\\]\\:\\:SetLastAccessTime* OR *\\[IO.File\\]\\:\\:SetLastWriteTime*)`"}
