{"id":"6942bd25-5970-40ab-af49-944247103358","created_by":"frack113","name":"Suspicious Get Information for SMB Share","tags":["attack.discovery","attack.t1069.001"],"interval":"5m","description":"Adversaries may look for folders and drives shared on remote systems as a means of identifying sources of information to gather as a precursor for Collection and to identify potential systems of interest for Lateral Movement.\nNetworks often contain shared network drives and folders that enable users to access file directories on various systems across a network.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Payload:/.*[Gg][Ee][Tt]\\-[Ss][Mm][Bb][Ss][Hh][Aa][Rr][Ee].*/ OR winlog.event_data.ContextInfo:/.*[Gg][Ee][Tt]\\-[Ss][Mm][Bb][Ss][Hh][Aa][Rr][Ee].*/)","rule_id":"6942bd25-5970-40ab-af49-944247103358","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Payload:*get\\-smbshare* OR winlog.event_data.ContextInfo:*get\\-smbshare*)`"}
