{"id":"64e8e417-c19a-475a-8d19-98ea705394cc","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Alternate PowerShell Hosts","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Programs using PowerShell directly without invocation of a dedicated interpreter","MSP Detection Searcher","Citrix ConfigSync.ps1"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.ContextInfo:/.*/ AND (NOT ((winlog.event_data.ContextInfo:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee].*/) OR (winlog.event_data.ContextInfo:/.*[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc][Rr][Uu][Nn]\\.[Ee][Xx][Ee].*/) OR (winlog.event_data.ContextInfo:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ss][Aa][Cc]\\.[Ee][Xx][Ee].*/) OR (winlog.event_data.ContextInfo:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg].*/))))","rule_id":"64e8e417-c19a-475a-8d19-98ea705394cc","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.ContextInfo:* AND (NOT ((winlog.event_data.ContextInfo:*powershell.exe*) OR (winlog.event_data.ContextInfo:*ConfigSyncRun.exe*) OR (winlog.event_data.ContextInfo:*C\\:\\\\Windows\\\\system32\\\\dsac.exe*) OR (winlog.event_data.ContextInfo:*C\\:\\\\Windows\\\\system32\\\\wsmprovhost.exe\\ \\-Embedding*))))`"}
