{"id":"602f5669-6927-4688-84db-0d4b7afb2150","created_by":"Ali Alwashali","name":"Disable Powershell Command History","tags":["attack.defense_evasion","attack.t1070.003"],"interval":"5m","description":"Detects scripts or commands that disabled the Powershell command history by removing psreadline module","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate script that disables the command history"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Mm][Oo][Dd][Uu][Ll][Ee].*/ AND powershell.file.script_block_text:/.*[Pp][Ss][Rr][Ee][Aa][Dd][Ll][Ii][Nn][Ee].*/)","rule_id":"602f5669-6927-4688-84db-0d4b7afb2150","timestamp_override":"event.ingested","references":["https://twitter.com/DissectMalware/status/1062879286749773824"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*Remove\\-Module* AND powershell.file.script_block_text:*psreadline*)`"}
