{"id":"b366adb4-d63d-422d-8a2c-186463b5ded0","created_by":"frack113","name":"Use Get-NetTCPConnection","tags":["attack.discovery","attack.t1049"],"interval":"5m","description":"Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Gg][Ee][Tt]\\-[Nn][Ee][Tt][Tt][Cc][Pp][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/","rule_id":"b366adb4-d63d-422d-8a2c-186463b5ded0","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-2---system-network-connections-discovery-with-powershell"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*Get\\-NetTCPConnection*`"}
