{"id":"b7ec41a4-042c-4f31-a5db-d0fcde9fa5c5","created_by":"Sean Metcalf (source), Florian Roth (rule)","name":"PowerShell PSAttack","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the use of PSAttack PowerShell hack tool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:/.*[Pp][Ss]\\ [Aa][Tt][Tt][Aa][Cc][Kk]\\!\\!\\!.*/","rule_id":"b7ec41a4-042c-4f31-a5db-d0fcde9fa5c5","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2921"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:*PS\\ ATTACK\\!\\!\\!*`"}
