{"id":"bf72941a-cba0-41ea-b18c-9aca3925690d","created_by":"Bhabesh Raj","name":"PowerShell ADRecon Execution","tags":["attack.discovery","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects execution of ADRecon.ps1 for AD reconnaissance which has been reported to be actively used by FIN7","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"powershell.file.script_block_text:(/.*[Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn]\\ [Gg][Ee][Tt]\\-[Aa][Dd][Rr][Ee][Xx][Cc][Ee][Ll][Cc][Oo][Mm][Oo][Bb].*/ OR /.*[Gg][Ee][Tt]\\-[Aa][Dd][Rr][Gg][Pp][Oo].*/ OR /.*[Gg][Ee][Tt]\\-[Aa][Dd][Rr][Dd][Oo][Mm][Aa][Ii][Nn][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr].*/ OR /.*[Aa][Dd][Rr][Ee][Cc][Oo][Nn]\\-[Rr][Ee][Pp][Oo][Rr][Tt]\\.[Xx][Ll][Ss][Xx].*/)","rule_id":"bf72941a-cba0-41ea-b18c-9aca3925690d","timestamp_override":"event.ingested","references":["https://github.com/sense-of-security/ADRecon/blob/11881a24e9c8b207f31b56846809ce1fb189bcc9/ADRecon.ps1","https://bi-zone.medium.com/from-pentest-to-apt-attack-cybercriminal-group-fin7-disguises-its-malware-as-an-ethical-hackers-c23c9a75e319"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`powershell.file.script_block_text:(*Function\\ Get\\-ADRExcelComOb* OR *Get\\-ADRGPO* OR *Get\\-ADRDomainController* OR *ADRecon\\-Report.xlsx*)`"}
