{"id":"1f6399cf-2c80-4924-ace1-6fcff3393480","created_by":"frack113","name":"DirectorySearcher Powershell Exploitation","tags":["attack.discovery","attack.t1018"],"interval":"5m","description":"Enumerates Active Directory to determine computers that are joined to the domain","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(powershell.file.script_block_text:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ .*/ AND powershell.file.script_block_text:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ss][Ee][Aa][Rr][Cc][Hh][Ee][Rr].*/ AND powershell.file.script_block_text:/.*\\.[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Ii][Ee][Ss][Tt][Oo][Ll][Oo][Aa][Dd]\\.[Aa][Dd][Dd].*/ AND powershell.file.script_block_text:/.*\\.[Ff][Ii][Nn][Dd][Aa][Ll][Ll]\\(\\).*/ AND powershell.file.script_block_text:/.*[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Ii][Ee][Ss]\\.[Nn][Aa][Mm][Ee].*/)","rule_id":"1f6399cf-2c80-4924-ace1-6fcff3393480","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md#atomic-test-15---enumerate-domain-computers-within-active-directory-using-directorysearcher"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(powershell.file.script_block_text:*New\\-Object\\ * AND powershell.file.script_block_text:*System.DirectoryServices.DirectorySearcher* AND powershell.file.script_block_text:*.PropertiesToLoad.Add* AND powershell.file.script_block_text:*.findall\\(\\)* AND powershell.file.script_block_text:*Properties.name*)`"}
