{"id":"8518ed3d-f7c9-4601-a26c-f361a4256a0c","created_by":"Florian Roth","name":"Bitsadmin Download from Suspicious Domain","tags":["attack.defense_evasion","attack.persistence","attack.t1197","attack.s0190","attack.t1036.003"],"interval":"5m","description":"Detects usage of bitsadmin downloading a file from a suspicious domain","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Some legitimate apps use this, but limited."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*[Rr][Aa][Ww]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Ii][Ss][Tt]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*\\.[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*\\.[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*\\.[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo]\\/.*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/))","rule_id":"8518ed3d-f7c9-4601-a26c-f361a4256a0c","timestamp_override":"event.ingested","references":["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin","https://isc.sans.edu/diary/22264","https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\bitsadmin.exe AND process.command_line:(*\\ \\/transfer\\ * OR *\\ \\/create\\ * OR *\\ \\/addfile\\ *) AND process.command_line:(*raw.githubusercontent.com* OR *gist.githubusercontent.com* OR *pastebin.com* OR *cdn.discordapp.com\\/attachments\\/* OR *mediafire.com* OR *mega.nz* OR *ddns.net* OR *.paste.ee* OR *.hastebin.com* OR *.ghostbin.co\\/* OR *ufile.io* OR *storage.googleapis.com* OR *anonfiles.com* OR *send.exploit.in* OR *transfer.sh*))`"}
