{"id":"e6c54d94-498c-4562-a37c-b469d8e9a275","created_by":"Florian Roth","name":"Suspicious PowerShell Download and Execute Pattern","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensitive)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software installers that pull packages from remote systems and execute them"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ii][Ee][Xx]\\ \\(\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ii][Ee][Xx]\\ \\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ii][Ee][Xx]\\(\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ii][Ee][Xx]\\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\ \\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ \\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\ \\-[Cc]\\ \\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/)","rule_id":"e6c54d94-498c-4562-a37c-b469d8e9a275","timestamp_override":"event.ingested","references":["https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*IEX\\ \\(\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\ \\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\(\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *\\ \\-command\\ \\(New\\-Object\\ System.Net.WebClient\\).DownloadFile\\(* OR *\\ \\-c\\ \\(New\\-Object\\ System.Net.WebClient\\).DownloadFile\\(*)`"}
