{"id":"c363385c-f75d-4753-a108-c1a8e28bdbda","created_by":"oscd.community, Natalia Shornikova","name":"Suspicious Usage of the Manage-bde.wsf Script","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects a usage of the manage-bde.wsf script that may indicate an attempt of proxy execution from script","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ AND process.command_line:/.*[Mm][Aa][Nn][Aa][Gg][Ee]\\-[Bb][Dd][Ee]\\.[Ww][Ss][Ff].*/)","rule_id":"c363385c-f75d-4753-a108-c1a8e28bdbda","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/","https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712","https://twitter.com/bohops/status/980659399495741441","https://twitter.com/JohnLaTwC/status/1223292479270600706","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*cscript* AND process.command_line:*manage\\-bde.wsf*)`"}
