{"id":"0fc35fc3-efe6-4898-8a37-0b233339524f","created_by":"frack113","name":"Suspicious ScreenSave Change by Reg.exe","tags":["attack.privilege_escalation","attack.t1546.002"],"interval":"5m","description":"Adversaries may establish persistence by executing malicious content triggered by user inactivity.\nScreensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["GPO"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Hh][Kk][Ee][Yy]_[Cc][Uu][Rr][Rr][Ee][Nn][Tt]_[Uu][Ss][Ee][Rr]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp].*/ OR /.*[Hh][Kk][Cc][Uu]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp].*/)) AND ((process.command_line:/.*\\/[Vv]\\ [Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Aa][Cc][Tt][Ii][Vv][Ee].*/ AND process.command_line:/.*\\/[Tt]\\ [Rr][Ee][Gg]_[Ss][Zz].*/ AND process.command_line:/.*\\/[Dd]\\ 1.*/ AND process.command_line:/.*\\/[Ff].*/) OR (process.command_line:/.*\\/[Vv]\\ [Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Tt][Ii][Mm][Ee][Oo][Uu][Tt].*/ AND process.command_line:/.*\\/[Tt]\\ [Rr][Ee][Gg]_[Ss][Zz].*/ AND process.command_line:/.*\\/[Dd]\\ .*/ AND process.command_line:/.*\\/[Ff].*/) OR (process.command_line:/.*\\/[Vv]\\ [Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Rr][Ii][Ss][Ss][Ee][Cc][Uu][Rr][Ee].*/ AND process.command_line:/.*\\/[Tt]\\ [Rr][Ee][Gg]_[Ss][Zz].*/ AND process.command_line:/.*\\/[Dd]\\ 0.*/ AND process.command_line:/.*\\/[Ff].*/) OR (process.command_line:/.*\\/[Vv]\\ [Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\/[Tt]\\ [Rr][Ee][Gg]_[Ss][Zz].*/ AND process.command_line:/.*\\/[Dd]\\ .*/ AND process.command_line:/.*\\.[Ss][Cc][Rr].*/ AND process.command_line:/.*\\/[Ff].*/)))","rule_id":"0fc35fc3-efe6-4898-8a37-0b233339524f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md","https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe AND process.command_line:(*HKEY_CURRENT_USER\\\\Control\\ Panel\\\\Desktop* OR *HKCU\\\\Control\\ Panel\\\\Desktop*)) AND ((process.command_line:*\\/v\\ ScreenSaveActive* AND process.command_line:*\\/t\\ REG_SZ* AND process.command_line:*\\/d\\ 1* AND process.command_line:*\\/f*) OR (process.command_line:*\\/v\\ ScreenSaveTimeout* AND process.command_line:*\\/t\\ REG_SZ* AND process.command_line:*\\/d\\ * AND process.command_line:*\\/f*) OR (process.command_line:*\\/v\\ ScreenSaverIsSecure* AND process.command_line:*\\/t\\ REG_SZ* AND process.command_line:*\\/d\\ 0* AND process.command_line:*\\/f*) OR (process.command_line:*\\/v\\ SCRNSAVE.EXE* AND process.command_line:*\\/t\\ REG_SZ* AND process.command_line:*\\/d\\ * AND process.command_line:*.scr* AND process.command_line:*\\/f*)))`"}
