{"id":"cd764533-2e07-40d6-a718-cfeec7f2da7f","created_by":"Florian Roth","name":"Renamed SysInternals Debug View","tags":["attack.resource_development","attack.t1588.002"],"interval":"5m","description":"Detects suspicious renamed SysInternals DebugView execution","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.product:(/[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]\\ [Dd][Ee][Bb][Uu][Gg][Vv][Ii][Ee][Ww]/ OR /[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]\\ [Dd][Ee][Bb][Uu][Gg][Vv][Ii][Ee][Ww]/) AND (NOT (process.pe.original_file_name:/[Dd][Bb][Gg][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Dd][Bb][Gg][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/)))","rule_id":"cd764533-2e07-40d6-a718-cfeec7f2da7f","timestamp_override":"event.ingested","references":["https://www.epicturla.com/blog/sysinturla"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.product:(Sysinternals\\ DebugView OR Sysinternals\\ Debugview) AND (NOT (process.pe.original_file_name:Dbgview.exe AND process.executable:*\\\\Dbgview.exe)))`"}
