{"id":"1c67a717-32ba-409b-a45d-0fb704a73a81","created_by":"frack113","name":"Suspicious Listing of Network Connections","tags":["attack.discovery","attack.t1049"],"interval":"5m","description":"Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ee][Tt][Ss][Tt][Aa][Tt].*/ OR (process.command_line:/.*[Nn][Ee][Tt]\\ .*/ AND (process.command_line:(/.*\\ [Uu][Ss][Ee]/ OR /.*\\ [Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]/) OR process.command_line:(/.*\\ [Uu][Ss][Ee]\\ .*/ OR /.*\\ [Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]\\ .*/))))","rule_id":"1c67a717-32ba-409b-a45d-0fb704a73a81","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*netstat* OR (process.command_line:*net\\ * AND (process.command_line:(*\\ use OR *\\ sessions) OR process.command_line:(*\\ use\\ * OR *\\ sessions\\ *))))`"}
