{"id":"5f6a601c-2ecb-498b-9c33-660362323afa","created_by":"Nasreddine Bencherchali","name":"Root Certificate Installed From Susp Locations","tags":["attack.defense_evasion","attack.t1553.004"],"interval":"5m","description":"Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ii][Mm][Pp][Oo][Rr][Tt]\\-[Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee].*/ AND process.command_line:/.*\\ \\-[Ff][Ii][Ll][Ee]\\-[Pp][Aa][Tt][Hh]\\ .*/ AND process.command_line:/.*[Cc][Ee][Rr][Tt]\\:\\\\[Ll][Oo][Cc][Aa][Ll][Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Rr][Oo][Oo][Tt].*/ AND process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/))","rule_id":"5f6a601c-2ecb-498b-9c33-660362323afa","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/","https://docs.microsoft.com/en-us/powershell/module/pki/import-certificate?view=windowsserver2022-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Import\\-Certificate* AND process.command_line:*\\ \\-File\\-Path\\ * AND process.command_line:*Cert\\:\\\\LocalMachine\\\\Root* AND process.command_line:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Perflogs\\\\* OR *C\\:\\\\Users\\\\Public\\\\*))`"}
