{"id":"01aeb693-138d-49d2-9403-c4f52d7d3d62","created_by":"Sander Wiebing","name":"Netsh RDP Port Opening","tags":["attack.defense_evasion","attack.t1562.004"],"interval":"5m","description":"Detects netsh commands that opens the port 3389 used for RDP, used in Sarwent Malware","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Nn][Ee][Tt][Ss][Hh].*/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Aa][Dd][Dd]\\ [Pp][Oo][Rr][Tt][Oo][Pp][Ee][Nn][Ii][Nn][Gg].*/ AND process.command_line:/.*[Tt][Cc][Pp]\\ 3389.*/) OR (process.command_line:/.*[Nn][Ee][Tt][Ss][Hh].*/ AND process.command_line:/.*[Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Aa][Dd][Dd]\\ [Rr][Uu][Ll][Ee].*/ AND process.command_line:/.*[Aa][Cc][Tt][Ii][Oo][Nn]\\=[Aa][Ll][Ll][Oo][Ww].*/ AND process.command_line:/.*[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll]\\=[Tt][Cc][Pp].*/ AND process.command_line:/.*[Ll][Oo][Cc][Aa][Ll][Pp][Oo][Rr][Tt]\\=3389.*/))","rule_id":"01aeb693-138d-49d2-9403-c4f52d7d3d62","timestamp_override":"event.ingested","references":["https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*netsh* AND process.command_line:*firewall\\ add\\ portopening* AND process.command_line:*tcp\\ 3389*) OR (process.command_line:*netsh* AND process.command_line:*advfirewall\\ firewall\\ add\\ rule* AND process.command_line:*action\\=allow* AND process.command_line:*protocol\\=TCP* AND process.command_line:*localport\\=3389*))`"}
