{"id":"0acaad27-9f02-4136-a243-c357202edd74","created_by":"Vasiliy Burov","name":"Ryuk Ransomware","tags":["attack.execution","attack.t1204"],"interval":"5m","description":"Detects Ryuk Ransomware command lines","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ss][Tt][Oo][Pp].*/ AND process.command_line:(/.*[Ss][Aa][Mm][Ss][Ss].*/ OR /.*[Aa][Uu][Dd][Ii][Oo][Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt][Bb][Uu][Ii][Ll][Dd][Ee][Rr].*/ OR /.*[Uu][Nn][Ii][Ss][Tt][Oo][Rr][Ee][Ss][Vv][Cc]_\\?\\?\\?\\?\\?.*/))","rule_id":"0acaad27-9f02-4136-a243-c357202edd74","timestamp_override":"event.ingested","references":["https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*stop* AND process.command_line:(*samss* OR *audioendpointbuilder* OR *unistoresvc_?????*))`"}
