{"id":"15c7904e-6ad1-4a45-9b46-5fb25df37fd2","created_by":"Agro (@agro_sev), Ensar Şamil (@sblmsrsn), oscd.community","name":"Malicious PE Execution by Microsoft Visual Studio Debugger","tags":["attack.t1218","attack.defense_evasion"],"interval":"5m","description":"There is an option for a MS VS Just-In-Time Debugger \"vsjitdebugger.exe\" to launch specified executable and attach a debugger. This option may be used adversaries to execute malicious code by signed verified binary. The debugger is installed alongside with Microsoft Visual Studio package.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["The process spawned by vsjitdebugger.exe is uncommon."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Vv][Ss][Jj][Ii][Tt][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ AND (NOT ((process.executable:/.*\\\\[Vv][Ss][Ii][Mm][Mm][Ee][Rr][Ss][Ii][Vv][Ee][Aa][Cc][Tt][Ii][Vv][Aa][Tt][Ee][Hh][Ee][Ll][Pp][Ee][Rr].*\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Dd][Ee][Vv][Ee][Nn][Vv]\\.[Ee][Xx][Ee]/))))","rule_id":"15c7904e-6ad1-4a45-9b46-5fb25df37fd2","timestamp_override":"event.ingested","references":["https://twitter.com/pabraeken/status/990758590020452353","https://lolbas-project.github.io/lolbas/OtherMSBinaries/Vsjitdebugger/","https://docs.microsoft.com/en-us/visualstudio/debugger/debug-using-the-just-in-time-debugger?view=vs-2019"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\vsjitdebugger.exe AND (NOT ((process.executable:*\\\\vsimmersiveactivatehelper*.exe OR process.executable:*\\\\devenv.exe))))`"}
