{"id":"ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31","created_by":"Florian Roth","name":"Ngrok Usage","tags":["attack.command_and_control","attack.t1572"],"interval":"5m","description":"Detects the use of Ngrok, a utility used for port forwarding and tunneling, often used by threat actors to make local protected services publicly available. Involved domains are bin.equinox.io for download and *.ngrok.io for connections.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Another tool that uses the command line switches of Ngrok","Ngrok http 3978 (https://docs.microsoft.com/en-us/azure/bot-service/bot-service-debug-channel-ngrok?view=azure-bot-service-4.0)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ [Tt][Cc][Pp]\\ 139.*/ OR /.*\\ [Tt][Cc][Pp]\\ 445.*/ OR /.*\\ [Tt][Cc][Pp]\\ 3389.*/ OR /.*\\ [Tt][Cc][Pp]\\ 5985.*/ OR /.*\\ [Tt][Cc][Pp]\\ 5986.*/) OR (process.command_line:/.*\\ [Ss][Tt][Aa][Rr][Tt]\\ .*/ AND process.command_line:/.*\\-\\-[Aa][Ll][Ll].*/ AND process.command_line:/.*\\-\\-[Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*\\.[Yy][Mm][Ll].*/) OR (process.executable:/.*[Nn][Gg][Rr][Oo][Kk]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ [Tt][Cc][Pp]\\ .*/ OR /.*\\ [Hh][Tt][Tt][Pp]\\ .*/ OR /.*\\ [Aa][Uu][Tt][Hh][Tt][Oo][Kk][Ee][Nn]\\ .*/)))","rule_id":"ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31","timestamp_override":"event.ingested","references":["https://ngrok.com/docs","https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html","https://stackoverflow.com/questions/42442320/ssh-tunnel-to-ngrok-and-initiate-rdp","https://www.virustotal.com/gui/file/58d21840d915aaf4040ceb89522396124c82f325282f805d1085527e1e2ccfa1/detection","https://cybleinc.com/2021/02/15/ngrok-platform-abused-by-hackers-to-deliver-a-new-wave-of-phishing-attacks/."],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ tcp\\ 139* OR *\\ tcp\\ 445* OR *\\ tcp\\ 3389* OR *\\ tcp\\ 5985* OR *\\ tcp\\ 5986*) OR (process.command_line:*\\ start\\ * AND process.command_line:*\\-\\-all* AND process.command_line:*\\-\\-config* AND process.command_line:*.yml*) OR (process.executable:*ngrok.exe AND process.command_line:(*\\ tcp\\ * OR *\\ http\\ * OR *\\ authtoken\\ *)))`"}
