{"id":"e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e","created_by":"frack113","name":"Disable Windows IIS HTTP Logging","tags":["attack.defense_evasion","attack.t1562.002"],"interval":"5m","description":"Disables HTTP logging on a Windows IIS web server as seen by Threat Group 3390 (Bronze Union)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Pp][Pp][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Ee][Tt].*/ AND process.command_line:/.*[Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*\\/[Ss][Ee][Cc][Tt][Ii][Oo][Nn]\\:[Hh][Tt][Tt][Pp][Ll][Oo][Gg][Gg][Ii][Nn][Gg].*/ AND process.command_line:/.*\\/[Dd][Oo][Nn][Tt][Ll][Oo][Gg]\\:[Tt][Rr][Uu][Ee].*/)","rule_id":"e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.002/T1562.002.md#atomic-test-1---disable-windows-iis-http-logging"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\appcmd.exe AND process.command_line:*set* AND process.command_line:*config* AND process.command_line:*\\/section\\:httplogging* AND process.command_line:*\\/dontLog\\:true*)`"}
