{"id":"45239e6a-b035-4aaf-b339-8ad379fcb67e","created_by":"Nasreddine Bencherchali","name":"Use of Squirrel.exe","tags":["attack.defense_evasion","attack.execution"],"interval":"5m","description":"The \"Squirrel.exe\" binary that is part of multiple software (Slack, Teams, Discord...etc) can be used as a LOLBIN","risk_score":47,"enabled":true,"severity":"medium","false_positives":["See rule (fa4b21c9-0057-4493-b289-2556416ae4d7) for possible FPs"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Qq][Uu][Ii][Rr][Rr][Ee][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\-\\-[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\ .*/ OR /.*\\ \\-\\-[Uu][Pp][Dd][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\-\\-[Uu][Pp][Dd][Aa][Tt][Ee][Rr][Oo][Ll][Ll][Bb][Aa][Cc][Kk]\\=.*/) AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/)","rule_id":"45239e6a-b035-4aaf-b339-8ad379fcb67e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\squirrel.exe AND process.command_line:(*\\ \\-\\-download\\ * OR *\\ \\-\\-update\\ * OR *\\ \\-\\-updateRollback\\=*) AND process.command_line:*http*)`"}
