{"id":"cafeeba3-01da-4ab4-b6c4-a31b1d9730c7","created_by":"frack113","name":"PrintBrm ZIP Creation of Extraction","tags":["attack.command_and_control","attack.t1105","attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Detects the execution of the LOLBIN PrintBrm.exe, which can be used to create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Rr][Ii][Nn][Tt][Bb][Rr][Mm]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Ff].*/ AND process.command_line:/.*\\.[Zz][Ii][Pp].*/)","rule_id":"cafeeba3-01da-4ab4-b6c4-a31b1d9730c7","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\PrintBrm.exe AND process.command_line:*\\ \\-f* AND process.command_line:*.zip*)`"}
