{"id":"0152550d-3a26-4efd-9f0e-54a0b28ae2f3","created_by":"Agro (@agro_sev) oscd.community","name":"Detection of PowerShell Execution via Sqlps.exe","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1127"],"interval":"5m","description":"This rule detects execution of a PowerShell code through the sqlps.exe utility, which is included in the standard set of utilities supplied with the MSSQL Server. Script blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe spawned by sqlagent.exe is a legitimate action."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/ OR process.parent.executable:/.*\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/) AND (NOT (process.parent.executable:/.*\\\\[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/)))","rule_id":"0152550d-3a26-4efd-9f0e-54a0b28ae2f3","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15","https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/","https://twitter.com/bryon_/status/975835709587075072"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sqlps.exe OR process.parent.executable:*\\\\sqlps.exe OR process.pe.original_file_name:\\\\sqlps.exe) AND (NOT (process.parent.executable:*\\\\sqlagent.exe)))`"}
