{"id":"455b9d50-15a1-4b99-853f-8d37655a4c1b","created_by":"frack113","name":"Suspicious AdFind Enumeration","tags":["attack.discovery","attack.t1087.002"],"interval":"5m","description":"Detects the execution of a AdFind for enumeration based on it's commadline flags","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Ll][Oo][Cc][Kk][Oo][Uu][Tt][Dd][Uu][Rr][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ll][Oo][Cc][Kk][Oo][Uu][Tt][Tt][Hh][Rr][Ee][Ss][Hh][Oo][Ll][Dd].*/ OR /.*[Ll][Oo][Cc][Kk][Oo][Uu][Tt][Oo][Bb][Ss][Ee][Rr][Vv][Aa][Tt][Ii][Oo][Nn][Ww][Ii][Nn][Dd][Oo][Ww].*/ OR /.*[Mm][Aa][Xx][Pp][Ww][Dd][Aa][Gg][Ee].*/ OR /.*[Mm][Ii][Nn][Pp][Ww][Dd][Aa][Gg][Ee].*/ OR /.*[Mm][Ii][Nn][Pp][Ww][Dd][Ll][Ee][Nn][Gg][Tt][Hh].*/ OR /.*[Pp][Ww][Dd][Hh][Ii][Ss][Tt][Oo][Rr][Yy][Ll][Ee][Nn][Gg][Tt][Hh].*/ OR /.*[Pp][Ww][Dd][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Ii][Ee][Ss].*/) OR process.command_line:/.*\\-[Ss][Cc]\\ [Aa][Dd][Mm][Ii][Nn][Cc][Oo][Uu][Nn][Tt][Dd][Mm][Pp].*/ OR process.command_line:/.*\\-[Ss][Cc]\\ [Ee][Xx][Cc][Hh][Aa][Dd][Dd][Rr][Ee][Ss][Ss][Ee][Ss].*/)","rule_id":"455b9d50-15a1-4b99-853f-8d37655a4c1b","timestamp_override":"event.ingested","references":["https://www.joeware.net/freetools/tools/adfind/","https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*lockoutduration* OR *lockoutthreshold* OR *lockoutobservationwindow* OR *maxpwdage* OR *minpwdage* OR *minpwdlength* OR *pwdhistorylength* OR *pwdproperties*) OR process.command_line:*\\-sc\\ admincountdmp* OR process.command_line:*\\-sc\\ exchaddresses*)`"}
