{"id":"fd6e2919-3936-40c9-99db-0aa922c356f7","created_by":"pH-T","name":"Malicious Base64 Encoded Powershell Invoke Cmdlets","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects base64 encoded powershell cmdlet invocation of known suspicious cmdlets","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ss][Qq][Bb][Uu][Aa][Hh][Yy][Aa][Bb][Ww][Bb][Rr][Aa][Gg][Uu][Aa][Ll][Qq][Bb][Cc][Aa][Gg][Ww][Aa][Bb][Ww][Bb][Vv][Aa][Gg][Qq][Aa][Ss][Aa][Bb][Vv][Aa][Hh][Uu][Aa][Bb][Gg][Bb][Kk][Aa].*/ OR /.*[Kk][Aa][Bb][Gg][Bb]2[Aa][Gg]8[Aa][Aa][Ww][Bb][Ll][Aa][Cc]0[Aa][Qq][Gg][Bb][Ss][Aa][Gg]8[Aa][Bb][Ww][Bb][Kk][Aa][Ee][Gg][Aa][Bb][Ww][Bb]1[Aa][Gg]4[Aa][Zz][Aa].*/ OR /.*[Jj][Aa][Gg]4[Aa][Dd][Gg][Bb][Vv][Aa][Gg][Ss][Aa][Zz][Qq][Aa][Tt][Aa][Ee][Ii][Aa][Bb][Aa][Bb][Vv][Aa][Gg]8[Aa][Zz][Aa][Bb][Ii][Aa][Gg]8[Aa][Dd][Qq][Bb][Uu][Aa][Gg][Qq][Aa].*/ OR /.*[Ss][Qq][Bb][Uu][Aa][Hh][Yy][Aa][Bb][Ww][Bb][Rr][Aa][Gg][Uu][Aa][Ll][Qq][Bb][Nn][Aa][Gg][Kk][Aa][Bb][Qq][Bb][Pp][Aa][Gg][Ss][Aa][Yy][Qq][Bb]0[Aa][Hh][Oo][Aa].*/ OR /.*[Kk][Aa][Bb][Gg][Bb]2[Aa][Gg]8[Aa][Aa][Ww][Bb][Ll][Aa][Cc]0[Aa][Tt][Qq][Bb][Pp][Aa][Gg]0[Aa][Aa][Qq][Bb][Rr][Aa][Gg][Ee][Aa][Dd][Aa][Bb]6[Aa].*/ OR /.*[Jj][Aa][Gg]4[Aa][Dd][Gg][Bb][Vv][Aa][Gg][Ss][Aa][Zz][Qq][Aa][Tt][Aa][Ee]0[Aa][Aa][Qq][Bb][Tt][Aa][Gg][Kk][Aa][Aa][Ww][Bb][Hh][Aa][Hh][Qq][Aa][Ee][Gg].*/ OR /.*[Ss][Qq][Bb][Uu][Aa][Hh][Yy][Aa][Bb][Ww][Bb][Rr][Aa][Gg][Uu][Aa][Ll][Qq][Bb][Xx][Aa][Ee]0[Aa][Ss][Qq][Bb][Ff][Aa][Hh][Gg][Aa][Zz][Qq][Bb][Jj][Aa].*/ OR /.*[Kk][Aa][Bb][Gg][Bb]2[Aa][Gg]8[Aa][Aa][Ww][Bb][Ll][Aa][Cc]0[Aa][Vv][Ww][Bb][Nn][Aa][Ee][Kk][Aa][Rr][Qq][Bb]4[Aa][Gg][Uu][Aa][Yy][Ww].*/ OR /.*[Jj][Aa][Gg]4[Aa][Dd][Gg][Bb][Vv][Aa][Gg][Ss][Aa][Zz][Qq][Aa][Tt][Aa][Ff][Cc][Aa][Tt][Qq][Bb][Jj][Aa][Ee][Uu][Aa][Ee][Aa][Bb][Ll][Aa][Gg][Mm][Aa].*/)","rule_id":"fd6e2919-3936-40c9-99db-0aa922c356f7","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*SQBuAHYAbwBrAGUALQBCAGwAbwBvAGQASABvAHUAbgBkA* OR *kAbgB2AG8AawBlAC0AQgBsAG8AbwBkAEgAbwB1AG4AZA* OR *JAG4AdgBvAGsAZQAtAEIAbABvAG8AZABIAG8AdQBuAGQA* OR *SQBuAHYAbwBrAGUALQBNAGkAbQBpAGsAYQB0AHoA* OR *kAbgB2AG8AawBlAC0ATQBpAG0AaQBrAGEAdAB6A* OR *JAG4AdgBvAGsAZQAtAE0AaQBtAGkAawBhAHQAeg* OR *SQBuAHYAbwBrAGUALQBXAE0ASQBFAHgAZQBjA* OR *kAbgB2AG8AawBlAC0AVwBNAEkARQB4AGUAYw* OR *JAG4AdgBvAGsAZQAtAFcATQBJAEUAeABlAGMA*)`"}
