{"id":"ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba","created_by":"Nasreddine Bencherchali","name":"Persistence Via TypedPaths - CommandLine","tags":["attack.persistence"],"interval":"5m","description":"Detects modification addition to the 'TypedPaths' key in the user or admin registry via the commandline. Which might indicate persistence attempt","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Tt][Yy][Pp][Ee][Dd][Pp][Aa][Tt][Hh][Ss].*/","rule_id":"ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba","timestamp_override":"event.ingested","references":["https://twitter.com/dez_/status/1560101453150257154","https://forensafe.com/blogs/typedpaths.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\TypedPaths*`"}
