{"id":"aa2efee7-34dd-446e-8a37-40790a66efd7","created_by":"frack113","name":"Recon Information for Export with Command Prompt","tags":["attack.collection","attack.t1119"],"interval":"5m","description":"Once established within a system or network, an adversary may use automated techniques for collecting internal data.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Tt][Rr][Ee][Ee]\\.[Cc][Oo][Mm]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Oo][Ss][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /[Dd][Oo][Ss][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/ OR /[Ss][Cc]\\.[Ee][Xx][Ee]/)) AND process.parent.command_line:/.*\\ \\>\\ %[Tt][Ee][Mm][Pp]%\\\\.*/)","rule_id":"aa2efee7-34dd-446e-8a37-40790a66efd7","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\tree.com OR *\\\\WMIC.exe OR *\\\\doskey.exe OR *\\\\sc.exe) OR process.pe.original_file_name:(wmic.exe OR DOSKEY.EXE OR sc.exe)) AND process.parent.command_line:*\\ >\\ %TEMP%\\\\*)`"}
