{"id":"63d1ccc0-2a43-4f4b-9289-361b308991ff","created_by":"Nasreddine Bencherchali","name":"Wab.Exe Unusual Parent Or Child Processes","tags":["attack.defense_evasion","attack.execution"],"interval":"5m","description":"Detects unusual parent or children of the wab.exe (Windows Contacts) process as seen being used with bumblebee activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) AND process.executable:/.*\\\\[Ww][Aa][Bb]\\.[Ee][Xx][Ee]/) OR process.parent.executable:/.*\\\\[Ww][Aa][Bb]\\.[Ee][Xx][Ee]/)","rule_id":"63d1ccc0-2a43-4f4b-9289-361b308991ff","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\WmiPrvSE.exe OR *\\\\svchost.exe OR *\\\\dllhost.exe) AND process.executable:*\\\\wab.exe) OR process.parent.executable:*\\\\wab.exe)`"}
