{"id":"a746c9b8-a2fb-4ee5-a428-92bee9e99060","created_by":"Agro (@agro_sev) oscd.communitly","name":"SQL Client Tools PowerShell Session Detection","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1127"],"interval":"5m","description":"This rule detects execution of a PowerShell code through the sqltoolsps.exe utility, which is included in the standard set of utilities supplied with the Microsoft SQL Server Management studio. Script blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Direct PS command execution through SQLToolsPS.exe is uncommon, childprocess sqltoolsps.exe spawned by smss.exe is a legitimate action."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Qq][Ll][Tt][Oo][Oo][Ll][Ss][Pp][Ss]\\.[Ee][Xx][Ee]/ OR process.parent.executable:/.*\\\\[Ss][Qq][Ll][Tt][Oo][Oo][Ll][Ss][Pp][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/\\\\[Ss][Qq][Ll][Tt][Oo][Oo][Ll][Ss][Pp][Ss]\\.[Ee][Xx][Ee]/) AND (NOT (process.parent.executable:/.*\\\\[Ss][Mm][Ss][Ss]\\.[Ee][Xx][Ee]/)))","rule_id":"a746c9b8-a2fb-4ee5-a428-92bee9e99060","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OtherMSBinaries/Sqltoolsps.yml","https://twitter.com/pabraeken/status/993298228840992768"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sqltoolsps.exe OR process.parent.executable:*\\\\sqltoolsps.exe OR process.pe.original_file_name:\\\\sqltoolsps.exe) AND (NOT (process.parent.executable:*\\\\smss.exe)))`"}
