{"id":"f1edd233-30b5-4823-9e6a-c4171b24d316","created_by":"frack113","name":"Rundll32 Registered COM Objects","tags":["attack.privilege_escalation","attack.persistence","attack.t1546.015"],"interval":"5m","description":"load malicious registered COM objects","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\-[Ss][Tt][Aa]\\ .*/ OR /.*\\-[Ll][Oo][Cc][Aa][Ll][Ss][Ee][Rr][Vv][Ee][Rr]\\ .*/) AND process.command_line:/.*\\{.*/ AND process.command_line:/.*\\}.*/)","rule_id":"f1edd233-30b5-4823-9e6a-c4171b24d316","timestamp_override":"event.ingested","references":["https://nasbench.medium.com/a-deep-dive-into-rundll32-exe-642344b41e90","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.015/T1546.015.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.command_line:(*\\-sta\\ * OR *\\-localserver\\ *) AND process.command_line:*\\{* AND process.command_line:*\\}*)`"}
