{"id":"38879043-7e1e-47a9-8d46-6bec88e201df","created_by":"Sreeman","name":"Modification Of Existing Services For Persistence","tags":["attack.persistence","attack.t1543.003","attack.t1574.011"],"interval":"5m","description":"Detects modification of an existing service on a compromised host in order to execute an arbitrary payload when the service is started or killed as a method of persistence.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ss][Cc]\\ .*/ AND process.command_line:/.*[Cc][Oo][Nn][Ff][Ii][Gg]\\ .*/ AND process.command_line:/.*[Bb][Ii][Nn][Pp][Aa][Tt][Hh]\\=.*/) OR (process.command_line:/.*[Ss][Cc]\\ .*/ AND process.command_line:/.*[Ff][Aa][Ii][Ll][Uu][Rr][Ee].*/ AND process.command_line:/.*[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\=.*/) OR (process.command_line:/.*[Rr][Ee][Gg]\\ .*/ AND process.command_line:/.*[Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*[Ff][Aa][Ii][Ll][Uu][Rr][Ee][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ AND process.command_line:(/.*\\.[Ss][Hh].*/ OR /.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Bb][Ii][Nn]$.*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Jj][Ss].*/ OR /.*\\.[Mm][Ss][Hh]$.*/ OR /.*\\.[Rr][Ee][Gg]$.*/ OR /.*\\.[Ss][Cc][Rr].*/ OR /.*\\.[Pp][Ss].*/ OR /.*\\.[Vv][Bb].*/ OR /.*\\.[Jj][Aa][Rr].*/ OR /.*\\.[Pp][Ll].*/)) OR (process.command_line:/.*[Rr][Ee][Gg]\\ .*/ AND process.command_line:/.*[Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh].*/ AND process.command_line:(/.*\\.[Ss][Hh].*/ OR /.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Bb][Ii][Nn]$.*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Jj][Ss].*/ OR /.*\\.[Mm][Ss][Hh]$.*/ OR /.*\\.[Rr][Ee][Gg]$.*/ OR /.*\\.[Ss][Cc][Rr].*/ OR /.*\\.[Pp][Ss].*/ OR /.*\\.[Vv][Bb].*/ OR /.*\\.[Jj][Aa][Rr].*/ OR /.*\\.[Pp][Ll].*/)))","rule_id":"38879043-7e1e-47a9-8d46-6bec88e201df","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*sc\\ * AND process.command_line:*config\\ * AND process.command_line:*binpath\\=*) OR (process.command_line:*sc\\ * AND process.command_line:*failure* AND process.command_line:*command\\=*) OR (process.command_line:*reg\\ * AND process.command_line:*add\\ * AND process.command_line:*FailureCommand* AND process.command_line:(*.sh* OR *.exe* OR *.dll* OR *.bin$* OR *.bat* OR *.cmd* OR *.js* OR *.msh$* OR *.reg$* OR *.scr* OR *.ps* OR *.vb* OR *.jar* OR *.pl*)) OR (process.command_line:*reg\\ * AND process.command_line:*add\\ * AND process.command_line:*ImagePath* AND process.command_line:(*.sh* OR *.exe* OR *.dll* OR *.bin$* OR *.bat* OR *.cmd* OR *.js* OR *.msh$* OR *.reg$* OR *.scr* OR *.ps* OR *.vb* OR *.jar* OR *.pl*)))`"}
