{"id":"aa8e035d-7be4-48d3-a944-102aec04400d","created_by":"frack113","name":"Suspicious Extrac32 Execution","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Download or Copy file with Extrac32","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ee][Xx][Tt][Rr][Aa][Cc]32\\.[Ee][Xx][Ee].*/ OR process.executable:/.*\\\\[Ee][Xx][Tt][Rr][Aa][Cc]32\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ee][Xx][Tt][Rr][Aa][Cc]32\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\.[Cc][Aa][Bb].*/ AND process.command_line:(/.*\\/[Cc].*/ OR /.*\\/[Yy].*/ OR /.*\\ \\\\\\\\\\*/))","rule_id":"aa8e035d-7be4-48d3-a944-102aec04400d","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Extrac32/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*extrac32.exe* OR process.executable:*\\\\extrac32.exe OR process.pe.original_file_name:extrac32.exe) AND process.command_line:*.cab* AND process.command_line:(*\\/C* OR *\\/Y* OR *\\ \\\\\\\\\\*))`"}
