{"id":"4c0aaedc-154c-4427-ada0-d80ef9c9deb6","created_by":"Florian Roth","name":"Process Access via TrolleyExpress Exclusion","tags":["attack.defense_evasion","attack.t1218.011","attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects a possible process memory dump that uses the white-listed Citrix TrolleyExpress.exe filename as a way to dump the lsass process memory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\ 7.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\ 8.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\ 9.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]\\ 7.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]\\ 8.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]\\ 9.*/ OR /.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]\\ \\-[Mm][Aa]\\ .*/) OR (process.executable:/.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ AND (NOT ((process.pe.original_file_name:/.*[Cc][Tt][Xx][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/) OR (NOT _exists_:process.pe.original_file_name)))))","rule_id":"4c0aaedc-154c-4427-ada0-d80ef9c9deb6","timestamp_override":"event.ingested","references":["https://twitter.com/_xpn_/status/1491557187168178176","https://www.youtube.com/watch?v=Ie831jF0bb0"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\\\TrolleyExpress\\ 7* OR *\\\\TrolleyExpress\\ 8* OR *\\\\TrolleyExpress\\ 9* OR *\\\\TrolleyExpress.exe\\ 7* OR *\\\\TrolleyExpress.exe\\ 8* OR *\\\\TrolleyExpress.exe\\ 9* OR *\\\\TrolleyExpress.exe\\ \\-ma\\ *) OR (process.executable:*\\\\TrolleyExpress.exe AND (NOT ((process.pe.original_file_name:*CtxInstall*) OR (NOT _exists_:process.pe.original_file_name)))))`"}
