{"id":"82a19e3a-2bfe-4a91-8c0d-5d4c98fbb719","created_by":"juju4","name":"Possible Applocker Bypass","tags":["attack.defense_evasion","attack.t1218.004","attack.t1218.009","attack.t1127.001","attack.t1218.005","attack.t1218"],"interval":"5m","description":"Detects execution of executables that can be used to bypass Applocker whitelisting","risk_score":21,"enabled":true,"severity":"low","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment","Using installutil to add features for .NET applications (primarily would occur in developer environments)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ii][Ee][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee].*/)","rule_id":"82a19e3a-2bfe-4a91-8c0d-5d4c98fbb719","timestamp_override":"event.ingested","references":["https://github.com/carnal0wnage/ApplicationWhitelistBypassTechniques/blob/b348846a3bd2ff45e3616d63a4c2b4426f84772c/TheList.txt","https://room362.com/post/2014/2014-01-16-application-whitelist-bypass-using-ieexec-dot-exe/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1127.001/T1127.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\\\msdt.exe* OR *\\\\installutil.exe* OR *\\\\regsvcs.exe* OR *\\\\regasm.exe* OR *\\\\msbuild.exe* OR *\\\\ieexec.exe*)`"}
