{"id":"b6457d63-d2a2-4e29-859d-4e7affc153d1","created_by":"@gott_cyber","name":"Discovery/Execution via dnscmd.exe","tags":["attack.discovery","attack.execution","attack.t1543.003"],"interval":"5m","description":"Detects an attempt to add a potentially crafted DLL as a plug in of the DNS Service.\nDetects an attempt to leverage dnscmd.exe to enumerate the DNS zones of a domain.\nDNS zones used to host the DNS records for a particular domain\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Nn][Ss][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND (process.command_line:(/.*\\/[Ee][Nn][Uu][Mm][Rr][Ee][Cc][Oo][Rr][Dd][Ss].*/ OR /.*\\/[Ee][Nn][Uu][Mm][Zz][Oo][Nn][Ee][Ss].*/ OR /.*\\/[Ii][Nn][Ff][Oo].*/) OR (process.command_line:/.*\\/[Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*\\/[Ss][Ee][Rr][Vv][Ee][Rr][Ll][Ee][Vv][Ee][Ll][Pp][Ll][Uu][Gg][Ii][Nn][Dd][Ll][Ll].*/)))","rule_id":"b6457d63-d2a2-4e29-859d-4e7affc153d1","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd","https://docs.microsoft.com/en-us/azure/dns/dns-zones-records","https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\dnscmd.exe AND (process.command_line:(*\\/enumrecords* OR *\\/enumzones* OR *\\/info*) OR (process.command_line:*\\/config* AND process.command_line:*\\/serverlevelplugindll*)))`"}
