{"id":"d95de845-b83c-4a9a-8a6a-4fc802ebf6c0","created_by":"Florian Roth, omkar72, @svch0st, Nasreddine Bencherchali","name":"Suspicious Reconnaissance Activity Using Net","tags":["attack.discovery","attack.t1087.001","attack.t1087.002"],"interval":"5m","description":"Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Inventory tool runs","Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/)) AND ((process.command_line:(/.*\\ [Gg][Rr][Oo][Uu][Pp]\\ .*/ OR /.*\\ [Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp]\\ .*/) AND process.command_line:(/.*[Dd][Oo][Mm][Aa][Ii][Nn]\\ [Aa][Dd][Mm][Ii][Nn][Ss].*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr].*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ee][Uu][Rr].*/ OR /.*[Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee]\\ [Aa][Dd][Mm][Ii][Nn][Ss].*/ OR /.*[Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\ [Tt][Rr][Uu][Ss][Tt][Ee][Dd]\\ [Ss][Uu][Bb][Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee]\\ [Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\ [Uu][Ss][Ee][Rr][Ss].*/ OR /.*[Uu][Tt][Ii][Ll][Ii][Ss][Aa][Tt][Ee][Uu][Rr][Ss]\\ [Dd][Uu]\\ [Bb][Uu][Rr][Ee][Aa][Uu]\\ à\\ [Dd][Ii][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*[Uu][Ss][Uu][Aa][Rr][Ii][Oo][Ss]\\ [Dd][Ee]\\ [Ee][Ss][Cc][Rr][Ii][Tt][Oo][Rr][Ii][Oo]\\ [Rr][Ee][Mm][Oo][Tt][Oo].*/ OR /.*\\ \\/[Dd][Oo].*/)) OR (process.command_line:/.*\\ [Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\ .*/ AND process.command_line:/.*\\ \\/[Dd][Oo].*/)))","rule_id":"d95de845-b83c-4a9a-8a6a-4fc802ebf6c0","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/","https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/","https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\net.exe OR *\\\\net1.exe) OR process.pe.original_file_name:(net.exe OR net1.exe)) AND ((process.command_line:(*\\ group\\ * OR *\\ localgroup\\ *) AND process.command_line:(*domain\\ admins* OR *\\ administrator* OR *\\ administrateur* OR *enterprise\\ admins* OR *Exchange\\ Trusted\\ Subsystem* OR *Remote\\ Desktop\\ Users* OR *Utilisateurs\\ du\\ Bureau\\ à\\ distance* OR *Usuarios\\ de\\ escritorio\\ remoto* OR *\\ \\/do*)) OR (process.command_line:*\\ accounts\\ * AND process.command_line:*\\ \\/do*)))`"}
