{"id":"d4498716-1d52-438f-8084-4a603157d131","created_by":"Tim Shelton (HAWK.IO)","name":"Password Provided In Command Line Of Net.exe","tags":null,"interval":"5m","description":"Detects a when net.exe is called with a password in the command line","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Nn][Ee][Tt].*/ AND process.command_line:/.*\\ [Uu][Ss][Ee]\\ .*/ AND process.command_line:/.*\\:.*\\\\\\*/ AND process.command_line:/.*\\/[Uu][Ss][Ee][Rr]\\:.*\\ .*/) AND (NOT ((process.command_line:/.*\\ /))))","rule_id":"d4498716-1d52-438f-8084-4a603157d131","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:C\\:\\\\Windows\\\\System32\\\\net.exe AND process.command_line:*net* AND process.command_line:*\\ use\\ * AND process.command_line:*\\:*\\\\\\* AND process.command_line:*\\/USER\\:*\\ *) AND (NOT ((process.command_line:*\\ ))))`"}
