{"id":"0e4164da-94bc-450d-a7be-a4b176179f1f","created_by":"frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'","name":"Suspicious Netsh Discovery Command","tags":["attack.discovery","attack.t1016"],"interval":"5m","description":"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ee][Tt][Ss][Hh]\\ .*/ AND process.command_line:/.*[Ss][Hh][Oo][Ww]\\ .*/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ .*/ AND process.command_line:(/.*[Cc][Oo][Nn][Ff][Ii][Gg]\\ .*/ OR /.*[Ss][Tt][Aa][Tt][Ee]\\ .*/ OR /.*[Rr][Uu][Ll][Ee]\\ .*/ OR /.*[Nn][Aa][Mm][Ee]\\=[Aa][Ll][Ll].*/))","rule_id":"0e4164da-94bc-450d-a7be-a4b176179f1f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*netsh\\ * AND process.command_line:*show\\ * AND process.command_line:*firewall\\ * AND process.command_line:(*config\\ * OR *state\\ * OR *rule\\ * OR *name\\=all*))`"}
