{"id":"c484e533-ee16-4a93-b6ac-f0ea4868b2f1","created_by":"Florian Roth","name":"SharpUp PrivEsc Tool","tags":["attack.privilege_escalation","attack.t1615","attack.t1569.002","attack.t1574.005"],"interval":"5m","description":"Detects the use of SharpUp, a tool for local privilege escalation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Hh][Aa][Rr][Pp][Uu][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Ss][Hh][Aa][Rr][Pp][Uu][Pp]/ OR process.command_line:(/.*[Hh][Ii][Jj][Aa][Cc][Kk][Aa][Bb][Ll][Ee][Pp][Aa][Tt][Hh][Ss].*/ OR /.*[Uu][Nn][Qq][Uu][Oo][Tt][Ee][Dd][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Aa][Tt][Hh].*/ OR /.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Dd][Ll][Ll][Hh][Ii][Jj][Aa][Cc][Kk].*/ OR /.*[Mm][Oo][Dd][Ii][Ff][Ii][Aa][Bb][Ll][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Bb][Ii][Nn][Aa][Rr][Ii][Ee][Ss].*/ OR /.*[Mm][Oo][Dd][Ii][Ff][Ii][Aa][Bb][Ll][Ee][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk].*/ OR /.*[Dd][Oo][Mm][Aa][Ii][Nn][Gg][Pp][Pp][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/))","rule_id":"c484e533-ee16-4a93-b6ac-f0ea4868b2f1","timestamp_override":"event.ingested","references":["https://github.com/GhostPack/SharpUp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SharpUp.exe OR process.pe.description:SharpUp OR process.command_line:(*HijackablePaths* OR *UnquotedServicePath* OR *ProcessDLLHijack* OR *ModifiableServiceBinaries* OR *ModifiableScheduledTask* OR *DomainGPPPassword*))`"}
