{"id":"05c36dd6-79d6-4a9a-97da-3db20298ab2d","created_by":"Timur Zinniatullin, oscd.community","name":"XSL Script Processing","tags":["attack.defense_evasion","attack.t1220"],"interval":"5m","description":"Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. Rule detects when adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["WMIC.exe FP depend on scripts and administrative methods used in the monitored environment.","Msxsl.exe is not installed by default, so unlikely.","Static format arguments - https://petri.com/command-line-wmi-part-3"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ff][Oo][Rr][Mm][Aa][Tt].*/) AND (NOT (process.command_line:(/.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Ll][Ii][Ss][Tt].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Hh][Tt][Aa][Bb][Ll][Ee].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Hh][Ff][Oo][Rr][Mm].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Tt][Aa][Bb][Ll][Ee].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Mm][Oo][Ff].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Vv][Aa][Ll][Uu][Ee].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Rr][Aa][Ww][Xx][Mm][Ll].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Xx][Mm][Ll].*/ OR /.*\\/[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Cc][Ss][Vv].*/)))) OR process.executable:/.*\\\\[Mm][Ss][Xx][Ss][Ll]\\.[Ee][Xx][Ee]/)","rule_id":"05c36dd6-79d6-4a9a-97da-3db20298ab2d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\wmic.exe AND process.command_line:*\\/format*) AND (NOT (process.command_line:(*\\/Format\\:List* OR *\\/Format\\:htable* OR *\\/Format\\:hform* OR *\\/Format\\:table* OR *\\/Format\\:mof* OR *\\/Format\\:value* OR *\\/Format\\:rawxml* OR *\\/Format\\:xml* OR *\\/Format\\:csv*)))) OR process.executable:*\\\\msxsl.exe)`"}
