{"id":"114e7f1c-f137-48c8-8f54-3088c24ce4b9","created_by":"Ján Trenčanský","name":"AnyDesk Silent Installation","tags":["attack.t1219"],"interval":"5m","description":"AnyDesk Remote Desktop silent installation can be used by attacker to gain remote access.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate deployment of AnyDesk"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-\\-[Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:/.*\\-\\-[Ss][Tt][Aa][Rr][Tt]\\-[Ww][Ii][Tt][Hh]\\-[Ww][Ii][Nn].*/ AND process.command_line:/.*\\-\\-[Ss][Ii][Ll][Ee][Nn][Tt].*/)","rule_id":"114e7f1c-f137-48c8-8f54-3088c24ce4b9","timestamp_override":"event.ingested","references":["https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20","https://support.anydesk.com/Automatic_Deployment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-\\-install* AND process.command_line:*\\-\\-start\\-with\\-win* AND process.command_line:*\\-\\-silent*)`"}
