{"id":"54773c5f-f1cc-4703-9126-2f797d96a69d","created_by":"Nasreddine Bencherchali @nas_bench","name":"Advanced Port Scanner","tags":["attack.discovery","attack.t1046","attack.t1135"],"interval":"5m","description":"Detects the use of Advanced Port Scanner.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative use","Tools with similar commandline (very rare)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]_[Pp][Oo][Rr][Tt]_[Ss][Cc][Aa][Nn][Nn][Ee][Rr].*/ OR (process.command_line:/.*\\/[Pp][Oo][Rr][Tt][Aa][Bb][Ll][Ee].*/ AND process.command_line:/.*\\/[Ll][Nn][Gg].*/))","rule_id":"54773c5f-f1cc-4703-9126-2f797d96a69d","timestamp_override":"event.ingested","references":["https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20Port%20Scanner"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\advanced_port_scanner* OR (process.command_line:*\\/portable* AND process.command_line:*\\/lng*))`"}
