{"id":"54e57ce3-0672-46eb-a402-2c0948d5e3e9","created_by":"FPT.EagleEye","name":"Emotet RunDLL32 Process Creation","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detecting Emotet DLL loading by looking for rundll32.exe processes with command lines ending in ,RunDLL or ,Control_RunDLL","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*,[Rr][Uu][Nn][Dd][Ll][Ll]/ OR /.*,[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]/)) AND (NOT (process.parent.executable:/.*\\\\[Tt][Rr][Aa][Cc][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/))) AND (NOT (process.command_line:(/.*\\.[Dd][Ll][Ll],[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]/ OR /.*\\.[Dd][Ll][Ll]\\\",[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]/ OR /.*\\.[Dd][Ll][Ll]',[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]/))))","rule_id":"54e57ce3-0672-46eb-a402-2c0948d5e3e9","timestamp_override":"event.ingested","references":["https://paste.cryptolaemus.com/emotet/2020/12/22/emotet-malware-IoCs_12-22-20.html","https://cyber.wtf/2021/11/15/guess-whos-back/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\rundll32.exe AND process.command_line:(*,RunDLL OR *,Control_RunDLL)) AND (NOT (process.parent.executable:*\\\\tracker.exe))) AND (NOT (process.command_line:(*.dll,Control_RunDLL OR *.dll\\\",Control_RunDLL OR *.dll',Control_RunDLL))))`"}
