{"id":"5afee48e-67dd-4e03-a783-f74259dcf998","created_by":"Florian Roth","name":"Suspicious Use of Procdump on LSASS","tags":["attack.defense_evasion","attack.t1036","attack.credential_access","attack.t1003.001","car.2013-05-009"],"interval":"5m","description":"Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process. This way we're also able to catch cases in which the attacker has renamed the procdump executable.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely, because no one should dump an lsass process memory","Another tool that uses the command line switches of Procdump"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ \\-[Mm][Aa]\\ .*/ OR /.*\\ \\/[Mm][Aa]\\ .*/) AND process.command_line:/.*\\ [Ll][Ss].*/)","rule_id":"5afee48e-67dd-4e03-a783-f74259dcf998","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ \\-ma\\ * OR *\\ \\/ma\\ *) AND process.command_line:*\\ ls*)`"}
