{"id":"43e32da2-fdd0-4156-90de-50dfd62636f9","created_by":"frack113","name":"Dism Remove Online Package","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Deployment Image Servicing and Management tool. DISM is used to enumerate, install, uninstall, configure, and update features and packages in Windows images","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Ii][Ss][Mm][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*\\/[Oo][Nn][Ll][Ii][Nn][Ee].*/ AND process.parent.command_line:/.*\\/[Dd][Ii][Ss][Aa][Bb][Ll][Ee]\\-[Ff][Ee][Aa][Tt][Uu][Rr][Ee].*/) OR (process.executable:/.*\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Oo][Nn][Ll][Ii][Nn][Ee].*/ AND process.command_line:/.*\\/[Dd][Ii][Ss][Aa][Bb][Ll][Ee]\\-[Ff][Ee][Aa][Tt][Uu][Rr][Ee].*/))","rule_id":"43e32da2-fdd0-4156-90de-50dfd62636f9","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism","https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\DismHost.exe AND process.parent.command_line:*\\/Online* AND process.parent.command_line:*\\/Disable\\-Feature*) OR (process.executable:*\\\\Dism.exe AND process.command_line:*\\/Online* AND process.command_line:*\\/Disable\\-Feature*))`"}
