{"id":"f576a613-2392-4067-9d1a-9345fb58d8d1","created_by":"frack113","name":"Automated Collection Command Prompt","tags":["attack.collection","attack.t1119","attack.credential_access","attack.t1552.001"],"interval":"5m","description":"Once established within a system or network, an adversary may use automated techniques for collecting internal data.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\.[Dd][Oo][Cc].*/ OR /.*\\.[Dd][Oo][Cc][Xx].*/ OR /.*\\.[Xx][Ll][Ss].*/ OR /.*\\.[Xx][Ll][Ss][Xx].*/ OR /.*\\.[Pp][Pp][Tt].*/ OR /.*\\.[Pp][Pp][Tt][Xx].*/ OR /.*\\.[Rr][Tt][Ff].*/ OR /.*\\.[Pp][Dd][Ff].*/ OR /.*\\.[Tt][Xx][Tt].*/) AND ((process.command_line:/.*[Dd][Ii][Rr]\\ .*/ AND process.command_line:/.*\\ \\/[Bb]\\ .*/ AND process.command_line:/.*\\ \\/[Ss]\\ .*/) OR (process.pe.original_file_name:/[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Ee]\\ .*/ OR /.*\\ \\/[Ss][Ii]\\ .*/))))","rule_id":"f576a613-2392-4067-9d1a-9345fb58d8d1","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*.doc* OR *.docx* OR *.xls* OR *.xlsx* OR *.ppt* OR *.pptx* OR *.rtf* OR *.pdf* OR *.txt*) AND ((process.command_line:*dir\\ * AND process.command_line:*\\ \\/b\\ * AND process.command_line:*\\ \\/s\\ *) OR (process.pe.original_file_name:FINDSTR.EXE AND process.command_line:(*\\ \\/e\\ * OR *\\ \\/si\\ *))))`"}
