{"id":"48917adc-a28e-4f5d-b729-11e75da8941f","created_by":"frack113","name":"Registry Defender Exclusions","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Qbot used reg.exe to add Defender folder exceptions for folders within AppData and ProgramData.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ss]\\\\[Pp][Aa][Tt][Hh][Ss].*/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Aa][Nn][Tt][Ii][Mm][Aa][Ll][Ww][Aa][Rr][Ee]\\\\[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ss]\\\\[Pp][Aa][Tt][Hh][Ss].*/) AND process.command_line:/.*[Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*\\/[Tt]\\ .*/ AND process.command_line:/.*[Rr][Ee][Gg]_[Dd][Ww][Oo][Rr][Dd]\\ .*/ AND process.command_line:/.*\\/[Vv]\\ .*/ AND process.command_line:/.*\\/[Dd]\\ .*/ AND process.command_line:/.*0.*/)","rule_id":"48917adc-a28e-4f5d-b729-11e75da8941f","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/","https://redcanary.com/threat-detection-report/threats/qbot/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:(*SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions\\\\Paths* OR *SOFTWARE\\\\Microsoft\\\\Microsoft\\ Antimalware\\\\Exclusions\\\\Paths*) AND process.command_line:*ADD\\ * AND process.command_line:*\\/t\\ * AND process.command_line:*REG_DWORD\\ * AND process.command_line:*\\/v\\ * AND process.command_line:*\\/d\\ * AND process.command_line:*0*)`"}
