{"id":"e7be6119-fc37-43f0-ad4f-1f3f99be2f9f","created_by":"Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community","name":"Copying Sensitive Files with Credential Data","tags":["attack.credential_access","attack.t1003.002","attack.t1003.003","car.2013-07-001","attack.s0404"],"interval":"5m","description":"Files with well-known filenames (sensitive files with credential data) copying","risk_score":73,"enabled":true,"severity":"high","false_positives":["Copying sensitive files for legitimate use (eg. backup) or forensic investigation by legitimate incident responder or forensic invetigator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Vv][Ss][Ss].*/ OR /.*\\ \\/[Mm]\\ .*/ OR /.*\\ \\/[Yy]\\ .*/)) OR process.command_line:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Aa][Mm].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/ OR /.*\\\\[Rr][Ee][Pp][Aa][Ii][Rr]\\\\[Ss][Aa][Mm].*/ OR /.*\\\\[Rr][Ee][Pp][Aa][Ii][Rr]\\\\[Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*\\\\[Rr][Ee][Pp][Aa][Ii][Rr]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Rr][Ee][Gg][Bb][Aa][Cc][Kk]\\\\[Ss][Aa][Mm].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Rr][Ee][Gg][Bb][Aa][Cc][Kk]\\\\[Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Rr][Ee][Gg][Bb][Aa][Cc][Kk]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/))","rule_id":"e7be6119-fc37-43f0-ad4f-1f3f99be2f9f","timestamp_override":"event.ingested","references":["https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/","https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\esentutl.exe AND process.command_line:(*vss* OR *\\ \\/m\\ * OR *\\ \\/y\\ *)) OR process.command_line:(*\\\\windows\\\\ntds\\\\ntds.dit* OR *\\\\config\\\\sam* OR *\\\\config\\\\security* OR *\\\\config\\\\system\\ * OR *\\\\repair\\\\sam* OR *\\\\repair\\\\system* OR *\\\\repair\\\\security* OR *\\\\config\\\\RegBack\\\\sam* OR *\\\\config\\\\RegBack\\\\system* OR *\\\\config\\\\RegBack\\\\security*))`"}
