{"id":"df1f26d3-bea7-4700-9ea2-ad3e990cf90e","created_by":"Max Altgelt","name":"Node Process Executions","tags":["attack.defense_evasion","attack.t1127","attack.t1059.007"],"interval":"5m","description":"Detects the execution of other scripts using the Node executable packaged with Adobe Creative Cloud","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Dd][Oo][Bb][Ee]\\ [Cc][Rr][Ee][Aa][Tt][Ii][Vv][Ee]\\ [Cc][Ll][Oo][Uu][Dd]\\ [Ee][Xx][Pp][Ee][Rr][Ii][Ee][Nn][Cc][Ee]\\\\[Ll][Ii][Bb][Ss]\\\\[Nn][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:/.*[Aa][Dd][Oo][Bb][Ee]\\ [Cc][Rr][Ee][Aa][Tt][Ii][Vv][Ee]\\ [Cc][Ll][Oo][Uu][Dd]\\ [Ee][Xx][Pp][Ee][Rr][Ii][Ee][Nn][Cc][Ee]\\\\[Jj][Ss].*/)))","rule_id":"df1f26d3-bea7-4700-9ea2-ad3e990cf90e","timestamp_override":"event.ingested","references":["https://twitter.com/mttaggart/status/1511804863293784064"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\Adobe\\ Creative\\ Cloud\\ Experience\\\\libs\\\\node.exe AND (NOT (process.command_line:*Adobe\\ Creative\\ Cloud\\ Experience\\\\js*)))`"}
