{"id":"b236190c-1c61-41e9-84b3-3fe03f6d76b0","created_by":"Florian Roth","name":"Regsvr32 Flags Anomaly","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects a flag anomaly in which regsvr32.exe uses a /i flag without using a /n flag at the same time","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Ii]\\:.*/) AND (NOT (process.command_line:/.*\\ \\/[Nn]\\ .*/)))","rule_id":"b236190c-1c61-41e9-84b3-3fe03f6d76b0","timestamp_override":"event.ingested","references":["https://twitter.com/sbousseaden/status/1282441816986484737?s=12"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\regsvr32.exe AND process.command_line:*\\ \\/i\\:*) AND (NOT (process.command_line:*\\ \\/n\\ *)))`"}
