{"id":"6812a10b-60ea-420c-832f-dfcc33b646ba","created_by":"Markus Neis","name":"Detection of PowerShell Execution via DLL","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR process.pe.description:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Hh][Oo][Ss][Tt][Pp][Rr][Oo][Zz][Ee][Ss][Ss]\\ \\([Rr][Uu][Nn][Dd][Ll][Ll]32\\).*/) AND process.command_line:(/.*[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Gg][Ee][Tt][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/))","rule_id":"6812a10b-60ea-420c-832f-dfcc33b646ba","timestamp_override":"event.ingested","references":["https://github.com/p3nt4/PowerShdll/blob/62cfa172fb4e1f7f4ac00ca942685baeb88ff356/README.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rundll32.exe OR process.pe.description:*Windows\\-Hostprozess\\ \\(Rundll32\\)*) AND process.command_line:(*Default.GetString* OR *FromBase64String*))`"}
