{"id":"4ac47ed3-44c2-4b1f-9d51-bf46e8914126","created_by":"Florian Roth","name":"TrustedPath UAC Bypass Pattern","tags":["attack.defense_evasion","attack.t1548.002"],"interval":"5m","description":"Detects indicators of a UAC bypass method by mocking directories","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ \\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/","rule_id":"4ac47ed3-44c2-4b1f-9d51-bf46e8914126","timestamp_override":"event.ingested","references":["https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e","https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows","https://github.com/netero1010/TrustedPath-UACBypass-BOF"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*C\\:\\\\Windows\\ \\\\System32\\\\*`"}
