{"id":"5de632bc-7fbd-4c8a-944a-fce55c59eae5","created_by":"Florian Roth","name":"REvil Kaseya Incident Malware Patterns","tags":["attack.execution","attack.t1059","attack.g0115"],"interval":"5m","description":"Detects process command line patterns and locations used by REvil group in Kaseya incident (can also match on other malware)","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Ee][Rr][Tt]\\.[Ee][Xx][Ee].*/ OR /.*[Dd][Ee][Ll]\\ \\/[Qq]\\ \\/[Ff]\\ [Cc]\\:\\\\[Kk][Ww][Oo][Rr][Kk][Ii][Nn][Gg]\\\\[Aa][Gg][Ee][Nn][Tt]\\.[Cc][Rr][Tt].*/ OR /.*[Kk][Aa][Ss][Ee][Yy][Aa]\\ [Vv][Ss][Aa]\\ [Aa][Gg][Ee][Nn][Tt]\\ [Hh][Oo][Tt]\\-[Ff][Ii][Xx].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee].*/ OR /.*[Rr][Mm][Dd][Ii][Rr]\\ \\/[Ss]\\ \\/[Qq]\\ %[Ss][Yy][Ss][Tt][Ee][Mm][Dd][Rr][Ii][Vv][Ee]%\\\\[Ii][Nn][Ee][Tt][Pp][Uu][Bb]\\\\[Ll][Oo][Gg][Ss].*/ OR /.*[Dd][Ee][Ll]\\ \\/[Ss]\\ \\/[Qq]\\ \\/[Ff]\\ %[Ss][Yy][Ss][Tt][Ee][Mm][Dd][Rr][Ii][Vv][Ee]%\\\\.*\\.[Ll][Oo][Gg].*/ OR /.*[Cc]\\:\\\\[Kk][Ww][Oo][Rr][Kk][Ii][Nn][Gg]1\\\\[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee].*/ OR /.*[Cc]\\:\\\\[Kk][Ww][Oo][Rr][Kk][Ii][Nn][Gg]1\\\\[Aa][Gg][Ee][Nn][Tt]\\.[Cc][Rr][Tt].*/) OR process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Ee][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Kk][Ww][Oo][Rr][Kk][Ii][Nn][Gg]\\\\[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Kk][Ww][Oo][Rr][Kk][Ii][Nn][Gg]1\\\\[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*[Dd][Ee][Ll]\\ \\/[Ss]\\ \\/[Qq]\\ \\/[Ff].*/ AND process.command_line:/.*[Ww][Ee][Bb][Pp][Aa][Gg][Ee][Ss]\\\\[Ee][Rr][Rr][Oo][Rr][Ss]\\\\[Ww][Ee][Bb][Ee][Rr][Rr][Oo][Rr][Ll][Oo][Gg]\\.[Tt][Xx][Tt].*/))","rule_id":"5de632bc-7fbd-4c8a-944a-fce55c59eae5","timestamp_override":"event.ingested","references":["https://community.sophos.com/b/security-blog/posts/active-ransomware-attack-on-kaseya-customers","https://www.joesandbox.com/analysis/443736/0/html","https://doublepulsar.com/kaseya-supply-chain-attack-delivers-mass-ransomware-event-to-us-companies-76e4ec6ec64b","https://therecord.media/revil-ransomware-executes-supply-chain-attack-via-malicious-kaseya-update/","https://blog.truesec.com/2021/07/04/kaseya-supply-chain-attack-targeting-msps-to-deliver-revil-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*C\\:\\\\Windows\\\\cert.exe* OR *del\\ \\/q\\ \\/f\\ c\\:\\\\kworking\\\\agent.crt* OR *Kaseya\\ VSA\\ Agent\\ Hot\\-fix* OR *\\\\AppData\\\\Local\\\\Temp\\\\MsMpEng.exe* OR *rmdir\\ \\/s\\ \\/q\\ %SystemDrive%\\\\inetpub\\\\logs* OR *del\\ \\/s\\ \\/q\\ \\/f\\ %SystemDrive%\\\\*.log* OR *c\\:\\\\kworking1\\\\agent.exe* OR *c\\:\\\\kworking1\\\\agent.crt*) OR process.executable:(C\\:\\\\Windows\\\\MsMpEng.exe OR C\\:\\\\Windows\\\\cert.exe OR C\\:\\\\kworking\\\\agent.exe OR C\\:\\\\kworking1\\\\agent.exe) OR (process.command_line:*del\\ \\/s\\ \\/q\\ \\/f* AND process.command_line:*WebPages\\\\Errors\\\\webErrorLog.txt*))`"}
