{"id":"7df1713a-1a5b-4a4b-a071-dc83b144a101","created_by":"sam0x90","name":"Esentutl Gather Credentials","tags":["attack.credential_access","attack.t1003","attack.t1003.003"],"interval":"5m","description":"Conti recommendation to its affiliates to use esentutl to access NTDS dumped file. Trickbot also uses this utilities to get MSEdge info via its module pwgrab.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["To be determined"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll].*/ AND process.command_line:/.*\\ \\/[Pp].*/)","rule_id":"7df1713a-1a5b-4a4b-a071-dc83b144a101","timestamp_override":"event.ingested","references":["https://twitter.com/vxunderground/status/1423336151860002816","https://attack.mitre.org/software/S0404/","https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*esentutl* AND process.command_line:*\\ \\/p*)`"}
