{"id":"36475a7d-0f6d-4dce-9b01-6aeb473bbaf1","created_by":"frack113","name":"SyncAppvPublishingServer VBS Execute Arbitrary PowerShell Code","tags":["attack.defense_evasion","attack.t1218","attack.t1216"],"interval":"5m","description":"Executes arbitrary PowerShell code using SyncAppvPublishingServer.vbs","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Ss][Yy][Nn][Cc][Aa][Pp][Pp][Vv][Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Vv][Bb][Ss].*/ AND process.command_line:/.*;.*/)","rule_id":"36475a7d-0f6d-4dce-9b01-6aeb473bbaf1","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md","https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\SyncAppvPublishingServer.vbs* AND process.command_line:*;*)`"}
