{"id":"8bc64091-6875-4881-aaf9-7bd25b5dda08","created_by":"Florian Roth","name":"Suspicious Process Patterns NTDS.DIT Exfil","tags":["attack.credential_access","attack.t1003.003"],"interval":"5m","description":"Detects suspicious process patterns used in NTDS.DIT exfiltration","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:(/.*\\\\[Nn][Tt][Dd][Ss][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Tt][Dd][Ss][Dd][Uu][Mm][Pp][Ee][Xx]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/ AND process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Hh][Ii][Vv].*/) OR process.command_line:/.*[Nn][Tt][Dd][Ss][Gg][Rr][Aa][Bb]\\.[Pp][Ss]1.*/) OR (process.command_line:/.*[Aa][Cc]\\ [Ii]\\ [Nn][Tt][Dd][Ss].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee]\\ [Ff][Uu][Ll][Ll].*/) OR (process.command_line:/.*\\/[Cc]\\ [Cc][Oo][Pp][Yy]\\ .*/ AND process.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/) OR (process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:/.*[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/)) OR (process.command_line:/.*[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/ AND (process.parent.executable:(/.*\\\\[Aa][Pp][Aa][Cc][Hh][Ee].*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/) OR process.executable:(/.*\\\\[Aa][Pp][Aa][Cc][Hh][Ee].*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/))))","rule_id":"8bc64091-6875-4881-aaf9-7bd25b5dda08","timestamp_override":"event.ingested","references":["https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration","https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/","https://pentestlab.blog/tag/ntds-dit/","https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1","https://github.com/zcgonvh/NTDSDumpEx","https://github.com/rapid7/metasploit-framework/blob/d297adcebb5c1df6fe30b12ca79b161deb71571c/data/post/powershell/NTDSgrab.ps1","https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:(*\\\\NTDSDump.exe OR *\\\\NTDSDumpEx.exe) OR (process.command_line:*ntds.dit* AND process.command_line:*system.hiv*) OR process.command_line:*NTDSgrab.ps1*) OR (process.command_line:*ac\\ i\\ ntds* AND process.command_line:*create\\ full*) OR (process.command_line:*\\/c\\ copy\\ * AND process.command_line:*\\\\windows\\\\ntds\\\\ntds.dit*) OR (process.command_line:*powershell* AND process.command_line:*ntds.dit*)) OR (process.command_line:*ntds.dit* AND (process.parent.executable:(*\\\\apache* OR *\\\\tomcat* OR *\\\\AppData\\\\* OR *\\\\Temp\\\\* OR *\\\\Public\\\\* OR *\\\\PerfLogs\\\\*) OR process.executable:(*\\\\apache* OR *\\\\tomcat* OR *\\\\AppData\\\\* OR *\\\\Temp\\\\* OR *\\\\Public\\\\* OR *\\\\PerfLogs\\\\*))))`"}
