{"id":"e9142d84-fbe0-401d-ac50-3e519fb00c89","created_by":"Florian Roth","name":"WhoAmI as Parameter","tags":["attack.discovery","attack.t1033","car.2016-03-001"],"interval":"5m","description":"Detects a suspicious process command line that uses whoami as first parameter (as e.g. used by EfsPotato)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\.[Ee][Xx][Ee]\\ [Ww][Hh][Oo][Aa][Mm][Ii].*/","rule_id":"e9142d84-fbe0-401d-ac50-3e519fb00c89","timestamp_override":"event.ingested","references":["https://twitter.com/blackarrowsec/status/1463805700602224645?s=12"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*.exe\\ whoami*`"}
