{"id":"5cc90652-4cbd-4241-aa3b-4b462fa5a248","created_by":"Craig Young, oscd.community, Georg Lauenstein","name":"Recon Activity with NLTEST","tags":["attack.discovery","attack.t1016","attack.t1482"],"interval":"5m","description":"Detects nltest commands that can be used for information discovery","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration use but user must be check out"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Nn][Ll][Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Nn][Ll][Tt][Ee][Ss][Tt][Rr][Kk]\\.[Ee][Xx][Ee]/) AND ((process.command_line:/.*\\/[Ss][Ee][Rr][Vv][Ee][Rr].*/ AND process.command_line:/.*\\/[Qq][Uu][Ee][Rr][Yy].*/) OR process.command_line:(/.*\\/[Dd][Cc][Ll][Ii][Ss][Tt]\\:.*/ OR /.*\\/[Pp][Aa][Rr][Ee][Nn][Tt][Dd][Oo][Mm][Aa][Ii][Nn].*/ OR /.*\\/[Dd][Oo][Mm][Aa][Ii][Nn]_[Tt][Rr][Uu][Ss][Tt][Ss].*/ OR /.*\\/[Tt][Rr][Uu][Ss][Tt][Ee][Dd]_[Dd][Oo][Mm][Aa][Ii][Nn][Ss].*/ OR /.*\\/[Uu][Ss][Ee][Rr].*/)))","rule_id":"5cc90652-4cbd-4241-aa3b-4b462fa5a248","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)","https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/","https://attack.mitre.org/techniques/T1482/","https://attack.mitre.org/techniques/T1016/","https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters","https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\nltest.exe OR process.pe.original_file_name:nltestrk.exe) AND ((process.command_line:*\\/server* AND process.command_line:*\\/query*) OR process.command_line:(*\\/dclist\\:* OR *\\/parentdomain* OR *\\/domain_trusts* OR *\\/trusted_domains* OR *\\/user*)))`"}
