{"id":"02b18447-ea83-4b1b-8805-714a8a34546a","created_by":"frack113","name":"Suspicious OfflineScannerShell.exe Execution From Another Folder","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Use OfflineScannerShell.exe to execute mpclient.dll library in the current working directory","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Oo][Ff][Ff][Ll][Ii][Nn][Ee][Ss][Cc][Aa][Nn][Nn][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ AND (NOT ((process.working_directory:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Oo][Ff][Ff][Ll][Ii][Nn][Ee]\\\\/) OR (NOT _exists_:process.working_directory))))","rule_id":"02b18447-ea83-4b1b-8805-714a8a34546a","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\OfflineScannerShell.exe AND (NOT ((process.working_directory:C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\Offline\\\\) OR (NOT _exists_:process.working_directory))))`"}
