{"id":"e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a","created_by":"Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"Certutil Encode","tags":["attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects suspicious a certutil command that used to encode files, which is sometimes used for data exfiltration","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ff].*/ AND process.command_line:/.*\\-[Ee][Nn][Cc][Oo][Dd][Ee].*/)","rule_id":"e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil","https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\certutil.exe AND process.command_line:*\\-f* AND process.command_line:*\\-encode*)`"}
