{"id":"0b7163dc-7eee-4960-af17-c0cd517f92da","created_by":"Nasreddine Bencherchali","name":"WMIC Service Start/Stop","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Detects usage of wmic to start or stop a service","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/ AND process.command_line:/.*\\ [Cc][Aa][Ll][Ll]\\ .*/ AND process.command_line:(/.*[Ss][Tt][Oo][Pp][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Tt][Aa][Rr][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/)))","rule_id":"0b7163dc-7eee-4960-af17-c0cd517f92da","timestamp_override":"event.ingested","references":["https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:wmic.exe OR process.executable:*\\\\WMIC.exe) AND (process.command_line:*\\ service\\ * AND process.command_line:*\\ call\\ * AND process.command_line:(*stopservice* OR *startservice*)))`"}
