{"id":"8de89e52-f6e1-4b5b-afd1-41ecfa300d48","created_by":"Nasreddine Bencherchali","name":"Suspicious WindowsTerminal Child Processes","tags":["attack.execution","attack.persistence"],"interval":"5m","description":"Detects suspicious children spawned via the Windows Terminal application which could be a sign of persistence via WindowsTerminal (see references section)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other legitimate \"Windows Terminal\" profiles"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\.[Ee][Xx][Ee]/ AND (process.executable:(/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc]\\.[Ee][Xx][Ee]/) OR process.executable:(/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/) OR process.command_line:(/.*\\ [Ii][Ee][Xx]\\ .*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-.*/ OR /.*[Ii][Mm][Pp][Oo][Rr][Tt]\\-[Mm][Oo][Dd][Uu][Ll][Ee].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\ \\/[Cc]\\ .*/ OR /.*\\ \\/[Kk]\\ .*/))) AND (NOT ((process.command_line:/.*[Ii][Mm][Pp][Oo][Rr][Tt]\\-[Mm][Oo][Dd][Uu][Ll][Ee].*/ AND process.command_line:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Vv][Ii][Ss][Uu][Aa][Ll][Ss][Tt][Uu][Dd][Ii][Oo]\\.[Dd][Ee][Vv][Ss][Hh][Ee][Ll][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ee][Nn][Tt][Ee][Rr]\\-[Vv][Ss][Dd][Ee][Vv][Ss][Hh][Ee][Ll][Ll].*/) OR (process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]_.*/ AND process.command_line:/.*\\\\[Ll][Oo][Cc][Aa][Ll][Ss][Tt][Aa][Tt][Ee]\\\\[Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Jj][Ss][Oo][Nn].*/))))","rule_id":"8de89e52-f6e1-4b5b-afd1-41ecfa300d48","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/windowsterminalprofile.html","https://twitter.com/nas_bench/status/1550836225652686848"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\WindowsTerminal.exe AND (process.executable:(*\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\certutil.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\csc.exe) OR process.executable:(*C\\:\\\\Users\\\\Public\\\\* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\TEMP\\\\*) OR process.command_line:(*\\ iex\\ * OR *Invoke\\-* OR *Import\\-Module* OR *DownloadString\\(* OR *\\ \\/c\\ * OR *\\ \\/k\\ *))) AND (NOT ((process.command_line:*Import\\-Module* AND process.command_line:*Microsoft.VisualStudio.DevShell.dll* AND process.command_line:*Enter\\-VsDevShell*) OR (process.command_line:*\\\\AppData\\\\Local\\\\Packages\\\\Microsoft.WindowsTerminal_* AND process.command_line:*\\\\LocalState\\\\settings.json*))))`"}
