{"id":"4b13db67-0c45-40f1-aba8-66a1a7198a1e","created_by":"frack113","name":"Suspicious Extrac32 Alternate Data Stream Execution","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Extract data from cab file and hide it in an alternate data stream","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee][Xx][Tt][Rr][Aa][Cc]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Cc][Aa][Bb].*/ AND process.command_line:/:[^\\\\\\\\]/)","rule_id":"4b13db67-0c45-40f1-aba8-66a1a7198a1e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Extrac32/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*extrac32.exe* AND process.command_line:*.cab* AND process.command_line:/:[^\\\\\\\\]/)`"}
