{"id":"79ce34ca-af29-4d0e-b832-fc1b377020db","created_by":"Florian Roth","name":"Run Whoami as Privileged User","tags":["attack.privilege_escalation","attack.discovery","attack.t1033"],"interval":"5m","description":"Detects a whoami.exe executed by privileged accounts that are often misused by threat actors","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.User:/.*[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr].*/ AND (process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/))","rule_id":"79ce34ca-af29-4d0e-b832-fc1b377020db","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://nsudo.m2team.org/en-us/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.User:*TrustedInstaller* AND (process.pe.original_file_name:whoami.exe OR process.executable:*\\\\whoami.exe))`"}
