{"id":"37db85d1-b089-490a-a59a-c7b6f984f480","created_by":"frack113","name":"Suspicious Findstr 385201 Execution","tags":["attack.discovery","attack.t1518.001"],"interval":"5m","description":"Discovery of an installed Sysinternals Sysmon service using driver altitude (even if the name is changed).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ 385201.*/)","rule_id":"37db85d1-b089-490a-a59a-c7b6f984f480","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md#atomic-test-5---security-software-discovery---sysmon-service"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\findstr.exe AND process.command_line:*\\ 385201*)`"}
