{"id":"95022b85-ff2a-49fa-939a-d7b8f56eeb9b","created_by":"Alexander Rausch","name":"RedMimicry Winnti Playbook Execute","tags":["attack.execution","attack.defense_evasion","attack.t1106","attack.t1059.003","attack.t1218.011"],"interval":"5m","description":"Detects actions caused by the RedMimicry Winnti playbook","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/) AND process.command_line:(/.*[Gg][Tt][Hh][Rr][Ee][Aa][Dd]\\-3\\.6\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Tt][Mm][Pp]\\.[Bb][Aa][Tt].*/ OR /.*[Ss][Ii][Gg][Cc][Mm][Mm]\\-2\\.4\\.[Dd][Ll][Ll].*/))","rule_id":"95022b85-ff2a-49fa-939a-d7b8f56eeb9b","timestamp_override":"event.ingested","references":["https://redmimicry.com"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*rundll32.exe* OR *cmd.exe*) AND process.command_line:(*gthread\\-3.6.dll* OR *\\\\Windows\\\\Temp\\\\tmp.bat* OR *sigcmm\\-2.4.dll*))`"}
