{"id":"18739897-21b1-41da-8ee4-5b786915a676","created_by":"Tim Burrell","name":"GALLIUM Artefacts","tags":["attack.credential_access","attack.t1212","attack.command_and_control","attack.t1071"],"interval":"5m","description":"Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.hash.sha1:/[Ee]570585[Ee][Dd][Cc]69[Ff]9074[Cc][Bb]5[Ee]8[Aa]790708336[Bb][Dd]45[Cc][Aa]0[Ff]/ AND (NOT (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\([Xx]86\\)\\\\.*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/))))","rule_id":"18739897-21b1-41da-8ee4-5b786915a676","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn800669(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.hash.sha1:e570585edc69f9074cb5e8a790708336bd45ca0f AND (NOT (process.executable:(*\\:\\\\Program\\ Files\\(x86\\)\\\\* OR *\\:\\\\Program\\ Files\\\\*))))`"}
