{"id":"6e897651-f157-4d8f-aaeb-df8151488385","created_by":"Florian Roth","name":"PowerShell Web Download","tags":null,"interval":"5m","description":"Detects suspicious ways to download files or content using PowerShell","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Scripts or tools that download files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/)","rule_id":"6e897651-f157-4d8f-aaeb-df8151488385","timestamp_override":"event.ingested","references":["https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(*)`"}
