{"id":"37c1333a-a0db-48be-b64b-7393b2386e3b","created_by":"Florian Roth","name":"Hacktool by Cube0x0","tags":null,"interval":"5m","description":"Detects the use of tools created by a well-known hacktool producer named Cube0x0, which includes his handle in all binaries as company information in the PE headers (SharpPrintNightmare, KrbRelay, SharpMapExec etc.)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.pe.company:/[Cc][Uu][Bb][Ee]0[Xx]0/","rule_id":"37c1333a-a0db-48be-b64b-7393b2386e3b","timestamp_override":"event.ingested","references":["https://github.com/cube0x0","https://www.virustotal.com/gui/search/metadata%253ACube0x0/files"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.pe.company:Cube0x0`"}
