{"id":"a62298a3-1fe0-422f-9a68-ffbcbc5a123d","created_by":"Florian Roth","name":"MERCURY Command Line Patterns","tags":["attack.execution","attack.t1059.001","attack.g0069"],"interval":"5m","description":"Detects suspicious command line patterns as seen being used by MERCURY threat actor","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-[Ee][Xx][Ee][Cc]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ \\-[Ww]\\ 1\\ \\-[Ee][Nn][Cc].*/ AND process.command_line:/.*[Uu][Ww][Bb]0[Aa][Gg][Ee][Aa][Cc][Gg][Bb]0[Aa][Cc]0[Aa][Ss][Gg][Bb][Vv][Aa][Gg][Ii][Aa][Ii][Aa][Aa][Tt][Aa][Ff][Mm][Aa][Yy][Ww][Bb][Yy][Aa][Gg][Kk][Aa][Cc][Aa][Bb]0[Aa][Ee][Ii][Aa][Bb][Aa][Bb][Vv][Aa][Gg][Mm][Aa][Aa][Ww].*/)","rule_id":"a62298a3-1fe0-422f-9a68-ffbcbc5a123d","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-exec\\ bypass\\ \\-w\\ 1\\ \\-enc* AND process.command_line:*UwB0AGEAcgB0AC0ASgBvAGIAIAAtAFMAYwByAGkAcAB0AEIAbABvAGMAaw*)`"}
