{"id":"cd479ccc-d8f0-4c66-ba7d-e06286f3f887","created_by":"Bhabesh Raj","name":"CVE-2021-26857 Exchange Exploitation","tags":["attack.t1203","attack.execution","cve.2021.26857"],"interval":"5m","description":"Detects possible successful exploitation for vulnerability described in CVE-2021-26857 by looking for | abnormal subprocesses spawning by Exchange Server's Unified Messaging service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*[Uu][Mm][Ww][Oo][Rr][Kk][Ee][Rr][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*[Ww][Ee][Rr][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"cd479ccc-d8f0-4c66-ba7d-e06286f3f887","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*UMWorkerProcess.exe AND (NOT (process.executable:(*wermgr.exe OR *WerFault.exe))))`"}
