{"id":"e011a729-98a6-4139-b5c4-bf6f6dd8239a","created_by":"Florian Roth, juju4, keepwatch","name":"Suspicious Certutil Command Usage","tags":["attack.defense_evasion","attack.t1140","attack.command_and_control","attack.t1105","attack.s0160","attack.g0007","attack.g0010","attack.g0045","attack.g0049","attack.g0075","attack.g0096"],"interval":"5m","description":"Detects a suspicious Microsoft certutil execution with sub commands like 'decode' sub command, which is sometimes used to decode malicious code","risk_score":73,"enabled":true,"severity":"high","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee][Hh][Ee][Xx]\\ .*/ OR /.*\\ \\-[Uu][Rr][Ll][Cc][Aa][Cc][Hh][Ee]\\ .*/ OR /.*\\ \\-[Vv][Ee][Rr][Ii][Ff][Yy][Cc][Tt][Ll]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Dd][Ee][Cc][Oo][Dd][Ee][Hh][Ee][Xx]\\ .*/ OR /.*\\ \\/[Uu][Rr][Ll][Cc][Aa][Cc][Hh][Ee]\\ .*/ OR /.*\\ \\/[Vv][Ee][Rr][Ii][Ff][Yy][Cc][Tt][Ll]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee]\\ .*/) OR (process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Ii][Nn][Gg].*/))","rule_id":"e011a729-98a6-4139-b5c4-bf6f6dd8239a","timestamp_override":"event.ingested","references":["https://twitter.com/JohnLaTwC/status/835149808817991680","https://blogs.technet.microsoft.com/pki/2006/11/30/basic-crl-checking-with-certutil/","https://www.trustedsec.com/2017/07/new-tool-release-nps_payload/","https://twitter.com/egre55/status/1087685529016193025","https://lolbas-project.github.io/lolbas/Binaries/Certutil/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ \\-decode\\ * OR *\\ \\-decodehex\\ * OR *\\ \\-urlcache\\ * OR *\\ \\-verifyctl\\ * OR *\\ \\-encode\\ * OR *\\ \\/decode\\ * OR *\\ \\/decodehex\\ * OR *\\ \\/urlcache\\ * OR *\\ \\/verifyctl\\ * OR *\\ \\/encode\\ *) OR (process.executable:*\\\\certutil.exe AND process.command_line:*ping*))`"}
