{"id":"59e938ff-0d6d-4dc3-b13f-36cc28734d4e","created_by":"Julia Fomina, oscd.community","name":"Execute Code with Pester.bat","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects code execution via Pester.bat (Pester - Powershell Modulte for testing)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of Pester for writing tests for Powershell scripts and modules"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Pp][Ee][Ss][Tt][Ee][Rr].*/ AND process.command_line:/.*[Gg][Ee][Tt]\\-[Hh][Ee][Ll][Pp].*/) OR (process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Ee][Ss][Tt][Ee][Rr].*/ AND process.command_line:/.*;.*/ AND process.command_line:(/.*[Hh][Ee][Ll][Pp].*/ OR /.*\\?.*/)))","rule_id":"59e938ff-0d6d-4dc3-b13f-36cc28734d4e","timestamp_override":"event.ingested","references":["https://twitter.com/Oddvarmoe/status/993383596244258816"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Pester* AND process.command_line:*Get\\-Help*) OR (process.executable:*\\\\cmd.exe AND process.command_line:*pester* AND process.command_line:*;* AND process.command_line:(*help* OR *?*)))`"}
