{"id":"ffa28e60-bdb1-46e0-9f82-05f7a61cc06e","created_by":"Florian Roth","name":"Suspicious Add User to Remote Desktop Users Group","tags":["attack.persistence","attack.lateral_movement","attack.t1133","attack.t1136.001","attack.t1021.001"],"interval":"5m","description":"Detects suspicious command line in which a user gets added to the local Remote Desktop Users group","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp]\\ .*/ AND process.command_line:/.*\\ \\/[Aa][Dd][Dd].*/) OR (process.command_line:/.*[Aa][Dd][Dd]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr]\\ .*/ AND process.command_line:/.*\\ \\-[Gg][Rr][Oo][Uu][Pp]\\ .*/)) AND process.command_line:(/.*[Rr][Ee][Mm][Oo][Tt][Ee]\\ [Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\ [Uu][Ss][Ee][Rr][Ss].*/ OR /.*[Uu][Tt][Ii][Ll][Ii][Ss][Aa][Tt][Ee][Uu][Rr][Ss]\\ [Dd][Uu]\\ [Bb][Uu][Rr][Ee][Aa][Uu]\\ à\\ [Dd][Ii][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*[Uu][Ss][Uu][Aa][Rr][Ii][Oo][Ss]\\ [Dd][Ee]\\ [Ee][Ss][Cc][Rr][Ii][Tt][Oo][Rr][Ii][Oo]\\ [Rr][Ee][Mm][Oo][Tt][Oo].*/))","rule_id":"ffa28e60-bdb1-46e0-9f82-05f7a61cc06e","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*localgroup\\ * AND process.command_line:*\\ \\/add*) OR (process.command_line:*Add\\-LocalGroupMember\\ * AND process.command_line:*\\ \\-Group\\ *)) AND process.command_line:(*Remote\\ Desktop\\ Users* OR *Utilisateurs\\ du\\ Bureau\\ à\\ distance* OR *Usuarios\\ de\\ escritorio\\ remoto*))`"}
