{"id":"250ae82f-736e-4844-a68b-0b5e8cc887da","created_by":"Bhabesh Raj","name":"Shellcode Injection","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055"],"interval":"5m","description":"Detects shellcode injection by Metasploit's migrate and Empire's psinject","risk_score":73,"enabled":true,"severity":"high","false_positives":["Empire's csharp_exe payload uses 0x1f3fff for process enumeration as well"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.GrantedAccess:(/0[Xx]147[Aa]/ OR /0[Xx]1[Ff]3[Ff][Ff][Ff]/) AND winlog.event_data.CallTrace:/.*[Uu][Nn][Kk][Nn][Oo][Ww][Nn].*/)","rule_id":"250ae82f-736e-4844-a68b-0b5e8cc887da","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.GrantedAccess:(0x147a OR 0x1f3fff) AND winlog.event_data.CallTrace:*UNKNOWN*)`"}
