{"id":"d38d2fa4-98e6-4a24-aff1-410b0c9ad177","created_by":"Christian Burkard, Florian Roth","name":"UAC Bypass Tool UACMe Akagi","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects execution of UACMe (a tool used for UAC bypass) via default PE metadata","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.product:/[Uu][Aa][Cc][Mm][Ee]/ OR process.pe.company:(/[Rr][Ee][Vv][Oo][Ll]\\ [Cc][Oo][Rr][Pp]/ OR /[Aa][Pp][Tt]\\ 92/ OR /[Uu][Gg]\\ [Nn][Oo][Rr][Tt][Hh]/ OR /[Hh][Aa][Zz][Aa][Rr][Dd][Oo][Uu][Ss]\\ [Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss]/ OR /[Cc][Dd]\\ [Pp][Rr][Oo][Jj][Ee][Cc][Tt]\\ [Rr][Ee][Kk][Tt]/) OR process.pe.description:(/[Uu][Aa][Cc][Mm][Ee]\\ [Mm][Aa][Ii][Nn]\\ [Mm][Oo][Dd][Uu][Ll][Ee]/ OR /[Pp][Ee][Nn][Tt][Ee][Ss][Tt][Ii][Nn][Gg]\\ [Uu][Tt][Ii][Ll][Ii][Tt][Yy]/) OR process.pe.original_file_name:(/[Aa][Kk][Aa][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /[Aa][Kk][Aa][Gg][Ii]64\\.[Ee][Xx][Ee]/) OR process.executable:(/.*\\\\[Aa][Kk][Aa][Gg][Ii]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Kk][Aa][Gg][Ii]\\.[Ee][Xx][Ee]/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=767637[Cc]23[Bb][Bb]42[Cc][Dd]5[Dd]7397[Cc][Ff]58[Bb]0[Bb][Ee]688.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=14[Cc]4[Ee]4[Cc]72[Bb][Aa]075[Ee]9069[Ee][Ee]67[Ff]39188[Aa][Dd]8.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=3[Cc]782813[Dd]4[Aa][Ff][Cc][Ee]07[Bb][Bb][Ff][Cc]5[Aa]9772[Aa][Cc][Dd][Bb][Dd][Cc].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=7[Dd]010[Cc]6[Bb][Bb]6[Aa]3726[Ff]327[Ff]7[Ee]239166[Dd]127.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=89159[Bb][Aa]4[Dd][Dd]04[Ee]4[Cc][Ee]5559[Ff]132[Aa]9964[Ee][Bb]3.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=6[Ff]33[Ff]4[Aa]5[Ff][Cc]42[Bb]8[Cc][Ee][Cc]7314947[Bb][Dd]13[Ff]30[Ff].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=5834[Ee][Dd]4291[Bb][Dd][Ee][Bb]928270428[Ee][Bb][Bb][Aa][Ff]7604.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=5[Aa]8[Aa]8[Aa]43[Ff]25485[Ee]7[Ee][Ee]1[Bb]201[Ee][Dd][Cc][Bb][Cc]7[Aa]38.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Dd][Cc]7[Dd]30[Bb]90[Bb]2[Dd]8[Aa][Bb][Ff]664[Ff][Bb][Ee][Dd]2[Bb]1[Bb]59894.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=41923[Ee][Aa]1[Ff]824[Ff][Ee]63[Ee][Aa]5[Bb][Ee][Bb]84[Dd][Bb]7[Aa]3[Ee]74.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=3[Dd][Ee]09703[Cc]8[Ee]79[Ee][Dd]2[Cc][Aa]3[Ff]01074719906[Bb].*/) OR IMPHASH:(/767637[Cc]23[Bb][Bb]42[Cc][Dd]5[Dd]7397[Cc][Ff]58[Bb]0[Bb][Ee]688/ OR /14[Cc]4[Ee]4[Cc]72[Bb][Aa]075[Ee]9069[Ee][Ee]67[Ff]39188[Aa][Dd]8/ OR /3[Cc]782813[Dd]4[Aa][Ff][Cc][Ee]07[Bb][Bb][Ff][Cc]5[Aa]9772[Aa][Cc][Dd][Bb][Dd][Cc]/ OR /7[Dd]010[Cc]6[Bb][Bb]6[Aa]3726[Ff]327[Ff]7[Ee]239166[Dd]127/ OR /89159[Bb][Aa]4[Dd][Dd]04[Ee]4[Cc][Ee]5559[Ff]132[Aa]9964[Ee][Bb]3/ OR /6[Ff]33[Ff]4[Aa]5[Ff][Cc]42[Bb]8[Cc][Ee][Cc]7314947[Bb][Dd]13[Ff]30[Ff]/ OR /5834[Ee][Dd]4291[Bb][Dd][Ee][Bb]928270428[Ee][Bb][Bb][Aa][Ff]7604/ OR /5[Aa]8[Aa]8[Aa]43[Ff]25485[Ee]7[Ee][Ee]1[Bb]201[Ee][Dd][Cc][Bb][Cc]7[Aa]38/ OR /[Dd][Cc]7[Dd]30[Bb]90[Bb]2[Dd]8[Aa][Bb][Ff]664[Ff][Bb][Ee][Dd]2[Bb]1[Bb]59894/ OR /41923[Ee][Aa]1[Ff]824[Ff][Ee]63[Ee][Aa]5[Bb][Ee][Bb]84[Dd][Bb]7[Aa]3[Ee]74/ OR /3[Dd][Ee]09703[Cc]8[Ee]79[Ee][Dd]2[Cc][Aa]3[Ff]01074719906[Bb]/))","rule_id":"d38d2fa4-98e6-4a24-aff1-410b0c9ad177","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.product:UACMe OR process.pe.company:(REvol\\ Corp OR APT\\ 92 OR UG\\ North OR Hazardous\\ Environments OR CD\\ Project\\ Rekt) OR process.pe.description:(UACMe\\ main\\ module OR Pentesting\\ utility) OR process.pe.original_file_name:(Akagi.exe OR Akagi64.exe) OR process.executable:(*\\\\Akagi64.exe OR *\\\\Akagi.exe) OR related.hash:(*IMPHASH\\=767637C23BB42CD5D7397CF58B0BE688* OR *IMPHASH\\=14C4E4C72BA075E9069EE67F39188AD8* OR *IMPHASH\\=3C782813D4AFCE07BBFC5A9772ACDBDC* OR *IMPHASH\\=7D010C6BB6A3726F327F7E239166D127* OR *IMPHASH\\=89159BA4DD04E4CE5559F132A9964EB3* OR *IMPHASH\\=6F33F4A5FC42B8CEC7314947BD13F30F* OR *IMPHASH\\=5834ED4291BDEB928270428EBBAF7604* OR *IMPHASH\\=5A8A8A43F25485E7EE1B201EDCBC7A38* OR *IMPHASH\\=DC7D30B90B2D8ABF664FBED2B1B59894* OR *IMPHASH\\=41923EA1F824FE63EA5BEB84DB7A3E74* OR *IMPHASH\\=3DE09703C8E79ED2CA3F01074719906B*) OR IMPHASH:(767637c23bb42cd5d7397cf58b0be688 OR 14c4e4c72ba075e9069ee67f39188ad8 OR 3c782813d4afce07bbfc5a9772acdbdc OR 7d010c6bb6a3726f327f7e239166d127 OR 89159ba4dd04e4ce5559f132a9964eb3 OR 6f33f4a5fc42b8cec7314947bd13f30f OR 5834ed4291bdeb928270428ebbaf7604 OR 5a8a8a43f25485e7ee1b201edcbc7a38 OR dc7d30b90b2d8abf664fbed2b1b59894 OR 41923ea1f824fe63ea5beb84db7a3e74 OR 3de09703c8e79ed2ca3f01074719906b))`"}
