{"id":"fc0e89b5-adb0-43c1-b749-c12a10ec37de","created_by":"Nasreddine Bencherchali, Tim Shelton","name":"Delete SafeBoot Keys Via Reg Utility","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects execution of \"reg.exe\" commands with the \"delete\" flag on safe boot registry keys. Often used by attacker to prevent safeboot execution of security products","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ [Dd][Ee][Ll][Ee][Tt][Ee]\\ .*/ AND process.command_line:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt].*/))","rule_id":"fc0e89b5-adb0-43c1-b749-c12a10ec37de","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*reg.exe OR process.pe.original_file_name:reg.exe) AND (process.command_line:*\\ delete\\ * AND process.command_line:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot*))`"}
