{"id":"1a5fefe6-734f-452e-a07d-fc1c35bce4b2","created_by":"frack113","name":"Netsh Firewall Rule Deletion","tags":["attack.defense_evasion","attack.t1562.004"],"interval":"5m","description":"Detects the removal of a port or application rule in the Windows Firewall configuration using netsh","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Dd][Ee][Ll][Ee][Tt][Ee].*/) AND (NOT (process.parent.executable:/.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Nn][Aa][Mm][Ee]\\=[Dd][Rr][Oo][Pp][Bb][Oo][Xx].*/)))","rule_id":"1a5fefe6-734f-452e-a07d-fc1c35bce4b2","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/8bbd5b4c-b82d-4e6d-a3ea-d454594a37cc/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\netsh.exe AND process.command_line:*firewall* AND process.command_line:*delete*) AND (NOT (process.parent.executable:*\\\\Dropbox.exe AND process.command_line:*name\\=Dropbox*)))`"}
