{"id":"5e95028c-5229-4214-afae-d653d573d0ec","created_by":"Florian Roth, John Lambert (idea), elhoim","name":"Reg Disable Security Service","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects a suspicious reg.exe invocation that looks as if it would disable an important security service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown","Other security solution installers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Rr][Ee][Gg].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/) AND ((process.command_line:/.*\\ \\/[Dd]\\ 4.*/ AND process.command_line:/.*\\ \\/[Vv]\\ [Ss][Tt][Aa][Rr][Tt].*/ AND process.command_line:(/.*\\\\[Ss][Ee][Nn][Ss][Ee].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd].*/ OR /.*\\\\[Mm][Ss][Mm][Pp][Ss][Vv][Cc].*/ OR /.*\\\\[Nn][Ii][Ss][Ss][Rr][Vv].*/ OR /.*\\\\[Ww][Dd][Bb][Oo][Oo][Tt].*/ OR /.*\\\\[Ww][Dd][Nn][Ii][Ss][Dd][Rr][Vv].*/ OR /.*\\\\[Ww][Dd][Nn][Ii][Ss][Ss][Vv][Cc].*/ OR /.*\\\\[Ww][Ss][Cc][Ss][Vv][Cc].*/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*\\\\[Ww][Uu][Aa][Uu][Ss][Ee][Rr][Vv].*/ OR /.*\\\\[Uu][Ss][Oo][Ss][Vv][Cc].*/ OR /.*\\\\[Ww][Dd][Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*\\\\[Aa][Pp][Pp][Ii][Dd][Ss][Vv][Cc].*/)) OR (process.command_line:/.*\\ \\/[Dd]\\ 1.*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*/ AND process.command_line:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Oo][Nn][Aa][Cc][Cc][Ee][Ss][Ss][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Oo][Uu][Tt][Ii][Nn][Ee][Ll][Yy][Tt][Aa][Kk][Ii][Nn][Gg][Aa][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Oo][Nn][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Ee][Nn][Aa][Bb][Ll][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ee][Nn][Hh][Aa][Nn][Cc][Ee][Dd][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Ss][Pp][Yy][Ww][Aa][Rr][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Ss][Pp][Yy][Ww][Aa][Rr][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Cc][Oo][Nn][Ff][Ii][Gg].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Pp][Rr][Ii][Vv][Aa][Cc][Yy][Mm][Oo][Dd][Ee].*/ OR /.*[Ss][Ii][Gg][Nn][Aa][Tt][Uu][Rr][Ee][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Oo][Nn][Ss][Tt][Aa][Rr][Tt][Uu][Pp][Ww][Ii][Tt][Hh][Oo][Uu][Tt][Ee][Nn][Gg][Ii][Nn][Ee].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg].*/))))","rule_id":"5e95028c-5229-4214-afae-d653d573d0ec","timestamp_override":"event.ingested","references":["https://twitter.com/JohnLaTwC/status/1415295021041979392","https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1","https://vms.drweb.fr/virus/?i=24144899","https://bidouillesecurity.com/disable-windows-defender-in-powershell/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*reg* AND process.command_line:*add*) AND ((process.command_line:*\\ \\/d\\ 4* AND process.command_line:*\\ \\/v\\ Start* AND process.command_line:(*\\\\Sense* OR *\\\\WinDefend* OR *\\\\MsMpSvc* OR *\\\\NisSrv* OR *\\\\WdBoot* OR *\\\\WdNisDrv* OR *\\\\WdNisSvc* OR *\\\\wscsvc* OR *\\\\SecurityHealthService* OR *\\\\wuauserv* OR *\\\\UsoSvc* OR *\\\\WdFilter* OR *\\\\AppIDSvc*)) OR (process.command_line:*\\ \\/d\\ 1* AND process.command_line:*Windows\\ Defender* AND process.command_line:(*DisableIOAVProtection* OR *DisableOnAccessProtection* OR *DisableRoutinelyTakingAction* OR *DisableScanOnRealtimeEnable* OR *DisableBlockAtFirstSeen* OR *DisableBehaviorMonitoring* OR *DisableEnhancedNotifications* OR *DisableAntiSpyware* OR *DisableAntiSpywareRealtimeProtection* OR *DisableConfig* OR *DisablePrivacyMode* OR *SignatureDisableUpdateOnStartupWithoutEngine* OR *DisableArchiveScanning* OR *DisableIntrusionPreventionSystem* OR *DisableScriptScanning*))))`"}
