{"id":"6ba5a05f-b095-4f0a-8654-b825f4f16334","created_by":"Florian Roth","name":"MSTSC Shadowing","tags":["attack.lateral_movement","attack.t1563.002"],"interval":"5m","description":"Detects RDP session hijacking by using MSTSC shadowing","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Oo][Cc][Oo][Nn][Ss][Ee][Nn][Tt][Pp][Rr][Oo][Mm][Pp][Tt].*/ AND process.command_line:/.*[Ss][Hh][Aa][Dd][Oo][Ww]\\:.*/)","rule_id":"6ba5a05f-b095-4f0a-8654-b825f4f16334","timestamp_override":"event.ingested","references":["https://twitter.com/kmkz_security/status/1220694202301976576","https://github.com/kmkz/Pentesting/blob/47592e5e160d3b86c2024f09ef04ceb87d204995/Post-Exploitation-Cheat-Sheet"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*noconsentprompt* AND process.command_line:*shadow\\:*)`"}
