{"id":"84f52741-8834-4a8c-a413-2eb2269aa6c8","created_by":"frack113","name":"Suspicious Msiexec Load DLL","tags":["attack.defense_evasion","attack.t1218.007"],"interval":"5m","description":"Detects MsiExec loading a DLL and calling its DllUnregisterServer function","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Zz]\\ .*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/)","rule_id":"84f52741-8834-4a8c-a413-2eb2269aa6c8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msiexec.exe AND process.command_line:*\\ \\/z\\ * AND process.command_line:*.dll*)`"}
