{"id":"4be8b654-0c01-4c9d-a10c-6b28467fc651","created_by":"Florian Roth","name":"LSASS Access from White-Listed Processes","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects a possible process memory dump that uses the white-listed filename like TrolleyExpress.exe as a way to dump the lsass process memory without Microsoft Defender interference","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely, since these tools shouldn't access lsass.exe at all"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Tt][Rr][Oo][Ll][Ll][Ee][Yy][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:(/.*10/ OR /.*30/ OR /.*50/ OR /.*70/ OR /.*90/ OR /.*[Bb]0/ OR /.*[Dd]0/ OR /.*[Ff]0/ OR /.*18/ OR /.*38/ OR /.*58/ OR /.*78/ OR /.*98/ OR /.*[Bb]8/ OR /.*[Dd]8/ OR /.*[Ff]8/ OR /.*1[Aa]/ OR /.*3[Aa]/ OR /.*5[Aa]/ OR /.*7[Aa]/ OR /.*9[Aa]/ OR /.*[Bb][Aa]/ OR /.*[Dd][Aa]/ OR /.*[Ff][Aa]/ OR /.*0[Xx]14[Cc]2/ OR /.*[Ff][Ff]/))","rule_id":"4be8b654-0c01-4c9d-a10c-6b28467fc651","timestamp_override":"event.ingested","references":["https://twitter.com/_xpn_/status/1491557187168178176","https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz","https://twitter.com/mrd0x/status/1460597833917251595"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:(*\\\\TrolleyExpress.exe OR *\\\\ProcessDump.exe OR *\\\\dump64.exe) AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF))`"}
