{"id":"98a96a5a-64a0-4c42-92c5-489da3866cb0","created_by":"Daniil Yugoslavskiy, oscd.community","name":"DNS Exfiltration and Tunneling Tools Execution","tags":["attack.exfiltration","attack.t1048.001","attack.command_and_control","attack.t1071.004","attack.t1132.001"],"interval":"5m","description":"Well-known DNS Exfiltration tools execution","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of iodine or dnscat2 — DNS Exfiltration tools (unlikely)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ii][Oo][Dd][Ii][Nn][Ee]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Dd][Nn][Ss][Cc][Aa][Tt]2.*/)","rule_id":"98a96a5a-64a0-4c42-92c5-489da3866cb0","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\iodine.exe OR process.executable:*\\\\dnscat2*)`"}
