{"id":"634b00d5-ccc3-4a06-ae3b-0ec8444dd51b","created_by":"Agro (@agro_sev) oscd.community","name":"Malicious Windows Script Components File Execution by TAEF Detection","tags":["attack.t1218"],"interval":"5m","description":"Windows Test Authoring and Execution Framework (TAEF) framework allows you to run automation by executing tests files written on different languages (C, C#, Microsoft COM Scripting interfaces). Adversaries may execute malicious code (such as WSC file with VBScript, dll and so on) directly by running te.exe","risk_score":21,"enabled":true,"severity":"low","false_positives":["It's not an uncommon to use te.exe directly to execute legal TAEF tests"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Tt][Ee]\\.[Ee][Xx][Ee]/ OR process.parent.executable:/.*\\\\[Tt][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/\\\\[Tt][Ee]\\.[Ee][Xx][Ee]/)","rule_id":"634b00d5-ccc3-4a06-ae3b-0ec8444dd51b","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Te/","https://twitter.com/pabraeken/status/993298228840992768","https://docs.microsoft.com/en-us/windows-hardware/drivers/taef/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\te.exe OR process.parent.executable:*\\\\te.exe OR process.pe.original_file_name:\\\\te.exe)`"}
