{"id":"e31033fc-33f0-4020-9a16-faf9b31cbf08","created_by":"frack113, Florian Roth","name":"Ncat Execution","tags":["attack.command_and_control","attack.t1095"],"interval":"5m","description":"Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate ncat use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Nn][Cc][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Cc][Aa][Tt]\\.[Ee][Xx][Ee]/) OR process.command_line:(/.*\\ \\-[Ll][Vv][Pp]\\ .*/ OR /.*\\ \\-[Ll][Vv][Nn][Pp].*/ OR /.*\\ \\-[Ll]\\ \\-[Vv]\\ \\-[Pp]\\ .*/ OR /.*\\ \\-[Ll][Vv]\\ \\-[Pp]\\ .*/ OR /.*\\ \\-[Ll]\\ \\-\\-[Pp][Rr][Oo][Xx][Yy]\\-[Tt][Yy][Pp][Ee]\\ [Hh][Tt][Tt][Pp]\\ .*/ OR /.*\\ \\-\\-[Ee][Xx][Ee][Cc]\\ [Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ .*/ OR /.*\\ \\-[Vv][Nn][Ll]\\ \\-\\-[Ee][Xx][Ee][Cc]\\ .*/))","rule_id":"e31033fc-33f0-4020-9a16-faf9b31cbf08","timestamp_override":"event.ingested","references":["https://nmap.org/ncat/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\ncat.exe OR *\\\\netcat.exe) OR process.command_line:(*\\ \\-lvp\\ * OR *\\ \\-lvnp* OR *\\ \\-l\\ \\-v\\ \\-p\\ * OR *\\ \\-lv\\ \\-p\\ * OR *\\ \\-l\\ \\-\\-proxy\\-type\\ http\\ * OR *\\ \\-\\-exec\\ cmd.exe\\ * OR *\\ \\-vnl\\ \\-\\-exec\\ *))`"}
