{"id":"62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c","created_by":"frack113","name":"Tor Client or Tor Browser Use","tags":["attack.command_and_control","attack.t1090.003"],"interval":"5m","description":"Detects the use of Tor or Tor-Browser to connect to onion routing networks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:(/.*\\\\[Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Oo][Rr]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)","rule_id":"62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c","timestamp_override":"event.ingested","references":["https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:(*\\\\tor.exe OR *\\\\Tor\\ Browser\\\\Browser\\\\firefox.exe)`"}
