{"id":"3037d961-21e9-4732-b27a-637bcc7bf539","created_by":"frack113","name":"Suspicious Conhost Legacy Option","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"ForceV1 asks for information directly from the kernel space. Conhost connects to the console application","risk_score":73,"enabled":true,"severity":"informational","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*0[Xx][Ff][Ff][Ff][Ff][Ff][Ff][Ff][Ff].*/ AND process.command_line:/.*\\-[Ff][Oo][Rr][Cc][Ee][Vv]1.*/)","rule_id":"3037d961-21e9-4732-b27a-637bcc7bf539","timestamp_override":"event.ingested","references":["https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29","https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*conhost.exe* AND process.command_line:*0xffffffff* AND process.command_line:*\\-ForceV1*)`"}
