{"id":"c3198a27-23a0-4c2c-af19-e5328d49680e","created_by":"Trent Liffick (@tliffick)","name":"Blue Mockingbird","tags":["attack.execution","attack.t1112","attack.t1047"],"interval":"5m","description":"Attempts to detect system changes made by Blue Mockingbird","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Cc]\\ [Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*[Ww][Ee][Rr][Cc][Pp][Ll][Ss][Uu][Pp][Pp][Oo][Rr][Tt][Ee]\\.[Dd][Ll][Ll].*/) OR (process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Oo][Rr]_[Pp][Rr][Oo][Ff][Ii][Ll][Ee][Rr]/))","rule_id":"c3198a27-23a0-4c2c-af19-e5328d49680e","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blue-mockingbird-cryptominer/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\cmd.exe AND process.command_line:*sc\\ config* AND process.command_line:*wercplsupporte.dll*) OR (process.executable:*\\\\wmic.exe AND process.command_line:*COR_PROFILER))`"}
