{"id":"15bd98ea-55f4-4d37-b09a-e7caa0fa2221","created_by":"Christopher Peacock @securepeacock, SCYTHE @scythe_io, TactiKoolSec","name":"Rundll32 InstallScreenSaver Execution","tags":["attack.t1218.011","attack.defense_evasion"],"interval":"5m","description":"An attacker may execute an application as a SCR File using rundll32.exe desk.cpl,InstallScreenSaver","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate installation of a new screensaver"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Rr].*/)","rule_id":"15bd98ea-55f4-4d37-b09a-e7caa0fa2221","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Libraries/Desk/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.command_line:*InstallScreenSaver*)`"}
