{"id":"4abc0ec4-db5a-412f-9632-26659cddf145","created_by":"Nasreddine Bencherchali","name":"UEFI Persistence Via Wpbbin - ProcessCreation","tags":["attack.persistence","attack.defense_evasion","attack.t1542.001"],"interval":"5m","description":"Detects execution of the binary \"wpbbin\" which is used as part of the UEFI based persistence method described in the reference section","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet for the tip)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Pp][Bb][Bb][Ii][Nn]\\.[Ee][Xx][Ee]/","rule_id":"4abc0ec4-db5a-412f-9632-26659cddf145","timestamp_override":"event.ingested","references":["https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c","https://persistence-info.github.io/Data/wpbbin.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:C\\:\\\\Windows\\\\System32\\\\wpbbin.exe`"}
