{"id":"71158e3f-df67-472b-930e-7d287acaa3e1","created_by":"Max Altgelt","name":"Execution Of Non-Existing File","tags":["attack.defense_evasion"],"interval":"5m","description":"Checks whether the image specified in a process creation event is not a full, absolute path (caused by process ghosting or other unorthodox methods to start a process)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((NOT (process.executable:/.*\\\\.*/)) AND (NOT ((NOT _exists_:process.executable) OR (process.executable:(\\- OR \"\")) OR (process.executable:(/[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]/ OR /[Mm][Ee][Mm][Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn]/) OR process.command_line:(/[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]/ OR /[Mm][Ee][Mm][Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn]/)))))","rule_id":"71158e3f-df67-472b-930e-7d287acaa3e1","timestamp_override":"event.ingested","references":["https://pentestlaboratories.com/2021/12/08/process-ghosting/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((NOT (process.executable:*\\\\*)) AND (NOT ((NOT _exists_:process.executable) OR (process.executable:(\\- OR \"\")) OR (process.executable:(Registry OR MemCompression) OR process.command_line:(Registry OR MemCompression)))))`"}
