{"id":"379fa130-190e-4c3f-b7bc-6c8e834485f3","created_by":"frack113","name":"Windows Cmd Delete File","tags":["attack.defense_evasion","attack.t1070.004"],"interval":"5m","description":"Adversaries may delete files left behind by the actions of their intrusion activity.\nMalware, tools, or other non-native files dropped or created on a system by an adversary may leave traces to indicate to what was done within a network and how.\nRemoval of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\ [Dd][Ee][Ll]\\ .*/ AND process.command_line:/.*\\/[Ff].*/) OR (process.command_line:/.*[Rr][Mm][Dd][Ii][Rr].*/ AND process.command_line:/.*\\/[Ss].*/ AND process.command_line:/.*\\/[Qq].*/))","rule_id":"379fa130-190e-4c3f-b7bc-6c8e834485f3","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\ del\\ * AND process.command_line:*\\/f*) OR (process.command_line:*rmdir* AND process.command_line:*\\/s* AND process.command_line:*\\/q*))`"}
