{"id":"bb76d96b-821c-47cf-944b-7ce377864492","created_by":"Elastic (idea), Tobias Michalski","name":"Suspicious WebDav Client Execution","tags":["attack.privilege_escalation","attack.credential_access","attack.t1212"],"interval":"5m","description":"Detects a privilege elevation attempt by coercing NTLM authentication on the Printer Spooler service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Aa][Vv][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll],[Dd][Aa][Vv][Ss][Ee][Tt][Cc][Oo][Oo][Kk][Ii][Ee].*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/ AND process.command_line:(/.*[Ss][Pp][Oo][Oo][Ll][Ss][Ss].*/ OR /.*[Ss][Rr][Vv][Ss][Vv][Cc].*/ OR /.*\\/[Pp][Rr][Ii][Nn][Tt]\\/[Pp][Ii][Pp][Ee]\\/.*/))","rule_id":"bb76d96b-821c-47cf-944b-7ce377864492","timestamp_override":"event.ingested","references":["https://twitter.com/med0x2e/status/1520402518685200384","https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.command_line:*C\\:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie* AND process.command_line:*http* AND process.command_line:(*spoolss* OR *srvsvc* OR *\\/print\\/pipe\\/*))`"}
