{"id":"e6313acd-208c-44fc-a0ff-db85d572e90e","created_by":"Florian Roth","name":"Network Reconnaissance Activity","tags":["attack.discovery","attack.t1087","attack.t1082","car.2016-03-001"],"interval":"5m","description":"Detects a set of suspicious network related commands often used in recon stages","risk_score":73,"enabled":true,"severity":"high","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp].*/ AND process.command_line:/.*_[Ll][Dd][Aa][Pp]\\._[Tt][Cc][Pp]\\.[Dd][Cc]\\._[Mm][Ss][Dd][Cc][Ss]\\..*/)","rule_id":"e6313acd-208c-44fc-a0ff-db85d572e90e","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*nslookup* AND process.command_line:*_ldap._tcp.dc._msdcs.*)`"}
