{"id":"21dd6d38-2b18-4453-9404-a0fe4a0cc288","created_by":"Sreeman, Nasreddine Bencherchali","name":"Curl Start Combination","tags":["attack.execution","attack.t1218","attack.command_and_control","attack.t1105"],"interval":"5m","description":"Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative scripts (installers)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\/[Cc]\\ .*/ AND process.command_line:/.*[Cc][Uu][Rr][Ll]\\ .*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/ AND process.command_line:/.*\\-[Oo].*/ AND process.command_line:/.*\\&.*/)","rule_id":"21dd6d38-2b18-4453-9404-a0fe4a0cc288","timestamp_override":"event.ingested","references":["https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\/c\\ * AND process.command_line:*curl\\ * AND process.command_line:*http* AND process.command_line:*\\-o* AND process.command_line:*&*)`"}
