{"id":"731231b9-0b5d-4219-94dd-abb6959aa7ea","created_by":"Florian Roth","name":"Suspicious Rundll32 Activity Invoking Sys File","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects suspicious process related to rundll32 based on command line that includes a *.sys file as seen being used by UNC2452","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*\\.[Ss][Yy][Ss],.*/ OR /.*\\.[Ss][Yy][Ss]\\ .*/))","rule_id":"731231b9-0b5d-4219-94dd-abb6959aa7ea","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32.exe* AND process.command_line:(*.sys,* OR *.sys\\ *))`"}
