{"id":"285b85b1-a555-4095-8652-a8a4106af63f","created_by":"Konstantin Grishchenko, oscd.community","name":"Suspicious Rundll32 Setupapi.dll Activity","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"setupapi.dll library provide InstallHinfSection function for processing INF files. INF file may contain instructions allowing to create values in the registry, modify files and install drivers. This technique could be used to obtain persistence via modifying one of Run or RunOnce registry keys, run process or use other DLLs chain calls (see references) InstallHinfSection function in setupapi.dll calls runonce.exe executable regardless of actual content of INF file.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Scripts and administrative tools that use INF files for driver installation with setupapi.dll"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*[Ss][Ee][Tt][Uu][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll].*/ AND process.parent.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Hh][Ii][Nn][Ff][Ss][Ee][Cc][Tt][Ii][Oo][Nn].*/)","rule_id":"285b85b1-a555-4095-8652-a8a4106af63f","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Libraries/Setupapi/","https://gist.githubusercontent.com/bohops/0cc6586f205f3691e04a1ebf1806aabd/raw/baf7b29891bb91e76198e30889fbf7d6642e8974/calc_exe.inf","https://raw.githubusercontent.com/huntresslabs/evading-autoruns/master/shady.inf","https://twitter.com/Z3Jpa29z/status/1313742350292746241?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\runonce.exe AND process.parent.executable:*\\\\rundll32.exe AND process.parent.command_line:*setupapi.dll* AND process.parent.command_line:*InstallHinfSection*)`"}
