{"id":"1070db9a-3e5d-412e-8e7b-7183b616e1b3","created_by":"Sreeman","name":"Sticky-Key Backdoor Copy Cmd.exe","tags":["attack.t1546.008","attack.privilege_escalation"],"interval":"5m","description":"By replacing the sticky keys executable with the local admins CMD executable, an attacker is able to access a privileged windows console session without authenticating to the system. When the sticky keys are \"activated\" the privilleged shell is launched.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/[Cc][Oo][Pp][Yy]\\ \\/[Yy]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee]/","rule_id":"1070db9a-3e5d-412e-8e7b-7183b616e1b3","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html","https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:copy\\ \\/y\\ C\\:\\\\windows\\\\system32\\\\cmd.exe\\ C\\:\\\\windows\\\\system32\\\\sethc.exe`"}
