{"id":"a77c1610-fc73-4019-8e29-0f51efc04a51","created_by":"frack113","name":"Suspicious Dosfuscation Character in Commandline","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects possible payload obfuscation via the commandline","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\^\\^.*/ OR /.*,;,.*/ OR /.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]\\:\\~.*/ OR /.*\\ [Ss]\\^[Ee][Tt]\\ .*/ OR /.*\\ [Ss]\\^[Ee]\\^[Tt]\\ .*/ OR /.*\\ [Ss][Ee]\\^[Tt]\\ .*/)","rule_id":"a77c1610-fc73-4019-8e29-0f51efc04a51","timestamp_override":"event.ingested","references":["https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\^\\^* OR *,;,* OR *%COMSPEC\\:\\~* OR *\\ s\\^et\\ * OR *\\ s\\^e\\^t\\ * OR *\\ se\\^t\\ *)`"}
