{"id":"53d4bb30-3f36-4e8a-b078-69d36c4a79ff","created_by":"Ensar Şamil, @sblmsrsn, @oscd_initiative","name":"Custom Class Execution via Xwizard","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the execution of Xwizard tool with specific arguments which utilized to run custom class properties.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Xx][Ww][Ii][Zz][Aa][Rr][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}}/)","rule_id":"53d4bb30-3f36-4e8a-b078-69d36c4a79ff","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Xwizard/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\xwizard.exe AND process.command_line:/{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}}/)`"}
