{"id":"27a72a60-7e5e-47b1-9d17-909c9abafdcd","created_by":"Florian Roth, Samir Bousseaden","name":"Suspicious Compression Tool Parameters","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"Detects suspicious command line arguments of common data compression tools","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:(/7[Zz].*\\.[Ee][Xx][Ee]/ OR /.*[Rr][Aa][Rr]\\.[Ee][Xx][Ee]/ OR /.*[Cc][Oo][Mm][Mm][Aa][Nn][Dd].*[Ll][Ii][Nn][Ee].*[Rr][Aa][Rr].*/) AND process.command_line:(/.*\\ \\-[Pp].*/ OR /.*\\ \\-[Tt][Aa].*/ OR /.*\\ \\-[Tt][Bb].*/ OR /.*\\ \\-[Ss][Dd][Ee][Ll].*/ OR /.*\\ \\-[Dd][Ww].*/ OR /.*\\ \\-[Hh][Pp].*/)) AND (NOT (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/)))","rule_id":"27a72a60-7e5e-47b1-9d17-909c9abafdcd","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1184067445612535811"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:(7z*.exe OR *rar.exe OR *Command*Line*RAR*) AND process.command_line:(*\\ \\-p* OR *\\ \\-ta* OR *\\ \\-tb* OR *\\ \\-sdel* OR *\\ \\-dw* OR *\\ \\-hp*)) AND (NOT (process.parent.executable:C\\:\\\\Program*)))`"}
