{"id":"dee0a7a3-f200-4112-a99b-952196d81e42","created_by":"Florian Roth","name":"DumpMinitool Usage","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects the use of a Visual Studio bundled tool named DumpMinitool.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Uu][Mm][Pp][Mm][Ii][Nn][Ii][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR OriginalName:/[Dd][Uu][Mm][Pp][Mm][Ii][Nn][Ii][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR (process.command_line:/.*\\ \\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\ .*/ AND process.command_line:/.*\\ \\-\\-[Dd][Uu][Mm][Pp][Tt][Yy][Pp][Ee]\\ [Ff][Uu][Ll][Ll].*/))","rule_id":"dee0a7a3-f200-4112-a99b-952196d81e42","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1511415432888131586?s=20&t=DvVrzeZ1OcGiWowbhPV8Lg","https://twitter.com/mrd0x/status/1511489821247684615"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\DumpMinitool.exe OR OriginalName:DumpMinitool.exe OR (process.command_line:*\\ \\-\\-processId\\ * AND process.command_line:*\\ \\-\\-dumpType\\ Full*))`"}
