{"id":"744a188b-0415-4792-896f-11ddb0588dbc","created_by":"Alexander McDonald","name":"Msra.exe Process Injection","tags":["attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Detects process injection using Microsoft Remote Asssistance (Msra.exe) which has been used for discovery and persistence tactics","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of Msra.exe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Mm][Ss][Rr][Aa]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*[Mm][Ss][Rr][Aa]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Aa][Rr][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Oo][Uu][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/))","rule_id":"744a188b-0415-4792-896f-11ddb0588dbc","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/","https://www.fortinet.com/content/dam/fortinet/assets/analyst-reports/ar-qakbot.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\msra.exe AND process.parent.command_line:*msra.exe AND process.executable:(*\\\\arp.exe OR *\\\\cmd.exe OR *\\\\net.exe OR *\\\\netstat.exe OR *\\\\nslookup.exe OR *\\\\route.exe OR *\\\\schtasks.exe OR *\\\\whoami.exe))`"}
