{"id":"754ed792-634f-40ae-b3bc-e0448d33f695","created_by":"Teymur Kheirkhabarov, Harish Segar (rule)","name":"Suspicious PowerShell Parent Process","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a suspicious parents of powershell.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Aa][Cc][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Ss][Ii][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Mm][Ii][Gg][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Cc][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Aa][Ff][Aa][Rr][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Qq][Ll][Ss][Ee][Rr][Vv][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Bb][Oo][Ss][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Ss][Hh]\\.[Ee][Xx][Ee]/) OR process.parent.executable:/.*[Tt][Oo][Mm][Cc][Aa][Tt].*/) AND (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) OR process.command_line:(/.*\\/[Cc]\\ [Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\/[Cc]\\ [Pp][Ww][Ss][Hh].*/) OR process.pe.description:/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]/ OR process.pe.product:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ [Cc][Oo][Rr][Ee]\\ 6/))","rule_id":"754ed792-634f-40ae-b3bc-e0448d33f695","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\services.exe OR *\\\\winword.exe OR *\\\\wmiprvse.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\visio.exe OR *\\\\outlook.exe OR *\\\\amigo.exe OR *\\\\chrome.exe OR *\\\\firefox.exe OR *\\\\iexplore.exe OR *\\\\microsoftedgecp.exe OR *\\\\microsoftedge.exe OR *\\\\browser.exe OR *\\\\vivaldi.exe OR *\\\\safari.exe OR *\\\\sqlagent.exe OR *\\\\sqlserver.exe OR *\\\\sqlservr.exe OR *\\\\w3wp.exe OR *\\\\httpd.exe OR *\\\\nginx.exe OR *\\\\php\\-cgi.exe OR *\\\\jbosssvc.exe OR *MicrosoftEdgeSH.exe) OR process.parent.executable:*tomcat*) AND (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) OR process.command_line:(*\\/c\\ powershell* OR *\\/c\\ pwsh*) OR process.pe.description:Windows\\ PowerShell OR process.pe.product:PowerShell\\ Core\\ 6))`"}
