{"id":"9aa01d62-7667-4d3b-acb8-8cb5103e2014","created_by":"Florian Roth","name":"Emissary Panda Malware SLLauncher","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects the execution of DLL side-loading malware used by threat group Emissary Panda aka APT27","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ss][Ll][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"9aa01d62-7667-4d3b-acb8-8cb5103e2014","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/579e7587-f09d-4aae-8b07-472833262965","https://twitter.com/cyb3rops/status/1168863899531132929"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\sllauncher.exe AND process.executable:*\\\\svchost.exe)`"}
