{"id":"45d3a03d-f441-458c-8883-df101a3bb146","created_by":"Nasreddine Bencherchali","name":"Launch-VsDevShell.PS1 Proxy Execution","tags":["attack.defense_evasion","attack.t1216.001"],"interval":"5m","description":"Detects the use of the 'Launch-VsDevShell.ps1' Microsoft signed script to execute commands.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of the script by a developer"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh]\\-[Vv][Ss][Dd][Ee][Vv][Ss][Hh][Ee][Ll][Ll]\\.[Pp][Ss]1.*/ AND process.command_line:(/.*[Vv][Ss][Ww][Hh][Ee][Rr][Ee][Pp][Aa][Tt][Hh]\\ .*/ OR /.*[Vv][Ss][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Aa][Tt][Ii][Oo][Nn][Pp][Aa][Tt][Hh]\\ .*/))","rule_id":"45d3a03d-f441-458c-8883-df101a3bb146","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1535981653239255040"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Launch\\-VsDevShell.ps1* AND process.command_line:(*VsWherePath\\ * OR *VsInstallationPath\\ *))`"}
