{"id":"8a8379b8-780b-4dbf-b1e9-31c8d112fefb","created_by":"Florian Roth","name":"Schtasks From Suspicious Folders","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"Detects scheduled task creations that have suspicious action command and folder combinations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ AND process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk]\\ .*/) AND process.command_line:(/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*%[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]%.*/))","rule_id":"8a8379b8-780b-4dbf-b1e9-31c8d112fefb","timestamp_override":"event.ingested","references":["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lazarus-dream-job-chemical"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/create\\ * AND process.command_line:(*powershell* OR *cmd\\ \\/c\\ * OR *cmd\\ \\/k\\ * OR *cmd.exe\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ *) AND process.command_line:(*C\\:\\\\ProgramData\\\\* OR *%ProgramData%*))`"}
