{"id":"dca91cfd-d7ab-4c66-8da7-ee57d487b35b","created_by":"frack113","name":"Process Start From Suspicious Folder","tags":["attack.execution","attack.t1204"],"interval":"5m","description":"Detects process start from rare or uncommon folders like temporary folder or folders that usually don't contain executable files","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/) AND (NOT ((process.parent.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ll][Ee][Aa][Nn][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee][Ss]\\\\[Aa][Pp][Pp]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Hh][Uu][Bb]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Vv][Ii][Ss][Uu][Aa][Ll][Ss][Tt][Uu][Dd][Ii][Oo]\\.[Ss][Ee][Tt][Uu][Pp]\\.[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Bb][Aa][Cc][Kk][Gg][Rr][Oo][Uu][Nn][Dd][Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Xx][Gg][Ii][Aa][Dd][Aa][Pp][Tt][Ee][Rr][Cc][Aa][Cc][Hh][Ee]\\.[Ee][Xx][Ee]/) OR process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Nn][Vv][Ii][Dd][Ii][Aa]\\ [Cc][Oo][Rr][Pp][Oo][Rr][Aa][Tt][Ii][Oo][Nn]\\\\.*/) OR (process.executable:/.*[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\.[Tt][Mm][Pp]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/))))","rule_id":"dca91cfd-d7ab-4c66-8da7-ee57d487b35b","timestamp_override":"event.ingested","references":["Malware sandbox results"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\Desktop\\\\* OR *\\\\Temp\\\\* OR *\\\\Temporary\\ Internet*) AND (NOT ((process.parent.executable:(C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\Installer\\\\resources\\\\app\\\\ServiceHub\\\\Services\\\\Microsoft.VisualStudio.Setup.Service\\\\BackgroundDownload.exe OR C\\:\\\\Windows\\\\System32\\\\dxgiadaptercache.exe) OR process.parent.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\NVIDIA\\ Corporation\\\\*) OR (process.executable:*setup.exe) OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Temp\\\\* AND process.executable:*.tmp\\\\MicrosoftEdgeUpdate.exe))))`"}
