{"id":"b18c9d4c-fac9-4708-bd06-dd5bfacf200f","created_by":"Alfie Champion (ajpc500)","name":"F-Secure C3 Load by Rundll32","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"F-Secure C3 produces DLLs with a default exported StartNodeRelay function.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Tt][Aa][Rr][Tt][Nn][Oo][Dd][Ee][Rr][Ee][Ll][Aa][Yy].*/)","rule_id":"b18c9d4c-fac9-4708-bd06-dd5bfacf200f","timestamp_override":"event.ingested","references":["https://github.com/FSecureLABS/C3/blob/11a081fd3be2aaf2a879f6b6e9a96ecdd24966ef/Src/NodeRelayDll/NodeRelayDll.cpp#L12"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32.exe* AND process.command_line:*.dll* AND process.command_line:*StartNodeRelay*)`"}
