{"id":"970007b7-ce32-49d0-a4a4-fbef016950bd","created_by":"Timur Zinniatullin, oscd.community","name":"Query Registry","tags":["attack.discovery","attack.t1012","attack.t1007"],"interval":"5m","description":"Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.","risk_score":21,"enabled":true,"severity":"low","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Qq][Uu][Ee][Rr][Yy].*/ OR /.*[Ss][Aa][Vv][Ee].*/ OR /.*[Ee][Xx][Pp][Oo][Rr][Tt].*/) AND process.command_line:(/.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/ OR /.*[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\.*/ OR /.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Dd][Ee][Ll][Aa][Yy][Ll][Oo][Aa][Dd].*/ OR /.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/ OR /.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Rr][Uu][Nn].*/ OR /.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss].*/))","rule_id":"970007b7-ce32-49d0-a4a4-fbef016950bd","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:(*query* OR *save* OR *export*) AND process.command_line:(*currentVersion\\\\windows* OR *winlogon\\\\* OR *currentVersion\\\\shellServiceObjectDelayLoad* OR *currentVersion\\\\run* OR *currentVersion\\\\policies\\\\explorer\\\\run* OR *currentcontrolset\\\\services*))`"}
