{"id":"734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Remote PowerShell Session Host Process (WinRM)","tags":["attack.execution","attack.t1059.001","attack.t1021.006"],"interval":"5m","description":"Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM host process) as a parent or child process (sign of an active PowerShell remote session).","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of remote Powershell, e.g. for monitoring purposes."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR process.parent.executable:/.*\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wsmprovhost.exe OR process.parent.executable:*\\\\wsmprovhost.exe)`"}
