{"id":"d87bd452-6da1-456e-8155-7dc988157b7d","created_by":"Nasreddine Bencherchali","name":"Suspicious Usage Of ShellExec_rundll","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious usage of the ShellExec_rundll function to launch other commands as seen in the the raspberry-robin attack","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*,[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND process.command_line:(/.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*[Oo][Dd][Bb][Cc][Cc][Oo][Nn][Ff].*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/))","rule_id":"d87bd452-6da1-456e-8155-7dc988157b7d","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/raspberry-robin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*,ShellExec_rundll* AND process.command_line:(*regsvr32* OR *C\\:\\\\Users\\\\Public\\\\* OR *odbcconf* OR *\\\\Desktop\\\\*))`"}
