{"id":"52d097e2-063e-4c9c-8fbb-855c8948d135","created_by":"Florian Roth","name":"Suspicious Windows Update Agent Empty Cmdline","tags":null,"interval":"5m","description":"Detects suspicious Windows Update Agent activity in which a wuauclt.exe process command line doesn't contain any command line flags","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"52d097e2-063e-4c9c-8fbb-855c8948d135","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blackbyte-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\Wuauclt.exe OR process.pe.original_file_name:Wuauclt.exe) AND process.command_line:*\\\\Wuauclt.exe)`"}
