{"id":"c7942406-33dd-4377-a564-0f62db0593a3","created_by":"Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"Suspicious Code Page Switch","tags":["attack.t1036","attack.defense_evasion"],"interval":"5m","description":"Detects a code page switch in command line or batch scripts to a rare language","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative activity (adjust code pages according to your organisation's region)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Hh][Cc][Pp]\\.[Cc][Oo][Mm]/ AND process.command_line:(/.*\\ 936/ OR /.*\\ 1258/))","rule_id":"c7942406-33dd-4377-a564-0f62db0593a3","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers","https://twitter.com/cglyer/status/1183756892952248325"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\chcp.com AND process.command_line:(*\\ 936 OR *\\ 1258))`"}
