{"id":"999e8307-a775-4d5f-addc-4855632335be","created_by":"Florian Roth","name":"BlackByte Ransomware Patterns","tags":null,"interval":"5m","description":"This command line patterns found in BlackByte Ransomware operations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ AND process.command_line:/.*\\ \\-[Ss][Ii][Nn][Gg][Ll][Ee]\\ .*/) OR process.command_line:(/.*[Dd][Ee][Ll]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee].*/ OR /.*;[Ss][Ee][Tt]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ \\-[Ss][Tt][Aa][Rr][Tt][Uu][Pp][Tt][Yy][Pp][Ee]\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd]\\ $.*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ \\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ \\\"$[Xx]\\ \\=\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Tt][Ee][Xx][Tt]\\.[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg]\\]\\:\\:[Uu][Nn][Ii][Cc][Oo][Dd][Ee]\\.[Gg][Ee][Tt][Ss][Tt][Rr][Ii][Nn][Gg]\\(\\[[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\]\\:\\:[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\ [Dd][Oo]\\ [Ss][Tt][Aa][Rr][Tt]\\ [Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]\\ \\/[Pp]\\ .*/))","rule_id":"999e8307-a775-4d5f-addc-4855632335be","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blackbyte-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:C\\:\\\\Users\\\\Public\\\\* AND process.command_line:*\\ \\-single\\ *) OR process.command_line:(*del\\ C\\:\\\\Windows\\\\System32\\\\Taskmgr.exe* OR *;Set\\-Service\\ \\-StartupType\\ Disabled\\ $* OR *powershell\\ \\-command\\ \\\"$x\\ \\=\\[System.Text.Encoding\\]\\:\\:Unicode.GetString\\(\\[System.Convert\\]\\:\\:FromBase64String\\(* OR *\\ do\\ start\\ wordpad.exe\\ \\/p\\ *))`"}
