{"id":"bb780e0c-16cf-4383-8383-1e5471db6cf9","created_by":"Sami Ruohonen, Harish Segar (improvement), Tim Shelton","name":"Suspicious XOR Encoded PowerShell Command Line","tags":["attack.defense_evasion","attack.t1059.001","attack.t1140","attack.t1027"],"interval":"5m","description":"Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.pe.description:/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]/ OR process.pe.product:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ [Cc][Oo][Rr][Ee]\\ 6/) AND process.command_line:(/.*[Bb][Xx][Oo][Rr].*/ OR /.*\\-[Jj][Oo][Ii][Nn]\\ .*/ OR /.*\\-[Jj][Oo][Ii][Nn]'.*/ OR /.*\\-[Jj][Oo][Ii][Nn]\\\".*/ OR /.*\\-[Jj][Oo][Ii][Nn]`.*/ OR /.*[Cc][Hh][Aa][Rr].*/)) AND (NOT (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ss][Ss][Mm]\\\\[Ss][Ss][Mm]\\-[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt]\\-[Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/)))","rule_id":"bb780e0c-16cf-4383-8383-1e5471db6cf9","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.pe.description:Windows\\ PowerShell OR process.pe.product:PowerShell\\ Core\\ 6) AND process.command_line:(*bxor* OR *\\-join\\ * OR *\\-join'* OR *\\-join\\\"* OR *\\-join`* OR *char*)) AND (NOT (process.parent.executable:C\\:\\\\Program\\ Files\\\\Amazon\\\\SSM\\\\ssm\\-document\\-worker.exe)))`"}
