{"id":"9c0295ce-d60d-40bd-bd74-84673b7592b1","created_by":"pH-T","name":"Suspicious Encoded Obfuscated LOAD String","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects suspicious base64 encoded and obbfuscated LOAD string often used for reflection.assembly load","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Ii][Gg][Bb][Mm][Aa][Cc][Ii][Aa][Kk][Ww][Aa][Ii][Aa][Gg]8[Aa][Yy][Qq][Bb][Kk][Aa][Cc][Ii][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Ii][Aa][Tt][Aa][Aa][Ii][Aa][Cc][Ss][Aa][Ii][Gg][Bb][Vv][Aa][Gg][Ee][Aa][Zz][Aa][Aa][Ii][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Ii][Aa][Ee][Ww][Aa][Ii][Gg][Aa][Rr][Aa][Cc][Ii][Aa][Bb][Ww][Bb][Hh][Aa][Gg][Qq][Aa][Ii][Gg][Aa][Pp][Aa].*/ OR /.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Ii][Gg][Bb][Mm][Aa][Gg]8[Aa][Ii][Gg][Aa][Rr][Aa][Cc][Ii][Aa][Yy][Qq][Bb][Kk][Aa][Cc][Ii][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Ii][Aa][Tt][Aa][Bb][Vv][Aa][Cc][Ii][Aa][Kk][Ww][Aa][Ii][Aa][Gg][Ee][Aa][Zz][Aa][Aa][Ii][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Ii][Aa][Ee][Ww][Aa][Bb][Ww][Aa][Ii][Aa][Cc][Ss][Aa][Ii][Gg][Bb][Hh][Aa][Gg][Qq][Aa][Ii][Gg][Aa][Pp][Aa].*/ OR /.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Ii][Gg][Bb][Mm][Aa][Gg]8[Aa][Yy][Qq][Aa][Ii][Aa][Cc][Ss][Aa][Ii][Gg][Bb][Kk][Aa][Cc][Ii][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Ii][Aa][Tt][Aa][Bb][Vv][Aa][Gg][Ee][Aa][Ii][Gg][Aa][Rr][Aa][Cc][Ii][Aa][Zz][Aa][Aa][Ii][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Ii][Aa][Ee][Ww][Aa][Bb][Ww][Bb][Hh][Aa][Cc][Ii][Aa][Kk][Ww][Aa][Ii][Aa][Gg][Qq][Aa][Ii][Gg][Aa][Pp][Aa].*/ OR /.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Jj][Ww][Bb][Mm][Aa][Cc][Cc][Aa][Kk][Ww][Aa][Nn][Aa][Gg]8[Aa][Yy][Qq][Bb][Kk][Aa][Cc][Cc][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Cc][Aa][Tt][Aa][Aa][Nn][Aa][Cc][Ss][Aa][Jj][Ww][Bb][Vv][Aa][Gg][Ee][Aa][Zz][Aa][Aa][Nn][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Nn][Aa][Ee][Ww][Aa][Jj][Ww][Aa][Rr][Aa][Cc][Cc][Aa][Bb][Ww][Bb][Hh][Aa][Gg][Qq][Aa][Jj][Ww][Aa][Pp][Aa].*/ OR /.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Jj][Ww][Bb][Mm][Aa][Gg]8[Aa][Jj][Ww][Aa][Rr][Aa][Cc][Cc][Aa][Yy][Qq][Bb][Kk][Aa][Cc][Cc][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Cc][Aa][Tt][Aa][Bb][Vv][Aa][Cc][Cc][Aa][Kk][Ww][Aa][Nn][Aa][Gg][Ee][Aa][Zz][Aa][Aa][Nn][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Nn][Aa][Ee][Ww][Aa][Bb][Ww][Aa][Nn][Aa][Cc][Ss][Aa][Jj][Ww][Bb][Hh][Aa][Gg][Qq][Aa][Jj][Ww][Aa][Pp][Aa].*/ OR /.*[Oo][Gg][Aa]6[Aa][Cc][Gg][Aa][Jj][Ww][Bb][Mm][Aa][Gg]8[Aa][Yy][Qq][Aa][Nn][Aa][Cc][Ss][Aa][Jj][Ww][Bb][Kk][Aa][Cc][Cc][Aa][Kk][Qq].*/ OR /.*[Oo][Aa][Oo][Gg][Aa][Oo][Aa][Cc][Cc][Aa][Tt][Aa][Bb][Vv][Aa][Gg][Ee][Aa][Jj][Ww][Aa][Rr][Aa][Cc][Cc][Aa][Zz][Aa][Aa][Nn][Aa][Cc][Kk][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Kk][Aa][Aa][Nn][Aa][Ee][Ww][Aa][Bb][Ww][Bb][Hh][Aa][Cc][Cc][Aa][Kk][Ww][Aa][Nn][Aa][Gg][Qq][Aa][Jj][Ww][Aa][Pp][Aa].*/)","rule_id":"9c0295ce-d60d-40bd-bd74-84673b7592b1","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar","https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ* OR *oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA* OR *6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA* OR *OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ* OR *oAOgAoACIATABvACIAKwAiAGEAZAAiACkA* OR *6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA* OR *OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ* OR *oAOgAoACIATABvAGEAIgArACIAZAAiACkA* OR *6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA* OR *OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ* OR *oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA* OR *6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA* OR *OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ* OR *oAOgAoACcATABvACcAKwAnAGEAZAAnACkA* OR *6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA* OR *OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ* OR *oAOgAoACcATABvAGEAJwArACcAZAAnACkA* OR *6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA*)`"}
