{"id":"c6fb44c6-71f5-49e6-9462-1425d328aee3","created_by":"Florian Roth","name":"Powershell Defender Base64 MpPreference","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects base64 encoded \"MpPreference\" PowerShell cmdlet code that tries to modifies or tamper with Windows Defender AV","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible Admin Activity","Other Cmdlets that may use the same parameters"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Qq][Ww][Rr][Kk][Ll][Uu]1[Ww][Uu][Hh][Jj][Ll][Zz][Mm][Vv][Yy][Zz][Ww]5[Jj][Zz][Ss].*/ OR /.*[Ff][Kk][Zz][Cc]1[Nn][Cc][Ff][Bb][Yy][Zz][Ww][Zz][Ll][Cc][Mm][Vv][Uu][Yy]2[Uu][Gg].*/ OR /.*[Bb][Zz][Gg][Qq][Tt][Tt][Xx][Bb][Qq][Cc][Mm][Vv][Mm][Zz][Xx][Jj][Ll][Bb][Mm][Nn][Ll][Ii].*/ OR /.*[Uu]2[Vv]0[Ll][Uu]1[Ww][Uu][Hh][Jj][Ll][Zz][Mm][Vv][Yy][Zz][Ww]5[Jj][Zz][Ss].*/ OR /.*[Nn][Ll][Dd][Cc]1[Nn][Cc][Ff][Bb][Yy][Zz][Ww][Zz][Ll][Cc][Mm][Vv][Uu][Yy]2[Uu][Gg].*/ OR /.*[Tt][Zz][Xx][Qq][Tt][Tt][Xx][Bb][Qq][Cc][Mm][Vv][Mm][Zz][Xx][Jj][Ll][Bb][Mm][Nn][Ll][Ii].*/ OR /.*[Yy][Ww][Rr][Kk][Ll][Ww]1[Ww][Cc][Hh][Jj][Ll][Zz][Mm][Vv][Yy][Zz][Ww]5[Jj][Zz][Ss].*/ OR /.*[Ff][Kk][Zz][Cc]1[Tt][Cc][Hh][Bb][Yy][Zz][Ww][Zz][Ll][Cc][Mm][Vv][Uu][Yy]2[Uu][Gg].*/ OR /.*[Hh][Zz][Gg][Qq][Tt][Bb][Xx][Bb][Ww][Cc][Mm][Vv][Mm][Zz][Xx][Jj][Ll][Bb][Mm][Nn][Ll][Ii].*/ OR /.*[Cc]2[Vv]0[Ll][Ww]1[Ww][Cc][Hh][Jj][Ll][Zz][Mm][Vv][Yy][Zz][Ww]5[Jj][Zz][Ss].*/ OR /.*[Nn][Ll][Dd][Cc]1[Tt][Cc][Hh][Bb][Yy][Zz][Ww][Zz][Ll][Cc][Mm][Vv][Uu][Yy]2[Uu][Gg].*/ OR /.*[Zz][Zz][Xx][Qq][Tt][Bb][Xx][Bb][Ww][Cc][Mm][Vv][Mm][Zz][Xx][Jj][Ll][Bb][Mm][Nn][Ll][Ii].*/) AND process.command_line:(/.*[Qq][Qq][Bb][Kk][Aa][Gg][Qq][Aa][Ll][Qq][Bb][Nn][Aa][Hh][Aa][Aa][Uu][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Zz][Gg][Bb][Ll][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Uu][Aa][Gg][Mm][Aa][Zz][Qq][Aa][Gg][Aa].*/ OR /.*[Ee][Aa][Zz][Aa][Bb][Kk][Aa][Cc]0[Aa][Tt][Qq][Bb][Ww][Aa][Ff][Aa][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Yy][Aa][Zz][Qq][Bb][Yy][Aa][Gg][Uu][Aa][Bb][Gg][Bb][Jj][Aa][Gg][Uu][Aa][Ii][Aa].*/ OR /.*[Bb][Aa][Gg][Qq][Aa][Zz][Aa][Aa][Tt][Aa][Ee]0[Aa][Cc][Aa][Bb][Qq][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Mm][Aa][Gg][Uu][Aa][Cc][Gg][Bb][Ll][Aa][Gg]4[Aa][Yy][Ww][Bb][Ll][Aa][Cc][Aa][Aa].*/ OR /.*[Uu][Ww][Bb][Ll][Aa][Hh][Qq][Aa][Ll][Qq][Bb][Nn][Aa][Hh][Aa][Aa][Uu][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Zz][Gg][Bb][Ll][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Uu][Aa][Gg][Mm][Aa][Zz][Qq][Aa][Gg][Aa].*/ OR /.*[Mm][Aa][Zz][Qq][Bb]0[Aa][Cc]0[Aa][Tt][Qq][Bb][Ww][Aa][Ff][Aa][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Yy][Aa][Zz][Qq][Bb][Yy][Aa][Gg][Uu][Aa][Bb][Gg][Bb][Jj][Aa][Gg][Uu][Aa][Ii][Aa].*/ OR /.*[Tt][Aa][Gg][Uu][Aa][Dd][Aa][Aa][Tt][Aa][Ee]0[Aa][Cc][Aa][Bb][Qq][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Mm][Aa][Gg][Uu][Aa][Cc][Gg][Bb][Ll][Aa][Gg]4[Aa][Yy][Ww][Bb][Ll][Aa][Cc][Aa][Aa].*/ OR /.*[Yy][Qq][Bb][Kk][Aa][Gg][Qq][Aa][Ll][Qq][Bb][Tt][Aa][Hh][Aa][Aa][Cc][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Zz][Gg][Bb][Ll][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Uu][Aa][Gg][Mm][Aa][Zz][Qq][Aa][Gg][Aa].*/ OR /.*[Ee][Aa][Zz][Aa][Bb][Kk][Aa][Cc]0[Aa][Bb][Qq][Bb][Ww][Aa][Hh][Aa][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Yy][Aa][Zz][Qq][Bb][Yy][Aa][Gg][Uu][Aa][Bb][Gg][Bb][Jj][Aa][Gg][Uu][Aa][Ii][Aa].*/ OR /.*[Hh][Aa][Gg][Qq][Aa][Zz][Aa][Aa][Tt][Aa][Gg]0[Aa][Cc][Aa][Bb][Ww][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Mm][Aa][Gg][Uu][Aa][Cc][Gg][Bb][Ll][Aa][Gg]4[Aa][Yy][Ww][Bb][Ll][Aa][Cc][Aa][Aa].*/ OR /.*[Cc][Ww][Bb][Ll][Aa][Hh][Qq][Aa][Ll][Qq][Bb][Tt][Aa][Hh][Aa][Aa][Cc][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Zz][Gg][Bb][Ll][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Uu][Aa][Gg][Mm][Aa][Zz][Qq][Aa][Gg][Aa].*/ OR /.*[Mm][Aa][Zz][Qq][Bb]0[Aa][Cc]0[Aa][Bb][Qq][Bb][Ww][Aa][Hh][Aa][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Yy][Aa][Zz][Qq][Bb][Yy][Aa][Gg][Uu][Aa][Bb][Gg][Bb][Jj][Aa][Gg][Uu][Aa][Ii][Aa].*/ OR /.*[Zz][Aa][Gg][Uu][Aa][Dd][Aa][Aa][Tt][Aa][Gg]0[Aa][Cc][Aa][Bb][Ww][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Mm][Aa][Gg][Uu][Aa][Cc][Gg][Bb][Ll][Aa][Gg]4[Aa][Yy][Ww][Bb][Ll][Aa][Cc][Aa][Aa].*/))","rule_id":"c6fb44c6-71f5-49e6-9462-1425d328aee3","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://twitter.com/AdamTheAnalyst/status/1483497517119590403"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*QWRkLU1wUHJlZmVyZW5jZS* OR *FkZC1NcFByZWZlcmVuY2Ug* OR *BZGQtTXBQcmVmZXJlbmNlI* OR *U2V0LU1wUHJlZmVyZW5jZS* OR *NldC1NcFByZWZlcmVuY2Ug* OR *TZXQtTXBQcmVmZXJlbmNlI* OR *YWRkLW1wcHJlZmVyZW5jZS* OR *FkZC1tcHByZWZlcmVuY2Ug* OR *hZGQtbXBwcmVmZXJlbmNlI* OR *c2V0LW1wcHJlZmVyZW5jZS* OR *NldC1tcHByZWZlcmVuY2Ug* OR *zZXQtbXBwcmVmZXJlbmNlI*) AND process.command_line:(*QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *EAZABkAC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *BAGQAZAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *MAZQB0AC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *TAGUAdAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *YQBkAGQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *EAZABkAC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *hAGQAZAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA* OR *cwBlAHQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA* OR *MAZQB0AC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA* OR *zAGUAdAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA*))`"}
