{"id":"8d01b53f-456f-48ee-90f6-bc28e67d4e35","created_by":"Florian Roth","name":"Suspicious PowerShell Obfuscated PowerShell Code","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious UTF16 and base64 encoded and often obfuscated PowerShell code often used in command lines","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ii][Aa][Aa][Tt][Aa][Gg][Ii][Aa][Ee][Aa][Bb][Vv][Aa][Hh][Ii][Aa][Ii][Aa][Aa][Ww][Aa][Hh][Gg][Aa].*/ OR /.*[Aa][Aa][Ll][Qq][Bb][Ii][Aa][Hh][Gg][Aa][Bb][Ww][Bb][Yy][Aa][Cc][Aa][Aa][Mm][Aa][Bb]4[Aa].*/ OR /.*[Gg][Aa][Cc]0[Aa][Yy][Gg][Bb]4[Aa][Gg]8[Aa][Cc][Gg][Aa][Gg][Aa][Dd][Aa][Aa][Ee][Aa].*/ OR /.*[Aa][Cc]4[Aa][Ss][Qq][Bb][Uu][Aa][Hh][Yy][Aa][Bb][Ww][Bb][Rr][Aa][Gg][Uu][Aa][Kk][Aa][Aa][Pp][Aa][Cc][Aa][Aa][Ff][Aa][Aa][Gg].*/ OR /.*[Aa][Uu][Aa][Ee][Kk][Aa][Bb][Gg][Bb]2[Aa][Gg]8[Aa][Aa][Ww][Bb][Ll][Aa][Cc][Gg][Aa][Kk][Qq][Aa][Gg][Aa][Hh][Ww][Aa][Ii].*/ OR /.*[Aa][Ll][Gg][Bb][Jj][Aa][Gg]4[Aa][Dd][Gg][Bb][Vv][Aa][Gg][Ss][Aa][Zz][Qq][Aa][Oo][Aa][Cc][Kk][Aa][Ii][Aa][Bb]8[Aa][Cc].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Qq][Bb]9[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Cc][Ii][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Ee][Aa][Ff][Qq][Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Aa][Ii][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Xx][Aa][Hh]0[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Ii][Gg][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Hh][Ss][Aa][Mm][Ww][Bb]9[Aa][Cc][Ii][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Bb]7[Aa][Dd][Mm][Aa][Ff][Qq][Aa][Ii][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Ee][Ww][Aa][Zz][Aa][Hh]0[Aa][Ii][Gg][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Gg][Bb]9[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Cc][Ii][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Ii][Aa][Ff][Qq][Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Aa][Ii][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Yy][Aa][Hh]0[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Ii][Gg][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Qq][Bb]9[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Cc][Cc][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Ee][Aa][Ff][Qq][Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Aa][Nn][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Xx][Aa][Hh]0[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Jj][Ww][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Hh][Ss][Aa][Mm][Ww][Bb]9[Aa][Cc][Cc][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Bb]7[Aa][Dd][Mm][Aa][Ff][Qq][Aa][Nn][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Ee][Ww][Aa][Zz][Aa][Hh]0[Aa][Jj][Ww][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/ OR /.*[Aa][Hh][Ss][Aa][Mm][Gg][Bb]9[Aa][Hh][Ss][Aa][Mm][Aa][Bb]9[Aa][Cc][Cc][Aa][Ii][Aa][Aa][Tt][Aa][Gg][Yy][Aa][Ii].*/ OR /.*[Bb]7[Aa][Dd][Ii][Aa][Ff][Qq][Bb]7[Aa][Dd][Aa][Aa][Ff][Qq][Aa][Nn][Aa][Cc][Aa][Aa][Ll][Qq][Bb][Mm][Aa][Cc].*/ OR /.*[Aa][Ee][Ww][Aa][Yy][Aa][Hh]0[Aa][Ee][Ww][Aa][Ww][Aa][Hh]0[Aa][Jj][Ww][Aa][Gg][Aa][Cc]0[Aa][Zz][Gg][Aa][Gg].*/)","rule_id":"8d01b53f-456f-48ee-90f6-bc28e67d4e35","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/fcadca91-3580-4ede-aff4-4d2bf809bf99/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*IAAtAGIAeABvAHIAIAAwAHgA* OR *AALQBiAHgAbwByACAAMAB4A* OR *gAC0AYgB4AG8AcgAgADAAeA* OR *AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg* OR *AuAEkAbgB2AG8AawBlACgAKQAgAHwAI* OR *ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC* OR *AHsAMQB9AHsAMAB9ACIAIAAtAGYAI* OR *B7ADEAfQB7ADAAfQAiACAALQBmAC* OR *AewAxAH0AewAwAH0AIgAgAC0AZgAg* OR *AHsAMAB9AHsAMwB9ACIAIAAtAGYAI* OR *B7ADAAfQB7ADMAfQAiACAALQBmAC* OR *AewAwAH0AewAzAH0AIgAgAC0AZgAg* OR *AHsAMgB9AHsAMAB9ACIAIAAtAGYAI* OR *B7ADIAfQB7ADAAfQAiACAALQBmAC* OR *AewAyAH0AewAwAH0AIgAgAC0AZgAg* OR *AHsAMQB9AHsAMAB9ACcAIAAtAGYAI* OR *B7ADEAfQB7ADAAfQAnACAALQBmAC* OR *AewAxAH0AewAwAH0AJwAgAC0AZgAg* OR *AHsAMAB9AHsAMwB9ACcAIAAtAGYAI* OR *B7ADAAfQB7ADMAfQAnACAALQBmAC* OR *AewAwAH0AewAzAH0AJwAgAC0AZgAg* OR *AHsAMgB9AHsAMAB9ACcAIAAtAGYAI* OR *B7ADIAfQB7ADAAfQAnACAALQBmAC* OR *AewAyAH0AewAwAH0AJwAgAC0AZgAg*)`"}
