{"id":"9d7ca793-f6bd-471c-8d0f-11e68b2f0d2f","created_by":"Nasreddine Bencherchali","name":"Suspicious Get Local Groups Information with WMIC","tags":["attack.discovery","attack.execution","attack.t1047"],"interval":"5m","description":"Detects execution of wmic utility with the \"computersystem\" flag in order to obtain information about the machine such as the domain, username, model...etc.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ [Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/ AND process.command_line:/.*\\ [Gg][Ee][Tt]\\ .*/))","rule_id":"9d7ca793-f6bd-471c-8d0f-11e68b2f0d2f","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\wmic.exe OR process.pe.original_file_name:wmic.exe) AND (process.command_line:*\\ computersystem\\ * AND process.command_line:*\\ get\\ *))`"}
