{"id":"6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6","created_by":"Nasreddine Bencherchali","name":"Sideloading Link.EXE","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the execution utitilies often found in Visual Studio tools that hardcode the call to the binary \"link.exe\". They can be abused to sideload any binary with the same name","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ll][Ii][Nn][Kk]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ll][Ii][Nn][Kk]\\ \\/.*/) AND (NOT ((process.parent.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/) AND process.parent.executable:/.*\\\\[Vv][Cc]\\\\[Tt][Oo][Oo][Ll][Ss]\\\\[Mm][Ss][Vv][Cc]\\\\.*/))))","rule_id":"6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6","timestamp_override":"event.ingested","references":["https://twitter.com/0gtweet/status/1560732860935729152"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\link.exe AND process.command_line:*LINK\\ \\/*) AND (NOT ((process.parent.executable:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\*) AND process.parent.executable:*\\\\VC\\\\Tools\\\\MSVC\\\\*))))`"}
