{"id":"074e0ded-6ced-4ebd-8b4d-53f55908119d","created_by":"Julia Fomina, oscd.community","name":"AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects execution of attacker-controlled WsmPty.xsl or WsmTxt.xsl via winrm.vbs and copied cscript.exe (can be renamed)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ww][Ii][Nn][Rr][Mm].*/ AND process.command_line:(/.*[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Pp][Rr][Ee][Tt][Tt][Yy].*/ OR /.*[Ff][Oo][Rr][Mm][Aa][Tt]\\:\\\"[Pp][Rr][Ee][Tt][Tt][Yy]\\\".*/ OR /.*[Ff][Oo][Rr][Mm][Aa][Tt]\\:\\\"[Tt][Ee][Xx][Tt]\\\".*/ OR /.*[Ff][Oo][Rr][Mm][Aa][Tt]\\:[Tt][Ee][Xx][Tt].*/) AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))","rule_id":"074e0ded-6ced-4ebd-8b4d-53f55908119d","timestamp_override":"event.ingested","references":["https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*winrm* AND process.command_line:(*format\\:pretty* OR *format\\:\\\"pretty\\\"* OR *format\\:\\\"text\\\"* OR *format\\:text*) AND (NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))))`"}
