{"id":"3d3aa6cd-6272-44d6-8afc-7e88dfef7061","created_by":"Timur Zinniatullin, oscd.community","name":"Change Default File Association","tags":["attack.persistence","attack.t1546.001"],"interval":"5m","description":"When a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access or by administrators using the built-in assoc utility. Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Admin activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Mm][Dd].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Aa][Ss][Ss][Oo][Cc].*/)","rule_id":"3d3aa6cd-6272-44d6-8afc-7e88dfef7061","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.001/T1546.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*cmd* AND process.command_line:*\\/c* AND process.command_line:*assoc*)`"}
