{"id":"1723e720-616d-4ddc-ab02-f7e3685a4713","created_by":"CD_ROM_","name":"Rundll32 With Suspicious Parent Process","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious start of rundll32.exe with a parent process of Explorer.exe. Variant of Raspberry Robin, as first reported by Red Canary.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/) AND (NOT (process.command_line:/.*\\\\[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll],[Oo][Pp][Ee][Nn][Aa][Ss]_[Rr][Uu][Nn][Dd][Ll][Ll].*/)))","rule_id":"1723e720-616d-4ddc-ab02-f7e3685a4713","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/raspberry-robin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rundll32.exe AND process.parent.executable:*\\\\explorer.exe) AND (NOT (process.command_line:*\\\\shell32.dll,OpenAs_RunDLL*)))`"}
