{"id":"3d4aebe0-6d29-45b2-a8a4-3dfde586a26d","created_by":"Florian Roth","name":"Fireball Archer Install","tags":["attack.execution","attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects Archer malware invocation via rundll32","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Aa][Rr][Cc][Hh][Ee][Rr][Ss][Vv][Cc].*/)","rule_id":"3d4aebe0-6d29-45b2-a8a4-3dfde586a26d","timestamp_override":"event.ingested","references":["https://www.virustotal.com/en/file/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022/analysis/","https://www.hybrid-analysis.com/sample/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022?environmentId=100"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32.exe* AND process.command_line:*InstallArcherSvc*)`"}
