{"id":"85b0b087-eddf-4a2b-b033-d771fa2b9775","created_by":"Florian Roth","name":"PowerShell Web Download and Execution","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects suspicious ways to download files or content and execute them using PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Scripts or tools that download files and execute them"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt]\\ .*/) AND process.command_line:(/.*[Ii][Ee][Xx]\\(.*/ OR /.*[Ii][Ee][Xx]\\ \\(.*/ OR /.*[Ii]`[Ee][Xx].*/ OR /.*[Ii][Ee]`[Xx].*/ OR /.*[Ii]`[Ee]`[Xx].*/ OR /.*|\\ [Ii][Ee][Xx].*/ OR /.*|[Ii][Ee][Xx]\\ .*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn].*/ OR /.*;[Ii][Ee][Xx]\\ $.*/))","rule_id":"85b0b087-eddf-4a2b-b033-d771fa2b9775","timestamp_override":"event.ingested","references":["https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(* OR *Invoke\\-WebRequest\\ *) AND process.command_line:(*IEX\\(* OR *IEX\\ \\(* OR *I`EX* OR *IE`X* OR *I`E`X* OR *|\\ IEX* OR *|IEX\\ * OR *Invoke\\-Execution* OR *;iex\\ $*))`"}
