{"id":"9c7e131a-0f2c-4ae0-9d43-b04f4e266d43","created_by":"Sreeman","name":"Using AppVLP To Circumvent ASR File Path Rule","tags":["attack.t1218","attack.defense_evasion","attack.execution"],"interval":"5m","description":"Application Virtualization Utility is included with Microsoft Office. We are able to abuse \"AppVLP\" to execute shell commands.\nNormally, this binary is used for Application Virtualization, but we can use it as an abuse binary to circumvent the ASR file path rule folder\nor to mark a file as a system file.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Aa][Pp][Pp][Vv][Ll][Pp]\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee].*/ OR /.*[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee].*/) AND process.command_line:(/.*\\.[Ss][Hh].*/ OR /.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Bb][Ii][Nn].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Jj][Ss].*/ OR /.*\\.[Mm][Ss][Hh].*/ OR /.*\\.[Rr][Ee][Gg].*/ OR /.*\\.[Ss][Cc][Rr].*/ OR /.*\\.[Pp][Ss].*/ OR /.*\\.[Vv][Bb].*/ OR /.*\\.[Jj][Aa][Rr].*/ OR /.*\\.[Pp][Ll].*/ OR /.*\\.[Ii][Nn][Ff].*/))","rule_id":"9c7e131a-0f2c-4ae0-9d43-b04f4e266d43","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*appvlp.exe* AND process.command_line:(*cmd.exe* OR *powershell.exe* OR *pwsh.exe*) AND process.command_line:(*.sh* OR *.exe* OR *.dll* OR *.bin* OR *.bat* OR *.cmd* OR *.js* OR *.msh* OR *.reg* OR *.scr* OR *.ps* OR *.vb* OR *.jar* OR *.pl* OR *.inf*))`"}
