{"id":"f24bcaea-0cd1-11eb-adc1-0242ac120002","created_by":"Mateusz Wydra, oscd.community","name":"Suspicious Atbroker Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Atbroker executing non-deafualt Assistive Technology applications","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate, non-default assistive technology applications execution"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*[Aa][Tt][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Tt][Aa][Rr][Tt].*/) AND (NOT (process.command_line:(/.*[Aa][Nn][Ii][Mm][Aa][Tt][Ii][Oo][Nn][Ss].*/ OR /.*[Aa][Uu][Dd][Ii][Oo][Dd][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Oo][Nn].*/ OR /.*[Cc][Aa][Rr][Ee][Tt][Bb][Rr][Oo][Ww][Ss][Ii][Nn][Gg].*/ OR /.*[Cc][Aa][Rr][Ee][Tt][Ww][Ii][Dd][Tt][Hh].*/ OR /.*[Cc][Oo][Ll][Oo][Rr][Ff][Ii][Ll][Tt][Ee][Rr][Ii][Nn][Gg].*/ OR /.*[Cc][Uu][Rr][Ss][Oo][Rr][Ss][Cc][Hh][Ee][Mm][Ee].*/ OR /.*[Ff][Ii][Ll][Tt][Ee][Rr][Kk][Ee][Yy][Ss].*/ OR /.*[Ff][Oo][Cc][Uu][Ss][Bb][Oo][Rr][Dd][Ee][Rr][Hh][Ee][Ii][Gg][Hh][Tt].*/ OR /.*[Ff][Oo][Cc][Uu][Ss][Bb][Oo][Rr][Dd][Ee][Rr][Ww][Ii][Dd][Tt][Hh].*/ OR /.*[Hh][Ii][Gg][Hh][Cc][Oo][Nn][Tt][Rr][Aa][Ss][Tt].*/ OR /.*[Kk][Ee][Yy][Bb][Oo][Aa][Rr][Dd][Cc][Uu][Ee][Ss].*/ OR /.*[Kk][Ee][Yy][Bb][Oo][Aa][Rr][Dd][Pp][Rr][Ee][Ff].*/ OR /.*[Mm][Aa][Gg][Nn][Ii][Ff][Ii][Ee][Rr][Pp][Aa][Nn][Ee].*/ OR /.*[Mm][Ee][Ss][Ss][Aa][Gg][Ee][Dd][Uu][Rr][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Mm][Ii][Nn][Ii][Mm][Uu][Mm][Hh][Ii][Tt][Rr][Aa][Dd][Ii][Uu][Ss].*/ OR /.*[Mm][Oo][Uu][Ss][Ee][Kk][Ee][Yy][Ss].*/ OR /.*[Nn][Aa][Rr][Rr][Aa][Tt][Oo][Rr].*/ OR /.*[Oo][Ss][Kk].*/ OR /.*[Oo][Vv][Ee][Rr][Ll][Aa][Pp][Pp][Ee][Dd][Cc][Oo][Nn][Tt][Ee][Nn][Tt].*/ OR /.*[Ss][Hh][Oo][Ww][Ss][Oo][Uu][Nn][Dd][Ss].*/ OR /.*[Ss][Oo][Uu][Nn][Dd][Ss][Ee][Nn][Tt][Rr][Yy].*/ OR /.*[Ss][Tt][Ii][Cc][Kk][Yy][Kk][Ee][Yy][Ss].*/ OR /.*[Tt][Oo][Gg][Gg][Ll][Ee][Kk][Ee][Yy][Ss].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Aa][Rr][Rr][Aa][Nn][Gg][Ii][Nn][Gg].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Tt][Rr][Aa][Cc][Kk][Ii][Nn][Gg].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Tt][Rr][Aa][Cc][Kk][Ii][Nn][Gg][Tt][Ii][Mm][Ee][Oo][Uu][Tt].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Tt][Rr][Aa][Cc][Kk][Ii][Nn][Gg][Zz][Oo][Rr][Dd][Ee][Rr].*/))))","rule_id":"f24bcaea-0cd1-11eb-adc1-0242ac120002","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/","https://lolbas-project.github.io/lolbas/Binaries/Atbroker/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*AtBroker.exe AND process.command_line:*start*) AND (NOT (process.command_line:(*animations* OR *audiodescription* OR *caretbrowsing* OR *caretwidth* OR *colorfiltering* OR *cursorscheme* OR *filterkeys* OR *focusborderheight* OR *focusborderwidth* OR *highcontrast* OR *keyboardcues* OR *keyboardpref* OR *magnifierpane* OR *messageduration* OR *minimumhitradius* OR *mousekeys* OR *Narrator* OR *osk* OR *overlappedcontent* OR *showsounds* OR *soundsentry* OR *stickykeys* OR *togglekeys* OR *windowarranging* OR *windowtracking* OR *windowtrackingtimeout* OR *windowtrackingzorder*))))`"}
