{"id":"185d7418-f250-42d0-b72e-0c8b70661e93","created_by":"frack113","name":"Suspicious Diantz Download and Compress Into a CAB File","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Download and compress a remote file and store it in a cab file on local machine.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Dd][Ii][Aa][Nn][Tt][Zz]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\ \\\\\\\\\\*/ AND process.command_line:/.*\\.[Cc][Aa][Bb].*/)","rule_id":"185d7418-f250-42d0-b72e-0c8b70661e93","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Diantz/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*diantz.exe* AND process.command_line:*\\ \\\\\\\\\\* AND process.command_line:*.cab*)`"}
