{"id":"8f70ac5f-1f6f-4f8e-b454-db19561216c5","created_by":"Florian Roth","name":"PowerShell DownloadFile","tags":["attack.execution","attack.t1059.001","attack.command_and_control","attack.t1104","attack.t1105"],"interval":"5m","description":"Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/ AND process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/)","rule_id":"8f70ac5f-1f6f-4f8e-b454-db19561216c5","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*powershell* AND process.command_line:*.DownloadFile* AND process.command_line:*System.Net.WebClient*)`"}
