{"id":"18749301-f1c5-4efc-a4c3-276ff1f5b6f8","created_by":"Nasreddine Bencherchali","name":"Use of VSIISExeLauncher.exe","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"The \"VSIISExeLauncher.exe\" binary part of the Visual Studio/VS Code can be used to execute arbitrary binaries","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Vv][Ss][Ii][Ii][Ss][Ee][Xx][Ee][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Vv][Ss][Ii][Ii][Ss][Ee][Xx][Ee][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Pp]\\ .*/ OR /.*\\ \\-[Aa]\\ .*/))","rule_id":"18749301-f1c5-4efc-a4c3-276ff1f5b6f8","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/VSIISExeLauncher/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\VSIISExeLauncher.exe OR process.pe.original_file_name:VSIISExeLauncher.exe) AND process.command_line:(*\\ \\-p\\ * OR *\\ \\-a\\ *))`"}
