{"id":"cd951fdc-4b2f-47f5-ba99-a33bf61e3770","created_by":"Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community","name":"Always Install Elevated Windows Installer","tags":["attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"This rule looks for Windows Installer service (msiexec.exe) trying to install MSI packages with SYSTEM privilege","risk_score":47,"enabled":true,"severity":"medium","false_positives":["System administrator usage","Anti virus products"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\.*/ AND process.executable:/.*[Mm][Ss][Ii].*/ AND process.executable:/.*[Tt][Mm][Pp]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)) OR (process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/) AND winlog.event_data.IntegrityLevel:/[Ss][Yy][Ss][Tt][Ee][Mm]/)) AND (NOT ((process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\/[Vv]/ OR process.parent.command_line:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\/[Vv]/) OR (process.parent.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Aa][Vv][Ii][Rr][Aa]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\.*/)))))","rule_id":"cd951fdc-4b2f-47f5-ba99-a33bf61e3770","timestamp_override":"event.ingested","references":["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\Windows\\\\Installer\\\\* AND process.executable:*msi* AND process.executable:*tmp AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)) OR (process.executable:*\\\\msiexec.exe AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*) AND winlog.event_data.IntegrityLevel:System)) AND (NOT ((process.parent.executable:C\\:\\\\Windows\\\\System32\\\\services.exe) OR (process.command_line:*\\\\system32\\\\msiexec.exe\\ \\/V OR process.parent.command_line:*\\\\system32\\\\msiexec.exe\\ \\/V) OR (process.parent.executable:(C\\:\\\\ProgramData\\\\Sophos\\\\* OR C\\:\\\\ProgramData\\\\Avira\\\\* OR C\\:\\\\Program\\ Files\\\\Avast\\ Software\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\* OR C\\:\\\\Program\\ Files\\\\Google\\\\Update\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Google\\\\Update\\\\*)))))`"}
