{"id":"56d19cb4-6414-4769-9644-1ed35ffbb148","created_by":"Nasreddine Bencherchali","name":"Obfuscated IP Via CLI","tags":["attack.discovery"],"interval":"5m","description":"Detects usage of an encoded/obfuscated version of an IP address (hex, octal...) via commandline","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Pp]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ 0[Xx].*/ OR process.command_line:/ [0-9]{7,13}/))","rule_id":"56d19cb4-6414-4769-9644-1ed35ffbb148","timestamp_override":"event.ingested","references":["https://h.43z.one/ipconverter/","https://twitter.com/Yasser_Elsnbary/status/1553804135354564608"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\ping.exe OR *\\\\arp.exe) AND (process.command_line:*\\ 0x* OR process.command_line:/ [0-9]{7,13}/))`"}
