{"id":"043c4b8b-3a54-4780-9682-081cb6b8185c","created_by":"Florian Roth (rule), Microsoft (idea)","name":"Suspicious IIS Module Registration","tags":null,"interval":"5m","description":"Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Aa][Pp][Pp][Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ [Aa][Dd][Dd]\\ [Mm][Oo][Dd][Uu][Ll][Ee].*/ AND process.parent.executable:/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll]\\.[Pp][Uu][Bb][Ll][Ii][Ss][Hh].*/ AND process.parent.executable:/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\ \\\\[Gg][Aa][Cc][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]\\ \\/[Ii].*/ AND process.parent.executable:/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/))","rule_id":"043c4b8b-3a54-4780-9682-081cb6b8185c","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*appcmd.exe\\ add\\ module* AND process.parent.executable:*\\\\w3wp.exe) OR (process.command_line:*\\ system.enterpriseservices.internal.publish* AND process.parent.executable:*\\\\w3wp.exe AND process.executable:*\\\\powershell.exe) OR (process.command_line:*\\ \\\\gacutil.exe\\ \\/I* AND process.parent.executable:*\\\\w3wp.exe))`"}
