{"id":"b83f5166-9237-4b5e-9cd4-7b5d52f4d8ee","created_by":"Florian Roth","name":"Judgement Panda Credential Access Activity","tags":["attack.credential_access","attack.t1552.001","attack.t1003.003"],"interval":"5m","description":"Detects Russian group activity as described in Global Threat Report 2019 by Crowdstrike","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Xx][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ss].*/ AND process.command_line:/.*\\/[Ee].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*\\/[Qq].*/ AND process.command_line:/.*\\/[Hh].*/ AND process.command_line:/.*\\\\\\\\\\*/) OR (process.executable:/.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ss][Nn][Aa][Pp][Ss][Hh][Oo][Tt].*/ AND process.command_line:/.*\\\"\\\".*/ AND process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/))","rule_id":"b83f5166-9237-4b5e-9cd4-7b5d52f4d8ee","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\xcopy.exe AND process.command_line:*\\/S* AND process.command_line:*\\/E* AND process.command_line:*\\/C* AND process.command_line:*\\/Q* AND process.command_line:*\\/H* AND process.command_line:*\\\\\\\\\\*) OR (process.executable:*\\\\adexplorer.exe AND process.command_line:*\\-snapshot* AND process.command_line:*\\\"\\\"* AND process.command_line:*c\\:\\\\users\\\\*))`"}
