{"id":"7b10f171-7f04-47c7-9fa2-5be43c76e535","created_by":"Ensar Şamil, @sblmsrsn, @oscd_initiative","name":"Visual Basic Command Line Compiler Usage","tags":["attack.defense_evasion","attack.t1027.004"],"interval":"5m","description":"Detects successful code compilation via Visual Basic Command Line Compiler that utilizes Windows Resource to Object Converter.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Utilization of this tool should not be seen in enterprise environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Vv][Bb][Cc]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Cc][Vv][Tt][Rr][Ee][Ss]\\.[Ee][Xx][Ee]/)","rule_id":"7b10f171-7f04-47c7-9fa2-5be43c76e535","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Vbc/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\vbc.exe AND process.executable:*\\\\cvtres.exe)`"}
