{"id":"87a476dc-0079-4583-a985-dee7a20a03de","created_by":"Nasreddine Bencherchali","name":"Enumeration for 3rd Party Creds From CLI","tags":["attack.credential_access","attack.t1552.002"],"interval":"5m","description":"Detects processes that query known 3rd party registry keys that holds credentials via commandline","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ss][Ii][Mm][Oo][Nn][Tt][Aa][Tt][Hh][Aa][Mm]\\\\[Pp][Uu][Tt][Tt][Yy]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ss][Ii][Mm][Oo][Nn][Tt][Aa][Tt][Hh][Aa][Mm]\\\\[Pp][Uu][Tt][Tt][Yy]\\\\[Ss][Ss][Hh][Hh][Oo][Ss][Tt][Kk][Ee][Yy][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Oo][Bb][Aa][Tt][Ee][Kk]\\\\[Mm][Oo][Bb][Aa][Xx][Tt][Ee][Rr][Mm]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Rr][Aa][Dd][Mm][Ii][Nn]\\\\[Vv]3\\.0\\\\[Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Rr][Aa][Dd][Mm][Ii][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Aa][Ee][Rr][Oo][Ff][Oo][Xx]\\\\[Ff][Oo][Xx][Mm][Aa][Ii][Ll][Pp][Rr][Ee][Vv][Ii][Ee][Ww].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Aa][Ee][Rr][Oo][Ff][Oo][Xx]\\\\[Ff][Oo][Xx][Mm][Aa][Ii][Ll]\\\\[Vv]3\\.1.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ii][Nn][Cc][Rr][Ee][Dd][Ii][Mm][Aa][Ii][Ll]\\\\[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Ii][Ee][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Qq][Uu][Aa][Ll][Cc][Oo][Mm][Mm]\\\\[Ee][Uu][Dd][Oo][Rr][Aa]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Rr][Ii][Mm][Aa][Rr][Tt][Ss]\\\\[Bb]2\\\\[Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Oo][Pp][Ee][Nn][Vv][Pp][Nn]\\-[Gg][Uu][Ii]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Aa][Rr][Tt][Ii][Nn]\\ [Pp][Rr][Ii][Kk][Rr][Yy][Ll]\\\\[Ww][Ii][Nn][Ss][Cc][Pp]\\ 2\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ff][Tt][Pp][Ww][Aa][Rr][Ee]\\\\[Cc][Oo][Rr][Ee][Ff][Tt][Pp]\\\\[Ss][Ii][Tt][Ee][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Oo][Pp][Ee][Nn][Ss][Ss][Hh]\\\\[Aa][Gg][Ee][Nn][Tt]\\\\[Kk][Ee][Yy][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Tt][Ii][Gg][Hh][Tt][Vv][Nn][Cc]\\\\[Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Oo][Rr][Ll]\\\\[Ww][Ii][Nn][Vv][Nn][Cc]3\\\\[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Rr][Ee][Aa][Ll][Vv][Nn][Cc]\\\\[Ww][Ii][Nn][Vv][Nn][Cc]4.*/)","rule_id":"87a476dc-0079-4583-a985-dee7a20a03de","timestamp_override":"event.ingested","references":["https://isc.sans.edu/diary/More+Data+Exfiltration/25698","https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt","https://github.com/HyperSine/how-does-MobaXterm-encrypt-password","https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions* OR *\\\\Software\\\\SimonTatham\\\\PuTTY\\\\SshHostKeys\\\\* OR *\\\\Software\\\\Mobatek\\\\MobaXterm\\\\* OR *\\\\Software\\\\WOW6432Node\\\\Radmin\\\\v3.0\\\\Server\\\\Parameters\\\\Radmin* OR *\\\\Software\\\\Aerofox\\\\FoxmailPreview* OR *\\\\Software\\\\Aerofox\\\\Foxmail\\\\V3.1* OR *\\\\Software\\\\IncrediMail\\\\Identities* OR *\\\\Software\\\\Qualcomm\\\\Eudora\\\\CommandLine* OR *\\\\Software\\\\RimArts\\\\B2\\\\Settings* OR *\\\\Software\\\\OpenVPN\\-GUI\\\\configs* OR *\\\\Software\\\\Martin\\ Prikryl\\\\WinSCP\\ 2\\\\Sessions* OR *\\\\Software\\\\FTPWare\\\\COREFTP\\\\Sites* OR *\\\\Software\\\\DownloadManager\\\\Passwords* OR *\\\\Software\\\\OpenSSH\\\\Agent\\\\Keys* OR *\\\\Software\\\\TightVNC\\\\Server* OR *\\\\Software\\\\ORL\\\\WinVNC3\\\\Password* OR *\\\\Software\\\\RealVNC\\\\WinVNC4*)`"}
