{"id":"6f4191bb-912b-48a8-9ce7-682769541e6d","created_by":"frack113","name":"Suspicious Msiexec Execute Arbitrary DLL","tags":["attack.defense_evasion","attack.t1218.007"],"interval":"5m","description":"Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Yy].*/) AND (NOT ((process.command_line:(/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Bb][Oo][Nn][Jj][Oo][Uu][Rr]\\\\[Mm][Dd][Nn][Ss][Nn][Ss][Pp]\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Bb][Oo][Nn][Jj][Oo][Uu][Rr]\\\\[Mm][Dd][Nn][Ss][Nn][Ss][Pp]\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Pp][Pp][Ll][Ee]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ii][Nn][Gg][Oo][Bb][Jj][Ee][Cc][Tt][Mm][Oo][Dd][Ee][Ll]\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Pp][Pp][Ll][Ee]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Aa][Dd][Mm][Ii][Nn]\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ \\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Cc][Mm]\\\\.*/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\/[Yy]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Cc][Mm]\\\\.*/)))))","rule_id":"6f4191bb-912b-48a8-9ce7-682769541e6d","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\msiexec.exe AND process.command_line:*\\ \\/y*) AND (NOT ((process.command_line:(*\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\\\Bonjour\\\\mdnsNSP.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Bonjour\\\\mdnsNSP.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Apple\\ Software\\ Update\\\\ScriptingObjectModel.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Apple\\ Software\\ Update\\\\SoftwareUpdateAdmin.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Windows\\\\CCM\\\\* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ C\\:\\\\Windows\\\\CCM\\\\*)))))`"}
