{"id":"e13f668e-7f95-443d-98d2-1816a7648a7b","created_by":"Nikita Nazarov, oscd.community","name":"Detected Windows Software Discovery","tags":["attack.discovery","attack.t1518"],"interval":"5m","description":"Adversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration activities"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Qq][Uu][Ee][Rr][Yy].*/ AND process.command_line:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\.*/ AND process.command_line:/.*\\/[Vv].*/ AND process.command_line:/.*[Ss][Vv][Cc][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/)","rule_id":"e13f668e-7f95-443d-98d2-1816a7648a7b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518/T1518.md","https://github.com/harleyQu1nn/AggressorScripts"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:*query* AND process.command_line:*\\\\software\\\\* AND process.command_line:*\\/v* AND process.command_line:*svcversion*)`"}
