{"id":"c75309a3-59f8-4a8d-9c2c-4c927ad50555","created_by":"Daniil Yugoslavskiy, oscd.community","name":"Exfiltration and Tunneling Tools Execution","tags":["attack.exfiltration","attack.command_and_control","attack.t1041","attack.t1572","attack.t1071.001"],"interval":"5m","description":"Execution of well known tools for data exfiltration and tunneling","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate Administrator using tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:(/.*\\\\[Pp][Ll][Ii][Nn][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Oo][Cc][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Tt][Uu][Nn][Nn][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Tt][Uu][Nn][Nn][Ee][Ll]\\.[Ee][Xx][Ee]/)","rule_id":"c75309a3-59f8-4a8d-9c2c-4c927ad50555","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:(*\\\\plink.exe OR *\\\\socat.exe OR *\\\\stunnel.exe OR *\\\\httptunnel.exe)`"}
