{"id":"8e0bb260-d4b2-4fff-bb8d-3f82118e6892","created_by":"Nasreddine Bencherchali","name":"Suspicious CMD Shell Redirect","tags":["attack.execution","attack.t1218"],"interval":"5m","description":"Detects inline windows shell commands redirecting output via the \">\" symbol to a suspicious location","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate admin scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\>\\ %[Uu][Ss][Ee][Rr][Pp][Rr][Oo][Ff][Ii][Ll][Ee]%\\\\.*/ AND process.command_line:/.*\\ \\>\\ %[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%\\\\.*/ AND process.command_line:/.*\\ \\>\\ \\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ AND process.command_line:/.*\\ \\>\\ [Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ AND process.command_line:/.*\\ \\>\\ %[Tt][Ee][Mm][Pp]%\\\\.*/)","rule_id":"8e0bb260-d4b2-4fff-bb8d-3f82118e6892","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cmd.exe AND process.command_line:*\\ >\\ %USERPROFILE%\\\\* AND process.command_line:*\\ >\\ %APPDATA%\\\\* AND process.command_line:*\\ >\\ \\\\Users\\\\Public\\\\* AND process.command_line:*\\ >\\ C\\:\\\\Users\\\\Public\\\\* AND process.command_line:*\\ >\\ %TEMP%\\\\*)`"}
