{"id":"3d48c9d3-1aa6-418d-98d3-8fd3c01a564e","created_by":"Nasreddine Bencherchali","name":"Use of Mftrace.exe","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"The \"Trace log generation tool for Media Foundation Tools\" (Mftrace.exe) can be used to execute arbitrary binaries","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use for tracing purposes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Mm][Ff][Tt][Rr][Aa][Cc][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ff][Tt][Rr][Aa][Cc][Ee]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\.[Ee][Xx][Ee]\\ .*/ AND process.command_line:/.*\\.[Ee][Xx][Ee]/)) OR process.parent.executable:/.*\\\\[Mm][Ff][Tt][Rr][Aa][Cc][Ee]\\.[Ee][Xx][Ee]/)","rule_id":"3d48c9d3-1aa6-418d-98d3-8fd3c01a564e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Mftrace/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\mftrace.exe OR process.pe.original_file_name:mftrace.exe) AND (process.command_line:*.exe\\ * AND process.command_line:*.exe)) OR process.parent.executable:*\\\\mftrace.exe)`"}
