{"id":"69bd9b97-2be2-41b6-9816-fb08757a4d1a","created_by":"Florian Roth","name":"Parent in Public Folder Suspicious Process","tags":null,"interval":"5m","description":"This rule detects suspicious processes with parent images located in the C:\\Users\\Public folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ AND process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk]\\ .*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee].*/ OR /.*[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll].*/ OR /.*[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee].*/))","rule_id":"69bd9b97-2be2-41b6-9816-fb08757a4d1a","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blackbyte-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:C\\:\\\\Users\\\\Public\\\\* AND process.command_line:(*powershell* OR *cmd.exe\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ * OR *cmd\\ \\/c\\ * OR *cmd\\ \\/k\\ * OR *wscript.exe* OR *cscript.exe* OR *bitsadmin* OR *certutil* OR *mshta.exe*))`"}
