{"id":"0a13e132-651d-11eb-ae93-0242ac130002","created_by":"Janantha Marasinghe (https://github.com/blueteam0ps)","name":"Suspicious Auditpol Usage","tags":["attack.defense_evasion","attack.t1562.002"],"interval":"5m","description":"Threat actors can use auditpol binary to change audit policy configuration to impair detection capability. This can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Admin activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Uu][Dd][Ii][Tt][Pp][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee].*/ OR /.*[Cc][Ll][Ee][Aa][Rr].*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee].*/ OR /.*[Rr][Ee][Ss][Tt][Oo][Rr][Ee].*/))","rule_id":"0a13e132-651d-11eb-ae93-0242ac130002","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\auditpol.exe AND process.command_line:(*disable* OR *clear* OR *remove* OR *restore*))`"}
