{"id":"23daeb52-e6eb-493c-8607-c4f0246cb7d8","created_by":"Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule), Michael Haag","name":"New Lolbin Process by Office Applications","tags":["attack.t1204.002","attack.t1047","attack.t1218.010","attack.execution","attack.defense_evasion"],"interval":"5m","description":"This rule will monitor any office apps that spins up a new LOLBin process. This activity is pretty suspicious and should be investigated.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ee][Rr][Cc][Ll][Ss][Ii][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/) AND process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Aa][Cc][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Qq][Nn][Ee][Dd][Tt]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Ss][Ii][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/))","rule_id":"23daeb52-e6eb-493c-8607-c4f0246cb7d8","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/","https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e","https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml","https://github.com/splunk/security_content/blob/develop/detections/endpoint/office_spawning_control.yml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\msiexec.exe OR *\\\\mshta.exe OR *\\\\verclsid.exe OR *\\\\msdt.exe OR *\\\\control.exe) AND process.parent.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\eqnedt32.exe OR *\\\\visio.exe OR *\\\\wordpad.exe OR *\\\\wordview.exe))`"}
