{"id":"e7888eb1-13b0-4616-bd99-4bc0c2b054b9","created_by":"Nasreddine Bencherchali","name":"Dllhost Process With No CommandLine","tags":["attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Detects a \"dllhost\" spawning with no commandline arguments which is a very rare thing to happen and could indicate process injection activity or malware mimicking similar system processes","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"e7888eb1-13b0-4616-bd99-4bc0c2b054b9","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/child-processes/","https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*dllhost.exe AND process.executable:*\\\\dllhost.exe)`"}
