{"id":"69ca006d-b9a9-47f5-80ff-ecd4d25d481a","created_by":"frack113","name":"Launch TruffleSnout Executable","tags":["attack.discovery","attack.t1482"],"interval":"5m","description":"Detect use of TruffleSnout.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Tt][Rr][Uu][Ff][Ff][Ll][Ee][Ss][Nn][Oo][Uu][Tt]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Tt][Rr][Uu][Ff][Ff][Ll][Ee][Ss][Nn][Oo][Uu][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"69ca006d-b9a9-47f5-80ff-ecd4d25d481a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md","https://github.com/dsnezhkov/TruffleSnout"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:TruffleSnout.exe OR process.executable:*\\\\TruffleSnout.exe)`"}
