{"id":"1b3b01c7-84e9-4072-86e5-fc285a41ff23","created_by":"Nasreddine Bencherchali","name":"Nslookup PowerShell Download","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects usage of powershell in conjunction with nslookup as a mean of download.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ \\..*/ AND process.command_line:/.*[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp].*/ AND process.command_line:/.*\\ \\-[Qq]\\=[Tt][Xx][Tt]\\ .*/) OR (process.parent.executable:/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*\\ \\-[Qq]\\=[Tt][Xx][Tt]\\ .*/ OR /.*\\ \\-[Qq][Uu][Ee][Rr][Yy][Tt][Yy][Pp][Ee]\\=[Tt][Xx][Tt]\\ .*/)))","rule_id":"1b3b01c7-84e9-4072-86e5-fc285a41ff23","timestamp_override":"event.ingested","references":["https://twitter.com/Alh4zr3d/status/1566489367232651264"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*powershell\\ .* AND process.command_line:*nslookup* AND process.command_line:*\\ \\-q\\=txt\\ *) OR (process.parent.executable:*\\\\powershell.exe AND process.executable:*\\\\nslookup.exe* AND process.command_line:(*\\ \\-q\\=txt\\ * OR *\\ \\-querytype\\=txt\\ *)))`"}
