{"id":"b9f0e6f5-09b4-4358-bae4-08408705bd5c","created_by":"Nasreddine Bencherchali","name":"Net.exe User Account Creation - Never Expire","tags":["attack.persistence","attack.t1136.001"],"interval":"5m","description":"Detects creation of local users via the net.exe command with the option \"never expire\"","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Uu][Ss][Ee][Rr].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Ee][Xx][Pp][Ii][Rr][Ee][Ss]\\:[Nn][Ee][Vv][Ee][Rr].*/)","rule_id":"b9f0e6f5-09b4-4358-bae4-08408705bd5c","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*user* AND process.command_line:*add* AND process.command_line:*expires\\:never*)`"}
