{"id":"7c9340a9-e2ee-4e43-94c5-c54ebbea1006","created_by":"frack113","name":"Suspicious DIR Execution","tags":["attack.discovery","attack.t1217"],"interval":"5m","description":"Detects usage of the \"dir\" command that's part of windows batch/cmd to collect information about directories","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Dd][Ii][Rr]\\ .*/ AND process.command_line:/.*\\ \\/[Ss].*/ AND process.command_line:/.*\\ \\/[Bb].*/)","rule_id":"7c9340a9-e2ee-4e43-94c5-c54ebbea1006","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*dir\\ * AND process.command_line:*\\ \\/s* AND process.command_line:*\\ \\/b*)`"}
