{"id":"2d87d610-d760-45ee-a7e6-7a6f2a65de00","created_by":"Florian Roth, oscd.community","name":"Mustang Panda Dropper","tags":["attack.t1587.001","attack.resource_development"],"interval":"5m","description":"Detects specific process parameters as used by Mustang Panda droppers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Tt][Ee][Mm][Pp]\\\\[Ww][Tt][Aa][Ss][Kk]\\.[Ee][Xx][Ee]\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee].*/ OR /.*%[Ww][Ii][Nn][Dd][Ii][Rr]\\:\\~\\-3,1%%[Pp][Uu][Bb][Ll][Ii][Cc]\\:\\~\\-9,1%.*/ OR /.*\\/[Tt][Nn]\\ \\\"[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/ OR /.*%[Ww][Ii][Nn][Dd][Ii][Rr]\\:\\~\\-1,1%.*/) OR (process.command_line:/.*\\/[Ee]\\:[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt].*/ AND process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\.[Tt][Xx][Tt].*/ AND process.command_line:/.*\\/[Ff].*/) OR process.executable:/.*[Tt][Ee][Mm][Pp]\\\\[Ww][Ii][Nn][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/)","rule_id":"2d87d610-d760-45ee-a7e6-7a6f2a65de00","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/7ca5661d-a67b-43ec-98c1-dd7a8103c256/","https://app.any.run/tasks/b12cccf3-1c22-4e28-9d3e-c7a6062f3914/","https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*Temp\\\\wtask.exe\\ \\/create* OR *%windir\\:\\~\\-3,1%%PUBLIC\\:\\~\\-9,1%* OR *\\/tn\\ \\\"Security\\ Script\\ * OR *%windir\\:\\~\\-1,1%*) OR (process.command_line:*\\/E\\:vbscript* AND process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*.txt* AND process.command_line:*\\/F*) OR process.executable:*Temp\\\\winwsh.exe)`"}
