{"id":"0a99eb3e-1617-41bd-b095-13dc767f3def","created_by":"Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)","name":"Jlaive Usage For Assembly Execution In-Memory","tags":["attack.execution","attack.t1059.003"],"interval":"5m","description":"Detect the use of Jlaive to execute assemblies in a copied PowerShell","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*\\.[Bb][Aa][Tt]/) AND ((process.executable:/.*\\\\[Xx][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Bb][Aa][Tt]\\.[Ee][Xx][Ee].*/) OR (process.executable:/.*\\\\[Xx][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Bb][Aa][Tt]\\.[Ee][Xx][Ee].*/) OR (process.executable:/.*\\\\[Aa][Tt][Tt][Rr][Ii][Bb]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\+[Ss].*/ AND process.command_line:/.*\\+[Hh].*/ AND process.command_line:/.*\\.[Bb][Aa][Tt]\\.[Ee][Xx][Ee].*/)))","rule_id":"0a99eb3e-1617-41bd-b095-13dc767f3def","timestamp_override":"event.ingested","references":["https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool","https://github.com/ch2sh/Jlaive"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\cmd.exe AND process.parent.command_line:*.bat) AND ((process.executable:*\\\\xcopy.exe AND process.command_line:*powershell.exe* AND process.command_line:*.bat.exe*) OR (process.executable:*\\\\xcopy.exe AND process.command_line:*pwsh.exe* AND process.command_line:*.bat.exe*) OR (process.executable:*\\\\attrib.exe AND process.command_line:*\\+s* AND process.command_line:*\\+h* AND process.command_line:*.bat.exe*)))`"}
