{"id":"fe63010f-8823-4864-a96b-a7b4a0f7b929","created_by":"Florian Roth","name":"Findstr LSASS","tags":["attack.credential_access","attack.t1552.006"],"interval":"5m","description":"Detects findstring commands that include the keyword lsass, which indicates recon actviity for the LSASS process PID","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ll][Ss][Aa][Ss][Ss].*/) OR process.command_line:(/.*\\ \\/[Ii]\\ [Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\ \\/[Ii]\\ \\\"[Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\ [Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]\\ [Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\ \\\"[Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]\\ \\\"[Ll][Ss][Aa][Ss][Ss].*/))","rule_id":"fe63010f-8823-4864-a96b-a7b4a0f7b929","timestamp_override":"event.ingested","references":["https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\findstr.exe AND process.command_line:*lsass*) OR process.command_line:(*\\ \\/i\\ lsass.exe* OR *\\ \\/i\\ \\\"lsass* OR *findstr\\ lsass* OR *findstr.exe\\ lsass* OR *findstr\\ \\\"lsass* OR *findstr.exe\\ \\\"lsass*))`"}
