{"id":"a238b5d0-ce2d-4414-a676-7a531b3d13d6","created_by":"@neu5ron, Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"Disable of ETW Trace","tags":["attack.defense_evasion","attack.t1070","attack.t1562.006","car.2016-04-002"],"interval":"5m","description":"Detects a command that clears or disables any ETW trace log which could indicate a logging evasion.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Cc][Ll].*/ AND process.command_line:/.*\\/[Tt][Rr][Aa][Cc][Ee].*/) OR (process.command_line:/.*[Cc][Ll][Ee][Aa][Rr]\\-[Ll][Oo][Gg].*/ AND process.command_line:/.*\\/[Tt][Rr][Aa][Cc][Ee].*/) OR (process.command_line:/.*[Ss][Ll].*/ AND process.command_line:/.*\\/[Ee]\\:[Ff][Aa][Ll][Ss][Ee].*/) OR (process.command_line:/.*[Ss][Ee][Tt]\\-[Ll][Oo][Gg].*/ AND process.command_line:/.*\\/[Ee]\\:[Ff][Aa][Ll][Ss][Ee].*/) OR (process.command_line:/.*[Ll][Oo][Gg][Mm][Aa][Nn].*/ AND process.command_line:/.*[Uu][Pp][Dd][Aa][Tt][Ee].*/ AND process.command_line:/.*[Tt][Rr][Aa][Cc][Ee].*/ AND process.command_line:/.*\\-\\-[Pp].*/ AND process.command_line:/.*\\-[Ee][Tt][Ss].*/) OR process.command_line:/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ee][Tt][Ww][Tt][Rr][Aa][Cc][Ee][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR (process.command_line:/.*[Ss][Ee][Tt]\\-[Ee][Tt][Ww][Tt][Rr][Aa][Cc][Ee][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ AND process.command_line:/.*0[Xx]11.*/))","rule_id":"a238b5d0-ce2d-4414-a676-7a531b3d13d6","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil","https://abuse.io/lockergoga.txt","https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*cl* AND process.command_line:*\\/Trace*) OR (process.command_line:*clear\\-log* AND process.command_line:*\\/Trace*) OR (process.command_line:*sl* AND process.command_line:*\\/e\\:false*) OR (process.command_line:*set\\-log* AND process.command_line:*\\/e\\:false*) OR (process.command_line:*logman* AND process.command_line:*update* AND process.command_line:*trace* AND process.command_line:*\\-\\-p* AND process.command_line:*\\-ets*) OR process.command_line:*Remove\\-EtwTraceProvider* OR (process.command_line:*Set\\-EtwTraceProvider* AND process.command_line:*0x11*))`"}
