{"id":"fa4b21c9-0057-4493-b289-2556416ae4d7","created_by":"Karneades / Markus Neis, Jonhnathan Ribeiro, oscd.community","name":"Squirrel Lolbin","tags":["attack.execution","attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects Possible Squirrel Packages Manager as Lolbin","risk_score":47,"enabled":true,"severity":"medium","false_positives":["1Clipboard","Beaker Browser","Caret","Collectie","Discord","Figma","Flow","Ghost","GitHub Desktop","GitKraken","Hyper","Insomnia","JIBO","Kap","Kitematic","Now Desktop","Postman","PostmanCanary","Rambox","Simplenote","Skype","Slack","SourceTree","Stride","Svgsus","WebTorrent","WhatsApp","WordPress.com","Atom","Gitkraken","Slack","Teams"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*\\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt].*/ OR /.*\\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt][Aa][Nn][Dd][Ww][Aa][Ii][Tt].*/ OR /.*\\-\\-[Cc][Rr][Ee][Aa][Tt][Ee][Ss][Hh][Oo][Rr][Tt][Cc][Uu][Tt].*/)) AND (NOT ((process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\ \\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt]\\ [Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\.[Ee][Xx][Ee].*/ OR process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Ii][Tt][Hh][Uu][Bb][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]\\ \\-\\-[Cc][Rr][Ee][Aa][Tt][Ee][Ss][Hh][Oo][Rr][Tt][Cc][Uu][Tt]\\ [Gg][Ii][Tt][Hh][Uu][Bb][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\.[Ee][Xx][Ee].*/ OR process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]\\\"\\ \\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt]\\ \\\"[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]\\\".*/))))","rule_id":"fa4b21c9-0057-4493-b289-2556416ae4d7","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/","http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\update.exe AND process.command_line:*.exe* AND process.command_line:(*\\-\\-processStart* OR *\\-\\-processStartAndWait* OR *\\-\\-createShortcut*)) AND (NOT ((process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Discord\\\\Update.exe* AND process.command_line:*\\ \\-\\-processStart\\ Discord.exe* OR process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\Update.exe\\ \\-\\-createShortcut\\ GitHubDesktop.exe* OR process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe\\\"\\ \\-\\-processStart\\ \\\"Teams.exe\\\"*))))`"}
