{"id":"e28a5a99-da44-436d-b7a0-2afc20a5f413","created_by":"Florian Roth","name":"Whoami Execution","tags":["attack.discovery","attack.t1033","car.2016-03-001"],"interval":"5m","description":"Detects the execution of whoami, which is often used by attackers after exploitation / privilege escalation but rarely used by administrators","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Admin activity","Scripts and administrative tools used in the monitored environment","Monitoring activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/)","rule_id":"e28a5a99-da44-436d-b7a0-2afc20a5f413","timestamp_override":"event.ingested","references":["https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/","https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\whoami.exe OR process.pe.original_file_name:whoami.exe)`"}
