{"id":"faa48cae-6b25-4f00-a094-08947fef582f","created_by":"@ROxPinTeddy","name":"Rar Usage with Password and Compression Level","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of Winrar command line version","Other command line tools, that use these flags"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\-[Hh][Pp].*/ AND process.command_line:(/.*\\ \\-[Mm].*/ OR /.*\\ [Aa]\\ .*/))","rule_id":"faa48cae-6b25-4f00-a094-08947fef582f","timestamp_override":"event.ingested","references":["https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/","https://ss64.com/bash/rar.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\-hp* AND process.command_line:(*\\ \\-m* OR *\\ a\\ *))`"}
