{"id":"b97cd4b1-30b8-4a9d-bd72-6293928d52bc","created_by":"A. Sungurov , oscd.community","name":"Indirect Command Execution By Program Compatibility Wizard","tags":["attack.defense_evasion","attack.t1218","attack.execution"],"interval":"5m","description":"Detect indirect command execution via Program Compatibility Assistant pcwrun.exe","risk_score":21,"enabled":true,"severity":"low","false_positives":["Need to use extra processing with 'unique_count' / 'filter' to focus on outliers as opposed to commonly seen artifacts","Legit usage of scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.parent.executable:/.*\\\\[Pp][Cc][Ww][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/","rule_id":"b97cd4b1-30b8-4a9d-bd72-6293928d52bc","timestamp_override":"event.ingested","references":["https://twitter.com/pabraeken/status/991335019833708544","https://lolbas-project.github.io/lolbas/Binaries/Pcwrun/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.parent.executable:*\\\\pcwrun.exe`"}
