{"id":"4281cb20-2994-4580-aa63-c8b86d019934","created_by":"Sami Ruohonen","name":"Hiding Files with Attrib.exe","tags":["attack.defense_evasion","attack.t1564.001"],"interval":"5m","description":"Detects usage of attrib.exe to hide files from users.","risk_score":21,"enabled":true,"severity":"low","false_positives":["IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe and igfxCUIService.exe is the parent of the cmd.exe)","Msiexec.exe hiding desktop.ini"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Aa][Tt][Tt][Rr][Ii][Bb]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\+[Hh]\\ .*/) AND (NOT ((process.command_line:/.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\.[Ii][Nn][Ii]\\ .*/ OR (process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/\\+[Rr]\\ \\+[Hh]\\ \\+[Ss]\\ \\+[Aa]\\ \\\\.*\\.[Cc][Uu][Ii]/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*\\.[Bb][Aa][Tt]/)))))","rule_id":"4281cb20-2994-4580-aa63-c8b86d019934","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\attrib.exe AND process.command_line:*\\ \\+h\\ *) AND (NOT ((process.command_line:*\\\\desktop.ini\\ * OR (process.parent.executable:*\\\\cmd.exe AND process.command_line:\\+R\\ \\+H\\ \\+S\\ \\+A\\ \\\\*.cui AND process.parent.command_line:C\\:\\\\WINDOWS\\\\system32\\\\*.bat)))))`"}
