{"id":"d3c3861d-c504-4c77-ba55-224ba82d0118","created_by":"Kutepov Anton, oscd.community","name":"Capture a Network Trace with netsh.exe","tags":["attack.discovery","attack.credential_access","attack.t1040"],"interval":"5m","description":"Detects capture a network trace via netsh.exe trace functionality","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrator or user uses netsh.exe trace functionality for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ee][Tt][Ss][Hh].*/ AND process.command_line:/.*[Tt][Rr][Aa][Cc][Ee].*/ AND process.command_line:/.*[Ss][Tt][Aa][Rr][Tt].*/)","rule_id":"d3c3861d-c504-4c77-ba55-224ba82d0118","timestamp_override":"event.ingested","references":["https://blogs.msdn.microsoft.com/canberrapfe/2012/03/30/capture-a-network-trace-without-installing-anything-capture-a-network-trace-of-a-reboot/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*netsh* AND process.command_line:*trace* AND process.command_line:*start*)`"}
