{"id":"3f7f5b0b-5b16-476c-a85f-ab477f6dd24b","created_by":"Trent Liffick (@tliffick), Bartlomiej Czyz (@bczyz1)","name":"Lazarus Session Highjacker","tags":["attack.defense_evasion","attack.t1036.005"],"interval":"5m","description":"Detects executables launched outside their default directories as used by Lazarus Group (Bluenoroff)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Mm][Ss][Dd][Tt][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Pp][Vv][Cc]\\.[Ee][Xx][Ee]/) AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))","rule_id":"3f7f5b0b-5b16-476c-a85f-ab477f6dd24b","timestamp_override":"event.ingested","references":["https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\msdtc.exe OR *\\\\gpvc.exe) AND (NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))))`"}
