{"id":"cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c","created_by":"Markus Neis, Sander Wiebing","name":"Netsh Port or Application Allowed","tags":["attack.defense_evasion","attack.t1562.004"],"interval":"5m","description":"Allow Incoming Connections by Port or Application on Windows Firewall","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/) AND (NOT ((process.command_line:(/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]\\ [Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Aa][Dd][Dd]\\ [Rr][Uu][Ll][Ee]\\ [Nn][Aa][Mm][Ee]\\=[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\ [Dd][Ii][Rr]\\=[Ii][Nn]\\ [Aa][Cc][Tt][Ii][Oo][Nn]\\=[Aa][Ll][Ll][Oo][Ww]\\ \\\"[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\=[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee]\\\"\\ [Ee][Nn][Aa][Bb][Ll][Ee]\\=[Yy][Ee][Ss]\\ [Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\=[Aa][Nn][Yy].*/ OR /.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]\\ [Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Aa][Dd][Dd]\\ [Rr][Uu][Ll][Ee]\\ [Nn][Aa][Mm][Ee]\\=[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\ [Dd][Ii][Rr]\\=[Ii][Nn]\\ [Aa][Cc][Tt][Ii][Oo][Nn]\\=[Aa][Ll][Ll][Oo][Ww]\\ \\\"[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\=[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee]\\\"\\ [Ee][Nn][Aa][Bb][Ll][Ee]\\=[Yy][Ee][Ss]\\ [Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\=[Aa][Nn][Yy].*/)))))","rule_id":"cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c","timestamp_override":"event.ingested","references":["https://attack.mitre.org/software/S0246/ (Lazarus HARDRAIN)","https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\netsh.exe AND process.command_line:*firewall* AND process.command_line:*add*) AND (NOT ((process.command_line:(*\\\\netsh.exe\\ advfirewall\\ firewall\\ add\\ rule\\ name\\=Dropbox\\ dir\\=in\\ action\\=allow\\ \\\"program\\=C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\"\\ enable\\=yes\\ profile\\=Any* OR *\\\\netsh.exe\\ advfirewall\\ firewall\\ add\\ rule\\ name\\=Dropbox\\ dir\\=in\\ action\\=allow\\ \\\"program\\=C\\:\\\\Program\\ Files\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\"\\ enable\\=yes\\ profile\\=Any*)))))`"}
