{"id":"ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e","created_by":"Thomas Patzke","name":"WMI Persistence - Script Event Consumer","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.003"],"interval":"5m","description":"Detects WMI script event consumers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate event consumers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e","timestamp_override":"event.ingested","references":["https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe AND process.parent.executable:C\\:\\\\Windows\\\\System32\\\\svchost.exe)`"}
