{"id":"99cf1e02-00fb-4c0d-8375-563f978dfd37","created_by":"Jonhnathan Ribeiro, oscd.community","name":"Suspicious Service DACL Modification","tags":["attack.persistence","attack.t1543.003"],"interval":"5m","description":"Detects suspicious DACL modifications that can  be used to hide services or make them unstopable","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Dd][Ss][Ee][Tt].*/ AND process.command_line:/.*[Dd];;.*/ AND process.command_line:(/.*;;;[Ii][Uu].*/ OR /.*;;;[Ss][Uu].*/ OR /.*;;;[Bb][Aa].*/ OR /.*;;;[Ss][Yy].*/ OR /.*;;;[Ww][Dd].*/))","rule_id":"99cf1e02-00fb-4c0d-8375-563f978dfd37","timestamp_override":"event.ingested","references":["https://www.sans.org/blog/red-team-tactics-hiding-windows-services/","https://docs.microsoft.com/pt-br/windows/win32/secauthz/sid-strings"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\sc.exe AND process.command_line:*sdset* AND process.command_line:*D;;* AND process.command_line:(*;;;IU* OR *;;;SU* OR *;;;BA* OR *;;;SY* OR *;;;WD*))`"}
