{"id":"b7e2a8d4-74bb-4b78-adc9-3f92af2d4829","created_by":"frack113, Nasreddine Bencherchali","name":"Reg Add Suspicious Paths","tags":["attack.defense_evasion","attack.t1112","attack.t1562.001"],"interval":"5m","description":"Detects when an adversary uses the reg.exe utility to add or modify new keys or subkeys","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare legitimate add to registry via cli (to these locations)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa][Ll][Oo][Ww]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\.*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Oo][Oo][Bb][Ee].*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn].*/ OR /.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\[Ww][Dd][Ii][Gg][Ee][Ss][Tt].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/))","rule_id":"b7e2a8d4-74bb-4b78-adc9-3f92af2d4829","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md","https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe OR process.pe.original_file_name:reg.exe) AND process.command_line:(*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE* OR *\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon* OR *\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest* OR *\\\\Microsoft\\\\Windows\\ Defender\\\\*))`"}
