{"id":"88f680b8-070e-402c-ae11-d2914f2257f1","created_by":"Florian Roth","name":"Encoded IEX","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a base64 encoded IEX command string in a process command line","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Ss][Uu][Vv][Yy][Ii][Cc][Hh][Bb].*/ OR /.*[Ll][Ff][Ww][Cc][Aa][Oo][Ww].*/ OR /.*[Jj][Rr][Vv][Gg][Gg][Kk][Ff].*/ OR /.*[Aa][Ww][Vv]4[Ii][Cc][Hh][Bb].*/ OR /.*[Ll][Ll][Ee][Cc][Aa][Oo][Ww].*/ OR /.*[Pp][Zz][Xx][Gg][Gg][Kk][Ff].*/ OR /.*[Aa][Ww][Vv]4[Ii][Cc][Hh][Oo][Zz][Xx].*/ OR /.*[Ll][Ll][Ee][Cc][Aa][Oo][Tt][Mm][Vv]3.*/ OR /.*[Pp][Zz][Xx][Gg][Gg][Kk][Ee]5[Ll][Dd].*/ OR /.*[Ss][Uu][Vv][Yy][Ii][Cc][Hh][Oo][Zz][Xx].*/ OR /.*[Ll][Ff][Ww][Cc][Aa][Oo][Tt][Mm][Vv]3.*/ OR /.*[Jj][Rr][Vv][Gg][Gg][Kk][Ee]5[Ll][Dd].*/) OR process.command_line:(/.*[Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa][Ii][Aa][Aa][Oo][Aa][Ff][Ss][Aa].*/ OR /.*[Kk][Aa][Rr][Qq][Bb][Yy][Aa][Cc][Aa][Aa][Kk][Aa][Bb][Bb][Aa].*/ OR /.*[Jj][Aa][Ee][Uu][Aa][Ww][Aa][Aa][Gg][Aa][Cc][Gg][Aa][Ww][Ww].*/ OR /.*[Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa][Ii][Aa][Aa][Oo][Aa][Ff][Ss][Aa].*/ OR /.*[Kk][Aa][Zz][Qq][Bb]4[Aa][Cc][Aa][Aa][Kk][Aa][Bb][Bb][Aa].*/ OR /.*[Pp][Aa][Gg][Uu][Aa][Ee][Aa][Aa][Gg][Aa][Cc][Gg][Aa][Ww][Ww].*/ OR /.*[Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa][Ii][Aa][Aa][Oo][Aa][Ee]4[Aa][Zz][Qq][Bb]3[Aa].*/ OR /.*[Kk][Aa][Zz][Qq][Bb]4[Aa][Cc][Aa][Aa][Kk][Aa][Bb][Oo][Aa][Gg][Uu][Aa][Dd][Ww].*/ OR /.*[Pp][Aa][Gg][Uu][Aa][Ee][Aa][Aa][Gg][Aa][Cc][Gg][Aa][Tt][Gg][Bb][Ll][Aa][Hh][Cc][Aa].*/ OR /.*[Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa][Ii][Aa][Aa][Oo][Aa][Ee]4[Aa][Zz][Qq][Bb]3[Aa].*/ OR /.*[Kk][Aa][Rr][Qq][Bb][Yy][Aa][Cc][Aa][Aa][Kk][Aa][Bb][Oo][Aa][Gg][Uu][Aa][Dd][Ww].*/ OR /.*[Jj][Aa][Ee][Uu][Aa][Ww][Aa][Aa][Gg][Aa][Cc][Gg][Aa][Tt][Gg][Bb][Ll][Aa][Hh][Cc][Aa].*/))","rule_id":"88f680b8-070e-402c-ae11-d2914f2257f1","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*SUVYIChb* OR *lFWCAoW* OR *JRVggKF* OR *aWV4IChb* OR *lleCAoW* OR *pZXggKF* OR *aWV4IChOZX* OR *lleCAoTmV3* OR *pZXggKE5ld* OR *SUVYIChOZX* OR *lFWCAoTmV3* OR *JRVggKE5ld*) OR process.command_line:(*SQBFAFgAIAAoAFsA* OR *kARQBYACAAKABbA* OR *JAEUAWAAgACgAWw* OR *aQBlAHgAIAAoAFsA* OR *kAZQB4ACAAKABbA* OR *pAGUAeAAgACgAWw* OR *aQBlAHgAIAAoAE4AZQB3A* OR *kAZQB4ACAAKABOAGUAdw* OR *pAGUAeAAgACgATgBlAHcA* OR *SQBFAFgAIAAoAE4AZQB3A* OR *kARQBYACAAKABOAGUAdw* OR *JAEUAWAAgACgATgBlAHcA*))`"}
