{"id":"3f3f3506-1895-401b-9cc3-e86b16e630d0","created_by":"Christian Burkard, Tim Shelton","name":"Direct Syscall of NtOpenProcess","tags":["attack.execution","attack.t1106"],"interval":"5m","description":"Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.CallTrace:/[Uu][Nn][Kk][Nn][Oo][Ww][Nn].*/ AND (NOT ((winlog.event_data.TargetImage:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Yy][Ll][Aa][Nn][Cc][Ee]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Cc][Yy][Ll][Aa][Nn][Cc][Ee][Uu][Ii]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.TargetImage:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.TargetImage:/.*[Vv][Cc][Rr][Ee][Dd][Ii][Ss][Tt]_[Xx]64\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Vv][Cc][Rr][Ee][Dd][Ii][Ss][Tt]_[Xx]64\\.[Ee][Xx][Ee]/) OR (winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Ss][Ee][Tt][Uu][Pp]64\\.[Ee][Xx][Ee]/) OR (winlog.event_data.TargetImage:/.*[Aa][Mm][Aa][Zz][Oo][Nn][Ss][Ss][Mm][Aa][Gg][Ee][Nn][Tt][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Aa][Mm][Aa][Zz][Oo][Nn][Ss][Ss][Mm][Aa][Gg][Ee][Nn][Tt][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.TargetImage:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/))))","rule_id":"3f3f3506-1895-401b-9cc3-e86b16e630d0","timestamp_override":"event.ingested","references":["https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.CallTrace:UNKNOWN* AND (NOT ((winlog.event_data.TargetImage:C\\:\\\\Program\\ Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe AND process.executable:C\\:\\\\Windows\\\\Explorer.EXE) OR (winlog.event_data.TargetImage:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\MicrosoftEdgeUpdate.exe AND process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Temp\\\\* AND process.executable:*\\\\MicrosoftEdgeUpdate.exe) OR (winlog.event_data.TargetImage:*vcredist_x64.exe AND process.executable:*vcredist_x64.exe) OR (winlog.event_data.TargetImage:C\\:\\\\Windows\\\\system32\\\\systeminfo.exe AND process.executable:*setup64.exe) OR (winlog.event_data.TargetImage:*AmazonSSMAgentSetup.exe AND process.executable:*AmazonSSMAgentSetup.exe) OR (winlog.event_data.TargetImage:*C\\:\\\\Program\\ Files\\\\Mozilla\\ Firefox\\\\firefox.exe AND process.executable:*C\\:\\\\Program\\ Files\\\\Mozilla\\ Firefox\\\\firefox.exe))))`"}
