{"id":"10c14723-61c7-4c75-92ca-9af245723ad2","created_by":"Ecco, oscd.community, Jonhnathan Ribeiro","name":"Impacket Lateralization Detection","tags":["attack.execution","attack.t1047","attack.lateral_movement","attack.t1021.003"],"interval":"5m","description":"Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\/[Qq].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*\\\\\\\\127\\.0\\.0\\.1\\\\.*/ AND process.command_line:/.*\\&1.*/) OR (process.parent.command_line:(/.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss].*/ OR /.*[Tt][Aa][Ss][Kk][Ee][Nn][Gg]\\.[Ee][Xx][Ee].*/) AND process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.command_line:/.*\\&1.*/))","rule_id":"10c14723-61c7-4c75-92ca-9af245723ad2","timestamp_override":"event.ingested","references":["https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/wmiexec.py","https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/atexec.py","https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/smbexec.py","https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/dcomexec.py"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\wmiprvse.exe OR *\\\\mmc.exe OR *\\\\explorer.exe OR *\\\\services.exe) AND process.command_line:*cmd.exe* AND process.command_line:*\\/Q* AND process.command_line:*\\/c* AND process.command_line:*\\\\\\\\127.0.0.1\\\\* AND process.command_line:*&1*) OR (process.parent.command_line:(*svchost.exe\\ \\-k\\ netsvcs* OR *taskeng.exe*) AND process.command_line:*cmd.exe* AND process.command_line:*\\/C* AND process.command_line:*Windows\\\\Temp\\\\* AND process.command_line:*&1*))`"}
