{"id":"23ceaf5c-b6f1-4a32-8559-f2ff734be516","created_by":"Kirill Kiryanov, oscd.community","name":"Dumping Process via Sqldumper.exe","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects process dump via legitimate sqldumper.exe binary","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate MSSQL Server actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Qq][Ll][Dd][Uu][Mm][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*0[Xx]0110.*/ OR /.*0[Xx]01100\\:40.*/))","rule_id":"23ceaf5c-b6f1-4a32-8559-f2ff734be516","timestamp_override":"event.ingested","references":["https://twitter.com/countuponsec/status/910977826853068800","https://twitter.com/countuponsec/status/910969424215232518","https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqldumper/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\sqldumper.exe AND process.command_line:(*0x0110* OR *0x01100\\:40*))`"}
