{"id":"b27077d6-23e6-45d2-81a0-e2b356eea5fd","created_by":"frack113","name":"Use of TTDInject.exe","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Detects the executiob of TTDInject.exe, which is used by Windows 10 v1809 and newer to debug time travel (underlying call of tttracer.exe)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*[Tt][Tt][Dd][Ii][Nn][Jj][Ee][Cc][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Tt][Tt][Dd][Ii][Nn][Jj][Ee][Cc][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"b27077d6-23e6-45d2-81a0-e2b356eea5fd","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*ttdinject.exe OR process.pe.original_file_name:TTDInject.EXE)`"}
