{"id":"b5c7395f-e501-4a08-94d4-57fe7a9da9d2","created_by":"Beyu Denis, oscd.community, Nasreddine Bencherchali","name":"Possible App Whitelisting Bypass via WinDbg/CDB as a Shellcode Runner","tags":["attack.execution","attack.t1106","attack.defense_evasion","attack.t1218","attack.t1127"],"interval":"5m","description":"Launch 64-bit shellcode from a debugger script file using cdb.exe.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of debugging tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Dd][Bb]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Dd][Bb]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Cc]\\ .*/ OR /.*\\ \\-[Cc][Ff]\\ .*/))","rule_id":"b5c7395f-e501-4a08-94d4-57fe7a9da9d2","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/","http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html","https://twitter.com/nas_bench/status/1534957360032120833"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\cdb.exe OR process.pe.original_file_name:CDB.Exe) AND process.command_line:(*\\ \\-c\\ * OR *\\ \\-cf\\ *))`"}
