{"id":"e593cf51-88db-4ee1-b920-37e89012a3c9","created_by":"juju4, Jonhnathan Ribeiro, oscd.community, Nasreddine Bencherchali","name":"Suspicious Rundll32 Activity","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects suspicious process related to rundll32 based on arguments","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt]\\:.*/ AND process.command_line:/.*\\.[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Xx][Ll][Ll].*/) OR (process.command_line:/.*[Uu][Rr][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Oo][Pp][Ee][Nn][Uu][Rr][Ll].*/) OR (process.command_line:/.*[Uu][Rr][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Oo][Pp][Ee][Nn][Uu][Rr][Ll][Aa].*/) OR (process.command_line:/.*[Uu][Rr][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ff][Ii][Ll][Ee][Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Hh][Aa][Nn][Dd][Ll][Ee][Rr].*/) OR (process.command_line:/.*[Zz][Ii][Pp][Ff][Ll][Dd][Rr]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Rr][Oo][Uu][Tt][Ee][Tt][Hh][Ee][Cc][Aa][Ll][Ll].*/) OR (process.command_line:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll].*/) OR (process.command_line:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/) OR (process.command_line:/.*[Mm][Ss][Hh][Tt][Mm][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Pp][Rr][Ii][Nn][Tt][Hh][Tt][Mm][Ll].*/) OR (process.command_line:/.*[Aa][Dd][Vv][Pp][Aa][Cc][Kk]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh][Ii][Nn][Ff][Ss][Ee][Cc][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Aa][Dd][Vv][Pp][Aa][Cc][Kk]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Oo][Cc][Xx].*/) OR (process.command_line:/.*[Ii][Ee][Aa][Dd][Vv][Pp][Aa][Cc][Kk]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh][Ii][Nn][Ff][Ss][Ee][Cc][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Ii][Ee][Aa][Dd][Vv][Pp][Aa][Cc][Kk]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Oo][Cc][Xx].*/) OR (process.command_line:/.*[Ii][Ee][Ff][Rr][Aa][Mm][Ee]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Oo][Pp][Ee][Nn][Uu][Rr][Ll].*/) OR (process.command_line:/.*[Ss][Hh][Dd][Oo][Cc][Vv][Ww]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Oo][Pp][Ee][Nn][Uu][Rr][Ll].*/) OR (process.command_line:/.*[Ss][Yy][Ss][Ss][Ee][Tt][Uu][Pp]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Ee][Tt][Uu][Pp][Ii][Nn][Ff][Oo][Bb][Jj][Ee][Cc][Tt][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Aa][Cc][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Ss][Ee][Tt][Uu][Pp][Aa][Pp][Ii]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Hh][Ii][Nn][Ff][Ss][Ee][Cc][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Pp][Cc][Ww][Uu][Tt][Ll]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Dd][Ff][Ss][Hh][Ii][Mm]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Hh][Oo][Pp][Ee][Nn][Vv][Ee][Rr][Bb][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/) OR (process.command_line:/.*[Dd][Ff][Ss][Hh][Ii][Mm]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Hh][Oo][Pp][Ee][Nn][Vv][Ee][Rr][Bb][Ss][Hh][Oo][Rr][Tt][Cc][Uu][Tt].*/) OR (process.command_line:/.*[Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Gg][Ee][Nn][Ee][Rr][Aa][Tt][Ee][Tt][Yy][Pp][Ee][Ll][Ii][Bb].*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/) OR (process.command_line:/.*[Ss][Hh][Ii][Mm][Gg][Vv][Ww]\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ii][Mm][Aa][Gg][Ee][Vv][Ii][Ee][Ww]_[Ff][Uu][Ll][Ll][Ss][Cc][Rr][Ee][Ee][Nn].*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/)) AND (NOT ((process.command_line:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll],[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]\\ [Dd][Ee][Ss][Kk]\\.[Cc][Pp][Ll],[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Rr],\\@[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Aa][Vv][Ee][Rr].*/) OR (process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*\\.[Cc][Pp][Ll].*/))))","rule_id":"e593cf51-88db-4ee1-b920-37e89012a3c9","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2017/05/01/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline/","https://twitter.com/Hexacorn/status/885258886428725250","https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52","https://twitter.com/nas_bench/status/1433344116071583746","https://twitter.com/eral4m/status/1479106975967240209","https://twitter.com/eral4m/status/1479080793003671557"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*javascript\\:* AND process.command_line:*.RegisterXLL*) OR (process.command_line:*url.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*url.dll* AND process.command_line:*OpenURLA*) OR (process.command_line:*url.dll* AND process.command_line:*FileProtocolHandler*) OR (process.command_line:*zipfldr.dll* AND process.command_line:*RouteTheCall*) OR (process.command_line:*shell32.dll* AND process.command_line:*Control_RunDLL*) OR (process.command_line:*shell32.dll* AND process.command_line:*ShellExec_RunDLL*) OR (process.command_line:*mshtml.dll* AND process.command_line:*PrintHTML*) OR (process.command_line:*advpack.dll* AND process.command_line:*LaunchINFSection*) OR (process.command_line:*advpack.dll* AND process.command_line:*RegisterOCX*) OR (process.command_line:*ieadvpack.dll* AND process.command_line:*LaunchINFSection*) OR (process.command_line:*ieadvpack.dll* AND process.command_line:*RegisterOCX*) OR (process.command_line:*ieframe.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*shdocvw.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*syssetup.dll* AND process.command_line:*SetupInfObjectInstallAction*) OR (process.command_line:*setupapi.dll* AND process.command_line:*InstallHinfSection*) OR (process.command_line:*pcwutl.dll* AND process.command_line:*LaunchApplication*) OR (process.command_line:*dfshim.dll* AND process.command_line:*ShOpenVerbApplication*) OR (process.command_line:*dfshim.dll* AND process.command_line:*ShOpenVerbShortcut*) OR (process.command_line:*scrobj.dll* AND process.command_line:*GenerateTypeLib* AND process.command_line:*http*) OR (process.command_line:*shimgvw.dll* AND process.command_line:*ImageView_Fullscreen* AND process.command_line:*http*)) AND (NOT ((process.command_line:*shell32.dll,Control_RunDLL\\ desk.cpl,screensaver,@screensaver*) OR (process.parent.executable:C\\:\\\\Windows\\\\System32\\\\control.exe AND process.parent.command_line:*.cpl*))))`"}
