{"id":"850d55f9-6eeb-4492-ad69-a72338f65ba4","created_by":"frack113","name":"Ilasm Lolbin Use Compile C-Sharp","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Detect use of Ilasm.exe to compile c# code into dll or exe.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ii][Ll][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ii][Ll][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/)","rule_id":"850d55f9-6eeb-4492-ad69-a72338f65ba4","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Ilasm/","https://www.echotrail.io/insights/search/ilasm.exe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\ilasm.exe OR process.pe.original_file_name:ilasm.exe)`"}
