{"id":"7ba08e95-1e0b-40cd-9db5-b980555e42fd","created_by":"MSTIC, FPT.EagleEye","name":"SOURGUM Actor Behaviours","tags":["attack.t1546","attack.t1546.015","attack.persistence","attack.privilege_escalation"],"interval":"5m","description":"Suspicious behaviours related to an actor tracked by Microsoft as SOURGUM","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Hh][Yy][Ss][Mm][Ee][Mm]\\.[Ss][Yy][Ss].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Mm][Ee]\\\\[Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Ww][Ii][Mm][Bb][Oo][Oo][Tt][Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn][Ss]\\.[Ii][Nn][Ii].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Mm][Ee]\\\\[Ii][Mm][Ee][Jj][Pp]\\\\[Ww][Ii][Mm][Bb][Oo][Oo][Tt][Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn][Ss]\\.[Ii][Nn][Ii].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Mm][Ee]\\\\[Ii][Mm][Ee][Tt][Cc]\\\\[Ww][Ii][Mm][Bb][Oo][Oo][Tt][Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn][Ss]\\.[Ii][Nn][Ii].*/) OR (process.executable:(/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ff][Ii][Ll][Ee][Pp][Aa][Tt][Hh]2.*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Mm][Ee].*/) AND process.command_line:/.*[Rr][Ee][Gg]\\ [Aa][Dd][Dd].*/ AND process.command_line:(/.*[Hh][Kk][Ee][Yy]_[Ll][Oo][Cc][Aa][Ll]_[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{7[Cc]857801\\-7381\\-11[Cc][Ff]\\-884[Dd]\\-00[Aa][Aa]004[Bb]2[Ee]24\\}\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32.*/ OR /.*[Hh][Kk][Ee][Yy]_[Ll][Oo][Cc][Aa][Ll]_[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Cc][Ff]4[Cc][Cc]405\\-[Ee]2[Cc]5\\-4[Dd][Dd][Dd]\\-[Bb]3[Cc][Ee]\\-5[Ee]7582[Dd]8[Cc]9[Ff][Aa]\\}\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32.*/)))","rule_id":"7ba08e95-1e0b-40cd-9db5-b980555e42fd","timestamp_override":"event.ingested","references":["https://www.virustotal.com/gui/file/c299063e3eae8ddc15839767e83b9808fd43418dc5a1af7e4f44b97ba53fbd3d/detection","https://github.com/Azure/Azure-Sentinel/blob/43e9be273dca321295190bfc4902858e009d4a35/Detections/MultipleDataSources/SOURGUM_IOC.yaml","https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*windows\\\\system32\\\\Physmem.sys* OR *Windows\\\\system32\\\\ime\\\\SHARED\\\\WimBootConfigurations.ini* OR *Windows\\\\system32\\\\ime\\\\IMEJP\\\\WimBootConfigurations.ini* OR *Windows\\\\system32\\\\ime\\\\IMETC\\\\WimBootConfigurations.ini*) OR (process.executable:(*windows\\\\system32\\\\filepath2* OR *windows\\\\system32\\\\ime*) AND process.command_line:*reg\\ add* AND process.command_line:(*HKEY_LOCAL_MACHINE\\\\software\\\\classes\\\\clsid\\\\\\{7c857801\\-7381\\-11cf\\-884d\\-00aa004b2e24\\}\\\\inprocserver32* OR *HKEY_LOCAL_MACHINE\\\\software\\\\classes\\\\clsid\\\\\\{cf4cc405\\-e2c5\\-4ddd\\-b3ce\\-5e7582d8c9fa\\}\\\\inprocserver32*)))`"}
