{"id":"eb87818d-db5d-49cc-a987-d5da331fbd90","created_by":"Jakob Weinzettl, oscd.community, Nasreddine Bencherchali","name":"Stop Windows Service","tags":["attack.impact","attack.t1489"],"interval":"5m","description":"Detects a windows service to be stopped","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator shutting down the service due to upgrade or removal purposes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((process.pe.original_file_name:(/[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) OR process.executable:(/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/)) AND process.command_line:/.*\\ [Ss][Tt][Oo][Pp]\\ .*/) AND (NOT (process.command_line:/[Ss][Cc]\\ \\ [Ss][Tt][Oo][Pp]\\ [Kk][Ss][Cc][Ww][Ee][Bb][Cc][Oo][Nn][Ss][Oo][Ll][Ee][Mm][Ee][Ss][Ss][Aa][Gg][Ee][Qq][Uu][Ee][Uu][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)))) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ss][Tt][Oo][Pp]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/))","rule_id":"eb87818d-db5d-49cc-a987-d5da331fbd90","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((process.pe.original_file_name:(sc.exe OR net.exe OR net1.exe) OR process.executable:(*\\\\sc.exe OR *\\\\net.exe OR *\\\\net1.exe)) AND process.command_line:*\\ stop\\ *) AND (NOT (process.command_line:sc\\ \\ stop\\ KSCWebConsoleMessageQueue AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)))) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Stop\\-Service\\ *))`"}
