{"id":"3b6ab547-8ec2-4991-b9d2-2b06702a48d7","created_by":"Florian Roth, oscd.community, Jonhnathan Ribeiro","name":"PowerShell Download from URL","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a Powershell process that contains download commands in its command line string","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.command_line:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\)\\..*/ AND process.command_line:/.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd].*/ AND process.command_line:(/.*[Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*[Ff][Ii][Ll][Ee]\\(.*/))","rule_id":"3b6ab547-8ec2-4991-b9d2-2b06702a48d7","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*new\\-object* AND process.command_line:*net.webclient\\).* AND process.command_line:*download* AND process.command_line:(*string\\(* OR *file\\(*))`"}
