{"id":"f26c6093-6f14-4b12-800f-0fcb46f5ffd0","created_by":"John Lambert (rule)","name":"Malicious Base64 Encoded PowerShell Keywords in Command Lines","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects base64 encoded strings used in hidden malicious PowerShell command lines","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ AND process.command_line:(/.*[Aa][Gg][Kk][Aa][Dd][Aa][Bb][Zz][Aa][Gg][Ee][Aa][Zz][Aa][Bb][Tt][Aa][Gg][Kk][Aa][Bb][Gg][Aa][Gg][Aa][Cc]8[Aa][Dd][Aa][Bb][Yy][Aa][Gg][Ee][Aa][Bb][Gg][Bb][Zz][Aa][Gg][Yy][Aa][Zz][Qq][Bb][Yy][Aa].*/ OR /.*[Aa][Xx][Rr][Zz][Yy][Ww][Rr][Tt][Aa][Ww]4[Gg][Ll]3[Rr][Yy][Yy][Ww]5[Zz][Zz][Mm][Vv][Yy].*/ OR /.*[Ii][Aa][Aa][Qq][Bb]0[Aa][Hh][Mm][Aa][Yy][Qq][Bb][Kk][Aa][Gg]0[Aa][Aa][Qq][Bb][Uu][Aa][Cc][Aa][Aa][Ll][Ww][Bb]0[Aa][Hh][Ii][Aa][Yy][Qq][Bb][Uu][Aa][Hh][Mm][Aa][Zz][Gg][Bb][Ll][Aa][Hh][Ii][Aa].*/ OR /.*[Jj][Pp][Dd][Hh][Nn][Hh][Zz][Gg]1[Pp][Bb][Ii][Aa][Vv][Dd][Hh][Jj][Hh][Bb][Nn][Nn][Mm][Zz][Xx].*/ OR /.*[Yy][Gg][Bb][Pp][Aa][Hh][Qq][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Qq][Aa][Bb][Qq][Bb][Pp][Aa][Gg]4[Aa][Ii][Aa][Aa][Vv][Aa][Hh][Qq][Aa][Cc][Gg][Bb][Hh][Aa][Gg]4[Aa][Cc][Ww][Bb][Mm][Aa][Gg][Uu][Aa][Cc][Gg].*/ OR /.*[Yy][Mm][Ll]0[Cc]2[Ff][Kk][Bb][Ww][Ll][Uu][Ii][Cc]90[Cc][Mm][Ff][Uu][Cc]2[Zz][Ll][Cc].*/ OR /.*[Aa][Gg][Mm][Aa][Aa][Aa][Bb]1[Aa][Gg]4[Aa][Aa][Ww][Bb][Ff][Aa][Hh][Mm][Aa][Aa][Qq][Bb]6[Aa][Gg][Uu][Aa].*/ OR /.*[Jj][Aa][Bb][Jj][Aa][Gg][Gg][Aa][Dd][Qq][Bb][Uu][Aa][Gg][Ss][Aa][Xx][Ww][Bb][Zz][Aa][Gg][Kk][Aa][Ee][Gg][Bb][Ll][Aa].*/ OR /.*[Jj][Gg][Nn][Oo][Dd][Ww]5[Rr][Xx]3[Nn][Pp][Ee][Mm].*/ OR /.*[Qq][Aa][Yy][Ww][Bb][Oo][Aa][Hh][Uu][Aa][Bb][Gg][Bb][Rr][Aa][Ff]8[Aa][Cc][Ww][Bb][Pp][Aa][Hh][Oo][Aa][Zz][Qq].*/ OR /.*[Rr][Jj][Aa][Hh][Vv][Uu][Aa]19[Zz][Aa][Xx][Pp][Ll].*/ OR /.*[Yy]2[Hh]1[Bb][Mm][Tt][Ff][Cc]2[Ll]6[Zz].*/ OR /.*[Aa][Ee]8[Aa][Ll][Gg][Bb][Dd][Aa][Gg]8[Aa][Bb][Qq][Bb][Ww][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Zz][Aa][Hh][Mm][Aa][Aa][Qq][Bb][Vv][Aa][Gg]4[Aa].*/ OR /.*[Kk][Aa][Tt][Ww][Aa][Uu][Aa][Ee][Mm][Aa][Bb][Ww][Bb][Tt][Aa][Hh][Aa][Aa][Cc][Gg][Bb][Ll][Aa][Hh][Mm][Aa][Cc][Ww][Bb][Pp][Aa][Gg]8[Aa][Bb][Gg].*/ OR /.*[Ll][Pp][Ll][Kk][Nn][Vv][Bb][Xx][Bb][Yy][Zz][Xx][Nn][Zz][Aa][Ww]9[Uu].*/ OR /.*[Ss][Qq][Bb][Pp][Aa][Cc]4[Aa][Qq][Ww][Bb][Vv][Aa][Gg]0[Aa][Cc][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Cc][Ww][Bb][Zz][Aa][Gg][Kk][Aa][Bb][Ww][Bb][Uu][Aa].*/ OR /.*[Ss][Uu]8[Uu][Qq]29[Tt][Cc][Hh][Jj][Ll][Cc]3[Nn][Pp][Bb]2.*/ OR /.*[Tt][Yy]5[Dd][Bb]21[Ww][Cc][Mm][Vv][Zz][Cc]2[Ll][Vv][Bb].*/ OR /.*[Aa][Ee]8[Aa][Ll][Gg][Bb][Nn][Aa][Gg][Uu][Aa][Bb][Qq][Bb][Vv][Aa][Hh][Ii][Aa][Ee][Qq][Bb][Tt][Aa][Hh][Qq][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Ee][Aa][Bb][Qq].*/ OR /.*[Kk][Aa][Tt][Ww][Aa][Uu][Aa][Ee]0[Aa][Zz][Qq][Bb][Tt][Aa][Gg]8[Aa][Cc][Gg][Bb]5[Aa][Ff][Mm][Aa][Dd][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Yy][Qq][Bb][Tt][Aa].*/ OR /.*[Ll][Pp][Ll][Kk]1[Ll][Bb][Ww]9[Yy][Ee][Vv][Nn]0[Cc][Mm][Vv][Hh][Bb].*/ OR /.*[Ss][Qq][Bb][Pp][Aa][Cc]4[Aa][Tt][Qq][Bb][Ll][Aa][Gg]0[Aa][Bb][Ww][Bb][Yy][Aa][Hh][Kk][Aa][Uu][Ww][Bb]0[Aa][Hh][Ii][Aa][Zz][Qq][Bb][Hh][Aa][Gg]0[Aa].*/ OR /.*[Ss][Uu]8[Uu][Tt][Ww][Vv][Tt][Bb]3[Jj]5[Uu]3[Rr][Yy][Zz][Ww][Ff][Tt].*/ OR /.*[Tt][Yy]5[Nn][Zz][Ww]1[Vv][Cc][Nn][Ll][Tt][Dd][Hh][Jj][Ll][Yy][Ww].*/ OR /.*4[Aa][Rr][Ww][Bb][Ll][Aa][Hh][Qq][Aa][Qq][Ww][Bb][Oo][Aa][Hh][Uu][Aa][Bb][Gg][Bb][Rr][Aa].*/ OR /.*5[Hh][Zz][Xx][Rr][Dd][Aa][Hh][Vv][Uu][Aa].*/ OR /.*[Aa][Ee][Cc][Aa][Zz][Qq][Bb]0[Aa][Ee][Mm][Aa][Aa][Aa][Bb]1[Aa][Gg]4[Aa][Aa][Ww].*/ OR /.*[Ll][Gg][Bb][Hh][Aa][Gg][Uu][Aa][Dd][Aa][Bb][Dd][Aa][Gg][Gg][Aa][Dd][Qq][Bb][Uu][Aa][Gg][Ss][Aa].*/ OR /.*[Ll][Kk][Dd][Ll][Dd][Ee][Nn][Oo][Dd][Ww]5[Rr].*/ OR /.*[Rr]2[Vv]0[Qq]2[Hh]1[Bb][Mm].*/ OR /.*[Aa][Ee][Gg][Aa][Uu][Gg][Bb][Ff][Aa][Ee][Ee][Aa][Rr][Aa][Bb][Ff][Aa][Ee][Kk][Aa][Tt][Gg][Bb][Gg][Aa][Ee]8[Aa][Nn][Gg][Aa]0[Aa].*/ OR /.*[Qq][Aa][Ss][Aa][Bb][Ss][Aa][Ee][Uu][Aa][Qq][Qq][Bb][Ee][Aa][Ff]8[Aa][Ss][Qq][Bb][Oo][Aa][Ee][Yy][Aa][Tt][Ww][Aa]2[Aa][Dd][Qq][Aa].*/ OR /.*[Rr][Ii][Uu][Kk][Vv][Bb][Rr][Ff]9[Jj][Tt][Kk][Zz][Pp][Nn][Jj].*/ OR /.*[Ss][Ff][Jj][Ff][Qq][Uu][Rr][Ff][Ss][Uu]5[Gg][Tt][Zz][Yy]0.*/ OR /.*[Vv][Aa][Bb][Ii][Aa][Ff][Ii][Aa][Rr][Qq][Bb][Bb][Aa][Ee][Qq][Aa][Xx][Ww][Bb][Jj][Aa][Ee]4[Aa][Rr][Gg][Bb][Pp][Aa][Dd][Yy][Aa][Nn][Aa].*/ OR /.*[Vv][Ee][Hh][Ss][Rr][Uu][Ff][Ee][Xx]0[Ll][Oo][Rr][Kk]82[Nn].*/ OR /.*[Aa][Hh][Ii][Aa][Zz][Qq][Bb][Hh][Aa][Hh][Qq][Aa][Zz][Qq][Bb][Ss][Aa][Gg][Uu][Aa][Bb][Qq][Bb][Vv][Aa][Hh][Qq][Aa][Zz][Qq][Bb][Uu][Aa][Gg][Gg][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Ee][Aa][Zz][Aa].*/ OR /.*[Cc][Mm][Vv][Hh][Dd][Gg][Vv][Ss][Zz][Ww]1[Vv][Dd][Gg][Vv][Uu][Aa][Hh][Jj][Ll][Yy][Ww].*/ OR /.*[Mm][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Ee][Aa][Dd][Aa][Bb][Ll][Aa][Ff][Ii][Aa][Zz][Qq][Bb][Tt][Aa][Gg]8[Aa][Dd][Aa][Bb][Ll][Aa][Ff][Qq][Aa][Aa][Aa][Bb][Yy][Aa][Gg][Uu][Aa][Yy][Qq][Bb][Kk][Aa].*/ OR /.*[Nn][Yy][Zz][Ww][Ff]0[Zz][Vv][Jj][Ll][Bb][Ww]90[Zz][Vv][Rr][Oo][Cc][Mm][Vv][Hh][Zz].*/ OR /.*[Qq]3[Jj][Ll][Yy][Xx][Rr][Ll][Uu][Mm][Vv][Tt][Bb]3[Rr][Ll][Vv][Gg][Hh][Yy][Zz][Ww][Ff][Kk].*/ OR /.*[Qq][Ww][Bb][Yy][Aa][Gg][Uu][Aa][Yy][Qq][Bb]0[Aa][Gg][Uu][Aa][Uu][Gg][Bb][Ll][Aa][Gg]0[Aa][Bb][Ww][Bb]0[Aa][Gg][Uu][Aa][Vv][Aa][Bb][Oo][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Hh][Aa][Gg][Qq][Aa].*/ OR /.*0[Aa][Zz][Qq][Bb][Tt][Aa][Gg]0[Aa][Bb][Ww][Bb]2[Aa][Gg][Uu][Aa].*/ OR /.*1[Ll][Bb][Ww]1[Vv][Dd][Mm].*/ OR /.*[Aa][Gg][Uu][Aa][Bb][Qq][Bb][Tt][Aa][Gg]8[Aa][Dd][Gg][Bb][Ll][Aa].*/ OR /.*[Bb][Qq][Bb][Ll][Aa][Gg]0[Aa][Bb][Qq][Bb][Vv][Aa][Hh][Yy][Aa][Zz][Qq].*/ OR /.*[Bb][Ww][Vv][Tt][Bb][Ww]92[Zz].*/ OR /.*[Zz][Ww]1[Tt][Bb]3[Zz][Ll].*/))","rule_id":"f26c6093-6f14-4b12-800f-0fcb46f5ffd0","timestamp_override":"event.ingested","references":["http://www.leeholmes.com/blog/2017/09/21/searching-for-content-in-base-64-strings/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*\\ hidden\\ * AND process.command_line:(*AGkAdABzAGEAZABtAGkAbgAgAC8AdAByAGEAbgBzAGYAZQByA* OR *aXRzYWRtaW4gL3RyYW5zZmVy* OR *IAaQB0AHMAYQBkAG0AaQBuACAALwB0AHIAYQBuAHMAZgBlAHIA* OR *JpdHNhZG1pbiAvdHJhbnNmZX* OR *YgBpAHQAcwBhAGQAbQBpAG4AIAAvAHQAcgBhAG4AcwBmAGUAcg* OR *Yml0c2FkbWluIC90cmFuc2Zlc* OR *AGMAaAB1AG4AawBfAHMAaQB6AGUA* OR *JABjAGgAdQBuAGsAXwBzAGkAegBlA* OR *JGNodW5rX3Npem* OR *QAYwBoAHUAbgBrAF8AcwBpAHoAZQ* OR *RjaHVua19zaXpl* OR *Y2h1bmtfc2l6Z* OR *AE8ALgBDAG8AbQBwAHIAZQBzAHMAaQBvAG4A* OR *kATwAuAEMAbwBtAHAAcgBlAHMAcwBpAG8Abg* OR *lPLkNvbXByZXNzaW9u* OR *SQBPAC4AQwBvAG0AcAByAGUAcwBzAGkAbwBuA* OR *SU8uQ29tcHJlc3Npb2* OR *Ty5Db21wcmVzc2lvb* OR *AE8ALgBNAGUAbQBvAHIAeQBTAHQAcgBlAGEAbQ* OR *kATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtA* OR *lPLk1lbW9yeVN0cmVhb* OR *SQBPAC4ATQBlAG0AbwByAHkAUwB0AHIAZQBhAG0A* OR *SU8uTWVtb3J5U3RyZWFt* OR *Ty5NZW1vcnlTdHJlYW* OR *4ARwBlAHQAQwBoAHUAbgBrA* OR *5HZXRDaHVua* OR *AEcAZQB0AEMAaAB1AG4Aaw* OR *LgBHAGUAdABDAGgAdQBuAGsA* OR *LkdldENodW5r* OR *R2V0Q2h1bm* OR *AEgAUgBFAEEARABfAEkATgBGAE8ANgA0A* OR *QASABSAEUAQQBEAF8ASQBOAEYATwA2ADQA* OR *RIUkVBRF9JTkZPNj* OR *SFJFQURfSU5GTzY0* OR *VABIAFIARQBBAEQAXwBJAE4ARgBPADYANA* OR *VEhSRUFEX0lORk82N* OR *AHIAZQBhAHQAZQBSAGUAbQBvAHQAZQBUAGgAcgBlAGEAZA* OR *cmVhdGVSZW1vdGVUaHJlYW* OR *MAcgBlAGEAdABlAFIAZQBtAG8AdABlAFQAaAByAGUAYQBkA* OR *NyZWF0ZVJlbW90ZVRocmVhZ* OR *Q3JlYXRlUmVtb3RlVGhyZWFk* OR *QwByAGUAYQB0AGUAUgBlAG0AbwB0AGUAVABoAHIAZQBhAGQA* OR *0AZQBtAG0AbwB2AGUA* OR *1lbW1vdm* OR *AGUAbQBtAG8AdgBlA* OR *bQBlAG0AbQBvAHYAZQ* OR *bWVtbW92Z* OR *ZW1tb3Zl*))`"}
