{"id":"4eddc365-79b4-43ff-a9d7-99422dc34b93","created_by":"Christopher Peacock @SecurePeacock, SCYTHE @scythe_io","name":"Use of Remote.exe","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Remote.exe is part of WinDbg in the Windows SDK and can be used for AWL bypass and running remote files.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Approved installs of Windows SDK with Debugging Tools for Windows (WinDbg)."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Mm][Oo][Tt][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Mm][Oo][Tt][Ee]\\.[Ee][Xx][Ee]/)","rule_id":"4eddc365-79b4-43ff-a9d7-99422dc34b93","timestamp_override":"event.ingested","references":["https://blog.thecybersecuritytutor.com/Exeuction-AWL-Bypass-Remote-exe-LOLBin/","https://lolbas-project.github.io/lolbas/OtherMSBinaries/Remote/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\remote.exe OR process.pe.original_file_name:remote.exe)`"}
