{"id":"ebef4391-1a81-4761-a40a-1db446c0e625","created_by":"Florian Roth","name":"Suspicious WMIC ActiveScriptEventConsumer Creation","tags":["attack.persistence","attack.t1546.003"],"interval":"5m","description":"Detects WMIC executions in which a event consumer gets created in order to establish persistence","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate software creating script event consumers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Aa][Cc][Tt][Ii][Vv][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ee][Vv][Ee][Nn][Tt][Cc][Oo][Nn][Ss][Uu][Mm][Ee][Rr].*/ AND process.command_line:/.*\\ [Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/)","rule_id":"ebef4391-1a81-4761-a40a-1db446c0e625","timestamp_override":"event.ingested","references":["https://twitter.com/johnlatwc/status/1408062131321270282?s=12","https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*ActiveScriptEventConsumer* AND process.command_line:*\\ CREATE\\ *)`"}
