{"id":"75bfe6e6-cd8e-429e-91d3-03921e1d7962","created_by":"Florian Roth","name":"ScreenConnect Remote Access","tags":["attack.initial_access","attack.t1133"],"interval":"5m","description":"Detects ScreenConnect program starts that establish a remote access to that system (not meeting, not remote support)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use by administrative staff"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee]\\=[Aa][Cc][Cc][Ee][Ss][Ss]\\&.*/ AND process.command_line:/.*[Yy]\\=[Gg][Uu][Ee][Ss][Tt]\\&.*/ AND process.command_line:/.*\\&[Pp]\\=.*/ AND process.command_line:/.*\\&[Cc]\\=.*/ AND process.command_line:/.*\\&[Kk]\\=.*/)","rule_id":"75bfe6e6-cd8e-429e-91d3-03921e1d7962","timestamp_override":"event.ingested","references":["https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*e\\=Access&* AND process.command_line:*y\\=Guest&* AND process.command_line:*&p\\=* AND process.command_line:*&c\\=* AND process.command_line:*&k\\=*)`"}
