{"id":"1444443e-6757-43e4-9ea4-c8fc705f79a2","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Modification of Boot Configuration","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Identifies use of the bcdedit command to delete boot configuration data. This tactic is sometimes used as by malware or an attacker as a destructive technique.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Bb][Cc][Dd][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Ee][Tt].*/) AND ((process.command_line:/.*[Bb][Oo][Oo][Tt][Ss][Tt][Aa][Tt][Uu][Ss][Pp][Oo][Ll][Ii][Cc][Yy].*/ AND process.command_line:/.*[Ii][Gg][Nn][Oo][Rr][Ee][Aa][Ll][Ll][Ff][Aa][Ii][Ll][Uu][Rr][Ee][Ss].*/) OR (process.command_line:/.*[Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ AND process.command_line:/.*[Nn][Oo].*/)))","rule_id":"1444443e-6757-43e4-9ea4-c8fc705f79a2","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md","https://eqllib.readthedocs.io/en/latest/analytics/c4732632-9c1d-4980-9fa8-1d98c93f918e.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\bcdedit.exe AND process.command_line:*set*) AND ((process.command_line:*bootstatuspolicy* AND process.command_line:*ignoreallfailures*) OR (process.command_line:*recoveryenabled* AND process.command_line:*no*)))`"}
