{"id":"814c95cc-8192-4378-a70a-f1aafd877af1","created_by":"Nasreddine Bencherchali","name":"Use of OpenConsole","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects usage of OpenConsole binary as a LOLBIN to launch other binaries to bypass application Whitelisting","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use by an administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Oo][Pp][Ee][Nn][Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Oo][Pp][Ee][Nn][Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\.[Ee][Xx][Ee]/) AND (NOT (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll].*/)))","rule_id":"814c95cc-8192-4378-a70a-f1aafd877af1","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1537563834478645252"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:OpenConsole.exe OR process.executable:*\\\\OpenConsole.exe) AND (NOT (process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal*)))`"}
