{"id":"80167ada-7a12-41ed-b8e9-aa47195c66a1","created_by":"Teymur Kheirkhabarov, Florian Roth","name":"Run Whoami as SYSTEM","tags":["attack.privilege_escalation","attack.discovery","attack.t1033"],"interval":"5m","description":"Detects a whoami.exe executed by LOCAL SYSTEM. This may be a sign of a successful local privilege escalation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible name overlap with NT AUHTORITY substring to cover all languages"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/) AND (process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/))","rule_id":"80167ada-7a12-41ed-b8e9-aa47195c66a1","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.User:(*AUTHORI* OR *AUTORI*) AND (process.pe.original_file_name:whoami.exe OR process.executable:*\\\\whoami.exe))`"}
