{"id":"fd877b94-9bb5-4191-bb25-d79cbd93c167","created_by":"Teymur Kheirkhabarov, Endgame, JHasenbusch, Daniil Yugoslavskiy, oscd.community","name":"Grabbing Sensitive Hives via Reg Utility","tags":["attack.credential_access","attack.t1003.002","attack.t1003.004","attack.t1003.005","car.2013-07-001"],"interval":"5m","description":"Dump sam, system or security hives using REG.exe utility","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Ss][Aa][Vv][Ee].*/ OR /.*[Ee][Xx][Pp][Oo][Rr][Tt].*/ OR /.*ˢ[Aa][Vv][Ee].*/ OR /.*[Ee]ˣ[Pp][Oo][Rr][Tt].*/) AND process.command_line:(/.*[Hh][Kk][Ll][Mm].*/ OR /.*[Hh][Kk]˪[Mm].*/ OR /.*[Hh][Kk][Ee][Yy]_[Ll][Oo][Cc][Aa][Ll]_[Mm][Aa][Cc][Hh][Ii][Nn][Ee].*/ OR /.*[Hh][Kk][Ee][Yy]_˪[Oo][Cc][Aa][Ll]_[Mm][Aa][Cc][Hh][Ii][Nn][Ee].*/ OR /.*[Hh][Kk][Ee][Yy]_[Ll][Oo][Cc][Aa]˪_[Mm][Aa][Cc][Hh][Ii][Nn][Ee].*/ OR /.*[Hh][Kk][Ee][Yy]_˪[Oo][Cc][Aa]˪_[Mm][Aa][Cc][Hh][Ii][Nn][Ee].*/) AND process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]/ OR /.*\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]/ OR /.*\\\\ˢ[Yy][Ss][Tt][Ee][Mm]/ OR /.*\\\\[Ss][Yy]ˢ[Tt][Ee][Mm]/ OR /.*\\\\ˢ[Yy]ˢ[Tt][Ee][Mm]/ OR /.*\\\\ˢ[Aa][Mm]/ OR /.*\\\\ˢ[Ee][Cc][Uu][Rr][Ii][Tt][Yy]/))","rule_id":"fd877b94-9bb5-4191-bb25-d79cbd93c167","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md","https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:(*save* OR *export* OR *ˢave* OR *eˣport*) AND process.command_line:(*hklm* OR *hk˪m* OR *hkey_local_machine* OR *hkey_˪ocal_machine* OR *hkey_loca˪_machine* OR *hkey_˪oca˪_machine*) AND process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security OR *\\\\ˢystem OR *\\\\syˢtem OR *\\\\ˢyˢtem OR *\\\\ˢam OR *\\\\ˢecurity))`"}
