{"id":"73fcad2e-ff14-4c38-b11d-4172c8ac86c7","created_by":"frack113","name":"Suspicious Rundll32 Script in CommandLine","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects suspicious process related to rundll32 based on arguments","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Mm][Ss][Hh][Tt][Mm][Ll],[Rr][Uu][Nn][Hh][Tt][Mm][Ll][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/ AND process.command_line:(/.*[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt]\\:.*/ OR /.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\:.*/))","rule_id":"73fcad2e-ff14-4c38-b11d-4172c8ac86c7","timestamp_override":"event.ingested","references":["https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.011/T1218.011.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32* AND process.command_line:*mshtml,RunHTMLApplication* AND process.command_line:(*javascript\\:* OR *vbscript\\:*))`"}
