{"id":"d7662ff6-9e97-4596-a61d-9839e32dee8d","created_by":"Nasreddine Bencherchali","name":"Add SafeBoot Keys Via Reg Utility","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects execution of \"reg.exe\" commands with the \"add\" or \"copy\" flags on safe boot registry keys. Often used by attacker to allow the ransomware to work in safe mode as some security products do not","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt].*/ AND process.command_line:(/.*\\ [Cc][Oo][Pp][Yy]\\ .*/ OR /.*\\ [Aa][Dd][Dd]\\ .*/))","rule_id":"d7662ff6-9e97-4596-a61d-9839e32dee8d","timestamp_override":"event.ingested","references":["https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*reg.exe OR process.pe.original_file_name:reg.exe) AND process.command_line:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot* AND process.command_line:(*\\ copy\\ * OR *\\ add\\ *))`"}
