{"id":"32410e29-5f94-4568-b6a3-d91a8adad863","created_by":"frack113","name":"Fast Reverse Proxy (FRP)","tags":["attack.command_and_control","attack.t1090"],"interval":"5m","description":"Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to help you expose a local server behind a NAT or firewall to the Internet.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ff][Rr][Pp][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Rr][Pp][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\\\[Ff][Rr][Pp][Cc]\\.[Ii][Nn][Ii].*/)","rule_id":"32410e29-5f94-4568-b6a3-d91a8adad863","timestamp_override":"event.ingested","references":["https://asec.ahnlab.com/en/38156/","https://github.com/fatedier/frp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\frpc.exe OR *\\\\frps.exe) AND process.command_line:*\\\\frpc.ini*)`"}
