{"id":"fb0b815b-f5f6-4f50-970f-ffe21f253f7a","created_by":"frack113","name":"Suspicious Extexport Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Extexport.exe loads dll and is execute from other folder the original path","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee][Xx][Tt][Ee][Xx][Pp][Oo][Rr][Tt]\\.[Ee][Xx][Ee].*/ OR process.executable:/.*\\\\[Ee][Xx][Tt][Ee][Xx][Pp][Oo][Rr][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ee][Xx][Tt][Ee][Xx][Pp][Oo][Rr][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"fb0b815b-f5f6-4f50-970f-ffe21f253f7a","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Extexport/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Extexport.exe* OR process.executable:*\\\\Extexport.exe OR process.pe.original_file_name:extexport.exe)`"}
