{"id":"349d891d-fef0-4fe4-bc53-eee623a15969","created_by":"frack113, Nasreddine Bencherchali","name":"Use Short Name Path in Command Line","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\~1\\\\.*/ OR /.*\\~2\\\\.*/) AND (NOT (process.parent.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ll][Ee][Aa][Nn][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/) OR process.parent.executable:(/.*\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ee][Aa][Mm]\\.[Bb][Aa][Cc][Kk][Uu][Pp]\\.[Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/))))","rule_id":"349d891d-fef0-4fe4-bc53-eee623a15969","timestamp_override":"event.ingested","references":["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN","https://twitter.com/frack113/status/1555830623633375232"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\~1\\\\* OR *\\~2\\\\*) AND (NOT (process.parent.executable:(C\\:\\\\Windows\\\\System32\\\\Dism.exe OR C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe) OR process.parent.executable:(*\\\\WebEx\\\\WebexHost.exe OR *\\\\thor\\\\thor64.exe OR *\\\\veam.backup.shell.exe))))`"}
