{"id":"d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e","created_by":"Florian Roth","name":"Sysprep on AppData Folder","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects suspicious sysprep process start with AppData folder as target (as used by Trojan Syndicasec in Thrip report by Symantec)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Yy][Ss][Pp][Rr][Ee][Pp]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/)","rule_id":"d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e","timestamp_override":"event.ingested","references":["https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets","https://app.any.run/tasks/61a296bb-81ad-4fee-955f-3b399f4aaf4b"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\sysprep.exe AND process.command_line:*\\\\AppData\\\\*)`"}
