{"id":"17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8","created_by":"Nasreddine Bencherchali","name":"Suspicious New Service Creation","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects creation of a new service via \"sc\" command or the powershell \"new-service\" cmdlet with suspicious binary paths","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*[Bb][Ii][Nn][Pp][Aa][Tt][Hh]\\=.*/) OR (process.command_line:/.*[Nn][Ee][Ww]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ AND process.command_line:/.*\\-[Bb][Ii][Nn][Aa][Rr][Yy][Pp][Aa][Tt][Hh][Nn][Aa][Mm][Ee].*/)) AND process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Ss][Vv][Cc][Hh][Oo][Ss][Tt].*/ OR /.*[Dd][Ll][Ll][Hh][Oo][Ss][Tt].*/ OR /.*[Cc][Mm][Dd]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc].*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk].*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc].*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/))","rule_id":"17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md","https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\sc.exe AND process.command_line:*create* AND process.command_line:*binPath\\=*) OR (process.command_line:*New\\-Service* AND process.command_line:*\\-BinaryPathName*)) AND process.command_line:(*powershell* OR *mshta* OR *wscript* OR *cscript* OR *svchost* OR *dllhost* OR *cmd\\ * OR *cmd.exe\\ \\/c* OR *cmd.exe\\ \\/k* OR *rundll32* OR *C\\:\\\\Users\\\\Public* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*))`"}
