{"id":"99793437-3e16-439b-be0f-078782cf953d","created_by":"Daniil Yugoslavskiy, Ian Davis, oscd.community","name":"Tap Installer Execution","tags":["attack.exfiltration","attack.t1048"],"interval":"5m","description":"Well-known TAP software installation. Possible preparation for data exfiltration using tunneling techniques","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate OpenVPN TAP insntallation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Tt][Aa][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Ee][Xx][Ee]/ AND (NOT ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ss][Ee][Cc][Uu][Rr][Ee][Ll][Ii][Nn][Ee]\\ [Vv][Pp][Nn]\\\\[Tt][Aa][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ss][Ee][Cc][Uu][Rr][Ee][Ll][Ii][Nn][Ee]\\ [Vv][Pp][Nn]\\\\[Tt][Aa][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Ee][Xx][Ee]/)))))","rule_id":"99793437-3e16-439b-be0f-078782cf953d","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\tapinstall.exe AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\Avast\\ Software\\\\SecureLine\\ VPN\\\\tapinstall.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\SecureLine\\ VPN\\\\tapinstall.exe)))))`"}
