{"id":"63332011-f057-496c-ad8d-d2b6afb27f96","created_by":"frack113","name":"Suspicious Tasklist Discovery Command","tags":["attack.discovery","attack.t1057"],"interval":"5m","description":"Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator, hotline ask to user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt].*/ OR process.executable:/.*\\\\[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"63332011-f057-496c-ad8d-d2b6afb27f96","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1057/T1057.md#atomic-test-2---process-discovery---tasklist"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*tasklist* OR process.executable:*\\\\tasklist.exe OR process.pe.original_file_name:tasklist.exe)`"}
