{"id":"395907ee-96e5-4666-af2e-2ca91688e151","created_by":"Nasreddine Bencherchali","name":"Wab Execution From Non Default Location","tags":["attack.defense_evasion","attack.execution"],"interval":"5m","description":"Detects execution of wab.exe (Windows Contacts) from non default locations as seen with bumblebee activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Aa][Bb]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Mm][Aa][Ii][Ll]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Mm][Aa][Ii][Ll]\\\\.*/))))","rule_id":"395907ee-96e5-4666-af2e-2ca91688e151","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wab.exe AND (NOT (process.executable:(C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Program\\ Files\\\\Windows\\ Mail\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Windows\\ Mail\\\\*))))`"}
