{"id":"2afafd61-6aae-4df4-baed-139fa1f4c345","created_by":"Thomas Patzke","name":"Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)","tags":["attack.credential_access","attack.t1003.003"],"interval":"5m","description":"Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["NTDS maintenance"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Nn][Tt][Dd][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/","rule_id":"2afafd61-6aae-4df4-baed-139fa1f4c345","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\ntdsutil.exe`"}
