{"id":"6b369ced-4b1d-48f1-b427-fdc0de0790bd","created_by":"frack113","name":"Suspicious Diantz Alternate Data Stream Execution","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Compress target file into a cab file stored in the Alternate Data Stream (ADS) of the target file.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Very Possible"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Dd][Ii][Aa][Nn][Tt][Zz]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Cc][Aa][Bb].*/ AND process.command_line:/:[^\\\\\\\\]/)","rule_id":"6b369ced-4b1d-48f1-b427-fdc0de0790bd","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Diantz/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*diantz.exe* AND process.command_line:*.cab* AND process.command_line:/:[^\\\\\\\\]/)`"}
