{"id":"4ae81040-fc1c-4249-bfa3-938d260214d9","created_by":"frack113","name":"Use Icacls to Hide File to Everyone","tags":["attack.defense_evasion","attack.t1564.001"],"interval":"5m","description":"Detect use of icacls to deny access for everyone in Users folder sometimes used to hide malicious files","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Ii][Cc][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ii][Cc][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\/[Dd][Ee][Nn][Yy].*/ AND process.command_line:/.*[Ss]\\-1\\-1\\-0\\:.*/))","rule_id":"4ae81040-fc1c-4249-bfa3-938d260214d9","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/1df999e6-1cb8-45e3-8b61-499d1b7d5a9b/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:iCACLS.EXE OR process.executable:*\\\\icacls.exe) AND (process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\/deny* AND process.command_line:*S\\-1\\-1\\-0\\:*))`"}
