{"id":"65d2be45-8600-4042-b4c0-577a1ff8a60e","created_by":"Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community","name":"Application Whitelisting Bypass via DLL Loaded by odbcconf.exe","tags":["attack.defense_evasion","attack.t1218.008"],"interval":"5m","description":"Detects defence evasion attempt via odbcconf.exe execution to load DLL","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of odbcconf.exe by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Oo][Dd][Bb][Cc][Cc][Oo][Nn][Ff]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\-[Ff].*/ OR /.*[Rr][Ee][Gg][Ss][Vv][Rr].*/)) OR (process.parent.executable:/.*\\\\[Oo][Dd][Bb][Cc][Cc][Oo][Nn][Ff]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/))","rule_id":"65d2be45-8600-4042-b4c0-577a1ff8a60e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/","https://twitter.com/Hexacorn/status/1187143326673330176","https://redcanary.com/blog/raspberry-robin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\odbcconf.exe AND process.command_line:(*\\-f* OR *regsvr*)) OR (process.parent.executable:*\\\\odbcconf.exe AND process.executable:*\\\\rundll32.exe))`"}
