{"id":"0c79148b-118e-472b-bdb7-9b57b444cc19","created_by":"Beyu Denis, oscd.community","name":"Malicious Payload Download via Office Binaries","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Downloads payload from remote server","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/)","rule_id":"0c79148b-118e-472b-bdb7-9b57b444cc19","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Powerpnt/","https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191","Reegun J (OCBC Bank)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powerpnt.exe OR *\\\\winword.exe OR *\\\\excel.exe) AND process.command_line:*http*)`"}
