{"id":"4f6c43e2-f989-4ea5-bcd8-843b49a0317c","created_by":"Christian Burkard","name":"UAC Bypass Using WOW64 Logger DLL Hijack","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using a WoW64 logger DLL hijack (UACMe 30)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1[Ff][Ff][Ff][Ff][Ff]/ AND winlog.event_data.CallTrace:/[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\(0000000000000000\\)|[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\(0000000000000000\\)|.*/)","rule_id":"4f6c43e2-f989-4ea5-bcd8-843b49a0317c","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\:\\\\Windows\\\\SysWOW64\\\\* AND winlog.event_data.GrantedAccess:0x1fffff AND winlog.event_data.CallTrace:UNKNOWN\\(0000000000000000\\)|UNKNOWN\\(0000000000000000\\)|*)`"}
