{"id":"9bd012ee-0dff-44d7-84a0-aa698cfd87a3","created_by":"Florian Roth","name":"LSASS Memory Access by Tool Named Dump","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects a possible process memory dump based on a keyword in the file name of the accessing process","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare programs that contain the word dump in their name and access lsass"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Dd][Uu][Mm][Pp].*/ AND winlog.event_data.GrantedAccess:(/.*10/ OR /.*30/ OR /.*50/ OR /.*70/ OR /.*90/ OR /.*[Bb]0/ OR /.*[Dd]0/ OR /.*[Ff]0/ OR /.*18/ OR /.*38/ OR /.*58/ OR /.*78/ OR /.*98/ OR /.*[Bb]8/ OR /.*[Dd]8/ OR /.*[Ff]8/ OR /.*1[Aa]/ OR /.*3[Aa]/ OR /.*5[Aa]/ OR /.*7[Aa]/ OR /.*9[Aa]/ OR /.*[Bb][Aa]/ OR /.*[Dd][Aa]/ OR /.*[Ff][Aa]/ OR /.*0[Xx]14[Cc]2/ OR /.*[Ff][Ff]/))","rule_id":"9bd012ee-0dff-44d7-84a0-aa698cfd87a3","timestamp_override":"event.ingested","references":["https://twitter.com/_xpn_/status/1491557187168178176","https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:*dump* AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF))`"}
