{"id":"6bba49bf-7f8c-47d6-a1bb-6b4dece4640e","created_by":"juju4","name":"Suspicious RASdial Activity","tags":["attack.defense_evasion","attack.execution","attack.t1059"],"interval":"5m","description":"Detects suspicious process related to rasdial.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*[Rr][Aa][Ss][Dd][Ii][Aa][Ll]\\.[Ee][Xx][Ee]/","rule_id":"6bba49bf-7f8c-47d6-a1bb-6b4dece4640e","timestamp_override":"event.ingested","references":["https://twitter.com/subTee/status/891298217907830785"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*rasdial.exe`"}
