{"id":"40b95d31-1afc-469e-8d34-9a3a667d058e","created_by":"Konstantin Grishchenko, oscd.community","name":"Suspicious Csi.exe Usage","tags":["attack.execution","attack.t1072","attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Csi.exe is a signed binary from Microsoft that comes with Visual Studio and provides C# interactive capabilities. It can be used to run C# code from a file passed as a parameter in command line. Early version of this utility provided with Microsoft “Roslyn” Community Technology Preview was named 'rcsi.exe'","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage by software developers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Cc][Ss][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Cc][Ss][Ii]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Cc][Ss][Ii]\\.[Ee][Xx][Ee]/ OR /[Rr][Cc][Ss][Ii]\\.[Ee][Xx][Ee]/)) AND process.pe.company:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Cc][Oo][Rr][Pp][Oo][Rr][Aa][Tt][Ii][Oo][Nn]/)","rule_id":"40b95d31-1afc-469e-8d34-9a3a667d058e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/","https://lolbas-project.github.io/lolbas/OtherMSBinaries/Rcsi/","https://enigma0x3.net/2016/11/21/bypassing-application-whitelisting-by-using-rcsi-exe/","https://twitter.com/Z3Jpa29z/status/1317545798981324801"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\csi.exe OR *\\\\rcsi.exe) OR process.pe.original_file_name:(csi.exe OR rcsi.exe)) AND process.pe.company:Microsoft\\ Corporation)`"}
