{"id":"0d34ed8b-1c12-4ff2-828c-16fc860b766d","created_by":"Andreas Hunkeler (@Karneades), Florian Roth","name":"Suspicious Shells Spawned by Java","tags":["attack.initial_access","attack.persistence","attack.privilege_escalation"],"interval":"5m","description":"Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate calls to system binaries","Company specific internal usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ff][Tt][Rr][Aa][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Vv][Ll][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/))","rule_id":"0d34ed8b-1c12-4ff2-828c-16fc860b766d","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\java.exe AND process.executable:(*\\\\sh.exe OR *\\\\bash.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\whoami.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\curl.exe))`"}
