{"id":"06b401f4-107c-4ff9-947f-9ec1e7649f1e","created_by":"Victor Sergeev, oscd.community","name":"Suspicious ftp.exe","tags":["attack.execution","attack.t1059","attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects renamed ftp.exe, ftp.exe script execution and child processes ran by ftp.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ss]\\:.*/) OR (process.pe.original_file_name:/[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ss]\\:.*/)) OR (process.pe.original_file_name:/[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/))) OR process.parent.executable:/.*[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/)","rule_id":"06b401f4-107c-4ff9-947f-9ec1e7649f1e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Ftp/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*ftp.exe AND process.command_line:*\\-s\\:*) OR (process.pe.original_file_name:ftp.exe AND process.command_line:*\\-s\\:*)) OR (process.pe.original_file_name:ftp.exe AND (NOT (process.executable:*ftp.exe))) OR process.parent.executable:*ftp.exe)`"}
