{"id":"4ede543c-e098-43d9-a28f-dd784a13132f","created_by":"Florian Roth, Tigzy","name":"Winrar Execution in Non-Standard Folder","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"Detects a suspicious winrar execution in a folder which is not the default installation folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of WinRAR in a folder of a software that bundles WinRAR"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Rr][Aa][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Aa][Rr]\\.[Ee][Xx][Ee]/) OR process.pe.description:/[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Ll][Ii][Nn][Ee]\\ [Rr][Aa][Rr]/) AND (NOT (process.executable:(/.*\\\\[Ww][Ii][Nn][Rr][Aa][Rr].*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Uu][Nn][Rr][Aa][Rr]\\.[Ee][Xx][Ee].*/))))","rule_id":"4ede543c-e098-43d9-a28f-dd784a13132f","timestamp_override":"event.ingested","references":["https://twitter.com/cyb3rops/status/1460978167628406785"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\rar.exe OR *\\\\winrar.exe) OR process.pe.description:Command\\ line\\ RAR) AND (NOT (process.executable:(*\\\\WinRAR* OR *C\\:\\\\Windows\\\\Temp* OR *\\\\UnRAR.exe*))))`"}
