{"id":"207b0396-3689-42d9-8399-4222658efc99","created_by":"Florian Roth","name":"PsExec/PAExec Flags","tags":["attack.develop_capabilities","attack.t1587.001"],"interval":"5m","description":"Detects suspicious flags used by PsExec and PAExec but no usual program name in command line","risk_score":73,"enabled":true,"severity":"high","false_positives":["Weird admins that rename their tools","Software companies that bundle PsExec/PAExec with their software and rename it, so that it is less embarrassing"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:(/.*\\ \\-[Ss]\\ [Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\ \\-[Ss]\\ \\-[Ii]\\ [Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa].*/ AND process.command_line:/.*\\ \\-[Uu]\\ .*/ AND process.command_line:/.*\\ \\-[Pp]\\ .*/ AND process.command_line:/.*\\ \\\\\\*/)) AND (NOT (process.command_line:(/.*[Pp][Aa][Ee][Xx][Ee][Cc].*/ OR /.*[Pp][Ss][Ee][Xx][Ee][Cc].*/))))","rule_id":"207b0396-3689-42d9-8399-4222658efc99","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec","https://www.poweradmin.com/paexec/","https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:(*\\ \\-s\\ cmd.exe OR *\\ \\-s\\ \\-i\\ cmd.exe) OR (process.command_line:*accepteula* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\\\\\*)) AND (NOT (process.command_line:(*paexec* OR *PsExec*))))`"}
