{"id":"9a132afa-654e-11eb-ae93-0242ac130002","created_by":"Janantha Marasinghe (https://github.com/blueteam0ps), FPT.EagleEye Team, omkar72, oscd.community","name":"AdFind Usage Detection","tags":["attack.discovery","attack.t1018","attack.t1087.002","attack.t1482","attack.t1069.002"],"interval":"5m","description":"AdFind continues to be seen across majority of breaches. It is used to domain trust discovery to plan out subsequent steps in the attack chain.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate admin activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Dd][Oo][Mm][Aa][Ii][Nn][Ll][Ii][Ss][Tt].*/ OR /.*[Tt][Rr][Uu][Ss][Tt][Dd][Mm][Pp].*/ OR /.*[Dd][Cc][Mm][Oo][Dd][Ee][Ss].*/ OR /.*[Aa][Dd][Ii][Nn][Ff][Oo].*/ OR /.*\\ [Dd][Cc][Ll][Ii][Ss][Tt]\\ .*/ OR /.*[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]_[Pp][Ww][Dd][Nn][Oo][Tt][Rr][Ee][Qq][Dd].*/ OR /.*[Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=.*/ OR /.*\\-[Ss][Uu][Bb][Nn][Ee][Tt][Ss]\\ \\-[Ff].*/ OR /.*[Nn][Aa][Mm][Ee]\\=\\\"[Dd][Oo][Mm][Aa][Ii][Nn]\\ [Aa][Dd][Mm][Ii][Nn][Ss]\\\".*/ OR /.*\\-[Ss][Cc]\\ [Uu]\\:.*/ OR /.*[Dd][Oo][Mm][Aa][Ii][Nn][Nn][Cc][Ss].*/ OR /.*[Dd][Oo][Mm][Pp][Oo][Ll].*/ OR /.*\\ [Oo][Uu][Dd][Mm][Pp]\\ .*/ OR /.*[Ss][Uu][Bb][Nn][Ee][Tt][Dd][Mm][Pp].*/ OR /.*[Gg][Pp][Oo][Dd][Mm][Pp].*/ OR /.*[Ff][Ss][Pp][Dd][Mm][Pp].*/ OR /.*[Uu][Ss][Ee][Rr][Ss]_[Nn][Oo][Ee][Xx][Pp][Ii][Rr][Ee].*/ OR /.*[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss]_[Aa][Cc][Tt][Ii][Vv][Ee].*/ OR /.*[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Ss]_[Pp][Ww][Dd][Nn][Oo][Tt][Rr][Ee][Qq][Dd].*/)","rule_id":"9a132afa-654e-11eb-ae93-0242ac130002","timestamp_override":"event.ingested","references":["https://www.joeware.net/freetools/tools/adfind/","https://thedfirreport.com/2020/05/08/adfind-recon/","https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/","https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/","https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx","https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*domainlist* OR *trustdmp* OR *dcmodes* OR *adinfo* OR *\\ dclist\\ * OR *computer_pwdnotreqd* OR *objectcategory\\=* OR *\\-subnets\\ \\-f* OR *name\\=\\\"Domain\\ Admins\\\"* OR *\\-sc\\ u\\:* OR *domainncs* OR *dompol* OR *\\ oudmp\\ * OR *subnetdmp* OR *gpodmp* OR *fspdmp* OR *users_noexpire* OR *computers_active* OR *computers_pwdnotreqd*)`"}
