{"id":"7aa7009a-28b9-4344-8c1f-159489a390df","created_by":"Florian Roth","name":"Windows Credential Editor","tags":["attack.credential_access","attack.t1003.001","attack.s0005"],"interval":"5m","description":"Detects the use of Windows Credential Editor (WCE)","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Another service that uses a single -s command line switch"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.pe.imphash:(/[Aa]53[Aa]02[Bb]997935[Ff][Dd]8[Ee][Ee][Dd][Cc][Bb]5[Ff]7[Aa][Bb][Aa][Bb]9[Bb]9[Ff]/ OR /[Ee]96[Aa]73[Cc]7[Bb][Ff]33[Aa]464[Cc]510[Ee][Dd][Ee]582318[Bb][Ff]2/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Aa]53[Aa]02[Bb]997935[Ff][Dd]8[Ee][Ee][Dd][Cc][Bb]5[Ff]7[Aa][Bb][Aa][Bb]9[Bb]9[Ff].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ee]96[Aa]73[Cc]7[Bb][Ff]33[Aa]464[Cc]510[Ee][Dd][Ee]582318[Bb][Ff]2.*/)) OR (process.command_line:/.*\\.[Ee][Xx][Ee]\\ \\-[Ss]/ AND process.parent.executable:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/)) AND (NOT (process.executable:/.*\\\\[Cc][Ll][Uu][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/)))","rule_id":"7aa7009a-28b9-4344-8c1f-159489a390df","timestamp_override":"event.ingested","references":["https://www.ampliasecurity.com/research/windows-credentials-editor/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.pe.imphash:(a53a02b997935fd8eedcb5f7abab9b9f OR e96a73c7bf33a464c510ede582318bf2) OR related.hash:(*IMPHASH\\=a53a02b997935fd8eedcb5f7abab9b9f* OR *IMPHASH\\=e96a73c7bf33a464c510ede582318bf2*)) OR (process.command_line:*.exe\\ \\-S AND process.parent.executable:*\\\\services.exe)) AND (NOT (process.executable:*\\\\clussvc.exe)))`"}
