{"id":"dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795","created_by":"frack113, Nasreddine Bencherchali","name":"Use NTFS Short Name in Command Line","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\~1\\.[Ee][Xx][Ee].*/ OR /.*\\~1\\.[Bb][Aa][Tt].*/ OR /.*\\~1\\.[Mm][Ss][Ii].*/ OR /.*\\~1\\.[Vv][Bb][Ee].*/ OR /.*\\~1\\.[Vv][Bb][Ss].*/ OR /.*\\~1\\.[Dd][Ll][Ll].*/ OR /.*\\~1\\.[Pp][Ss]1.*/ OR /.*\\~1\\.[Jj][Ss].*/ OR /.*\\~1\\.[Hh][Tt][Aa].*/ OR /.*\\~2\\.[Ee][Xx][Ee].*/ OR /.*\\~2\\.[Bb][Aa][Tt].*/ OR /.*\\~2\\.[Mm][Ss][Ii].*/ OR /.*\\~2\\.[Vv][Bb][Ee].*/ OR /.*\\~2\\.[Vv][Bb][Ss].*/ OR /.*\\~2\\.[Dd][Ll][Ll].*/ OR /.*\\~2\\.[Pp][Ss]1.*/ OR /.*\\~2\\.[Jj][Ss].*/ OR /.*\\~2\\.[Hh][Tt][Aa].*/) AND (NOT (process.parent.executable:(/.*\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/))))","rule_id":"dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795","timestamp_override":"event.ingested","references":["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN","https://twitter.com/jonasLyk/status/1555914501802921984"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\~1.exe* OR *\\~1.bat* OR *\\~1.msi* OR *\\~1.vbe* OR *\\~1.vbs* OR *\\~1.dll* OR *\\~1.ps1* OR *\\~1.js* OR *\\~1.hta* OR *\\~2.exe* OR *\\~2.bat* OR *\\~2.msi* OR *\\~2.vbe* OR *\\~2.vbs* OR *\\~2.dll* OR *\\~2.ps1* OR *\\~2.js* OR *\\~2.hta*) AND (NOT (process.parent.executable:(*\\\\WebEx\\\\WebexHost.exe OR *\\\\thor\\\\thor64.exe))))`"}
