{"id":"03cc0c25-389f-4bf8-b48d-11878079f1ca","created_by":"Michael Haag","name":"MSHTA Spawning Windows Shell","tags":["attack.defense_evasion","attack.t1218.005","car.2013-02-003","car.2013-03-001","car.2014-04-003"],"interval":"5m","description":"Detects a Windows command line executable started from MSHTA","risk_score":73,"enabled":true,"severity":"high","false_positives":["Printer software / driver installations","HP software"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ AND (process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/) OR process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/))","rule_id":"03cc0c25-389f-4bf8-b48d-11878079f1ca","timestamp_override":"event.ingested","references":["https://www.trustedsec.com/july-2015/malicious-htas/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\mshta.exe AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\reg.exe OR *\\\\regsvr32.exe) OR process.executable:*\\\\BITSADMIN*))`"}
