{"id":"0955e4e1-c281-4fb9-9ee1-5ee7b4b754d2","created_by":"Nasreddine Bencherchali","name":"Use of Pcalua For Execution","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Execute commands and binaries from the context of The program compatibility assistant (Pcalua.exe). This is used as a LOLBIN for example to bypass application whitelisting.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use by a via a batch script or by an administrator."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Cc][Aa][Ll][Uu][Aa]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Aa].*/)","rule_id":"0955e4e1-c281-4fb9-9ee1-5ee7b4b754d2","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Pcalua/","https://pentestlab.blog/2020/07/06/indirect-command-execution/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\pcalua.exe AND process.command_line:*\\ \\-a*)`"}
