{"id":"17769c90-230e-488b-a463-e05c08e9d48f","created_by":"Florian Roth","name":"Powershell Defender Exclusion","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects requests to exclude files, folders or processes from Antivirus scanning using PowerShell cmdlets","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Possible Admin Activity","Other Cmdlets that may use the same parameters"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Aa][Dd][Dd]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee]\\ .*/ OR /.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee]\\ .*/) AND process.command_line:(/.*\\ \\-[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Pp][Aa][Tt][Hh]\\ .*/ OR /.*\\ \\-[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn]\\ .*/ OR /.*\\ \\-[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ .*/ OR /.*\\ \\-[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ii][Pp][Aa][Dd][Dd][Rr][Ee][Ss][Ss]\\ .*/))","rule_id":"17769c90-230e-488b-a463-e05c08e9d48f","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://twitter.com/AdamTheAnalyst/status/1483497517119590403"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*Add\\-MpPreference\\ * OR *Set\\-MpPreference\\ *) AND process.command_line:(*\\ \\-ExclusionPath\\ * OR *\\ \\-ExclusionExtension\\ * OR *\\ \\-ExclusionProcess\\ * OR *\\ \\-ExclusionIpAddress\\ *))`"}
