{"id":"cd3d1298-eb3b-476c-ac67-12847de55813","created_by":"Julia Fomina, oscd.community","name":"DLL Execution via Rasautou.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects using Rasautou.exe for loading arbitrary .DLL specified in -d option and executes the export specified in -p.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Aa][Ss][Aa][Uu][Tt][Oo][Uu]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Aa][Ss][Dd][Ll][Uu][Ii]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\-[Dd]\\ .*/ AND process.command_line:/.*\\ \\-[Pp]\\ .*/))","rule_id":"cd3d1298-eb3b-476c-ac67-12847de55813","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Rasautou/","https://github.com/fireeye/DueDLLigence","https://www.fireeye.com/blog/threat-research/2019/10/staying-hidden-on-the-endpoint-evading-detection-with-shellcode.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rasautou.exe OR process.pe.original_file_name:rasdlui.exe) AND (process.command_line:*\\ \\-d\\ * AND process.command_line:*\\ \\-p\\ *))`"}
