{"id":"8a4519e8-e64a-40b6-ae85-ba8ad2177559","created_by":"Max Altgelt","name":"Process Creation with Renamed BrowserCore.exe","tags":["attack.t1528","attack.t1036.003"],"interval":"5m","description":"Detects process creation with a renamed BrowserCore.exe (used to extract Azure tokens)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Bb][Rr][Oo][Ww][Ss][Ee][Rr][Cc][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ AND (NOT ((process.executable:/.*\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr][Cc][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/))))","rule_id":"8a4519e8-e64a-40b6-ae85-ba8ad2177559","timestamp_override":"event.ingested","references":["https://twitter.com/mariuszbit/status/1531631015139102720"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:BrowserCore.exe AND (NOT ((process.executable:*\\\\BrowserCore.exe))))`"}
