{"id":"e507feb7-5f73-4ef6-a970-91bb6f6d744f","created_by":"Florian Roth","name":"Elise Backdoor","tags":["attack.g0030","attack.g0050","attack.s0081","attack.execution","attack.t1059.003"],"interval":"5m","description":"Detects Elise backdoor acitivty as used by APT32","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Aa][Cc][Hh][Ee][Ss]\\\\[Nn][Aa][Vv][Ss][Hh][Ee][Xx][Tt]\\.[Dd][Ll][Ll]\\ .*/) OR process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Mm][Ii][Cc][Rr][Oo][Ss]\\~1\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Aa][Cc][Hh][Ee][Ss]\\\\[Nn][Aa][Vv][Ss][Hh][Ee][Xx][Tt]\\.[Dd][Ll][Ll],[Ss][Ee][Tt][Tt][Ii][Nn][Gg]/)","rule_id":"e507feb7-5f73-4ef6-a970-91bb6f6d744f","timestamp_override":"event.ingested","references":["https://community.rsa.com/community/products/netwitness/blog/2018/02/13/lotus-blossom-continues-asean-targeting"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:C\\:\\\\Windows\\\\SysWOW64\\\\cmd.exe AND process.command_line:*\\\\Windows\\\\Caches\\\\NavShExt.dll\\ *) OR process.command_line:*\\\\AppData\\\\Roaming\\\\MICROS\\~1\\\\Windows\\\\Caches\\\\NavShExt.dll,Setting)`"}
