{"id":"2a072a96-a086-49fa-bcb5-15cc5a619093","created_by":"Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community","name":"Service Execution","tags":["attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects manual service execution (start) via system utilities.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrator or user executes a service for legitimate reasons."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ [Ss][Tt][Aa][Rr][Tt]\\ .*/)","rule_id":"2a072a96-a086-49fa-bcb5-15cc5a619093","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1569.002/T1569.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*\\ start\\ *)`"}
