{"id":"15b75071-74cc-47e0-b4c6-b43744a62a2b","created_by":"juju4, Jonhnathan Ribeiro, oscd.community","name":"Suspicious Process Start Locations","tags":["attack.defense_evasion","attack.t1036","car.2013-05-002"],"interval":"5m","description":"Detects suspicious process run from unusual locations","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\:\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr]\\\\.*/ OR /.*\\:\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Vv][Oo][Ll][Uu][Mm][Ee][Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn]\\\\.*/) OR process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Ee][Bb][Uu][Gg]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Oo][Nn][Tt][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Hh][Ee][Ll][Pp]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Ss][Oo][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/))","rule_id":"15b75071-74cc-47e0-b4c6-b43744a62a2b","timestamp_override":"event.ingested","references":["https://car.mitre.org/wiki/CAR-2013-05-002"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\:\\\\RECYCLER\\\\* OR *\\:\\\\SystemVolumeInformation\\\\*) OR process.executable:(C\\:\\\\Windows\\\\Tasks\\\\* OR C\\:\\\\Windows\\\\debug\\\\* OR C\\:\\\\Windows\\\\fonts\\\\* OR C\\:\\\\Windows\\\\help\\\\* OR C\\:\\\\Windows\\\\drivers\\\\* OR C\\:\\\\Windows\\\\addins\\\\* OR C\\:\\\\Windows\\\\cursors\\\\* OR C\\:\\\\Windows\\\\system32\\\\tasks\\\\*))`"}
