{"id":"b2ddd389-f676-4ac4-845a-e00781a48e5f","created_by":"Anton Kutepov, oscd.community","name":"Using SettingSyncHost.exe as LOLBin","tags":["attack.execution","attack.defense_evasion","attack.t1574.008"],"interval":"5m","description":"Detects using SettingSyncHost.exe to run hijacked binary","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))) AND (process.parent.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc].*/ AND process.parent.command_line:/.*[Rr][Oo][Aa][Mm][Dd][Ii][Aa][Gg]\\.[Cc][Mm][Dd].*/ AND process.parent.command_line:/.*\\-[Oo][Uu][Tt][Pp][Uu][Tt][Pp][Aa][Tt][Hh].*/))","rule_id":"b2ddd389-f676-4ac4-845a-e00781a48e5f","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2020/02/02/settingsynchost-exe-as-a-lolbin"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))) AND (process.parent.command_line:*cmd.exe\\ \\/c* AND process.parent.command_line:*RoamDiag.cmd* AND process.parent.command_line:*\\-outputpath*))`"}
