{"id":"d08a2711-ee8b-4323-bdec-b7d85e892b31","created_by":"Florian Roth","name":"CsExec Remote Execution Tool Usage","tags":["attack.develop_capabilities","attack.t1587.001","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects the use of the lesser known remote execution tool named CsExec (a PsExec alternative)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Cc][Ss][Ee][Xx][Ee][Cc]/)","rule_id":"d08a2711-ee8b-4323-bdec-b7d85e892b31","timestamp_override":"event.ingested","references":["https://github.com/malcomvetter/CSExec","https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\csexec.exe OR process.pe.description:csexec)`"}
