{"id":"ae9c6a7c-9521-42a6-915e-5aaa8689d529","created_by":"Wojciech Lesicki","name":"CobaltStrike Load by Rundll32","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Rundll32 can be use by Cobalt Strike with StartW function to load DLLs from the command line.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/ AND process.command_line:(/.*\\ [Ss][Tt][Aa][Rr][Tt][Ww]/ OR /.*,[Ss][Tt][Aa][Rr][Tt][Ww]/))","rule_id":"ae9c6a7c-9521-42a6-915e-5aaa8689d529","timestamp_override":"event.ingested","references":["https://www.cobaltstrike.com/help-windows-executable","https://redcanary.com/threat-detection-report/","https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32.exe* AND process.command_line:*.dll* AND process.command_line:(*\\ StartW OR *,StartW))`"}
