{"id":"b66474aa-bd92-4333-a16c-298155b120df","created_by":"pH-T, Florian Roth","name":"Suspicious Powershell No File or Command","tags":["attack.execution","attack.persistence","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects suspicious powershell execution that ends with a common flag instead of a command or a filename to execute (could be a sign of implicit execution that uses files in WindowsApps directory)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\\"/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn]/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn]'/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\\"/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]'/ OR /.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\\"/ OR /.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]/ OR /.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]'/ OR /.*\\ \\-[Nn][Oo][Nn][Ii]\\\"/ OR /.*\\ \\-[Nn][Oo][Nn][Ii]/ OR /.*\\ \\-[Nn][Oo][Nn][Ii]'/)","rule_id":"b66474aa-bd92-4333-a16c-298155b120df","timestamp_override":"event.ingested","references":["https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\ \\-windowstyle\\ hidden\\\" OR *\\ \\-windowstyle\\ hidden OR *\\ \\-windowstyle\\ hidden' OR *\\ \\-w\\ hidden\\\" OR *\\ \\-w\\ hidden OR *\\ \\-w\\ hidden' OR *\\ \\-ep\\ bypass\\\" OR *\\ \\-ep\\ bypass OR *\\ \\-ep\\ bypass' OR *\\ \\-noni\\\" OR *\\ \\-noni OR *\\ \\-noni')`"}
