{"id":"49f2f17b-b4c8-4172-a68b-d5bf95d05130","created_by":"Florian Roth","name":"UAC Bypass via ICMLuaUtil","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:(/\\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{3[Ee]5[Ff][Cc]7[Ff]9\\-9[Aa]51\\-4367\\-9063\\-[Aa]120244[Ff][Bb][Ee][Cc]7\\}/ OR /\\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{[Dd]2[Ee]7041[Bb]\\-2927\\-42[Ff][Bb]\\-8[Ee]9[Ff]\\-7[Cc][Ee]93[Bb]6[Dd][Cc]937\\}/)) AND (NOT (process.executable:/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/)))","rule_id":"49f2f17b-b4c8-4172-a68b-d5bf95d05130","timestamp_override":"event.ingested","references":["https://www.elastic.co/guide/en/security/current/uac-bypass-via-icmluautil-elevated-com-interface.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\dllhost.exe AND process.parent.command_line:(\\/Processid\\:\\{3E5FC7F9\\-9A51\\-4367\\-9063\\-A120244FBEC7\\} OR \\/Processid\\:\\{D2E7041B\\-2927\\-42FB\\-8E9F\\-7CE93B6DC937\\})) AND (NOT (process.executable:*\\\\WerFault.exe OR process.pe.original_file_name:WerFault.exe)))`"}
