{"id":"fbd7c32d-db2a-4418-b92c-566eb8911133","created_by":"frack113","name":"SyncAppvPublishingServer Execute Arbitrary PowerShell Code","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["App-V clients"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Yy][Nn][Cc][Aa][Pp][Pp][Vv][Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\"[Nn];\\ .*/)","rule_id":"fbd7c32d-db2a-4418-b92c-566eb8911133","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md","https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SyncAppvPublishingServer.exe AND process.command_line:*\\\"n;\\ *)`"}
