{"id":"2f974656-6d83-4059-bbdf-68ac5403422f","created_by":"Florian Roth","name":"Hermetic Wiper TG Process Patterns","tags":["attack.execution","attack.lateral_movement","attack.t1021.001"],"interval":"5m","description":"Detects process execution patterns found in intrusions related to the Hermetic Wiper malware attacks against Ukraine in February 2022","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Oo][Ll][Ii][Cc][Yy][Dd][Ee][Ff][Ii][Nn][Ii][Tt][Ii][Oo][Nn][Ss]\\\\[Pp][Oo][Ss][Tt][Gg][Rr][Ee][Ss][Qq][Ll]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*[Cc][Ss][Ii][Dd][Ll]_[Ss][Yy][Ss][Tt][Ee][Mm]_[Dd][Rr][Ii][Vv][Ee]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Yy][Ss]\\.[Tt][Mm][Pp].*/ OR /.*\\ 1\\>\\ \\\\\\\\127\\.0\\.0\\.1\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\__16.*/) OR (process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ \\-[Cc]\\ .*/ AND process.command_line:/.*\\\\[Cc][Oo][Mm][Ss][Vv][Cc][Ss]\\.[Dd][Ll][Ll]\\ [Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp]\\ .*/ AND process.command_line:/.*\\\\[Ww][Ii][Nn][Uu][Pp][Dd]\\.[Ll][Oo][Gg]\\ [Ff][Uu][Ll][Ll].*/))","rule_id":"2f974656-6d83-4059-bbdf-68ac5403422f","timestamp_override":"event.ingested","references":["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\policydefinitions\\\\postgresql.exe OR process.command_line:(*CSIDL_SYSTEM_DRIVE\\\\temp\\\\sys.tmp* OR *\\ 1>\\ \\\\\\\\127.0.0.1\\\\ADMIN$\\\\__16*) OR (process.command_line:*powershell\\ \\-c\\ * AND process.command_line:*\\\\comsvcs.dll\\ MiniDump\\ * AND process.command_line:*\\\\winupd.log\\ full*))`"}
