{"id":"80fc36aa-945e-4181-89f2-2f907ab6775d","created_by":"Christian Burkard","name":"UAC Bypass Using IEInstal - Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/) AND process.parent.executable:/.*\\\\[Ii][Ee][Ii][Nn][Ss][Tt][Aa][Ll]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*[Cc][Oo][Nn][Ss][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"80fc36aa-945e-4181-89f2-2f907ab6775d","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.IntegrityLevel:(High OR System) AND process.parent.executable:*\\\\ieinstal.exe AND process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable:*consent.exe)`"}
