{"id":"48a61b29-389f-4032-b317-b30de6b95314","created_by":"Florian Roth","name":"Suspicious Plink Remote Forwarding","tags":["attack.command_and_control","attack.t1572","attack.lateral_movement","attack.t1021.001"],"interval":"5m","description":"Detects suspicious Plink tunnel remote forarding to a local port","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity using a remote port forwarding to a local port"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.description:/[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\-[Ll][Ii][Nn][Ee]\\ [Ss][Ss][Hh],\\ [Tt][Ee][Ll][Nn][Ee][Tt],\\ [Aa][Nn][Dd]\\ [Rr][Ll][Oo][Gg][Ii][Nn]\\ [Cc][Ll][Ii][Ee][Nn][Tt]/ AND process.command_line:/.*\\ \\-[Rr]\\ .*/)","rule_id":"48a61b29-389f-4032-b317-b30de6b95314","timestamp_override":"event.ingested","references":["https://www.real-sec.com/2019/04/bypassing-network-restrictions-through-rdp-tunneling/","https://medium.com/@informationsecurity/remote-ssh-tunneling-with-plink-exe-7831072b3d7d"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.description:Command\\-line\\ SSH,\\ Telnet,\\ and\\ Rlogin\\ client AND process.command_line:*\\ \\-R\\ *)`"}
