{"id":"9aa5106d-bce3-4b13-86df-3a20f1d5cf0b","created_by":"Nasreddine Bencherchali","name":"Use of Forfiles For Execution","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Execute commands and binaries from the context of \"forfiles\". This is used as a LOLBIN for example to bypass application whitelisting.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use by a via a batch script or by an administrator."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\/[Pp]\\ .*/ OR /.*\\ \\-[Pp]\\ .*/) AND process.command_line:(/.*\\ \\/[Mm]\\ .*/ OR /.*\\ \\-[Mm]\\ .*/) AND process.command_line:(/.*\\ \\/[Cc]\\ .*/ OR /.*\\ \\-[Cc]\\ .*/))","rule_id":"9aa5106d-bce3-4b13-86df-3a20f1d5cf0b","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Forfiles/","https://pentestlab.blog/2020/07/06/indirect-command-execution/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\forfiles.exe OR process.pe.original_file_name:forfiles.exe) AND process.command_line:(*\\ \\/p\\ * OR *\\ \\-p\\ *) AND process.command_line:(*\\ \\/m\\ * OR *\\ \\-m\\ *) AND process.command_line:(*\\ \\/c\\ * OR *\\ \\-c\\ *))`"}
