{"id":"64760eef-87f7-4ed3-93fd-655668ea9420","created_by":"Nasreddine Bencherchali","name":"Use of Scriptrunner.exe","tags":["attack.defense_evasion","attack.execution","attack.t1218"],"interval":"5m","description":"The \"ScriptRunner.exe\" binary can be abused to porxy execution through it and bypass possible whitelisting","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use when App-v is deployed"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ \\-[Aa][Pp][Pp][Vv][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/)","rule_id":"64760eef-87f7-4ed3-93fd-655668ea9420","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Scriptrunner/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\ScriptRunner.exe OR process.pe.original_file_name:ScriptRunner.exe) AND process.command_line:*\\ \\-appvscript\\ *)`"}
