{"id":"440a56bf-7873-4439-940a-1c8a671073c2","created_by":"Tim Burrell","name":"GALLIUM Artefacts","tags":["attack.credential_access","attack.t1212","attack.command_and_control","attack.t1071"],"interval":"5m","description":"Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.hash.sha1:(/53[Aa]44[Cc]2396[Dd]15[Cc]3[Aa]03723[Ff][Aa]5[Ee]5[Dd][Bb]54[Cc][Aa][Ff][Dd]527635/ OR /9[Cc]5[Ee]496921[Ee]3[Bb][Cc]882[Dd][Cc]40694[Ff]1[Dd][Cc][Cc]3746[Aa]75[Dd][Bb]19/ OR /[Aa][Ee][Bb]573[Aa][Cc][Cc][Ff][Dd]95758550[Cc][Ff]30[Bb][Ff]04[Ff]389[Aa]92922844/ OR /79[Ee][Ff]78[Aa]797403[Aa]4[Ee][Dd]1[Aa]616[Cc]68[Ee]07[Ff][Ff][Ff]868[Aa]8650[Aa]/ OR /4[Ff]6[Ff]38[Bb]4[Cc][Ee][Cc]35[Ee]895[Dd]91[Cc]052[Bb]1[Ff]5[Aa]83[Dd]665[Cc]2196/ OR /1[Ee]8[Cc]2[Cc][Aa][Cc]2[Ee]4[Cc][Ee]7[Cc][Bb][Dd]33[Cc]3858[Ee][Bb]2[Ee]24531[Cc][Bb]8[Aa]84[Dd]/ OR /[Ee]841[Aa]63[Ee]47361[Aa]572[Dd][Bb]9[Aa]7334[Aa][Ff]459[Dd][Dd][Cc][Aa]11347[Aa]/ OR /[Cc]28[Ff]606[Dd][Ff]28[Aa]9[Bb][Cc]8[Dd][Ff]75[Aa]4[Dd]5[Ee]5837[Ff][Cc]5522[Dd][Dd]34[Dd]/ OR /2[Ee]94[Bb]305[Dd]6812[Aa]9[Ff]96[Ee]6781[Cc]888[Ee]48[Cc]7[Ff][Bb]157[Bb]6[Bb]/ OR /[Dd][Dd]44133716[Bb]8[Aa]241957[Bb]912[Ff][Aa]6[Aa]02[Ee][Ff][Dd][Ee]3[Cc][Ee]3025/ OR /8793[Bb][Ff]166[Cc][Bb]89[Ee][Bb]55[Ff]0593404[Ee]4[Ee]933[Aa][Bb]605[Ee]803/ OR /[Aa]39[Bb]57032[Dd][Bb][Bb]2335499[Aa]51[Ee]13470[Aa]7[Cc][Dd]5[Dd]86[Bb]138/ OR /41[Cc][Cc]2[Bb]15[Cc]662[Bb][Cc]001[Cc]0[Ee][Bb]92[Ff]6[Cc][Cc]222934[Ff]0[Bb][Ee][Ee][Ee][Aa]/ OR /[Dd]209430[Dd]6[Aa][Ff]54792371174[Ee]70[Ee]27[Dd][Dd]11[Dd]3[Dd][Ee][Ff]7[Aa]7/ OR /1[Cc]6452026[Cc]56[Ee][Ff][Dd]2[Cc]94[Cc][Ee][Aa]7[Ee]0[Ff]671[Ee][Bb]55515[Ee][Dd][Bb]0/ OR /[Cc]6[Bb]41[Dd]3[Aa][Ff][Dd][Cc][Dd][Cc][Aa][Ff]9[Ff]442[Bb][Bb][Ee]772[Ff]5[Dd][Aa]871801[Ff][Dd]5[Aa]/ OR /4923[Dd]460[Ee]22[Ff][Bb][Bb][Ff]165[Bb][Bb][Bb][Aa][Bb][Aa]168[Ee]5[Aa]46[Bb]8157[Dd]9[Ff]/ OR /[Ff]201504[Bb][Dd]96[Ee]81[Dd]0[Dd]350[Cc]3[Aa]8332593[Ee][Ee]1[Cc]9[Ee]09[Dd][Ee]/ OR /[Dd][Dd][Dd]2[Dd][Bb]1127632[Aa]2[Aa]52943[Aa]2[Ff][Ee]516[Aa]2[Ee]7[Dd]05[Dd]70[Dd]2/)","rule_id":"440a56bf-7873-4439-940a-1c8a671073c2","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn800669(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.hash.sha1:(53a44c2396d15c3a03723fa5e5db54cafd527635 OR 9c5e496921e3bc882dc40694f1dcc3746a75db19 OR aeb573accfd95758550cf30bf04f389a92922844 OR 79ef78a797403a4ed1a616c68e07fff868a8650a OR 4f6f38b4cec35e895d91c052b1f5a83d665c2196 OR 1e8c2cac2e4ce7cbd33c3858eb2e24531cb8a84d OR e841a63e47361a572db9a7334af459ddca11347a OR c28f606df28a9bc8df75a4d5e5837fc5522dd34d OR 2e94b305d6812a9f96e6781c888e48c7fb157b6b OR dd44133716b8a241957b912fa6a02efde3ce3025 OR 8793bf166cb89eb55f0593404e4e933ab605e803 OR a39b57032dbb2335499a51e13470a7cd5d86b138 OR 41cc2b15c662bc001c0eb92f6cc222934f0beeea OR d209430d6af54792371174e70e27dd11d3def7a7 OR 1c6452026c56efd2c94cea7e0f671eb55515edb0 OR c6b41d3afdcdcaf9f442bbe772f5da871801fd5a OR 4923d460e22fbbf165bbbaba168e5a46b8157d9f OR f201504bd96e81d0d350c3a8332593ee1c9e09de OR ddd2db1127632a2a52943a2fe516a2e7d05d70d2)`"}
