{"id":"33339be3-148b-4e16-af56-ad16ec6c7e7b","created_by":"Trent Liffick","name":"Findstr Launching .lnk File","tags":["attack.defense_evasion","attack.t1036","attack.t1202","attack.t1027.003"],"interval":"5m","description":"Detects usage of findstr to identify and execute a lnk file as seen within the HHS redirect attack","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Ll][Nn][Kk]/)","rule_id":"33339be3-148b-4e16-af56-ad16ec6c7e7b","timestamp_override":"event.ingested","references":["https://www.bleepingcomputer.com/news/security/hhsgov-open-redirect-used-by-coronavirus-phishing-to-spread-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\findstr.exe AND process.command_line:*.lnk)`"}
