{"id":"1e0e1a81-e79b-44bc-935b-ddb9c8006b3d","created_by":"oscd.community, Natalia Shornikova, frack113","name":"CL_Mutexverifiers.ps1 Proxy Execution","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects the use of a Microsoft signed script to execute commands","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Cc][Ll]_[Mm][Uu][Tt][Ee][Xx][Vv][Ee][Rr][Ii][Ff][Ii][Ee][Rr][Ss]\\.[Pp][Ss]1.*/ AND process.command_line:/.*[Rr][Uu][Nn][Aa][Ff][Tt][Ee][Rr][Cc][Aa][Nn][Cc][Ee][Ll][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ .*/)","rule_id":"1e0e1a81-e79b-44bc-935b-ddb9c8006b3d","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\CL_Mutexverifiers.ps1* AND process.command_line:*runAfterCancelProcess\\ *)`"}
