{"id":"7b544661-69fc-419f-9a59-82ccc328f205","created_by":"Markus Neis, Swisscom","name":"Ke3chang Registry Key Modifications","tags":["attack.g0004","attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects Registry modifications performed by Ke3chang malware in campaigns running in 2019 and 2020","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Will need to be looked for combinations of those processes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\-[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy]\\ [Dd][Ww][Oo][Rr][Dd]\\ \\-[Nn][Aa][Mm][Ee]\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ff][Ii][Rr][Ss][Tt][Rr][Uu][Nn][Cc][Uu][Ss][Tt][Oo][Mm][Ii][Zz][Ee]\\ \\-[Vv][Aa][Ll][Uu][Ee]\\ 2\\ \\-[Ff][Oo][Rr][Cc][Ee].*/ OR /.*\\-[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy]\\ [Ss][Tt][Rr][Ii][Nn][Gg]\\ \\-[Nn][Aa][Mm][Ee]\\ [Cc][Hh][Ee][Cc][Kk]_[Aa][Ss][Ss][Oo][Cc][Ii][Aa][Tt][Ii][Oo][Nn][Ss]\\ \\-[Vv][Aa][Ll][Uu][Ee].*/ OR /.*\\-[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy]\\ [Dd][Ww][Oo][Rr][Dd]\\ \\-[Nn][Aa][Mm][Ee]\\ [Ii][Ee][Hh][Aa][Rr][Dd][Ee][Nn]\\ \\-[Vv][Aa][Ll][Uu][Ee]\\ 0\\ \\-[Ff][Oo][Rr][Cc][Ee].*/)","rule_id":"7b544661-69fc-419f-9a59-82ccc328f205","timestamp_override":"event.ingested","references":["https://www.verfassungsschutz.de/embed/broschuere-2020-06-bfv-cyber-brief-2020-01.pdf","https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\-Property\\ DWORD\\ \\-name\\ DisableFirstRunCustomize\\ \\-value\\ 2\\ \\-Force* OR *\\-Property\\ String\\ \\-name\\ Check_Associations\\ \\-value* OR *\\-Property\\ DWORD\\ \\-name\\ IEHarden\\ \\-value\\ 0\\ \\-Force*)`"}
