{"id":"148431ce-4b70-403d-8525-fcc2993f29ea","created_by":"Avneet Singh @v3t0_, oscd.community","name":"DLL Injection with Tracker.exe","tags":["attack.defense_evasion","attack.t1055.001"],"interval":"5m","description":"This rule detects DLL injection and execution via LOLBAS - Tracker.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Tt][Rr][Aa][Cc][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Tt][Rr][Aa][Cc][Kk][Ee][Rr]/) AND process.command_line:(/.*\\ \\/[Dd]\\ .*/ OR /.*\\ \\/[Cc]\\ .*/))","rule_id":"148431ce-4b70-403d-8525-fcc2993f29ea","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\tracker.exe OR process.pe.description:Tracker) AND process.command_line:(*\\ \\/d\\ * OR *\\ \\/c\\ *))`"}
