{"id":"d06be4b9-8045-428b-a567-740a26d9db25","created_by":"Victor Sergeev, oscd.community","name":"Verclsid.exe Runs COM Object","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects when verclsid.exe is used to run COM object via GUID","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Vv][Ee][Rr][Cc][Ll][Ss][Ii][Dd]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Vv][Ee][Rr][Cc][Ll][Ss][Ii][Dd]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\/[Ss].*/ AND process.command_line:/.*\\/[Cc].*/))","rule_id":"d06be4b9-8045-428b-a567-740a26d9db25","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Verclsid/","https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5","https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\verclsid.exe OR process.pe.original_file_name:verclsid.exe) AND (process.command_line:*\\/S* AND process.command_line:*\\/C*))`"}
