{"id":"2f869d59-7f6a-4931-992c-cce556ff2d53","created_by":"Nasreddine Bencherchali","name":"Use of Adplus.exe","tags":["attack.defense_evasion","attack.execution","attack.t1003.001"],"interval":"5m","description":"The \"AdPlus.exe\" binary that is part of the Windows SDK can be used as a lolbin to dump process memory and execute arbitrary commands","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of Adplus"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Aa][Dd][Pp][Ll][Uu][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Aa][Dd][Pp][Ll][Uu][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Hh][Aa][Nn][Gg]\\ .*/ OR /.*\\ \\-[Pp][Nn]\\ .*/ OR /.*\\ \\-[Pp][Mm][Nn]\\ .*/ OR /.*\\ \\-[Pp]\\ .*/ OR /.*\\ \\-[Pp][Oo]\\ .*/ OR /.*\\ \\-[Cc]\\ .*/ OR /.*\\ \\-[Ss][Cc]\\ .*/))","rule_id":"2f869d59-7f6a-4931-992c-cce556ff2d53","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Adplus/","https://twitter.com/nas_bench/status/1534916659676422152","https://twitter.com/nas_bench/status/1534915321856917506"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\adplus.exe OR process.pe.original_file_name:Adplus.exe) AND process.command_line:(*\\ \\-hang\\ * OR *\\ \\-pn\\ * OR *\\ \\-pmn\\ * OR *\\ \\-p\\ * OR *\\ \\-po\\ * OR *\\ \\-c\\ * OR *\\ \\-sc\\ *))`"}
