{"id":"edd8a48c-1b9f-4ba1-83aa-490338cd1ccb","created_by":"Markus Neis, Swisscom","name":"Renamed jusched.exe","tags":["attack.execution","attack.defense_evasion","attack.t1036.003"],"interval":"5m","description":"Detects renamed jusched.exe used by cobalt group","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.description:/[Jj][Aa][Vv][Aa]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr]/ OR process.pe.description:/[Jj][Aa][Vv][Aa]\\([Tt][Mm]\\)\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr]/) AND (NOT (process.executable:/.*\\\\[Jj][Uu][Ss][Cc][Hh][Ee][Dd]\\.[Ee][Xx][Ee]/)))","rule_id":"edd8a48c-1b9f-4ba1-83aa-490338cd1ccb","timestamp_override":"event.ingested","references":["https://www.bitdefender.com/files/News/CaseStudies/study/262/Bitdefender-WhitePaper-An-APT-Blueprint-Gaining-New-Visibility-into-Financial-Threats-interactive.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.description:Java\\ Update\\ Scheduler OR process.pe.description:Java\\(TM\\)\\ Update\\ Scheduler) AND (NOT (process.executable:*\\\\jusched.exe)))`"}
