{"id":"678dfc63-fefb-47a5-a04c-26bcf8cc9f65","created_by":"Florian Roth","name":"Rare GrantedAccess Flags on LSASS Access","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects process access to LSASS memory with suspicious access flags 0x410 and 0x01410 (spin-off of similar rule)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software accessing LSASS process for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/.*10/) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Aa][Ll][Ww][Aa][Rr][Ee][Bb][Yy][Tt][Ee][Ss]\\\\[Aa][Nn][Tt][Ii]\\-[Mm][Aa][Ll][Ww][Aa][Rr][Ee]\\\\[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Aa][Ll][Ww][Aa][Rr][Ee][Bb][Yy][Tt][Ee][Ss]\\\\[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Cc][Tt][Ll][Rr][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Mm][Bb][Uu][Pp][Dd][Aa][Tt][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Ee][Rr][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\[Mm][Mm][Ss][Ss][Hh][Oo][Ss][Tt]\\\\[Mm][Mm][Ss][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\.*/ AND process.executable:/.*\\\\[Gg][Aa][Mm][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/) OR (process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\.*/ AND process.executable:/.*\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/) AND process.executable:/.*[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/) OR (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\\\[Vv][Ss]_[Bb][Oo][Oo][Tt][Ss][Tt][Rr][Aa][Pp][Pp][Ee][Rr]_.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1410/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/)) OR (SourceCommandLine:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ee][Rr][Mm][Gg][Rr]\\.[Ee][Xx][Ee]\\ \\-[Uu][Pp][Ll][Oo][Aa][Dd]/) OR (process.executable:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ AND process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]_[Rr][Ee][Pp][Oo][Rr][Tt][Ee][Rr]_[Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Bb][Aa][Mm][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ / OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/)))))","rule_id":"678dfc63-fefb-47a5-a04c-26bcf8cc9f65","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights","https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow","https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html","https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:*10) AND (NOT ((process.executable:(C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe OR C\\:\\\\Program\\ Files\\\\Malwarebytes\\\\Anti\\-Malware\\\\MBAMService.exe OR C\\:\\\\PROGRAMDATA\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe OR C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe OR C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe OR C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe OR C\\:\\\\Windows\\\\System32\\\\msiexec.exe OR C\\:\\\\Windows\\\\System32\\\\lsass.exe OR C\\:\\\\WINDOWS\\\\System32\\\\perfmon.exe OR C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\wmiprvse.exe OR C\\:\\\\Windows\\\\sysWOW64\\\\wbem\\\\wmiprvse.exe OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\McAfee\\\\MMSSHost\\\\MMSSHOST.exe)) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable:*\\\\GamingServices.exe) OR (process.executable:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE)) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND process.executable:*Antivirus*) OR (process.executable:(*\\\\thor64.exe OR *\\\\thor.exe)) OR (process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable:*\\\\vs_bootstrapper_* AND winlog.event_data.GrantedAccess:0x1410) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\WINDOWS\\\\system32\\\\*)) OR (SourceCommandLine:C\\:\\\\WINDOWS\\\\system32\\\\wermgr.exe\\ \\-upload) OR (process.executable:*C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\Local\\\\* AND process.executable:(*\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR *\\\\software_reporter_tool.exe OR *\\\\DropboxUpdate.exe OR *\\\\MBAMInstallerService.exe OR *\\\\WebEx\\\\WebexHost.exe\\  OR *\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe)))))`"}
