{"id":"9386d78a-7207-4048-9c9f-a93a7c2d1c05","created_by":"Julia Fomina, oscd.community","name":"Code Execution via Pcwutl.dll","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects launch of executable by calling the LaunchApplication function from pcwutl.dll library.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Use of Program Compatibility Troubleshooter Helper"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Cc][Ww][Uu][Tt][Ll].*/ AND process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/)","rule_id":"9386d78a-7207-4048-9c9f-a93a7c2d1c05","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Libraries/Pcwutl/","https://twitter.com/harr0ey/status/989617817849876488"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.command_line:*pcwutl* AND process.command_line:*LaunchApplication*)`"}
