{"id":"e1118a8f-82f5-44b3-bb6b-8a284e5df602","created_by":"Andreas Hunkeler (@Karneades)","name":"Scheduled Task WScript VBScript","tags":["attack.persistence","attack.t1053","attack.t1053.005"],"interval":"5m","description":"Detects specific process parameters as used by ACTINIUM scheduled task persistence creation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ AND process.command_line:/.*[Ee]\\:[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt].*/)","rule_id":"e1118a8f-82f5-44b3-bb6b-8a284e5df602","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*schtasks* AND process.command_line:*create* AND process.command_line:*wscript* AND process.command_line:*e\\:vbscript*)`"}
