{"id":"b6b49cd1-34d6-4ead-b1bf-176e9edba9a4","created_by":"Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton","name":"Suspicious PowerShell Cmdline","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the PowerShell command lines with reversed strings","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Cc][Tt][Aa][Cc].*/ OR /.*[Kk][Aa][Ee][Rr][Bb].*/ OR /.*[Dd][Nn][Aa][Mm][Mm][Oo][Cc].*/ OR /.*[Ee][Kk][Oo][Vv][Nn].*/ OR /.*[Ee][Ll][Ii][Ff][Dd].*/ OR /.*[Rr][Aa][Hh][Cc].*/ OR /.*[Ee][Tt][Ii][Rr][Ww].*/ OR /.*[Gg][Oo][Ll][Oo][Nn].*/ OR /.*[Tt][Nn][Ii][Nn][Oo][Nn].*/ OR /.*[Ee][Dd][Dd][Ii][Hh].*/ OR /.*[Tt][Pp][Ii][Rr][Cc][Ss].*/ OR /.*[Ss][Ss][Ee][Cc][Oo][Rr][Pp].*/ OR /.*[Ll][Ll][Ee][Hh][Ss][Rr][Ee][Ww][Oo][Pp].*/ OR /.*[Ee][Ss][Nn][Oo][Pp][Ss][Ee][Rr].*/ OR /.*[Dd][Aa][Oo][Ll][Nn][Ww][Oo][Dd].*/ OR /.*[Tt][Nn][Ee][Ii][Ll][Cc][Bb][Ee][Ww].*/ OR /.*[Tt][Nn][Ee][Ii][Ll][Cc].*/ OR /.*[Pp][Tt][Tt][Hh].*/ OR /.*[Ee][Ll][Ii][Ff][Oo][Tt][Ee][Vv][Aa][Ss].*/ OR /.*46[Ee][Ss][Aa][Bb].*/ OR /.*[Hh][Tt][Aa][Pp][Pp][Mm][Ee][Tt][Tt][Ee][Gg].*/ OR /.*[Tt][Cc][Ee][Jj][Bb][Oo].*/ OR /.*[Mm][Aa][Ee][Rr][Tt][Ss].*/ OR /.*[Hh][Cc][Aa][Ee][Rr][Oo][Ff].*/ OR /.*[Ee][Kk][Oo][Vv][Nn][Ii].*/ OR /.*[Rr][Ee][Tt][Uu][Pp][Mm][Oo][Cc].*/)) AND (NOT ((process.command_line:/.*\\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/))))","rule_id":"b6b49cd1-34d6-4ead-b1bf-176e9edba9a4","timestamp_override":"event.ingested","references":["https://2019.offzone.moscow/ru/report/hunting-for-powershell-abuses/","https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=66"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*powershell.exe OR *pwsh.exe) AND process.command_line:(*hctac* OR *kaerb* OR *dnammoc* OR *ekovn* OR *eliFd* OR *rahc* OR *etirw* OR *golon* OR *tninon* OR *eddih* OR *tpircS* OR *ssecorp* OR *llehsrewop* OR *esnopser* OR *daolnwod* OR *tneilCbeW* OR *tneilc* OR *ptth* OR *elifotevas* OR *46esab* OR *htaPpmeTteG* OR *tcejbO* OR *maerts* OR *hcaerof* OR *ekovni* OR *retupmoc*)) AND (NOT ((process.command_line:*\\-EncodedCommand*))))`"}
