{"id":"cc4e02ba-9c06-48e2-b09e-2500cace9ae0","created_by":"Sreeman","name":"Tasks Folder Evasion","tags":["attack.defense_evasion","attack.persistence","attack.execution","attack.t1574.002"],"interval":"5m","description":"The Tasks folder in system32 and syswow64 are globally writable paths. Adversaries can take advantage of this and load or influence any script hosts or ANY .NET Application in Tasks to load and execute a custom assembly into cscript, wscript, regsvr32, mshta, eventvwr","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Ee][Cc][Hh][Oo]\\ .*/ OR /.*[Cc][Oo][Pp][Yy]\\ .*/ OR /.*[Tt][Yy][Pp][Ee]\\ .*/ OR /.*[Ff][Ii][Ll][Ee]\\ [Cc][Rr][Ee][Aa][Tt][Ee][Nn][Ee][Ww].*/) AND process.command_line:(/.*\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/ OR /.*\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/))","rule_id":"cc4e02ba-9c06-48e2-b09e-2500cace9ae0","timestamp_override":"event.ingested","references":["https://twitter.com/subTee/status/1216465628946563073","https://gist.github.com/am0nsec/8378da08f848424e4ab0cc5b317fdd26"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*echo\\ * OR *copy\\ * OR *type\\ * OR *file\\ createnew*) AND process.command_line:(*\\ C\\:\\\\Windows\\\\System32\\\\Tasks\\\\* OR *\\ C\\:\\\\Windows\\\\SysWow64\\\\Tasks\\\\*))`"}
