{"id":"575dce0c-8139-4e30-9295-1ee75969f7fe","created_by":"blueteamer8699","name":"GatherNetworkInfo.vbs Script Usage","tags":["attack.discovery","attack.group_policy_discovery","attack.execution","attack.command_and_scripting_interpreter","attack.visual_basic","attack.t1059.005"],"interval":"5m","description":"Adversaries can abuse of C:\\Windows\\System32\\gatherNetworkInfo.vbs script along with cscript.exe to gather information about the target","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*[Gg][Aa][Tt][Hh][Ee][Rr][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ii][Nn][Ff][Oo]\\.[Vv][Bb][Ss].*/)","rule_id":"575dce0c-8139-4e30-9295-1ee75969f7fe","timestamp_override":"event.ingested","references":["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*cscript.exe* AND process.command_line:*gatherNetworkInfo.vbs*)`"}
