{"id":"3121461b-5aa0-4a41-b910-66d25524edbb","created_by":"Florian Roth, Markus Neis","name":"Winnti Malware HK University Campaign","tags":["attack.defense_evasion","attack.t1574.002","attack.g0044"],"interval":"5m","description":"Detects specific process characteristics of Winnti malware noticed in Dec/Jan 2020 in a campaign against Honk Kong universities","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Hh][Pp][Qq][Hh][Vv][Ii][Nn][Dd]\\.[Ee][Xx][Ee].*/) AND process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Rr][Mm].*/) OR (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Rr][Mm].*/ AND process.executable:/.*\\\\[Ww][Mm][Pp][Ll][Aa][Yy][Ee][Rr]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:/.*\\\\[Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Ww][Mm][Pp][Ll][Aa][Yy][Ee][Rr]\\.[Ee][Xx][Ee]/) OR process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Rr][Mm]\\\\[Cc][Ll][Rr]\\\\[Cc][Ll][Rr]\\.[Ee][Xx][Ee]/ OR (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Rr][Mm]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/ AND process.executable:/.*\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Ff][Ii][Ll][Tt][Ee][Rr][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))","rule_id":"3121461b-5aa0-4a41-b910-66d25524edbb","timestamp_override":"event.ingested","references":["https://www.welivesecurity.com/2020/01/31/winnti-group-targeting-universities-hong-kong/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*C\\:\\\\Windows\\\\Temp* OR *\\\\hpqhvind.exe*) AND process.executable:C\\:\\\\ProgramData\\\\DRM*) OR (process.parent.executable:C\\:\\\\ProgramData\\\\DRM* AND process.executable:*\\\\wmplayer.exe) OR (process.parent.executable:*\\\\Test.exe AND process.executable:*\\\\wmplayer.exe) OR process.executable:C\\:\\\\ProgramData\\\\DRM\\\\CLR\\\\CLR.exe OR (process.parent.executable:C\\:\\\\ProgramData\\\\DRM\\\\Windows* AND process.executable:*\\\\SearchFilterHost.exe))`"}
