{"id":"49be8799-7b4d-4fda-ad23-cafbefdebbc5","created_by":"Christopher Peacock @SecurePeacock, SCYTHE @scythe_io","name":"Use of Wfc.exe","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"The Workflow Command-line Compiler can be used for AWL bypass and is listed in Microsoft's recommended block rules.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use by a software developer"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ff][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Ff][Cc]\\.[Ee][Xx][Ee]/)","rule_id":"49be8799-7b4d-4fda-ad23-cafbefdebbc5","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/","https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wfc.exe OR process.pe.original_file_name:wfc.exe)`"}
