{"id":"2c0d2d7b-30d6-4d14-9751-7b9113042ab9","created_by":"Florian Roth","name":"Suspicious Characters in CommandLine","tags":null,"interval":"5m","description":"Detects suspicious Unicode characters in the command line, which could be a sign of obfuscation or defense evasion","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*ˣ.*/ OR /.*˪.*/ OR /.*ˢ.*/) OR process.command_line:(/.*∕.*/ OR /.*⁄.*/) OR process.command_line:(/.*―.*/ OR /.*—.*/))","rule_id":"2c0d2d7b-30d6-4d14-9751-7b9113042ab9","timestamp_override":"event.ingested","references":["https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*ˣ* OR *˪* OR *ˢ*) OR process.command_line:(*∕* OR *⁄*) OR process.command_line:(*―* OR *—*))`"}
