{"id":"729ce0ea-5d8f-4769-9762-e35de441586d","created_by":"Florian Roth","name":"MpiExec Lolbin","tags":["attack.execution","attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects a certain command line flag combination used by mpiexec.exe LOLBIN from HPC pack that can be used to execute any other binary","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Pp][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.imphash:/[Dd]8[Bb]52[Ee][Ff]6[Aa][Aa][Aa]3[Aa]81501[Bb][Dd][Ff][Ff][Ff]9[Dd][Bb][Bb]96217/ OR related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Dd]8[Bb]52[Ee][Ff]6[Aa][Aa][Aa]3[Aa]81501[Bb][Dd][Ff][Ff][Ff]9[Dd][Bb][Bb]96217.*/) AND process.command_line:(/.*\\ \\/[Nn]\\ 1\\ .*/ OR /.*\\ \\-[Nn]\\ 1\\ .*/))","rule_id":"729ce0ea-5d8f-4769-9762-e35de441586d","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1465058133303246867","https://docs.microsoft.com/en-us/powershell/high-performance-computing/mpiexec?view=hpc19-ps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\mpiexec.exe OR process.pe.imphash:d8b52ef6aaa3a81501bdfff9dbb96217 OR related.hash:*IMPHASH\\=d8b52ef6aaa3a81501bdfff9dbb96217*) AND process.command_line:(*\\ \\/n\\ 1\\ * OR *\\ \\-n\\ 1\\ *))`"}
