{"id":"e66779cc-383e-4224-a3a4-267eeb585c40","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Bypass UAC via CMSTP","tags":["attack.privilege_escalation","attack.defense_evasion","attack.t1548.002","attack.t1218.003"],"interval":"5m","description":"Detect commandline usage of Microsoft Connection Manager Profile Installer (cmstp.exe) to install specially formatted local .INF files","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of cmstp.exe utility by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Mm][Ss][Tt][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Mm][Ss][Tt][Pp]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\/[Ss].*/ OR /.*\\-[Ss].*/ OR /.*\\/[Aa][Uu].*/ OR /.*\\-[Aa][Uu].*/ OR /.*\\/[Nn][Ii].*/ OR /.*\\-[Nn][Ii].*/))","rule_id":"e66779cc-383e-4224-a3a4-267eeb585c40","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md","https://lolbas-project.github.io/lolbas/Binaries/Cmstp/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\cmstp.exe OR process.pe.original_file_name:CMSTP.EXE) AND process.command_line:(*\\/s* OR *\\-s* OR *\\/au* OR *\\-au* OR *\\/ni* OR *\\-ni*))`"}
