{"id":"1f0f6176-6482-4027-b151-00071af39d7e","created_by":"frack113","name":"Suspicious ConfigSecurityPolicy Execution","tags":["attack.exfiltration","attack.t1567"],"interval":"5m","description":"Upload file, credentials or data exfiltration with Binary part of Windows Defender","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Ee][Xx][Ee].*/ OR process.executable:/.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Oo][Ll][Ii][Cc][Yy]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/.*/ OR /.*[Hh][Tt][Tt][Pp]\\:\\/\\/.*/ OR /.*[Ff][Tt][Pp]\\:\\/\\/.*/))","rule_id":"1f0f6176-6482-4027-b151-00071af39d7e","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/ConfigSecurityPolicy/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*ConfigSecurityPolicy.exe* OR process.executable:*\\\\ConfigSecurityPolicy.exe OR process.pe.original_file_name:ConfigSecurityPolicy.exe) AND process.command_line:(*https\\:\\/\\/* OR *http\\:\\/\\/* OR *ftp\\:\\/\\/*))`"}
