{"id":"ad92e3f9-7eb6-460e-96b1-582b0ccbb980","created_by":"Christian Burkard","name":"UAC Bypass Using MSConfig Token Modification - Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using a msconfig GUI hack (UACMe 55)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/) AND process.parent.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Pp][Kk][Gg][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Ee][Xx][Ee]\\\"\\ \\-5/)","rule_id":"ad92e3f9-7eb6-460e-96b1-582b0ccbb980","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.IntegrityLevel:(High OR System) AND process.parent.executable:*\\\\AppData\\\\Local\\\\Temp\\\\pkgmgr.exe AND process.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\msconfig.exe\\\"\\ \\-5)`"}
