{"id":"2d117e49-e626-4c7c-bd1f-c3c0147774c8","created_by":"Florian Roth","name":"PowerShell Base64 Encoded Shellcode","tags":["attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects Base64 encoded Shellcode","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/ AND process.command_line:(/.*[Oo][Ii][Cc][Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/ OR /.*[Oo][Ii][Jj][Aa][Aa][Aa][Aa][Yy][Ii][Nn][Ll][Mm].*/))","rule_id":"2d117e49-e626-4c7c-bd1f-c3c0147774c8","timestamp_override":"event.ingested","references":["https://twitter.com/cyb3rops/status/1063072865992523776"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*AAAAYInlM* AND process.command_line:(*OiCAAAAYInlM* OR *OiJAAAAYInlM*))`"}
