{"id":"dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0","created_by":"Andreas Hunkeler (@Karneades), Nasreddine Bencherchali","name":"Shells Spawned by Java","tags":["attack.initial_access","attack.persistence","attack.privilege_escalation"],"interval":"5m","description":"Detects shell spawned from Java host process, which could be a sign of exploitation (e.g. log4j exploitation)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate calls to system binaries","Company specific internal usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/)) AND (NOT (process.parent.executable:/.*[Bb][Uu][Ii][Ll][Dd].*/ AND process.command_line:/.*[Bb][Uu][Ii][Ll][Dd].*/)))","rule_id":"dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\java.exe AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe)) AND (NOT (process.parent.executable:*build* AND process.command_line:*build*)))`"}
