{"id":"a4eaf250-7dc1-4842-862a-5e71cd59a167","created_by":"Florian Roth, Maxime Thiebaut","name":"Suspicious RazerInstaller Explorer Subprocess","tags":["attack.privilege_escalation","attack.t1553"],"interval":"5m","description":"Detects a explorer.exe sub process of the RazerInstaller software which can be invoked from the installer to select a different installation folder but can also be exploited to escalate privileges to LOCAL SYSTEM","risk_score":73,"enabled":true,"severity":"high","false_positives":["User selecting a different installation folder (check for other sub processes of this explorer.exe process)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Rr][Aa][Zz][Ee][Rr][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:/[Ss][Yy][Ss][Tt][Ee][Mm]/) AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Rr][Aa][Zz][Ee][Rr]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\.*/)))","rule_id":"a4eaf250-7dc1-4842-862a-5e71cd59a167","timestamp_override":"event.ingested","references":["https://twitter.com/j0nh4t/status/1429049506021138437","https://streamable.com/q2dsji"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\RazerInstaller.exe AND winlog.event_data.IntegrityLevel:System) AND (NOT (process.executable:C\\:\\\\Windows\\\\Installer\\\\Razer\\\\Installer\\\\*)))`"}
