{"id":"198effb6-6c98-4d0c-9ea3-451fa143c45c","created_by":"Avneet Singh @v3t0_, oscd.community","name":"Run Once Task Execution as Configured in Registry","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"This rule detects the execution of Run Once task as configured in the registry","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Rr][Uu][Nn]\\ [Oo][Nn][Cc][Ee]\\ [Ww][Rr][Aa][Pp][Pp][Ee][Rr]/) AND process.command_line:/.*\\ \\/[Aa][Ll][Tt][Ee][Rr][Nn][Aa][Tt][Ee][Ss][Hh][Ee][Ll][Ll][Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/)","rule_id":"198effb6-6c98-4d0c-9ea3-451fa143c45c","timestamp_override":"event.ingested","references":["https://twitter.com/pabraeken/status/990717080805789697","https://lolbas-project.github.io/lolbas/Binaries/Runonce/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\runonce.exe OR process.pe.description:Run\\ Once\\ Wrapper) AND process.command_line:*\\ \\/AlternateShellStartup*)`"}
