{"id":"313d6012-51a0-4d93-8dfc-de8553239e25","created_by":"Sreeman, Florian Roth, Frack113","name":"Monitoring Winget For LOLbin Execution","tags":["attack.defense_evasion","attack.execution","attack.t1059"],"interval":"5m","description":"Adversaries can abuse winget to download payloads remotely and execute them without touching disk. Winget will be included by default in Windows 10 and is already available in Windows 10 insider programs. The manifest option enables you to install an application by passing in a YAML file directly to the client. Winget can be used to download and install exe's, msi, msix files later.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Admin activity installing packages not in the official Microsoft repo. Winget probably won't be used by most users."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ww][Ii][Nn][Gg][Ee][Tt].*/ AND process.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:(/.*\\-[Mm]\\ .*/ OR /.*\\-\\-[Mm][Aa][Nn][Ii][Ff][Ee][Ss][Tt].*/))","rule_id":"313d6012-51a0-4d93-8dfc-de8553239e25","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/package-manager/winget/install#local-install"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*winget* AND process.command_line:*install* AND process.command_line:(*\\-m\\ * OR *\\-\\-manifest*))`"}
