{"id":"883faa95-175a-4e22-8181-e5761aeb373c","created_by":"Florian Roth","name":"Suspicious Service Binary Directory","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects a service binary running in a suspicious directory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn].*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Aa][Ll][Ll]\\ [Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Cc][Oo][Nn][Tt][Aa][Cc][Tt][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Ee][Ss]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Oo][Nn][Tt][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Mm][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/) AND process.parent.executable:(/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))","rule_id":"883faa95-175a-4e22-8181-e5761aeb373c","timestamp_override":"event.ingested","references":["https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\Users\\\\Public\\\\* OR *\\\\$Recycle.bin* OR *\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\Contacts\\\\* OR *\\\\Users\\\\Searches\\\\* OR *C\\:\\\\Perflogs\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\addins\\\\*) AND process.parent.executable:(*\\\\services.exe OR *\\\\svchost.exe))`"}
