{"id":"4f154fb6-27d1-4813-a759-78b93e0b9c48","created_by":"_pete_0, TheDFIRReport","name":"Operator Bloopers Cobalt Strike Modules","tags":["attack.execution","attack.t1059.003"],"interval":"5m","description":"Detects use of Cobalt Strike module commands accidentally entered in the CMD shell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:(/[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/) AND process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Uu][Ss][Ee][Rr][Hh][Uu][Nn][Tt][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Hh][Aa][Rr][Ee][Ff][Ii][Nn][Dd][Ee][Rr].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Aa][Ss][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ss][Mm][Bb][Aa][Uu][Tt][Oo][Bb][Rr][Uu][Tt][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Nn][Ii][Gg][Hh][Tt][Mm][Aa][Rr][Ee].*/ OR /.*[Zz][Ee][Rr][Oo][Ll][Oo][Gg][Oo][Nn].*/ OR /.*[Aa][Vv]_[Qq][Uu][Ee][Rr][Yy].*/))","rule_id":"4f154fb6-27d1-4813-a759-78b93e0b9c48","timestamp_override":"event.ingested","references":["https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf","https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/","https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cmd.exe AND process.command_line:(cmd.exe* OR c\\:\\\\windows\\\\system32\\\\cmd.exe*) AND process.command_line:(*Invoke\\-UserHunter* OR *Invoke\\-ShareFinder* OR *Invoke\\-Kerberoast* OR *Invoke\\-SMBAutoBrute* OR *Invoke\\-Nightmare* OR *zerologon* OR *av_query*))`"}
