{"id":"79b06761-465f-4f88-9ef2-150e24d3d737","created_by":"Florian Roth","name":"Procdump Evasion","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects uses of the SysInternals Procdump utility in which procdump or its output get renamed or a dump file is moved ot copied to a different name","risk_score":73,"enabled":true,"severity":"high","false_positives":["Cases in which procdump just gets copied to a different directory without any renaming"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Cc][Oo][Pp][Yy]\\ [Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/ OR /.*[Mm][Oo][Vv][Ee]\\ [Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/) OR (process.command_line:/.*[Cc][Oo][Pp][Yy]\\ .*/ AND process.command_line:/.*\\.[Dd][Mm][Pp]\\ .*/ AND process.command_line:(/.*2\\.[Dd][Mm][Pp].*/ OR /.*[Ll][Ss][Aa][Ss][Ss].*/ OR /.*[Oo][Uu][Tt]\\.[Dd][Mm][Pp].*/)) OR process.command_line:(/.*[Cc][Oo][Pp][Yy]\\ [Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]_.*/ OR /.*[Mm][Oo][Vv][Ee]\\ [Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]_.*/))","rule_id":"79b06761-465f-4f88-9ef2-150e24d3d737","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1480785527901204481"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*copy\\ procdump* OR *move\\ procdump*) OR (process.command_line:*copy\\ * AND process.command_line:*.dmp\\ * AND process.command_line:(*2.dmp* OR *lsass* OR *out.dmp*)) OR process.command_line:(*copy\\ lsass.exe_* OR *move\\ lsass.exe_*))`"}
