{"id":"90d50722-0483-4065-8e35-57efaadd354d","created_by":"Florian Roth","name":"DevInit Lolbin Download","tags":["attack.execution","attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects a certain command line flag combination used by devinit.exe lolbin to download arbitrary MSI packages on a Windows system","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\-[Tt]\\ [Mm][Ss][Ii]\\-[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\ .*/ AND process.command_line:/.*\\ \\-[Ii]\\ [Hh][Tt][Tt][Pp].*/)","rule_id":"90d50722-0483-4065-8e35-57efaadd354d","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1460815932402679809"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\-t\\ msi\\-install\\ * AND process.command_line:*\\ \\-i\\ http*)`"}
