{"id":"855bc8b5-2ae8-402e-a9ed-b889e6df1900","created_by":"Florian Roth, oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st","name":"Copy from Admin Share","tags":["attack.lateral_movement","attack.collection","attack.exfiltration","attack.t1039","attack.t1048","attack.t1021.002"],"interval":"5m","description":"Detects a suspicious copy command to or from an Admin share","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Rr][Oo][Bb][Oo][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Xx][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Oo][Pp][Yy].*/) OR (process.executable:/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:(/.*[Cc][Oo][Pp][Yy]\\-[Ii][Tt][Ee][Mm].*/ OR /.*[Cc][Oo][Pp][Yy].*/ OR /.*[Cc][Pp][Ii]\\ .*/ OR /.*\\ [Cc][Pp]\\ .*/))) AND (process.command_line:/.*\\\\\\\\\\*/ AND process.command_line:/.*$.*/))","rule_id":"855bc8b5-2ae8-402e-a9ed-b889e6df1900","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1211636381086339073","https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\robocopy.exe OR *\\\\xcopy.exe) OR (process.executable:*\\\\cmd.exe AND process.command_line:*copy*) OR (process.executable:*\\\\powershell* AND process.command_line:(*copy\\-item* OR *copy* OR *cpi\\ * OR *\\ cp\\ *))) AND (process.command_line:*\\\\\\\\\\* AND process.command_line:*$*))`"}
