{"id":"d0dae994-26c6-4d2d-83b5-b3c8b79ae513","created_by":"frack113","name":"Launch WebBrowserPassView Executable","tags":["attack.credential_access","attack.t1555.003"],"interval":"5m","description":"Detect use of WebBrowserPassView.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.description:/[Ww][Ee][Bb]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]\\ [Vv][Ii][Ee][Ww][Ee][Rr]/ OR process.executable:/.*\\\\[Ww][Ee][Bb][Bb][Rr][Oo][Ww][Ss][Ee][Rr][Pp][Aa][Ss][Ss][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/)","rule_id":"d0dae994-26c6-4d2d-83b5-b3c8b79ae513","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1555.003/T1555.003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.description:Web\\ Browser\\ Password\\ Viewer OR process.executable:*\\\\WebBrowserPassView.exe)`"}
