{"id":"965fff6c-1d7e-4e25-91fd-cdccd75f7d2c","created_by":"Florian Roth","name":"DarkSide Ransomware Pattern","tags":["attack.execution","attack.t1204"],"interval":"5m","description":"Detects DarkSide Ransomware and helpers","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown","UAC bypass method used by other malware"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\=\\[[Cc][Hh][Aa][Rr]\\]\\[[Bb][Yy][Tt][Ee]\\]\\('0[Xx]'\\+.*/ OR /.*\\ \\-[Ww][Oo][Rr][Kk]\\ [Ww][Oo][Rr][Kk][Ee][Rr]0\\ \\-[Pp][Aa][Tt][Hh]\\ .*/) OR (process.parent.command_line:/.*[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{3[Ee]5[Ff][Cc]7[Ff]9\\-9[Aa]51\\-4367\\-9063\\-[Aa]120244[Ff][Bb][Ee][Cc]7\\}.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))","rule_id":"965fff6c-1d7e-4e25-91fd-cdccd75f7d2c","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html","https://app.any.run/tasks/8b9a571b-bcc1-4783-ba32-df4ba623b9c0/","https://www.joesandbox.com/analysis/411752/0/html#7048BB9A06B8F2DD9D24C77F389D7B2B58D2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\=\\[char\\]\\[byte\\]\\('0x'\\+* OR *\\ \\-work\\ worker0\\ \\-path\\ *) OR (process.parent.command_line:*DllHost.exe\\ \\/Processid\\:\\{3E5FC7F9\\-9A51\\-4367\\-9063\\-A120244FBEC7\\}* AND process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\*))`"}
