{"id":"bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2","created_by":"Florian Roth","name":"Suspicious Ntdll Pipe Redirection","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Tt][Yy][Pp][Ee]\\ %[Ww][Ii][Nn][Dd][Ii][Rr]%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/ OR /.*[Tt][Yy][Pp][Ee]\\ %[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/ OR /.*[Tt][Yy][Pp][Ee]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll]\\ \\>\\ \\\\\\\\\\.\\\\[Pp][Ii][Pp][Ee]\\\\\\*/)","rule_id":"bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2","timestamp_override":"event.ingested","references":["https://www.x86matthew.com/view_post?id=ntdll_pipe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*type\\ %windir%\\\\system32\\\\ntdll.dll* OR *type\\ %systemroot%\\\\system32\\\\ntdll.dll* OR *type\\ c\\:\\\\windows\\\\system32\\\\ntdll.dll* OR *\\\\ntdll.dll\\ >\\ \\\\\\\\.\\\\pipe\\\\\\*)`"}
