{"id":"7b0666ad-3e38-4e3d-9bab-78b06de85f7b","created_by":"Jason Lynch","name":"Execution of Renamed PaExec","tags":["attack.defense_evasion","attack.t1036.003","attack.g0046","car.2013-05-009","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects execution of renamed paexec via imphash and executable product string","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown imphashes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.product:/.*[Pp][Aa][Ee][Xx][Ee][Cc].*/ AND (process.pe.imphash:(/11[Dd]40[Aa]7[Bb]7876288[Ff]919[Aa][Bb]819[Cc][Cc]2[Dd]9802/ OR /6444[Ff]8[Aa]34[Ee]99[Bb]8[Ff]7[Dd]9647[Dd][Ee]66[Aa][Aa][Bb][Ee]516/ OR /[Dd][Ff][Dd]6[Aa][Aa]3[Ff]7[Bb]2[Bb]1035[Bb]76[Bb]718[Ff]1[Dd][Dd][Cc]689[Ff]/ OR /1[Aa]6[Cc][Cc][Aa]4[Dd]5460[Bb]1710[Aa]12[Dd][Ee][Aa]39[Ee]4[Aa]592[Cc]/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=11[Dd]40[Aa]7[Bb]7876288[Ff]919[Aa][Bb]819[Cc][Cc]2[Dd]9802.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=6444[Ff]8[Aa]34[Ee]99[Bb]8[Ff]7[Dd]9647[Dd][Ee]66[Aa][Aa][Bb][Ee]516.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Dd][Ff][Dd]6[Aa][Aa]3[Ff]7[Bb]2[Bb]1035[Bb]76[Bb]718[Ff]1[Dd][Dd][Cc]689[Ff].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=1[Aa]6[Cc][Cc][Aa]4[Dd]5460[Bb]1710[Aa]12[Dd][Ee][Aa]39[Ee]4[Aa]592[Cc].*/))) AND (NOT (process.executable:/.*[Pp][Aa][Ee][Xx][Ee][Cc].*/)))","rule_id":"7b0666ad-3e38-4e3d-9bab-78b06de85f7b","timestamp_override":"event.ingested","references":["sha256=01a461ad68d11b5b5096f45eb54df9ba62c5af413fa9eb544eacb598373a26bc","https://summit.fireeye.com/content/dam/fireeye-www/summit/cds-2018/presentations/cds18-technical-s05-att&cking-fin7.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.product:*PAExec* AND (process.pe.imphash:(11D40A7B7876288F919AB819CC2D9802 OR 6444f8a34e99b8f7d9647de66aabe516 OR dfd6aa3f7b2b1035b76b718f1ddc689f OR 1a6cca4d5460b1710a12dea39e4a592c) OR related.hash:(*IMPHASH\\=11D40A7B7876288F919AB819CC2D9802* OR *IMPHASH\\=6444f8a34e99b8f7d9647de66aabe516* OR *IMPHASH\\=dfd6aa3f7b2b1035b76b718f1ddc689f* OR *IMPHASH\\=1a6cca4d5460b1710a12dea39e4a592c*))) AND (NOT (process.executable:*paexec*)))`"}
