{"id":"86085955-ea48-42a2-9dd3-85d4c36b167d","created_by":"frack113","name":"Suspicious Execution of Taskkill","tags":["attack.impact","attack.t1489"],"interval":"5m","description":"Adversaries may stop services or processes in order to conduct Data Destruction or Data Encrypted for Impact on the data stores of services like Exchange and SQL Server.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Tt][Aa][Ss][Kk][Kk][Ii][Ll][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Tt][Aa][Ss][Kk][Kk][Ii][Ll][Ll]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\/[Ff].*/ AND process.command_line:/.*\\ \\/[Ii][Mm]\\ .*/))","rule_id":"86085955-ea48-42a2-9dd3-85d4c36b167d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1489/T1489.md#atomic-test-3---windows---stop-service-by-killing-process"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\taskkill.exe OR process.pe.original_file_name:taskkill.exe) AND (process.command_line:*\\ \\/f* AND process.command_line:*\\ \\/im\\ *))`"}
