{"id":"f44800ac-38ec-471f-936e-3fa7d9c53100","created_by":"Nasreddine Bencherchali @nas_bench","name":"CleanWipe Usage","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative use (Should be investigated either way)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Ee][Pp][Rr][Ee][Mm][Oo][Vv][Aa][Ll][Tt][Oo][Oo][Ll][Nn][Aa][Tt][Ii][Vv][Ee]_[Xx]64\\.[Ee][Xx][Ee]/ OR (process.executable:/.*\\\\[Cc][Aa][Tt][Cc][Ll][Ee][Aa][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-\\-[Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/) OR (process.executable:/.*\\\\[Nn][Ee][Tt][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Rr].*/) OR (process.executable:/.*\\\\[Ww][Ff][Pp][Uu][Nn][Ii][Nn][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:/.*\\/[Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee].*/))","rule_id":"f44800ac-38ec-471f-936e-3fa7d9c53100","timestamp_override":"event.ingested","references":["https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SepRemovalToolNative_x64.exe OR (process.executable:*\\\\CATClean.exe AND process.command_line:*\\-\\-uninstall*) OR (process.executable:*\\\\NetInstaller.exe AND process.command_line:*\\-r*) OR (process.executable:*\\\\WFPUnins.exe AND process.command_line:*\\/uninstall* AND process.command_line:*\\/enterprise*))`"}
