{"id":"39019a4e-317f-4ce3-ae63-309a8c6b53c5","created_by":"Florian Roth","name":"Suspicious Scheduled Task Creation Involving Temp Folder","tags":["attack.execution","attack.persistence","attack.t1053.005"],"interval":"5m","description":"Detects the creation of scheduled tasks that involves a temporary folder and runs only once","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity","Software installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ AND process.command_line:/.*\\ \\/[Ss][Cc]\\ [Oo][Nn][Cc][Ee]\\ .*/ AND process.command_line:/.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/)","rule_id":"39019a4e-317f-4ce3-ae63-309a8c6b53c5","timestamp_override":"event.ingested","references":["https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/create\\ * AND process.command_line:*\\ \\/sc\\ once\\ * AND process.command_line:*\\\\Temp\\\\*)`"}
