{"id":"7c0dcd3d-acf8-4f71-9570-f448b0034f94","created_by":"FLorian Roth","name":"PsExec Service Execution as LOCAL SYSTEM","tags":["attack.execution"],"interval":"5m","description":"Detects suspicious launch of the PSEXESVC service on this system and a sub process run as LOCAL_SYSTEM (-s), which means that someone remotely started a command on this system running it with highest privileges and not only the privileges of the login user account (e.g. the administrator account)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/))","rule_id":"7c0dcd3d-acf8-4f71-9570-f448b0034f94","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:C\\:\\\\Windows\\\\PSEXESVC.exe AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*))`"}
