{"id":"643bdcac-8b82-49f4-9fd9-25a90b929f3b","created_by":"Sittikorn S","name":"Renamed MegaSync","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the execution of a renamed meg.exe of MegaSync during incident response engagements associated with ransomware families like Nefilim, Sodinokibi, Pysa, and Conti.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software that illegaly integrates MegaSync in a renamed form","Administrators that have renamed MegaSync"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Mm][Ee][Gg]\\.[Ee][Xx][Ee].*/) OR (process.pe.original_file_name:/[Mm][Ee][Gg]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Mm][Ee][Gg]\\.[Ee][Xx][Ee]/))))","rule_id":"643bdcac-8b82-49f4-9fd9-25a90b929f3b","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/rclone-mega-extortion/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\explorer.exe AND process.command_line:*C\\:\\\\Windows\\\\Temp\\\\meg.exe*) OR (process.pe.original_file_name:meg.exe AND (NOT (process.executable:*\\\\meg.exe))))`"}
