{"id":"b7b19cb6-9b32-4fc4-a108-73f19acfe262","created_by":"Konstantin Grishchenko, oscd.community","name":"Suspicious VBoxDrvInst.exe Parameters","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect VBoxDrvInst.exe run with parameters allowing processing INF file. This allows to create values in the registry and install drivers. For example one could use this technique to obtain persistence via modifying one of Run or RunOnce registry keys","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of VBoxDrvInst.exe utility by VirtualBox Guest Additions installation process"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Vv][Bb][Oo][Xx][Dd][Rr][Vv][Ii][Nn][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Dd][Rr][Ii][Vv][Ee][Rr].*/ AND process.command_line:/.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee][Ii][Nn][Ff].*/)","rule_id":"b7b19cb6-9b32-4fc4-a108-73f19acfe262","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OtherBinaries/VBoxDrvInst.yml","https://twitter.com/pabraeken/status/993497996179492864"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\VBoxDrvInst.exe AND process.command_line:*driver* AND process.command_line:*executeinf*)`"}
