{"id":"cf93e05e-d798-4d9e-b522-b0248dc61eaf","created_by":"Nasreddine Bencherchali","name":"SharpChisel Usage","tags":["attack.command_and_control","attack.t1090.001"],"interval":"5m","description":"Detects usage of the Sharp Chisel via the commandline arguments","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Some flalse positives may occure with other tools with similar commandlines"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Hh][Aa][Rr][Pp][Cc][Hh][Ii][Ss][Ee][Ll]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*[Ee][Xx][Ee]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\ .*/ OR /.*[Ee][Xx][Ee]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ .*/) OR process.command_line:(/.*\\ \\-\\-[Ss][Oo][Cc][Kk][Ss]5.*/ OR /.*\\ \\-\\-[Rr][Ee][Vv][Ee][Rr][Ss][Ee].*/ OR /.*\\ [Rr]\\:.*/ OR /.*\\:127\\.0\\.0\\.1\\:.*/))","rule_id":"cf93e05e-d798-4d9e-b522-b0248dc61eaf","timestamp_override":"event.ingested","references":["https://github.com/shantanu561993/SharpChisel","https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SharpChisel.exe OR process.command_line:(*exe\\ client\\ * OR *exe\\ server\\ *) OR process.command_line:(*\\ \\-\\-socks5* OR *\\ \\-\\-reverse* OR *\\ r\\:* OR *\\:127.0.0.1\\:*))`"}
