{"id":"129966c9-de17-4334-a123-8b58172e664d","created_by":"Austin Songer @austinsonger, Florian Roth","name":"Suspicious Dump64.exe Execution","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects when a user bypasses Defender by renaming a tool to dump64.exe and placing it in a Visual Studio folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Dump64.exe in other folders than the excluded one"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Ff][Ee][Ee][Dd][Bb][Aa][Cc][Kk]\\\\[Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee].*/))) OR (process.executable:/.*\\\\[Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\-[Mm][Aa]\\ .*/ OR /.*[Aa][Cc][Cc][Pp][Ee][Tt][Ee][Uu][Ll][Aa].*/)))","rule_id":"129966c9-de17-4334-a123-8b58172e664d","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1460597833917251595"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\dump64.exe AND (NOT (process.executable:*\\\\Installer\\\\Feedback\\\\dump64.exe*))) OR (process.executable:*\\\\dump64.exe AND process.command_line:(*\\ \\-ma\\ * OR *accpeteula*)))`"}
