{"id":"10152a7b-b566-438f-a33c-390b607d1c8d","created_by":"Markus Neis","name":"Empire Monkey","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects EmpireMonkey APT reported Activity","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Very Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\/[Ii]\\:%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%\\\\[Ll][Oo][Gg][Ss]\\.[Tt][Xx][Tt]\\ [Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/ AND process.executable:/.*\\\\[Cc][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\/[Ii]\\:%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%\\\\[Ll][Oo][Gg][Ss]\\.[Tt][Xx][Tt]\\ [Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/ AND process.pe.description:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\([Cc]\\)\\ [Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Ss][Ee][Rr][Vv][Ee][Rr]/))","rule_id":"10152a7b-b566-438f-a33c-390b607d1c8d","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/a4107649-8cb0-41af-ad75-113152d4d57b"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\/i\\:%APPDATA%\\\\logs.txt\\ scrobj.dll AND process.executable:*\\\\cutil.exe) OR (process.command_line:*\\/i\\:%APPDATA%\\\\logs.txt\\ scrobj.dll AND process.pe.description:Microsoft\\(C\\)\\ Registerserver))`"}
