{"id":"b243b280-65fe-48df-ba07-6ddea7646427","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Discovery of a System Time","tags":["attack.discovery","attack.t1124"],"interval":"5m","description":"Identifies use of various commands to query a systems time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate use of the system utilities to discover system time for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Tt][Ii][Mm][Ee].*/) OR (process.executable:/.*\\\\[Ww]32[Tt][Mm]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Tt][Zz].*/))","rule_id":"b243b280-65fe-48df-ba07-6ddea7646427","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1124/T1124.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*time*) OR (process.executable:*\\\\w32tm.exe AND process.command_line:*tz*))`"}
