{"id":"c260b6db-48ba-4b4a-a76f-2f67644e99d2","created_by":"Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"Covenant Launcher Indicators","tags":["attack.execution","attack.defense_evasion","attack.t1059.001","attack.t1564.003"],"interval":"5m","description":"Detects suspicious command lines used in Covenant luanchers","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\-[Ss][Tt][Aa].*/ AND process.command_line:/.*\\-[Nn][Oo][Pp].*/ AND process.command_line:/.*\\-[Ww][Ii][Nn][Dd][Oo][Ww].*/ AND process.command_line:/.*[Hh][Ii][Dd][Dd][Ee][Nn].*/ AND process.command_line:(/.*\\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*\\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/)) OR process.command_line:(/.*[Ss][Vv]\\ [Oo]\\ \\([Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ii][Oo]\\.[Mm][Ee][Mm][Oo][Rr][Yy][Ss][Tt][Ee][Aa][Mm]\\);[Ss][Vv]\\ [Dd]\\ .*/ OR /.*[Mm][Ss][Hh][Tt][Aa]\\ [Ff][Ii][Ll][Ee]\\.[Hh][Tt][Aa].*/ OR /.*[Gg][Rr][Uu][Nn][Tt][Hh][Tt][Tt][Pp].*/ OR /.*\\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Cc][Ww][Bb]2[Aa][Cc][Aa][Aa][Bb][Ww][Aa][Gg][Aa].*/))","rule_id":"c260b6db-48ba-4b4a-a76f-2f67644e99d2","timestamp_override":"event.ingested","references":["https://posts.specterops.io/covenant-v0-5-eee0507b85ba"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\-Sta* AND process.command_line:*\\-Nop* AND process.command_line:*\\-Window* AND process.command_line:*Hidden* AND process.command_line:(*\\-Command* OR *\\-EncodedCommand*)) OR process.command_line:(*sv\\ o\\ \\(New\\-Object\\ IO.MemorySteam\\);sv\\ d\\ * OR *mshta\\ file.hta* OR *GruntHTTP* OR *\\-EncodedCommand\\ cwB2ACAAbwAgA*))`"}
