{"id":"1eeed653-dbc8-4187-ad0c-eeebb20e6599","created_by":"Markus Neis, keepwatch","name":"Possible SPN Enumeration","tags":["attack.credential_access","attack.t1558.003"],"interval":"5m","description":"Detects Service Principal Name Enumeration used for Kerberoasting","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator Activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Ee][Tt][Ss][Pp][Nn]\\.[Ee][Xx][Ee]/ OR (process.pe.description:/.*[Qq][Uu][Ee][Rr][Yy]\\ [Oo][Rr]\\ [Rr][Ee][Ss][Ee][Tt]\\ [Tt][Hh][Ee]\\ [Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr].*/ AND process.pe.description:/.*[Ss][Pp][Nn]\\ [Aa][Tt][Tt][Rr][Ii][Bb][Uu][Tt][Ee].*/)) AND process.command_line:/.*\\-[Qq].*/)","rule_id":"1eeed653-dbc8-4187-ad0c-eeebb20e6599","timestamp_override":"event.ingested","references":["https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\setspn.exe OR (process.pe.description:*Query\\ or\\ reset\\ the\\ computer* AND process.pe.description:*SPN\\ attribute*)) AND process.command_line:*\\-q*)`"}
