{"id":"c5c00f49-b3f9-45a6-997e-cfdecc6e1967","created_by":"pH-T, Nasreddine Bencherchali","name":"Suspicious Schtasks Execution AppData Folder","tags":["attack.execution","attack.persistence","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects the creation of a schtask that executes a file from C:\\Users\\<USER>\\AppData\\Local","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*\\/[Rr][Uu].*/ AND process.command_line:/.*\\/[Tt][Rr].*/ AND process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ AND process.command_line:(/.*[Nn][Tt]\\ [Aa][Uu][Tt].*/ OR /.*\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/)) AND (NOT (process.parent.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.parent.executable:/.*[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]_\\.[Ee][Xx][Ee].*/ AND process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Tt][Nn]\\ [Tt][Vv][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Rr][Ee][Ss][Tt][Oo][Rr][Ee].*/)))","rule_id":"c5c00f49-b3f9-45a6-997e-cfdecc6e1967","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create* AND process.command_line:*\\/RU* AND process.command_line:*\\/TR* AND process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\* AND process.command_line:(*NT\\ AUT* OR *\\ SYSTEM\\ *)) AND (NOT (process.parent.executable:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.parent.executable:*TeamViewer_.exe* AND process.executable:*\\\\schtasks.exe AND process.command_line:*\\/TN\\ TVInstallRestore*)))`"}
