{"id":"62510e69-616b-4078-b371-847da438cc03","created_by":"Endgame, JHasenbusch (ported for oscd.community)","name":"Windows Network Enumeration","tags":["attack.discovery","attack.t1018"],"interval":"5m","description":"Identifies attempts to enumerate hosts in a network using the built-in Windows net.exe tool.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate use of net.exe utility by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Vv][Ii][Ee][Ww].*/) AND (NOT (process.command_line:/.*\\\\\\\\\\*/)))","rule_id":"62510e69-616b-4078-b371-847da438cc03","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*view*) AND (NOT (process.command_line:*\\\\\\\\\\*)))`"}
