{"id":"c57872c7-614f-4d7f-a40d-b78c8df2d30d","created_by":"frack113","name":"CL_LoadAssembly.ps1 Proxy Execution","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects the use of a Microsoft signed script to execute commands and bypassing AppLocker.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\\\[Cc][Ll]_[Ll][Oo][Aa][Dd][Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\.[Pp][Ss]1.*/ OR /.*[Ll][Oo][Aa][Dd][Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy][Ff][Rr][Oo][Mm][Pp][Aa][Tt][Hh]\\ .*/)","rule_id":"c57872c7-614f-4d7f-a40d-b78c8df2d30d","timestamp_override":"event.ingested","references":["https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/","https://lolbas-project.github.io/lolbas/Scripts/CL_LoadAssembly/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\\\CL_LoadAssembly.ps1* OR *LoadAssemblyFromPath\\ *)`"}
