{"id":"add64136-62e5-48ea-807e-88638d02df1e","created_by":"Ecco, E.M. Anhaus, oscd.community","name":"Fsutil Suspicious Invocation","tags":["attack.defense_evasion","attack.t1070"],"interval":"5m","description":"Detects suspicious parameters of fsutil (deleting USN journal, configuring it with small size, etc). Might be used by ransomwares during the attack (seen by NotPetya and others).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Admin activity","Scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Dd][Ee][Ll][Ee][Tt][Ee][Jj][Oo][Uu][Rr][Nn][Aa][Ll].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Jj][Oo][Uu][Rr][Nn][Aa][Ll].*/))","rule_id":"add64136-62e5-48ea-807e-88638d02df1e","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-usn","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070/T1070.md","https://eqllib.readthedocs.io/en/latest/analytics/c91f422a-5214-4b17-8664-c5fcf115c0a2.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\fsutil.exe OR process.pe.original_file_name:fsutil.exe) AND process.command_line:(*deletejournal* OR *createjournal*))`"}
