{"id":"9eb271b9-24ae-4cd4-9465-19cfc1047f3e","created_by":"Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative","name":"Proxy Execution Via Explorer.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Attackers can use explorer.exe for evading defense mechanisms","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate explorer.exe run from cmd.exe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee].*/)","rule_id":"9eb271b9-24ae-4cd4-9465-19cfc1047f3e","timestamp_override":"event.ingested","references":["https://twitter.com/CyberRaiju/status/1273597319322058752"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\explorer.exe AND process.parent.executable:*\\\\cmd.exe AND process.command_line:*explorer.exe*)`"}
