{"id":"a9e416a8-e613-4f8b-88b8-a7d1d1af2f61","created_by":"Michael R. (@nahamike01)","name":"Suspicious Use of CSharp Interactive Console","tags":["attack.execution","attack.t1127"],"interval":"5m","description":"Detects the execution of CSharp interactive console by PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible depending on environment. Pair with other factors such as net connections, command-line args, etc."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Ss][Ii]\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/) AND process.pe.original_file_name:/[Cc][Ss][Ii]\\.[Ee][Xx][Ee]/)","rule_id":"a9e416a8-e613-4f8b-88b8-a7d1d1af2f61","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/detecting-attacks-leveraging-the-net-framework/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\csi.exe AND process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe) AND process.pe.original_file_name:csi.exe)`"}
