{"id":"9801abb8-e297-4dbf-9fbd-57dde0e830ad","created_by":"Nasreddine Bencherchali","name":"Abusing IEExec To Download Payloads","tags":null,"interval":"5m","description":"Detects execution of the IEExec utility to download payloads","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ii][Ee][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ii][Ee][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/.*/ OR /.*[Hh][Tt][Tt][Pp]\\:\\/\\/.*/))","rule_id":"9801abb8-e297-4dbf-9fbd-57dde0e830ad","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Ieexec/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\IEExec.exe OR process.pe.original_file_name:IEExec.exe) AND process.command_line:(*https\\:\\/\\/* OR *http\\:\\/\\/*))`"}
