{"id":"00bca14a-df4e-4649-9054-3f2aa676bc04","created_by":"Florian Roth","name":"Suspicious Curl File Upload","tags":["attack.exfiltration","attack.t1567","attack.t1105"],"interval":"5m","description":"Detects a suspicious curl process start the adds a file to a web request","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Scripts created by developers and admins"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.product:/[Tt][Hh][Ee]\\ [Cc][Uu][Rr][Ll]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Aa][Bb][Ll][Ee]/) AND process.command_line:(/.*\\ \\-[Ff]\\ .*/ OR /.*\\ \\-\\-[Ff][Oo][Rr][Mm]\\ .*/ OR /.*\\ \\-[Tt]\\ .*/ OR /.*\\ \\-\\-[Uu][Pp][Ll][Oo][Aa][Dd]\\-[Ff][Ii][Ll][Ee]\\ .*/ OR /.*\\ \\-[Dd]\\ .*/ OR /.*\\ \\-\\-[Dd][Aa][Tt][Aa]\\ .*/))","rule_id":"00bca14a-df4e-4649-9054-3f2aa676bc04","timestamp_override":"event.ingested","references":["https://twitter.com/d1r4c/status/1279042657508081664","https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-19---curl-upload-file","https://curl.se/docs/manpage.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\curl.exe OR process.pe.product:The\\ curl\\ executable) AND process.command_line:(*\\ \\-F\\ * OR *\\ \\-\\-form\\ * OR *\\ \\-T\\ * OR *\\ \\-\\-upload\\-file\\ * OR *\\ \\-d\\ * OR *\\ \\-\\-data\\ *))`"}
