{"id":"889719ef-dd62-43df-86c3-768fb08dc7c0","created_by":"Florian Roth","name":"Suspicious PowerShell Mailbox Export to Share","tags":["attack.persistence","attack.t1505.003","attack.resource_development","attack.t1584.006"],"interval":"5m","description":"Detects a PowerShell New-MailboxExportRequest that exports a mailbox to a local share, as used in ProxyShell exploitations","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ee][Ww]\\-[Mm][Aa][Ii][Ll][Bb][Oo][Xx][Ee][Xx][Pp][Oo][Rr][Tt].*/ AND process.command_line:/.*\\ \\-[Mm][Aa][Ii][Ll][Bb][Oo][Xx]\\ .*/ AND process.command_line:/.*\\ \\-[Ff][Ii][Ll][Ee][Pp][Aa][Tt][Hh]\\ \\\\\\\\127\\.0\\.0\\.1\\\\[Cc]$.*/)","rule_id":"889719ef-dd62-43df-86c3-768fb08dc7c0","timestamp_override":"event.ingested","references":["https://youtu.be/5mqid-7zp8k?t=2481","https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html","https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*New\\-MailboxExport* AND process.command_line:*\\ \\-Mailbox\\ * AND process.command_line:*\\ \\-FilePath\\ \\\\\\\\127.0.0.1\\\\C$*)`"}
