{"id":"4e2ed651-1906-4a59-a78a-18220fca1b22","created_by":"Florian Roth, Nasreddine Bencherchali","name":"NirCmd Tool Execution","tags":["attack.execution","attack.t1569.002","attack.s0029"],"interval":"5m","description":"Detects the use of NirCmd tool for command execution, which could be the result of legitimate administrative activity","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use by administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Nn][Ii][Rr][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*\\ [Ee][Xx][Ee][Cc][Mm][Dd]\\ .*/ OR /.*\\.[Ee][Xx][Ee]\\ [Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/ OR /.*\\.[Ee][Xx][Ee]\\ [Ss][Hh][Ee][Xx][Ee][Cc]\\ .*/ OR /.*\\ [Rr][Uu][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee]\\ .*/)) OR (process.command_line:(/.*\\ [Ee][Xx][Ee][Cc]\\ .*/ OR /.*\\ [Ee][Xx][Ee][Cc]2\\ .*/) AND process.command_line:(/.*\\ [Ss][Hh][Oo][Ww]\\ .*/ OR /.*\\ [Hh][Ii][Dd][Ee]\\ .*/)))","rule_id":"4e2ed651-1906-4a59-a78a-18220fca1b22","timestamp_override":"event.ingested","references":["https://www.nirsoft.net/utils/nircmd.html","https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/","https://www.nirsoft.net/utils/nircmd2.html#using"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:NirCmd.exe OR process.command_line:(*\\ execmd\\ * OR *.exe\\ script\\ * OR *.exe\\ shexec\\ * OR *\\ runinteractive\\ *)) OR (process.command_line:(*\\ exec\\ * OR *\\ exec2\\ *) AND process.command_line:(*\\ show\\ * OR *\\ hide\\ *)))`"}
