{"id":"7090adee-82e2-4269-bd59-80691e7c6338","created_by":"_pete_0, TheDFIRReport","name":"CHCP CodePage Locale Lookup","tags":["attack.discovery","attack.t1614.001"],"interval":"5m","description":"Detects use of chcp to look up the system locale value as part of host discovery","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:(/.*\\ \\/[Cc]\\ .*/ OR /.*\\ \\/[Kk]\\ .*/) AND process.executable:/.*\\\\[Cc][Hh][Cc][Pp]\\.[Cc][Oo][Mm]/ AND process.command_line:(/.*[Cc][Hh][Cc][Pp]/ OR /.*[Cc][Hh][Cc][Pp]\\ / OR /.*[Cc][Hh][Cc][Pp]\\ \\ /))","rule_id":"7090adee-82e2-4269-bd59-80691e7c6338","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/chcp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\cmd.exe AND process.parent.command_line:(*\\ \\/c\\ * OR *\\ \\/k\\ *) AND process.executable:*\\\\chcp.com AND process.command_line:(*chcp OR *chcp\\  OR *chcp\\ \\ ))`"}
