{"id":"1228c958-e64e-4e71-92ad-7d429f4138ba","created_by":"Florian Roth","name":"Script Interpreter Execution From Suspicious Folder","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects a suspicious script executions in temporary folders or folders accessible by environment variables","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) OR process.command_line:(/.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ .*/ OR /.*\\/[Ee]\\:[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/ OR /.*\\/[Ee]\\:[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/) OR process.pe.original_file_name:(/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) AND process.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/))","rule_id":"1228c958-e64e-4e71-92ad-7d429f4138ba","timestamp_override":"event.ingested","references":["https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\mshta.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\cmd.exe) OR process.command_line:(*\\ \\-w\\ hidden\\ * OR *\\ \\-ep\\ bypass\\ * OR *\\/e\\:vbscript\\ * OR *\\/e\\:javascript\\ *) OR process.pe.original_file_name:(powershell.exe OR pwsh.dll OR mshta.exe OR wscript.exe OR cscript.exe OR cmd.exe)) AND process.executable:(*\\\\Windows\\\\Temp* OR *\\\\Temporary\\ Internet* OR *\\\\AppData\\\\Local\\\\Temp* OR *\\\\AppData\\\\Roaming\\\\Temp* OR *C\\:\\\\Users\\\\Public\\\\* OR *C\\:\\\\Perflogs\\\\*))`"}
