{"id":"47688f1b-9f51-4656-b013-3cc49a166a36","created_by":"Christian Burkard","name":"Base64 Encoded Listing of Shadowcopy","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects base64 encoded listing Win32_Shadowcopy","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Vv][Ww][Bb][Pp][Aa][Gg]4[Aa][Mm][Ww][Aa][Yy][Aa][Ff]8[Aa][Uu][Ww][Bb][Oo][Aa][Gg][Ee][Aa][Zz][Aa][Bb][Vv][Aa][Hh][Cc][Aa][Yy][Ww][Bb][Vv][Aa][Hh][Aa][Aa][Ee][Qq][Aa][Gg][Aa][Hh][Ww][Aa][Ii][Aa][Bb][Gg][Aa][Gg]8[Aa][Cc][Gg][Bb][Ff][Aa][Gg][Ee][Aa][Yy][Ww][Bb][Oo][Aa][Cc]0[Aa][Tt][Ww][Bb][Ii][Aa][Gg][Oo][Aa][Zz][Qq][Bb][Jj][Aa][Hh][Qq][Aa].*/ OR /.*[Cc][Aa][Aa][Qq][Bb][Uu][Aa][Dd][Mm][Aa][Mm][Gg][Bb][Ff][Aa][Ff][Mm][Aa][Aa][Aa][Bb][Hh][Aa][Gg][Qq][Aa][Bb][Ww][Bb]3[Aa][Gg][Mm][Aa][Bb][Ww][Bb][Ww][Aa][Hh][Kk][Aa][Ii][Aa][Bb]8[Aa][Cc][Aa][Aa][Rr][Gg][Bb][Vv][Aa][Hh][Ii][Aa][Rr][Qq][Bb][Hh][Aa][Gg][Mm][Aa][Aa][Aa][Aa][Tt][Aa][Ee]8[Aa][Yy][Gg][Bb][Qq][Aa][Gg][Uu][Aa][Yy][Ww][Bb]0[Aa].*/ OR /.*[Xx][Aa][Gg][Kk][Aa][Bb][Gg][Aa][Zz][Aa][Dd][Ii][Aa][Xx][Ww][Bb][Tt][Aa][Gg][Gg][Aa][Yy][Qq][Bb][Kk][Aa][Gg]8[Aa][Dd][Ww][Bb][Jj][Aa][Gg]8[Aa][Cc][Aa][Bb]5[Aa][Cc][Aa][Aa][Ff][Aa][Aa][Gg][Aa][Ee][Yy][Aa][Bb][Ww][Bb][Yy][Aa][Ee][Uu][Aa][Yy][Qq][Bb][Jj][Aa][Gg][Gg][Aa][Ll][Qq][Bb][Pp][Aa][Gg][Ii][Aa][Aa][Gg][Bb][Ll][Aa][Gg][Mm][Aa][Dd][Aa].*/)","rule_id":"47688f1b-9f51-4656-b013-3cc49a166a36","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQAgAHwAIABGAG8AcgBFAGEAYwBoAC0ATwBiAGoAZQBjAHQA* OR *cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkAIAB8ACAARgBvAHIARQBhAGMAaAAtAE8AYgBqAGUAYwB0A* OR *XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5ACAAfAAgAEYAbwByAEUAYQBjAGgALQBPAGIAagBlAGMAdA*)`"}
