{"id":"74a12f18-505c-4114-8d0b-8448dd5485c6","created_by":"frack113","name":"Nimgrab File Download","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects usage of nimgrab, a tool bundled with the Nim programming framework, downloading a file. This can be normal behaviour on developer systems.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of Nim on developer systems"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Ii][Mm][Gg][Rr][Aa][Bb]\\.[Ee][Xx][Ee]/ OR related.hash:(/.*[Mm][Dd]5\\=2[Dd][Dd]44[Cc]3[Cc]29[Dd]667[Ff]5[Cc]0[Ee][Ff]5[Ff]9[Dd]7[Cc]7[Ff][Ff][Bb]8[Bb].*/ OR /.*[Ss][Hh][Aa]256\\=[Ff]266609[Ee]91985[Ff]0[Ff][Ee]3[Ee]31[Cc]5[Ee]8[Ff][Aa][Ee][Ee][Ee][Cc]4[Ff][Ff][Aa]5[Ee]0322[Dd]8[Bb]6[Ff]15[Ff][Ee]69[Ff]4[Cc]5165[Bb]9559.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Cc]07[Ff][Dd][Dd][Dd]21[Dd]123[Ee][Aa]9[Bb]3[Aa]08[Ee][Ee][Ff]44[Aa][Aa][Aa][Cc]45.*/) OR process.hash.md5:/2[Dd][Dd]44[Cc]3[Cc]29[Dd]667[Ff]5[Cc]0[Ee][Ff]5[Ff]9[Dd]7[Cc]7[Ff][Ff][Bb]8[Bb]/ OR process.hash.sha256:/[Ff]266609[Ee]91985[Ff]0[Ff][Ee]3[Ee]31[Cc]5[Ee]8[Ff][Aa][Ee][Ee][Ee][Cc]4[Ff][Ff][Aa]5[Ee]0322[Dd]8[Bb]6[Ff]15[Ff][Ee]69[Ff]4[Cc]5165[Bb]9559/ OR imphash:/[Cc]07[Ff][Dd][Dd][Dd]21[Dd]123[Ee][Aa]9[Bb]3[Aa]08[Ee][Ee][Ff]44[Aa][Aa][Aa][Cc]45/)","rule_id":"74a12f18-505c-4114-8d0b-8448dd5485c6","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\nimgrab.exe OR related.hash:(*MD5\\=2DD44C3C29D667F5C0EF5F9D7C7FFB8B* OR *SHA256\\=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559* OR *IMPHASH\\=C07FDDD21D123EA9B3A08EEF44AAAC45*) OR process.hash.md5:2DD44C3C29D667F5C0EF5F9D7C7FFB8B OR process.hash.sha256:F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559 OR imphash:C07FDDD21D123EA9B3A08EEF44AAAC45)`"}
