{"id":"12b8e9f5-96b2-41e1-9a42-8c6779a5c184","created_by":"Nasreddine Bencherchali","name":"Suspicious Execution Of PDQDeployRunner","tags":["attack.execution"],"interval":"5m","description":"Detects suspicious execution of \"PDQDeployRunner\" which is part of the PDQDeploy service stack that is responsible for executing commands and packages on a remote machines","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the PDQDeploy tool to execute these commands"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*[Pp][Dd][Qq][Dd][Ee][Pp][Ll][Oo][Yy][Rr][Uu][Nn][Nn][Ee][Rr]\\-.*/ AND (process.executable:(/.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Ll]\\.[Ee][Xx][Ee]/) OR process.executable:(/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/) OR process.command_line:(/.*[Ii][Ee][Xx]\\ .*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-.*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Hh][Tt][Tt][Pp].*/ OR /.*\\ \\-[Ee][Nn][Cc]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ .*/ OR /.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn].*/)))","rule_id":"12b8e9f5-96b2-41e1-9a42-8c6779a5c184","timestamp_override":"event.ingested","references":["https://twitter.com/malmoeb/status/1550483085472432128"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*PDQDeployRunner\\-* AND (process.executable:(*\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\wmic.exe OR *\\\\msiexec.exe OR *\\\\mshta.exe OR *\\\\csc.exe OR *\\\\dllhost.exe OR *\\\\certutil.exe OR *\\\\scriptrunner.exe OR *\\\\bash.exe OR *\\\\wsl.exe) OR process.executable:(*C\\:\\\\Users\\\\Public\\\\* OR *C\\:\\\\ProgramData\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*) OR process.command_line:(*iex\\ * OR *Invoke\\-* OR *DownloadString* OR *http* OR *\\ \\-enc\\ * OR *\\ \\-encodedcommand\\ * OR *FromBase64String* OR *\\ \\-decode\\ * OR *\\ \\-w\\ hidden*)))`"}
