{"id":"b8b1b304-a60f-4999-9a6e-c547bde03ffd","created_by":"Nasreddine Bencherchali","name":"DeviceCredentialDeployment Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the execution of DeviceCredentialDeployment to hide a process from view","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/","rule_id":"b8b1b304-a60f-4999-9a6e-c547bde03ffd","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/pull/147"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\DeviceCredentialDeployment.exe`"}
