{"id":"4a2a2c3e-209f-4d01-b513-4155a540b469","created_by":"frack113","name":"Suspicious MsiExec Embedding Parent","tags":["attack.t1218.007","attack.defense_evasion"],"interval":"5m","description":"Adversaries may abuse msiexec.exe to proxy the execution of malicious payloads","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND process.parent.command_line:/.*[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee].*/ AND process.parent.command_line:/.*\\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg]\\ .*/) AND (NOT ((process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ss][Pp][Ll][Uu][Nn][Kk][Uu][Nn][Ii][Vv][Ee][Rr][Ss][Aa][Ll][Ff][Oo][Rr][Ww][Aa][Rr][Dd][Ee][Rr]\\\\[Bb][Ii][Nn]\\\\.*/) OR (process.command_line:/.*\\\\[Dd][Ii][Ss][Mm][Ff][Oo][Dd][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Cc][Mm][Dd].*/ OR process.parent.command_line:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg]\\ .*/ AND process.parent.command_line:/.*[Gg][Ll][Oo][Bb][Aa][Ll]\\\\[Mm][Ss][Ii]0000.*/))))","rule_id":"4a2a2c3e-209f-4d01-b513-4155a540b469","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe) AND process.parent.command_line:*MsiExec.exe* AND process.parent.command_line:*\\-Embedding\\ *) AND (NOT ((process.executable:*\\:\\\\Windows\\\\System32\\\\cmd.exe AND process.command_line:*C\\:\\\\Program\\ Files\\\\SplunkUniversalForwarder\\\\bin\\\\*) OR (process.command_line:*\\\\DismFoDInstall.cmd* OR process.parent.command_line:*\\\\MsiExec.exe\\ \\-Embedding\\ * AND process.parent.command_line:*Global\\\\MSI0000*))))`"}
