{"id":"ebea773c-a8f1-42ad-a856-00cb221966e8","created_by":"Nasreddine Bencherchali","name":"DLL Sideloading by VMware Xfer Utility","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects execution of VMware Xfer utility (VMwareXferlogs.exe) from the non-default directory which may be an attempt to sideload arbitrary DLL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee][Xx][Ff][Ee][Rr][Ll][Oo][Gg][Ss]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\.*/)))","rule_id":"ebea773c-a8f1-42ad-a856-00cb221966e8","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\VMwareXferlogs.exe AND (NOT (process.executable:C\\:\\\\Program\\ Files\\\\VMware\\\\*)))`"}
