{"id":"a197e378-d31b-41c0-9635-cfdf1c1bb423","created_by":"frack113","name":"WinRM Access with Evil-WinRM","tags":["attack.lateral_movement","attack.t1021.006"],"interval":"5m","description":"Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Bb][Yy]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ii]\\ .*/ AND process.command_line:/.*\\-[Uu]\\ .*/ AND process.command_line:/.*\\-[Pp]\\ .*/)","rule_id":"a197e378-d31b-41c0-9635-cfdf1c1bb423","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-3---winrm-access-with-evil-winrm","https://github.com/Hackplayers/evil-winrm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\ruby.exe AND process.command_line:*\\-i\\ * AND process.command_line:*\\-u\\ * AND process.command_line:*\\-p\\ *)`"}
