{"id":"a7cd7306-df8b-4398-b711-6f3e4935cf16","created_by":"Florian Roth","name":"Remote Procedure Call Service Anomaly","tags":["attack.initial_access","attack.t1190","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects suspicious remote procedure call (RPC) service anomalies based on the spawned sub processes (long shot to detect the exploitation of vulnerabilities like CVE-2022-26809)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown","Some cases in which the service spawned a werfault.exe process"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Rr][Pp][Cc][Ss][Ss].*/","rule_id":"a7cd7306-df8b-4398-b711-6f3e4935cf16","timestamp_override":"event.ingested","references":["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-26809","https://www.bleepingcomputer.com/startups/RpcSs.exe-14544.html","https://twitter.com/cyb3rops/status/1514217991034097664"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.parent.command_line:C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\\ \\-k\\ RPCSS*`"}
