{"id":"a96970af-f126-420d-90e1-d37bf25e50e1","created_by":"frack113, Nasreddine Bencherchali","name":"Use Short Name Path in Image","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image detection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\~1\\\\.*/ OR /.*\\~2\\\\.*/) AND (NOT (process.parent.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ll][Ee][Aa][Nn][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/) OR process.parent.executable:(/.*\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/) OR process.pe.product:/[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ss][Hh][Ii][Ee][Ll][Dd]\\ \\([Rr]\\)/ OR process.pe.description:/[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ss][Hh][Ii][Ee][Ll][Dd]\\ \\([Rr]\\)\\ [Ss][Ee][Tt][Uu][Pp]\\ [Ee][Nn][Gg][Ii][Nn][Ee]/ OR process.pe.company:/[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ss][Hh][Ii][Ee][Ll][Dd]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\ [Cc][Oo][Rr][Pp][Oo][Rr][Aa][Tt][Ii][Oo][Nn]/)))","rule_id":"a96970af-f126-420d-90e1-d37bf25e50e1","timestamp_override":"event.ingested","references":["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN","https://twitter.com/frack113/status/1555830623633375232"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\~1\\\\* OR *\\~2\\\\*) AND (NOT (process.parent.executable:(C\\:\\\\Windows\\\\System32\\\\Dism.exe OR C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe) OR process.parent.executable:(*\\\\WebEx\\\\WebexHost.exe OR *\\\\thor\\\\thor64.exe) OR process.pe.product:InstallShield\\ \\(R\\) OR process.pe.description:InstallShield\\ \\(R\\)\\ Setup\\ Engine OR process.pe.company:InstallShield\\ Software\\ Corporation)))`"}
