{"id":"f64e5c19-879c-4bae-b471-6d84c8339677","created_by":"Cian Heasley, Florian Roth","name":"Webshell Recon Detection Via CommandLine & Processes","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Detects processes spawned from web servers (php, tomcat, iis...etc) that perform reconnaissance looking for the existence of popular scripting tools (perl, python, wget) on the system via the help commands","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Dd][Dd][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss]_[Tt][Oo][Mm][Cc][Aa][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.executable:(/.*\\-[Tt][Oo][Mm][Cc][Aa][Tt]\\-.*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/)) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]\\.[Jj][Aa][Rr].*/ OR /.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]_[Hh][Oo][Mm][Ee].*/))) AND process.command_line:(/.*[Pp][Ee][Rr][Ll]\\ \\-\\-[Hh][Ee][Ll][Pp].*/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]\\ \\-\\-[Hh][Ee][Ll][Pp].*/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]\\ \\-[Hh].*/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]3\\ \\-\\-[Hh][Ee][Ll][Pp].*/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]3\\ \\-[Hh].*/ OR /.*[Ww][Gg][Ee][Tt]\\ \\-\\-[Hh][Ee][Ll][Pp].*/ OR /.*[Pp][Ee][Rr][Ll]\\ \\-[Hh].*/))","rule_id":"f64e5c19-879c-4bae-b471-6d84c8339677","timestamp_override":"event.ingested","references":["https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe OR *\\\\caddy.exe OR *\\\\ws_tomcatservice.exe) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.executable:(*\\-tomcat\\-* OR *\\\\tomcat*)) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.command_line:(*catalina.jar* OR *CATALINA_HOME*))) AND process.command_line:(*perl\\ \\-\\-help* OR *python\\ \\-\\-help* OR *python\\ \\-h* OR *python3\\ \\-\\-help* OR *python3\\ \\-h* OR *wget\\ \\-\\-help* OR *perl\\ \\-h*))`"}
