{"id":"04d9079e-3905-4b70-ad37-6bdf11304965","created_by":"Markus Neis","name":"CrackMapExecWin","tags":["attack.g0035","attack.credential_access","attack.discovery","attack.t1110","attack.t1087"],"interval":"5m","description":"Detects CrackMapExecWin Activity as Described by NCSC","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Cc][Rr][Aa][Cc][Kk][Mm][Aa][Pp][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/","rule_id":"04d9079e-3905-4b70-ad37-6bdf11304965","timestamp_override":"event.ingested","references":["https://www.ncsc.gov.uk/alerts/hostile-state-actors-compromising-uk-organisations-focus-engineering-and-industrial-control","https://attack.mitre.org/software/S0488/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\crackmapexec.exe`"}
