{"id":"43f487f0-755f-4c2a-bce7-d6d2eec2fcf8","created_by":"frack113","name":"Suspicious Add Scheduled Task From User AppData Temp","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"schtasks.exe create task from user AppData\\Local\\Temp","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/) AND (NOT ((process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ \\/[Tt][Nn]\\ \\\"[Kk][Ll][Cc][Pp]_[Uu][Pp][Dd][Aa][Tt][Ee]\\\"\\ \\/[Xx][Mm][Ll]\\ .*/ AND process.command_line:/.*\\\\[Kk][Ll][Cc][Pp]_[Uu][Pp][Dd][Aa][Tt][Ee]_[Tt][Aa][Ss][Kk]\\.[Xx][Mm][Ll].*/))))","rule_id":"43f487f0-755f-4c2a-bce7-d6d2eec2fcf8","timestamp_override":"event.ingested","references":["malware analyse https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create\\ * AND process.command_line:*\\\\AppData\\\\Local\\\\Temp*) AND (NOT ((process.command_line:*\\/Create\\ \\/TN\\ \\\"klcp_update\\\"\\ \\/XML\\ * AND process.command_line:*\\\\klcp_update_task.xml*))))`"}
