{"id":"932fb0d8-692b-4b0f-a26e-5643a50fe7d6","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Audio Capture via PowerShell","tags":["attack.collection","attack.t1123"],"interval":"5m","description":"Detects audio capture via PowerShell Cmdlet.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate audio capture by legitimate user."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Uu][Dd][Ii][Oo][Dd][Ee][Vv][Ii][Cc][Ee]\\-[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\-[Cc][Mm][Dd][Ll][Ee][Tt].*/","rule_id":"932fb0d8-692b-4b0f-a26e-5643a50fe7d6","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1123/T1123.md","https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*WindowsAudioDevice\\-Powershell\\-Cmdlet*`"}
