{"id":"34ebb878-1b15-4895-b352-ca2eeb99b274","created_by":"frack113","name":"Suspicious Execution of Shutdown","tags":["attack.impact","attack.t1529"],"interval":"5m","description":"Use of the commandline to shutdown or reboot windows","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\/[Rr]\\ .*/ OR /.*\\/[Ss]\\ .*/))","rule_id":"34ebb878-1b15-4895-b352-ca2eeb99b274","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\shutdown.exe AND process.command_line:(*\\/r\\ * OR *\\/s\\ *))`"}
