{"id":"30e92f50-bb5a-4884-98b5-d20aa80f3d7a","created_by":"frack113","name":"Hidden Powershell in Link File Pattern","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects events that appear when a user click on a link file with a powershell command in it","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate commands in .lnk files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:/.*\\.[Ll][Nn][Kk].*/)","rule_id":"30e92f50-bb5a-4884-98b5-d20aa80f3d7a","timestamp_override":"event.ingested","references":["https://www.x86matthew.com/view_post?id=embed_exe_lnk"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:C\\:\\\\Windows\\\\explorer.exe AND process.executable:C\\:\\\\Windows\\\\System32\\\\cmd.exe AND process.command_line:*powershell* AND process.command_line:*.lnk*)`"}
