{"id":"4782eb5a-a513-4523-a0ac-f3082b26ac5c","created_by":"Nasreddine Bencherchali","name":"Mshtml DLL RunHTMLApplication Abuse","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious command line using the \"mshtml.dll\" RunHTMLApplication export to run arbitrary code via different protocol handlers (vbscript, javascript, file, htpp...)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\\\.\\.\\\\.*/ AND process.command_line:/.*[Mm][Ss][Hh][Tt][Mm][Ll].*/ AND process.command_line:/.*[Rr][Uu][Nn][Hh][Tt][Mm][Ll][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/)","rule_id":"4782eb5a-a513-4523-a0ac-f3082b26ac5c","timestamp_override":"event.ingested","references":["https://twitter.com/n1nj4sec/status/1421190238081277959"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\..\\\\* AND process.command_line:*mshtml* AND process.command_line:*RunHTMLApplication*)`"}
