{"id":"a7c3d773-caef-227e-a7e7-c2f13c622329","created_by":"Oleg Kolesnikov @securonix invrep_de, oscd.community, Florian Roth, Christian Burkard","name":"Bad Opsec Defaults Sacrificial Processes With Improper Arguments","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects attackers using tooling with bad opsec defaults e.g. spawning a sacrificial process to inject a capability into the process without taking into account how the process is normally run, one trivial example of this is using rundll32.exe without arguments as a sacrificial process (default in CS, now highlighted by c2lint), running WerFault without arguments (Kraken - credit am0nsec), and other examples.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/))","rule_id":"a7c3d773-caef-227e-a7e7-c2f13c622329","timestamp_override":"event.ingested","references":["https://blog.malwarebytes.com/malwarebytes-news/2020/10/kraken-attack-abuses-wer-service/","https://www.cobaltstrike.com/help-opsec","https://twitter.com/CyberRaiju/status/1251492025678983169","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32","https://docs.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool","https://docs.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-net-services-installation-tool#feedback"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\WerFault.exe AND process.command_line:*WerFault.exe) OR (process.executable:*\\\\rundll32.exe AND process.command_line:*rundll32.exe) OR (process.executable:*\\\\regsvcs.exe AND process.command_line:*regsvcs.exe) OR (process.executable:*\\\\regasm.exe AND process.command_line:*regasm.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*regsvr32.exe))`"}
