{"id":"347906f3-e207-4d18-ae5b-a9403d6bcdef","created_by":"frack113","name":"Netsh Allow Group Policy on Microsoft Defender Firewall","tags":["attack.defense_evasion","attack.t1562.004"],"interval":"5m","description":"Adversaries may  modify system firewalls in order to bypass controls limiting network usage","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Ss][Ee][Tt].*/ AND process.command_line:/.*[Rr][Uu][Ll][Ee].*/ AND process.command_line:/.*[Gg][Rr][Oo][Uu][Pp]\\=.*/ AND process.command_line:/.*[Nn][Ee][Ww].*/ AND process.command_line:/.*[Ee][Nn][Aa][Bb][Ll][Ee]\\=[Yy][Ee][Ss].*/)","rule_id":"347906f3-e207-4d18-ae5b-a9403d6bcdef","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall","https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\netsh.exe AND process.command_line:*advfirewall* AND process.command_line:*firewall* AND process.command_line:*set* AND process.command_line:*rule* AND process.command_line:*group\\=* AND process.command_line:*new* AND process.command_line:*enable\\=Yes*)`"}
