{"id":"63de06b9-a385-40b5-8b32-73f2b9ef84b6","created_by":"Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'","name":"Fsutil Drive Enumeration","tags":["attack.peripheral_device_discovery","attack.t1120"],"interval":"5m","description":"Attackers may leverage fsutil to enumerated connected drives.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Certain software or administrative tasks may trigger false positives."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Dd][Rr][Ii][Vv][Ee][Ss].*/)","rule_id":"63de06b9-a385-40b5-8b32-73f2b9ef84b6","timestamp_override":"event.ingested","references":["Turla has used fsutil fsinfo drives to list connected drives. https://attack.mitre.org/techniques/T1120/","https://github.com/elastic/detection-rules/blob/414d32027632a49fb239abb8fbbb55d3fa8dd861/rules/windows/discovery_peripheral_device.toml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\fsutil.exe OR process.pe.original_file_name:fsutil.exe) AND process.command_line:*drives*)`"}
