{"id":"42b1a5b8-353f-4f10-b256-39de4467faff","created_by":"Andreas Hunkeler (@Karneades), oscd.community","name":"Harvesting of Wifi Credentials Using netsh.exe","tags":["attack.discovery","attack.credential_access","attack.t1040"],"interval":"5m","description":"Detect the harvesting of wifi credentials using netsh.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrator or user uses netsh.exe wlan functionality for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ww][Ll][Aa][Nn].*/ AND process.command_line:/.*\\ [Ss].*/ AND process.command_line:/.*\\ [Pp].*/ AND process.command_line:/.*\\ [Kk].*/ AND process.command_line:/.*\\=[Cc][Ll][Ee][Aa][Rr].*/)","rule_id":"42b1a5b8-353f-4f10-b256-39de4467faff","timestamp_override":"event.ingested","references":["https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\netsh.exe AND process.command_line:*wlan* AND process.command_line:*\\ s* AND process.command_line:*\\ p* AND process.command_line:*\\ k* AND process.command_line:*\\=clear*)`"}
