{"id":"515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48","created_by":"Florian Roth, Nasreddine Bencherchali","name":"CreateDump Process Dump","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects uses of the createdump.exe LOLOBIN utility to dump process memory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Command lines that use the same flags"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Rr][Ee][Aa][Tt][Ee][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ff][Xx]_[Vv][Ee][Rr]_[Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Nn][Aa][Mm][Ee]_[Ss][Tt][Rr]/) AND process.command_line:(/.*\\ \\-[Uu]\\ .*/ OR /.*\\ \\-\\-[Ff][Uu][Ll][Ll]\\ .*/ OR /.*\\ \\-[Ff]\\ .*/ OR /.*\\ \\-\\-[Nn][Aa][Mm][Ee]\\ .*/ OR /.*\\.[Dd][Mm][Pp]\\ .*/))","rule_id":"515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/","https://twitter.com/bopin2020/status/1366400799199272960"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\createdump.exe OR process.pe.original_file_name:FX_VER_INTERNALNAME_STR) AND process.command_line:(*\\ \\-u\\ * OR *\\ \\-\\-full\\ * OR *\\ \\-f\\ * OR *\\ \\-\\-name\\ * OR *.dmp\\ *))`"}
