{"id":"66c3b204-9f88-4d0a-a7f7-8a57d521ca55","created_by":"Florian Roth","name":"Windows Crypto Mining Indicators","tags":["attack.impact","attack.t1496"],"interval":"5m","description":"Detects command line parameters or strings often used by crypto miners","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of crypto miners","Some build frameworks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ \\-\\-[Cc][Pp][Uu]\\-[Pp][Rr][Ii][Oo][Rr][Ii][Tt][Yy]\\=.*/ OR /.*\\-\\-[Dd][Oo][Nn][Aa][Tt][Ee]\\-[Ll][Ee][Vv][Ee][Ll]\\=0.*/ OR /.*\\ \\-[Oo]\\ [Pp][Oo][Oo][Ll]\\..*/ OR /.*\\ \\-\\-[Nn][Ii][Cc][Ee][Hh][Aa][Ss][Hh].*/ OR /.*\\ \\-\\-[Aa][Ll][Gg][Oo]\\=[Rr][Xx]\\/0\\ .*/ OR /.*[Ss][Tt][Rr][Aa][Tt][Uu][Mm]\\+[Tt][Cc][Pp]\\:\\/\\/.*/ OR /.*[Ss][Tt][Rr][Aa][Tt][Uu][Mm]\\+[Uu][Dd][Pp]\\:\\/\\/.*/ OR /.*[Ll][Ss]1[Kk][Bb]25[Hh][Dd][Gg][Uu][Tt][Bb][Gg][Vv]2[Zz][Ww][Ww]9.*/ OR /.*0[Tt][Zz][Gg]9[Uu][Yy][Xx][Rr][Ll][Ll][Ww][Xx][Ll][Dd][Mm][Vv][Ss][Pp].*/ OR /.*[Tt][Ll][Ww][Rr][Vv][Bb][Mm][Ff]0[Zz][Ss]1[Ss][Zz][Xx][Zz][Ll][Bb][Dd].*/ OR /.*[Cc]3[Rr][Yy][Yy][Xx][Rr]1[Bb][Ss][Tt]0[Yy]3[Aa]6[Ll][Yy].*/ OR /.*[Nn]0[Cc][Mm][Ff]0[Dd][Ww]0[Rr][Dd][Gg][Nn][Ww][Oo][Ii]8[Vv].*/ OR /.*[Zz][Dd][Hh][Jj][Hh][Dd][Hh][Vv][Tt][Kk]3[Rr][Jj][Cc][Dd][Oo][Vv][Ll].*/ OR /.*[Cc]3[Rr][Yy][Yy][Xx][Rr]1[Bb][Ss][Tt]1[Zz][Hh][Aa]6[Ll][Yy].*/ OR /.*[Nn]0[Cc][Mm][Ff]0[Dd][Ww]0[Rr][Dd][Ww][Rr][Ww][Oo][Ii]8[Vv].*/ OR /.*[Zz][Dd][Hh][Jj][Hh][Dd][Hh][Vv][Tt][Kk]3[Vv][Kk][Cc][Dd][Oo][Vv][Ll].*/) AND (NOT (process.command_line:(/.*\\ [Pp][Oo][Oo][Ll]\\.[Cc]\\ .*/ OR /.*\\ [Pp][Oo][Oo][Ll]\\.[Oo]\\ .*/ OR /.*[Gg][Cc][Cc]\\ \\-.*/))))","rule_id":"66c3b204-9f88-4d0a-a7f7-8a57d521ca55","timestamp_override":"event.ingested","references":["https://www.poolwatch.io/coin/monero"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ \\-\\-cpu\\-priority\\=* OR *\\-\\-donate\\-level\\=0* OR *\\ \\-o\\ pool.* OR *\\ \\-\\-nicehash* OR *\\ \\-\\-algo\\=rx\\/0\\ * OR *stratum\\+tcp\\:\\/\\/* OR *stratum\\+udp\\:\\/\\/* OR *LS1kb25hdGUtbGV2ZWw9* OR *0tZG9uYXRlLWxldmVsP* OR *tLWRvbmF0ZS1sZXZlbD* OR *c3RyYXR1bSt0Y3A6Ly* OR *N0cmF0dW0rdGNwOi8v* OR *zdHJhdHVtK3RjcDovL* OR *c3RyYXR1bSt1ZHA6Ly* OR *N0cmF0dW0rdWRwOi8v* OR *zdHJhdHVtK3VkcDovL*) AND (NOT (process.command_line:(*\\ pool.c\\ * OR *\\ pool.o\\ * OR *gcc\\ \\-*))))`"}
