{"id":"d522eca2-2973-4391-a3e0-ef0374321dae","created_by":"Semanur Guneysu @semanurtg, oscd.community","name":"Abused Debug Privilege by Arbitrary Parent Processes","tags":["attack.privilege_escalation","attack.t1548"],"interval":"5m","description":"Detection of unusual child processes by different system processes","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Aa][Rr][Cc][Hh][Ii][Nn][Dd][Ee][Xx][Ee][Rr]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)) AND (NOT (process.command_line:/.*\\ [Rr][Oo][Uu][Tt][Ee]\\ .*/ AND process.command_line:/.*\\ [Aa][Dd][Dd]\\ .*/)))","rule_id":"d522eca2-2973-4391-a3e0-ef0374321dae","timestamp_override":"event.ingested","references":["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-74-638.jpg"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\winlogon.exe OR *\\\\services.exe OR *\\\\lsass.exe OR *\\\\csrss.exe OR *\\\\smss.exe OR *\\\\wininit.exe OR *\\\\spoolsv.exe OR *\\\\searchindexer.exe) AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe) AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)) AND (NOT (process.command_line:*\\ route\\ * AND process.command_line:*\\ ADD\\ *)))`"}
