{"id":"2158f96f-43c2-43cb-952a-ab4580f32382","created_by":"Beyu Denis, oscd.community","name":"Psr.exe Capture Screenshots","tags":["attack.collection","attack.t1113"],"interval":"5m","description":"The psr.exe captures desktop screenshots and saves them on the local machine","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Ss][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ss][Tt][Aa][Rr][Tt].*/)","rule_id":"2158f96f-43c2-43cb-952a-ab4580f32382","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Psr/","https://www.sans.org/summit-archives/file/summit-archive-1493861893.pdf","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\Psr.exe AND process.command_line:*\\/start*)`"}
