{"id":"5bb68627-3198-40ca-b458-49f973db8752","created_by":"Bartlomiej Czyz, Relativity","name":"Rundll32 Without Parameters","tags":["attack.lateral_movement","attack.t1021.002","attack.t1570","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects rundll32 execution without parameters as observed when running Metasploit windows/smb/psexec exploit module","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/","rule_id":"5bb68627-3198-40ca-b458-49f973db8752","timestamp_override":"event.ingested","references":["https://bczyz1.github.io/2021/01/30/psexec.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:rundll32.exe`"}
