{"id":"40b19fa6-d835-400c-b301-41f3a2baacaf","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Shadow Copies Access via Symlink","tags":["attack.credential_access","attack.t1003.002","attack.t1003.003"],"interval":"5m","description":"Shadow Copies storage symbolic link creation using operating systems utilities","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrator working with shadow copies, access for backup purposes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Mm][Kk][Ll][Ii][Nn][Kk].*/ AND process.command_line:/.*[Hh][Aa][Rr][Dd][Dd][Ii][Ss][Kk][Vv][Oo][Ll][Uu][Mm][Ee][Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/)","rule_id":"40b19fa6-d835-400c-b301-41f3a2baacaf","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*mklink* AND process.command_line:*HarddiskVolumeShadowCopy*)`"}
