{"id":"fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c","created_by":"Florian Roth","name":"Encoded FromBase64String","tags":["attack.defense_evasion","attack.t1140","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a base64 encoded FromBase64String keyword in a process command line","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Oo][Jj][Pp][Gg][Cc][Mm]9[Tt][Qq][Mm][Ff][Zz][Zz][Tt][Yy]0[Uu]3[Rr][Yy][Aa][Ww]5[Nn].*/ OR /.*[Oo]6[Rr][Nn][Jj][Vv][Bb][Uu][Jj][Hh][Cc]2[Uu]2[Nn][Ff][Nn]0[Cc][Mm][Ll][Uu][Zz].*/ OR /.*6[Oo][Kk][Zz][Yy][Bb]21[Cc][Yy][Xx][Nn][Ll][Nn][Jj][Rr][Tt][Dd][Hh][Jj][Pp][Bb][Mm].*/) OR process.command_line:(/.*[Oo][Gg][Aa]6[Aa][Ee][Yy][Aa][Cc][Gg][Bb][Vv][Aa][Gg]0[Aa][Qq][Gg][Bb][Hh][Aa][Hh][Mm][Aa][Zz][Qq][Aa]2[Aa][Dd][Qq][Aa][Uu][Ww][Bb]0[Aa][Hh][Ii][Aa][Aa][Qq][Bb][Uu][Aa][Gg][Cc][Aa].*/ OR /.*[Oo][Aa][Oo][Gg][Bb][Gg][Aa][Hh][Ii][Aa][Bb][Ww][Bb][Tt][Aa][Ee][Ii][Aa][Yy][Qq][Bb][Zz][Aa][Gg][Uu][Aa][Nn][Gg][Aa]0[Aa][Ff][Mm][Aa][Dd][Aa][Bb][Yy][Aa][Gg][Kk][Aa][Bb][Gg][Bb][Nn][Aa].*/ OR /.*6[Aa][Dd][Oo][Aa][Rr][Gg][Bb][Yy][Aa][Gg]8[Aa][Bb][Qq][Bb][Cc][Aa][Gg][Ee][Aa][Cc][Ww][Bb][Ll][Aa][Dd][Yy][Aa][Nn][Aa][Bb][Tt][Aa][Hh][Qq][Aa][Cc][Gg][Bb][Pp][Aa][Gg]4[Aa][Zz][Ww].*/))","rule_id":"fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*OjpGcm9tQmFzZTY0U3RyaW5n* OR *o6RnJvbUJhc2U2NFN0cmluZ* OR *6OkZyb21CYXNlNjRTdHJpbm*) OR process.command_line:(*OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA* OR *oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA* OR *6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw*))`"}
