{"id":"0ba863e6-def5-4e50-9cea-4dd8c7dc46a4","created_by":"Kyaw Min Thein, Furkan Caliskan (@caliskanfurkan_)","name":"Control Panel Items","tags":["attack.execution","attack.defense_evasion","attack.t1218.002","attack.persistence","attack.t1546"],"interval":"5m","description":"Detects the malicious use of a control panel item","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Cc][Pp][Ll][Ss].*/) OR (process.command_line:/.*\\.[Cc][Pp][Ll]/ AND (NOT ((process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*%[Ss][Yy][Ss][Tt][Ee][Mm]%.*/)) OR (process.command_line:/.*[Rr][Ee][Gg][Ss][Vv][Rr]32\\ .*/ AND process.command_line:/.*\\ \\/[Ss]\\ .*/ AND process.command_line:/.*[Ii][Gg][Ff][Xx][Cc][Pp][Ll]\\.[Cc][Pp][Ll].*/)))))","rule_id":"0ba863e6-def5-4e50-9cea-4dd8c7dc46a4","timestamp_override":"event.ingested","references":["https://attack.mitre.org/techniques/T1196/","https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe AND process.command_line:*add* AND process.command_line:*CurrentVersion\\\\Control\\ Panel\\\\CPLs*) OR (process.command_line:*.cpl AND (NOT ((process.command_line:(*\\\\System32\\\\* OR *%System%*)) OR (process.command_line:*regsvr32\\ * AND process.command_line:*\\ \\/s\\ * AND process.command_line:*igfxCPL.cpl*)))))`"}
