{"id":"62e0298b-e994-4189-bc87-bc699aa62d97","created_by":"frack113, Nasreddine Bencherchali","name":"Imports Registry Key From a File Using Reg.exe","tags":["attack.t1112","attack.defense_evasion"],"interval":"5m","description":"Detects the import of the '.reg' files from suspicious paths using the 'reg.exe' utility","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate import of keys"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ [Ii][Mm][Pp][Oo][Rr][Tt]\\ .*/ AND process.command_line:(/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/))","rule_id":"62e0298b-e994-4189-bc87-bc699aa62d97","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:*\\ import\\ * AND process.command_line:(*C\\:\\\\Users\\\\* OR *%temp%* OR *%appdata%* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\Temp\\\\* OR *C\\:\\\\ProgramData\\\\*))`"}
