{"id":"c1d867fe-8d95-4487-aab4-e53f2d339f90","created_by":"Florian Roth","name":"Renamed Sysinternals Sdelete Usage","tags":["attack.impact","attack.t1485"],"interval":"5m","description":"Detects the use of a renamed SysInternals Sdelete, which is something an administrator shouldn't do (the renaming)","risk_score":73,"enabled":true,"severity":"high","false_positives":["System administrator usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Ss][Dd][Ee][Ll][Ee][Tt][Ee]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Ss][Dd][Ee][Ll][Ee][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Dd][Ee][Ll][Ee][Tt][Ee]64\\.[Ee][Xx][Ee]/))))","rule_id":"c1d867fe-8d95-4487-aab4-e53f2d339f90","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:sdelete.exe AND (NOT (process.executable:(*\\\\sdelete.exe OR *\\\\sdelete64.exe))))`"}
