{"id":"f14e169e-9978-4c69-acb3-1cff8200bc36","created_by":"Florian Roth","name":"Suspicious GrpConv Execution","tags":["attack.persistence","attack.t1547"],"interval":"5m","description":"Detects the suspicious execution of a utility to convert Windows 3.x .grp files or for persistence purposes by malicious software or actors","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Gg][Rr][Pp][Cc][Oo][Nn][Vv]\\.[Ee][Xx][Ee]\\ \\-[Oo].*/ OR /.*[Gg][Rr][Pp][Cc][Oo][Nn][Vv]\\ \\-[Oo].*/)","rule_id":"f14e169e-9978-4c69-acb3-1cff8200bc36","timestamp_override":"event.ingested","references":["https://twitter.com/0gtweet/status/1526833181831200770"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*grpconv.exe\\ \\-o* OR *grpconv\\ \\-o*)`"}
