{"id":"883835a7-df45-43e4-bf1d-4268768afda4","created_by":"Florian Roth","name":"Regedit as Trusted Installer","tags":["attack.privilege_escalation","attack.t1548"],"interval":"5m","description":"Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Hh][Aa][Cc][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/))","rule_id":"883835a7-df45-43e4-bf1d-4268768afda4","timestamp_override":"event.ingested","references":["https://twitter.com/1kwpeter/status/1397816101455765504"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\regedit.exe AND process.parent.executable:(*\\\\TrustedInstaller.exe OR *\\\\ProcessHacker.exe))`"}
