{"id":"1a70042a-6622-4a2b-8958-267625349abf","created_by":"frack113","name":"Run from a Zip File","tags":["attack.impact","attack.t1485"],"interval":"5m","description":"Payloads may be compressed, archived, or encrypted in order to avoid detection","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\.[Zz][Ii][Pp]\\\\.*/","rule_id":"1a70042a-6622-4a2b-8958-267625349abf","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-4---execution-from-compressed-file"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*.zip\\\\*`"}
