{"id":"a0459f02-ac51-4c09-b511-b8c9203fc429","created_by":"oscd.community, Natalia Shornikova","name":"Execution via CL_Invocation.ps1","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects Execution via SyncInvoke in CL_Invocation.ps1 module","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Ll]_[Ii][Nn][Vv][Oo][Cc][Aa][Tt][Ii][Oo][Nn]\\.[Pp][Ss]1.*/ AND process.command_line:/.*[Ss][Yy][Nn][Cc][Ii][Nn][Vv][Oo][Kk][Ee].*/)","rule_id":"a0459f02-ac51-4c09-b511-b8c9203fc429","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/","https://twitter.com/bohops/status/948061991012327424"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*CL_Invocation.ps1* AND process.command_line:*SyncInvoke*)`"}
