{"id":"ffa6861c-4461-4f59-8a41-578c39f3f23e","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community","name":"LSASS Memory Dumping","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detect creation of dump files containing the memory space of lsass.exe, which contains sensitive credentials. Identifies usage of Sysinternals procdump.exe to export the memory space of lsass.exe which contains sensitive credentials.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Ll][Ss][Aa][Ss][Ss].*/ AND process.command_line:/.*\\.[Dd][Mm][Pp].*/) AND (NOT (process.executable:/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/))) OR (process.executable:/.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/ AND process.executable:/.*\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ll][Ss][Aa][Ss][Ss].*/))","rule_id":"ffa6861c-4461-4f59-8a41-578c39f3f23e","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/1e1ef6be-12fc-11e9-8d76-4d6bb837cda4.html","https://eqllib.readthedocs.io/en/latest/analytics/210b4ea4-12fc-11e9-8d76-4d6bb837cda4.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*lsass* AND process.command_line:*.dmp*) AND (NOT (process.executable:*\\\\werfault.exe))) OR (process.executable:*\\\\procdump* AND process.executable:*.exe AND process.command_line:*lsass*))`"}
