{"id":"ba1f7802-adc7-48b4-9ecb-81e227fddfd5","created_by":"Timur Zinniatullin, oscd.community","name":"Network Sniffing","tags":["attack.credential_access","attack.discovery","attack.t1040"],"interval":"5m","description":"Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection. An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Admin activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Tt][Ss][Hh][Aa][Rr][Kk]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ii].*/) OR process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/)","rule_id":"ba1f7802-adc7-48b4-9ecb-81e227fddfd5","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\tshark.exe AND process.command_line:*\\-i*) OR process.executable:*\\\\windump.exe)`"}
