{"id":"9637e8a5-7131-4f7f-bdc7-2b05d8670c43","created_by":"Markus Neis, Sander Wiebing","name":"Suspicious File Characteristics Due to Missing Fields","tags":["attack.execution","attack.t1059.006"],"interval":"5m","description":"Detects Executables in the Downloads folder without FileVersion,Description,Product,Company likely created with py2exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((process.pe.description:\\? AND process.pe.file_version:\\?) OR (process.pe.description:\\? AND process.pe.product:\\?)) OR (process.pe.description:\\? AND process.pe.company:\\?)) AND process.executable:/.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/)","rule_id":"9637e8a5-7131-4f7f-bdc7-2b05d8670c43","timestamp_override":"event.ingested","references":["https://securelist.com/muddywater/88059/","https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((process.pe.description:\\? AND process.pe.file_version:\\?) OR (process.pe.description:\\? AND process.pe.product:\\?)) OR (process.pe.description:\\? AND process.pe.company:\\?)) AND process.executable:*\\\\Downloads\\\\*)`"}
