{"id":"ad720b90-25ad-43ff-9b5e-5c841facc8e5","created_by":"Florian Roth, Nasreddine Bencherchali","name":"Add User to Local Administrators","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"Detects suspicious command line that adds an account to the local administrators/administrateurs group","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp]\\ .*/ AND process.command_line:/.*\\ \\/[Aa][Dd][Dd].*/) OR (process.command_line:/.*[Aa][Dd][Dd]\\-[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp][Mm][Ee][Mm][Bb][Ee][Rr]\\ .*/ AND process.command_line:/.*\\ \\-[Gg][Rr][Oo][Uu][Pp]\\ .*/)) AND process.command_line:(/.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr][Ss]\\ .*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ee][Uu][Rr].*/))","rule_id":"ad720b90-25ad-43ff-9b5e-5c841facc8e5","timestamp_override":"event.ingested","references":["https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*localgroup\\ * AND process.command_line:*\\ \\/add*) OR (process.command_line:*Add\\-LocalGroupMember\\ * AND process.command_line:*\\ \\-Group\\ *)) AND process.command_line:(*\\ administrators\\ * OR *\\ administrateur*))`"}
