{"id":"18cf6cf0-39b0-4c22-9593-e244bdc9a2d4","created_by":"Florian Roth","name":"TA505 Dropper Load Pattern","tags":["attack.execution","attack.g0092","attack.t1106"],"interval":"5m","description":"Detects mshta loaded by wmiprvse as parent as used by TA505 malicious documents","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND (process.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/))","rule_id":"18cf6cf0-39b0-4c22-9593-e244bdc9a2d4","timestamp_override":"event.ingested","references":["https://twitter.com/ForensicITGuy/status/1334734244120309760"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\wmiprvse.exe AND (process.executable:*\\\\mshta.exe OR process.pe.original_file_name:mshta.exe))`"}
