{"id":"15619216-e993-4721-b590-4c520615a67d","created_by":"Teymur Kheirkhabarov, Ecco, Florian Roth","name":"Meterpreter or Cobalt Strike Getsystem Service Start","tags":["attack.privilege_escalation","attack.t1134.001","attack.t1134.002"],"interval":"5m","description":"Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service starting","risk_score":73,"enabled":true,"severity":"high","false_positives":["Commandlines containing components like cmd accidentally","Jobs and services started with cmd"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ AND ((process.command_line:/.*[Cc][Mm][Dd].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Ee][Cc][Hh][Oo].*/ AND process.command_line:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (process.command_line:/.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Ee][Cc][Hh][Oo].*/ AND process.command_line:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Ee][Cc][Hh][Oo].*/ AND process.command_line:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*\\.[Dd][Ll][Ll],[Aa].*/ AND process.command_line:/.*\\/[Pp]\\:.*/))) AND (NOT (process.command_line:/.*[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn].*/)))","rule_id":"15619216-e993-4721-b590-4c520615a67d","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\services.exe AND ((process.command_line:*cmd* AND process.command_line:*\\/c* AND process.command_line:*echo* AND process.command_line:*\\\\pipe\\\\*) OR (process.command_line:*%COMSPEC%* AND process.command_line:*\\/c* AND process.command_line:*echo* AND process.command_line:*\\\\pipe\\\\*) OR (process.command_line:*cmd.exe* AND process.command_line:*\\/c* AND process.command_line:*echo* AND process.command_line:*\\\\pipe\\\\*) OR (process.command_line:*rundll32* AND process.command_line:*.dll,a* AND process.command_line:*\\/p\\:*))) AND (NOT (process.command_line:*MpCmdRun*)))`"}
