{"id":"6640f31c-01ad-49b5-beb5-83498a5cd8bd","created_by":"Nasreddine Bencherchali","name":"Node.exe Process Abuse","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Detects the execution node.exe which is shipped with multiple softwares such as VMware, Adobe...etc. In order to execute arbitrary code. For example to establish reverse shell as seen in Log4j attacks...etc","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\-[Ee]\\ .*/ OR /.*\\ \\-\\-[Ee][Vv][Aa][Ll]\\ .*/) AND process.command_line:/.*\\.[Ee][Xx][Ee][Cc]\\(.*/ AND process.command_line:/.*[Nn][Ee][Tt]\\.[Ss][Oo][Cc][Kk][Ee][Tt].*/ AND process.command_line:/.*\\.[Cc][Oo][Nn][Nn][Ee][Cc][Tt].*/ AND process.command_line:/.*[Cc][Hh][Ii][Ll][Dd]_[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/)","rule_id":"6640f31c-01ad-49b5-beb5-83498a5cd8bd","timestamp_override":"event.ingested","references":["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html","https://www.sprocketsecurity.com/resources/crossing-the-log4j-horizon-a-vulnerability-with-no-return","https://www.rapid7.com/blog/post/2022/01/18/active-exploitation-of-vmware-horizon-servers/","https://nodejs.org/api/cli.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\node.exe AND process.command_line:(*\\ \\-e\\ * OR *\\ \\-\\-eval\\ *) AND process.command_line:*.exec\\(* AND process.command_line:*net.socket* AND process.command_line:*.connect* AND process.command_line:*child_process*)`"}
