{"id":"1775e15e-b61b-4d14-a1a3-80981298085a","created_by":"Florian Roth","name":"Suspicious Rundll32 Without Any CommandLine Params","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects suspicious start of rundll32.exe without any parameters as found in CobaltStrike beacon activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible but rare"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND (NOT (process.parent.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))) AND (NOT (process.parent.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\.*/))))","rule_id":"1775e15e-b61b-4d14-a1a3-80981298085a","timestamp_override":"event.ingested","references":["https://www.cobaltstrike.com/help-opsec"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\\\rundll32.exe AND (NOT (process.parent.executable:*\\\\svchost.exe))) AND (NOT (process.parent.executable:(*\\\\AppData\\\\Local\\\\* OR *\\\\Microsoft\\\\Edge\\\\*))))`"}
