{"id":"b17ea6f7-6e90-447e-a799-e6c0a493d6ce","created_by":"Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community","name":"Shadow Copies Creation Using Operating Systems Utilities","tags":["attack.credential_access","attack.t1003","attack.t1003.002","attack.t1003.003"],"interval":"5m","description":"Shadow Copies creation using operating systems utilities, possible credential access","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrator working with shadow copies, access for backup purposes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ss][Hh][Aa][Dd][Oo][Ww].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/)","rule_id":"b17ea6f7-6e90-447e-a799-e6c0a493d6ce","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/tutorial-for-ntds-goodness-vssadmin-wmis-ntdsdit-system/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wmic.exe OR *\\\\vssadmin.exe) AND process.command_line:*shadow* AND process.command_line:*create*)`"}
