{"id":"1c0e41cd-21bb-4433-9acc-4a2cd6367b9b","created_by":"Nasreddine Bencherchali","name":"Suspicious Modification Of Scheduled Tasks","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"Detects when an attacker tries to modify an already existing scheduled tasks to run from a suspicious location\nAttackers can create a simple looking task in order to avoid detection on creation as it's often the most focused on\nInstead they modify the task after creation to include their malicious payload\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Cc][Hh][Aa][Nn][Gg][Ee]\\ .*/ AND process.command_line:/.*\\ \\/[Tt][Nn]\\ .*/ AND process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*%[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ OR /.*%[Ll][Oo][Cc][Aa][Ll][Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/) AND process.command_line:(/.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk]\\ .*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll].*/ OR /.*[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee].*/ OR /.*[Bb][Aa][Ss][Hh]\\ .*/ OR /.*[Ss][Cc][Rr][Cc][Oo][Nn][Ss].*/ OR /.*[Ww][Mm][Ii][Cc]\\ .*/ OR /.*[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee].*/ OR /.*[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss].*/ OR /.*[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr].*/ OR /.*[Hh][Hh]\\.[Ee][Xx][Ee].*/ OR /.*[Hh][Hh]\\ .*/))","rule_id":"1c0e41cd-21bb-4433-9acc-4a2cd6367b9b","timestamp_override":"event.ingested","references":["Internal Research","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/Change\\ * AND process.command_line:*\\ \\/TN\\ * AND process.command_line:(*\\\\AppData\\\\Local\\\\Temp* OR *\\\\AppData\\\\Roaming\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\WINDOWS\\\\Temp\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Temporary\\ Internet* OR *C\\:\\\\ProgramData\\\\* OR *C\\:\\\\Perflogs\\\\* OR *%ProgramData%* OR *%appdata%* OR *%comspec%* OR *%localappdata%*) AND process.command_line:(*regsvr32* OR *rundll32* OR *cmd\\ \\/c\\ * OR *cmd\\ \\/k\\ * OR *cmd.exe\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ * OR *powershell* OR *mshta* OR *wscript* OR *cscript* OR *certutil* OR *bitsadmin* OR *bash.exe* OR *bash\\ * OR *scrcons* OR *wmic\\ * OR *wmic.exe* OR *forfiles* OR *scriptrunner* OR *hh.exe* OR *hh\\ *))`"}
