{"id":"bafac3d6-7de9-4dd9-8874-4a1194b493ed","created_by":"Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative","name":"Abusing Print Executable","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Attackers can use print.exe for remote file copy","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Pp][Rr][Ii][Nn][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/[Pp][Rr][Ii][Nn][Tt].*/ AND process.command_line:/.*\\/[Dd].*/ AND process.command_line:/.*\\.[Ee][Xx][Ee].*/) AND (NOT (process.command_line:/.*[Pp][Rr][Ii][Nn][Tt]\\.[Ee][Xx][Ee].*/)))","rule_id":"bafac3d6-7de9-4dd9-8874-4a1194b493ed","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Print/","https://twitter.com/Oddvarmoe/status/985518877076541440"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\print.exe AND process.command_line:print* AND process.command_line:*\\/D* AND process.command_line:*.exe*) AND (NOT (process.command_line:*print.exe*)))`"}
