{"id":"2704ab9e-afe2-4854-a3b1-0c0706d03578","created_by":"Florian Roth","name":"Dumpert Process Dumper","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects the use of Dumpert process dumper, which dumps the lsass.exe process memory","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Very unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"related.hash:/.*09[Dd]278[Ff]9[Dd][Ee]118[Ee][Ff]09163[Cc]6140255[Cc]690.*/","rule_id":"2704ab9e-afe2-4854-a3b1-0c0706d03578","timestamp_override":"event.ingested","references":["https://github.com/outflanknl/Dumpert","https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`related.hash:*09D278F9DE118EF09163C6140255C690*`"}
