{"id":"ada4b0c4-758b-46ac-9033-9004613a150d","created_by":"frack113","name":"Modify Group Policy Settings","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1484.001"],"interval":"5m","description":"Detect malicious GPO modifications can be used to implement many other malicious behaviors.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm].*/ AND process.command_line:(/.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Dd][Cc].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Oo][Ff][Ff][Ss][Ee][Tt][Dd][Cc].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee].*/ OR /.*[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Rr][Ee][Ff][Rr][Ee][Ss][Hh][Tt][Ii][Mm][Ee][Oo][Ff][Ff][Ss][Ee][Tt].*/ OR /.*[Ee][Nn][Aa][Bb][Ll][Ee][Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn].*/ OR /.*[Ss][Hh][Ee][Ll][Ll][Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn][Ll][Ee][Vv][Ee][Ll].*/))","rule_id":"ada4b0c4-758b-46ac-9033-9004613a150d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1484.001/T1484.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe OR process.pe.original_file_name:reg.exe) AND process.command_line:*\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System* AND process.command_line:(*GroupPolicyRefreshTimeDC* OR *GroupPolicyRefreshTimeOffsetDC* OR *GroupPolicyRefreshTime* OR *GroupPolicyRefreshTimeOffset* OR *EnableSmartScreen* OR *ShellSmartScreenLevel*))`"}
