{"id":"eca49c87-8a75-4f13-9c73-a5a29e845f03","created_by":"Victor Sergeev, oscd.community","name":"Suspicious Runscripthelper.exe","tags":["attack.execution","attack.t1059","attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects execution of powershell scripts via Runscripthelper.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Ss][Cc][Rr][Ii][Pp][Tt][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Uu][Rr][Ff][Aa][Cc][Ee][Cc][Hh][Ee][Cc][Kk].*/)","rule_id":"eca49c87-8a75-4f13-9c73-a5a29e845f03","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\Runscripthelper.exe AND process.command_line:*surfacecheck*)`"}
