{"id":"ac175779-025a-4f12-98b0-acdaeb77ea85","created_by":"Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"PowerShell Script Run in AppData","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a suspicious command line execution that invokes PowerShell with reference to an AppData folder","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\\\[Pp][Ww][Ss][Hh].*/ OR /.*[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee].*/) AND process.command_line:/.*\\/[Cc]\\ .*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ AND process.command_line:(/.*[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/))","rule_id":"ac175779-025a-4f12-98b0-acdaeb77ea85","timestamp_override":"event.ingested","references":["https://twitter.com/JohnLaTwC/status/1082851155481288706","https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*powershell.exe* OR *\\\\powershell* OR *\\\\pwsh* OR *pwsh.exe*) AND process.command_line:*\\/c\\ * AND process.command_line:*\\\\AppData\\\\* AND process.command_line:(*Local\\\\* OR *Roaming\\\\*))`"}
