{"id":"647c7b9e-d784-4fda-b9a0-45c565a7b729","created_by":"_pete_0, TheDFIRReport","name":"Operator Bloopers Cobalt Strike Commands","tags":["attack.execution","attack.t1059.003"],"interval":"5m","description":"Detects use of Cobalt Strike commands accidentally entered in the CMD shell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/) AND process.command_line:(/.*[Pp][Ss][Ii][Nn][Jj][Ee][Cc][Tt].*/ OR /.*[Ss][Pp][Aa][Ww][Nn][Aa][Ss].*/ OR /.*[Mm][Aa][Kk][Ee]_[Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee]\\-[Ee][Xx][Ee][Cc].*/ OR /.*[Rr][Ee][Vv]2[Ss][Ee][Ll][Ff].*/ OR /.*[Dd][Cc][Ss][Yy][Nn][Cc].*/ OR /.*[Ll][Oo][Gg][Oo][Nn][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Ss].*/ OR /.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\-[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy].*/ OR /.*[Gg][Ee][Tt][Ss][Yy][Ss][Tt][Ee][Mm].*/) AND process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)","rule_id":"647c7b9e-d784-4fda-b9a0-45c565a7b729","timestamp_override":"event.ingested","references":["https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf","https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/","https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(cmd.exe* OR c\\:\\\\windows\\\\system32\\\\cmd.exe*) AND process.command_line:(*psinject* OR *spawnas* OR *make_token* OR *remote\\-exec* OR *rev2self* OR *dcsync* OR *logonpasswords* OR *execute\\-assembly* OR *getsystem*) AND process.executable:*\\\\cmd.exe)`"}
