{"id":"d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2","created_by":"Florian Roth","name":"Renamed Rundll32.exe Execution","tags":null,"interval":"5m","description":"Detects the execution of rundll32.exe that has been renamed to a different name to avoid detection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/)))","rule_id":"d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2","timestamp_override":"event.ingested","references":["https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:RUNDLL32.EXE AND (NOT (process.executable:*\\\\rundll32.exe)))`"}
