{"id":"3c1b5fb0-c72f-45ba-abd1-4d4c353144ab","created_by":"Max Altgelt","name":"Process Creation Using Sysnative Folder","tags":["attack.t1055"],"interval":"5m","description":"Detects process creation events that use the Sysnative folder (common for CobaltStrike spawns)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Nn][Aa][Tt][Ii][Vv][Ee]\\\\.*/","rule_id":"3c1b5fb0-c72f-45ba-abd1-4d4c353144ab","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:C\\:\\\\Windows\\\\Sysnative\\\\*`"}
