{"id":"5b80a791-ad9b-4b75-bcc1-ad4e1e89c200","created_by":"Florian Roth","name":"Bitsadmin Download File with Suspicious Extension","tags":["attack.defense_evasion","attack.persistence","attack.t1197","attack.s0190","attack.t1036.003"],"interval":"5m","description":"Detects usage of bitsadmin downloading a file with a suspicious extension","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*\\.[Aa][Ss][Aa][Xx].*/ OR /.*\\.[Aa][Ss][Hh][Xx].*/ OR /.*\\.[Aa][Ss][Mm][Xx].*/ OR /.*\\.[Aa][Ss][Pp].*/ OR /.*\\.[Aa][Ss][Pp][Xx].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Ff][Mm].*/ OR /.*\\.[Cc][Gg][Ii].*/ OR /.*\\.[Cc][Hh][Mm].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Gg][Ii][Ff].*/ OR /.*\\.[Jj][Pp][Ee][Gg].*/ OR /.*\\.[Jj][Pp][Gg].*/ OR /.*\\.[Jj][Ss][Pp].*/ OR /.*\\.[Jj][Ss][Pp][Xx].*/ OR /.*\\.[Pp][Nn][Gg].*/ OR /.*\\.[Pp][Ss]1.*/ OR /.*\\.[Pp][Ss][Mm]1.*/ OR /.*\\.[Ss][Cc][Ff].*/ OR /.*\\.[Ss][Cc][Tt].*/ OR /.*\\.[Tt][Xx][Tt].*/ OR /.*\\.[Vv][Bb][Ee].*/ OR /.*\\.[Vv][Bb][Ss].*/ OR /.*\\.[Ww][Aa][Rr].*/ OR /.*\\.[Ww][Ss][Ff].*/ OR /.*\\.[Ww][Ss][Hh].*/ OR /.*\\.[Zz][Ii][Pp].*/ OR /.*\\.[Rr][Aa][Rr].*/ OR /.*\\.[Dd][Ll][Ll].*/))","rule_id":"5b80a791-ad9b-4b75-bcc1-ad4e1e89c200","timestamp_override":"event.ingested","references":["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin","https://isc.sans.edu/diary/22264","https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\bitsadmin.exe AND process.command_line:(*\\ \\/transfer\\ * OR *\\ \\/create\\ * OR *\\ \\/addfile\\ *) AND process.command_line:(*.asax* OR *.ashx* OR *.asmx* OR *.asp* OR *.aspx* OR *.bat* OR *.cfm* OR *.cgi* OR *.chm* OR *.cmd* OR *.gif* OR *.jpeg* OR *.jpg* OR *.jsp* OR *.jspx* OR *.png* OR *.ps1* OR *.psm1* OR *.scf* OR *.sct* OR *.txt* OR *.vbe* OR *.vbs* OR *.war* OR *.wsf* OR *.wsh* OR *.zip* OR *.rar* OR *.dll*))`"}
