{"id":"2dd2c217-bf68-437a-b57c-fe9fd01d5de8","created_by":"Florian Roth","name":"Suspicious Regsvr32 HTTP IP Pattern","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects a certain command line flag combination used by regsvr32 when used to download and register a DLL from a remote address which uses HTTP (not HTTPS) and a IP address and not FQDN","risk_score":73,"enabled":true,"severity":"high","false_positives":["FQDNs that start with a number"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\/[Ss].*/ AND process.command_line:/.*\\ \\/[Uu].*/ AND process.command_line:(/.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/1.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/2.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/3.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/4.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/5.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/6.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/7.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/8.*/ OR /.*\\ \\/[Ii]\\:[Hh][Tt][Tt][Pp]\\:\\/\\/9.*/))","rule_id":"2dd2c217-bf68-437a-b57c-fe9fd01d5de8","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1461041276514623491c19-ps","https://twitter.com/tccontre18/status/1480950986650832903"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\/s* AND process.command_line:*\\ \\/u* AND process.command_line:(*\\ \\/i\\:http\\:\\/\\/1* OR *\\ \\/i\\:http\\:\\/\\/2* OR *\\ \\/i\\:http\\:\\/\\/3* OR *\\ \\/i\\:http\\:\\/\\/4* OR *\\ \\/i\\:http\\:\\/\\/5* OR *\\ \\/i\\:http\\:\\/\\/6* OR *\\ \\/i\\:http\\:\\/\\/7* OR *\\ \\/i\\:http\\:\\/\\/8* OR *\\ \\/i\\:http\\:\\/\\/9*))`"}
