{"id":"ed5d72a6-f8f4-479d-ba79-02f6a80d7471","created_by":"Markus Neis","name":"MSHTA Spwaned by SVCHOST","tags":["attack.defense_evasion","attack.t1218.005"],"interval":"5m","description":"Detects MSHTA.EXE spwaned by SVCHOST as seen in LethalHTA and described in report","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/)","rule_id":"ed5d72a6-f8f4-479d-ba79-02f6a80d7471","timestamp_override":"event.ingested","references":["https://codewhitesec.blogspot.com/2018/07/lethalhta.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\svchost.exe AND process.executable:*\\\\mshta.exe)`"}
