{"id":"208748f7-881d-47ac-a29c-07ea84bf691d","created_by":"Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team","name":"Microsoft Outlook Product Spawning Windows Shell","tags":["attack.execution","attack.t1204.002"],"interval":"5m","description":"Detects a Windows command and scripting interpreter executable started from Microsoft Outlook","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ff][Tt][Rr][Aa][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Vv][Ll][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/))","rule_id":"208748f7-881d-47ac-a29c-07ea84bf691d","timestamp_override":"event.ingested","references":["https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100","https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\OUTLOOK.EXE AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\scrcons.exe OR *\\\\schtasks.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\msiexec.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\svchost.exe OR *\\\\msbuild.exe OR *\\\\msdt.exe))`"}
