{"id":"36210e0d-5b19-485d-a087-c096088885f0","created_by":"Florian Roth (rule), Daniel Bohannon (idea), Roberto Rodriguez (Fix)","name":"Suspicious PowerShell Parameter Substring","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious PowerShell invocation with a parameter substring","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd][Oo]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn][Dd]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii]\\ [Hh].*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh][Ii]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh][Ii][Dd]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh][Ii][Dd][Dd]\\ .*/ OR /.*\\ \\-[Ww][Ii][Nn]\\ [Hh][Ii][Dd][Dd][Ee]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr][Oo]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr][Oo][Ff]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr][Oo][Ff][Ii]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr][Oo][Ff][Ii][Ll]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv]\\ .*/ OR /.*\\ \\-[Ee][Cc]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo]\\ .*/ OR /.*\\ \\-[Ee][Nn]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx][Ee]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Xx]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh]\\ .*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd][Oo]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn][Dd]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii]\\ [Hh].*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh]\\ .*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh][Ii]\\ .*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh][Ii][Dd]\\ .*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh][Ii][Dd][Dd]\\ .*/ OR /.*\\ \\/[Ww][Ii][Nn]\\ [Hh][Ii][Dd][Dd][Ee]\\ .*/ OR /.*\\ \\/[Nn][Oo][Pp][Rr]\\ .*/ OR /.*\\ \\/[Nn][Oo][Pp][Rr][Oo]\\ .*/ OR /.*\\ \\/[Nn][Oo][Pp][Rr][Oo][Ff]\\ .*/ OR /.*\\ \\/[Nn][Oo][Pp][Rr][Oo][Ff][Ii]\\ .*/ OR /.*\\ \\/[Nn][Oo][Pp][Rr][Oo][Ff][Ii][Ll]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii]\\ .*/ OR /.*\\ \\/[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv]\\ .*/ OR /.*\\ \\/[Ee][Cc]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee][Dd]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo][Dd]\\ .*/ OR /.*\\ \\/[Ee][Nn][Cc][Oo]\\ .*/ OR /.*\\ \\/[Ee][Nn]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp]\\ .*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt][Ii]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu][Tt]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc][Uu]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee][Cc]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx][Ee]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Xx]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*\\ \\/[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/))","rule_id":"36210e0d-5b19-485d-a087-c096088885f0","timestamp_override":"event.ingested","references":["http://www.danielbohannon.com/blog-1/2017/3/12/powershell-execution-argument-obfuscation-how-it-can-make-detection-easier"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\ \\-windowstyle\\ h\\ * OR *\\ \\-windowstyl\\ h* OR *\\ \\-windowsty\\ h* OR *\\ \\-windowst\\ h* OR *\\ \\-windows\\ h* OR *\\ \\-windo\\ h* OR *\\ \\-wind\\ h* OR *\\ \\-win\\ h* OR *\\ \\-wi\\ h* OR *\\ \\-win\\ h\\ * OR *\\ \\-win\\ hi\\ * OR *\\ \\-win\\ hid\\ * OR *\\ \\-win\\ hidd\\ * OR *\\ \\-win\\ hidde\\ * OR *\\ \\-NoPr\\ * OR *\\ \\-NoPro\\ * OR *\\ \\-NoProf\\ * OR *\\ \\-NoProfi\\ * OR *\\ \\-NoProfil\\ * OR *\\ \\-nonin\\ * OR *\\ \\-nonint\\ * OR *\\ \\-noninte\\ * OR *\\ \\-noninter\\ * OR *\\ \\-nonintera\\ * OR *\\ \\-noninterac\\ * OR *\\ \\-noninteract\\ * OR *\\ \\-noninteracti\\ * OR *\\ \\-noninteractiv\\ * OR *\\ \\-ec\\ * OR *\\ \\-encodedComman\\ * OR *\\ \\-encodedComma\\ * OR *\\ \\-encodedComm\\ * OR *\\ \\-encodedCom\\ * OR *\\ \\-encodedCo\\ * OR *\\ \\-encodedC\\ * OR *\\ \\-encoded\\ * OR *\\ \\-encode\\ * OR *\\ \\-encod\\ * OR *\\ \\-enco\\ * OR *\\ \\-en\\ * OR *\\ \\-executionpolic\\ * OR *\\ \\-executionpoli\\ * OR *\\ \\-executionpol\\ * OR *\\ \\-executionpo\\ * OR *\\ \\-executionp\\ * OR *\\ \\-execution\\ bypass* OR *\\ \\-executio\\ bypass* OR *\\ \\-executi\\ bypass* OR *\\ \\-execut\\ bypass* OR *\\ \\-execu\\ bypass* OR *\\ \\-exec\\ bypass* OR *\\ \\-exe\\ bypass* OR *\\ \\-ex\\ bypass* OR *\\ \\-ep\\ bypass* OR *\\ \\/windowstyle\\ h\\ * OR *\\ \\/windowstyl\\ h* OR *\\ \\/windowsty\\ h* OR *\\ \\/windowst\\ h* OR *\\ \\/windows\\ h* OR *\\ \\/windo\\ h* OR *\\ \\/wind\\ h* OR *\\ \\/win\\ h* OR *\\ \\/wi\\ h* OR *\\ \\/win\\ h\\ * OR *\\ \\/win\\ hi\\ * OR *\\ \\/win\\ hid\\ * OR *\\ \\/win\\ hidd\\ * OR *\\ \\/win\\ hidde\\ * OR *\\ \\/NoPr\\ * OR *\\ \\/NoPro\\ * OR *\\ \\/NoProf\\ * OR *\\ \\/NoProfi\\ * OR *\\ \\/NoProfil\\ * OR *\\ \\/nonin\\ * OR *\\ \\/nonint\\ * OR *\\ \\/noninte\\ * OR *\\ \\/noninter\\ * OR *\\ \\/nonintera\\ * OR *\\ \\/noninterac\\ * OR *\\ \\/noninteract\\ * OR *\\ \\/noninteracti\\ * OR *\\ \\/noninteractiv\\ * OR *\\ \\/ec\\ * OR *\\ \\/encodedComman\\ * OR *\\ \\/encodedComma\\ * OR *\\ \\/encodedComm\\ * OR *\\ \\/encodedCom\\ * OR *\\ \\/encodedCo\\ * OR *\\ \\/encodedC\\ * OR *\\ \\/encoded\\ * OR *\\ \\/encode\\ * OR *\\ \\/encod\\ * OR *\\ \\/enco\\ * OR *\\ \\/en\\ * OR *\\ \\/executionpolic\\ * OR *\\ \\/executionpoli\\ * OR *\\ \\/executionpol\\ * OR *\\ \\/executionpo\\ * OR *\\ \\/executionp\\ * OR *\\ \\/execution\\ bypass* OR *\\ \\/executio\\ bypass* OR *\\ \\/executi\\ bypass* OR *\\ \\/execut\\ bypass* OR *\\ \\/execu\\ bypass* OR *\\ \\/exec\\ bypass* OR *\\ \\/exe\\ bypass* OR *\\ \\/ex\\ bypass* OR *\\ \\/ep\\ bypass*))`"}
