{"id":"edadb1e5-5919-4e4c-8462-a9e643b02c4b","created_by":"Cedric MAURUGEON","name":"Process Dump via RdrLeakDiag.exe","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects a process memory dump performed by RdrLeakDiag.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Rr][Dd][Rr][Ll][Ee][Aa][Kk][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ff][Uu][Ll][Ll][Mm][Ee][Mm][Dd][Mm][Pp].*/)","rule_id":"edadb1e5-5919-4e4c-8462-a9e643b02c4b","timestamp_override":"event.ingested","references":["https://www.pureid.io/dumping-abusing-windows-credentials-part-1/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:RdrLeakDiag.exe AND process.command_line:*fullmemdmp*)`"}
