{"id":"ce72ef99-22f1-43d4-8695-419dcb5d9330","created_by":"Nasreddine Bencherchali","name":"Suspicious Stop Windows Service","tags":["attack.defense_evasion","attack.t1489"],"interval":"5m","description":"Detects the usage of one of the the commands to stop services such as 'net', 'sc'...etc in order to stop critical or important windows services such as AV, Backup...etc. As seen being used in some ransomware scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator or tools shutting down the services due to upgrade or removal purposes. If you experience some FP please consider adding filters to the parent process launching this command and not removing the entry"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Vv][Ss][Ss].*/ OR /.*[Hh][Ee][Aa][Ll][Tt][Hh][Tt][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Tt][Hh][Rr][Ee][Aa][Tt][Ll][Oo][Cc][Kk][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*\\\"[Vv][Ee][Rr][Ii][Tt][Aa][Ss]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy]\\\".*/ OR /.*[Ee][Pp][Ll][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Rr][Ee][Dd][Ll][Ii][Nn][Ee].*/ OR /.*\\\"[Cc][Ll][Ii][Ee][Nn][Tt]\\ [Aa][Gg][Ee][Nn][Tt]\\ 7\\.60\\\".*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Vv][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Dd][Ee][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*\\\"[Zz][Oo][Oo][Ll][Zz]\\ 2\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Aa][Uu][Tt][Oo][Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Pp][Oo][Vv][Ff][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr][Ss][Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*\\\"[Ss][Yy][Mm][Aa][Nn][Tt][Ee][Cc]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy]\\\".*/ OR /.*[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Hh][Ee][Aa][Ll][Tt][Hh]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr][Ss][Tt][Pp][Ss].*/ OR /.*[Aa][Cc][Rr][Ss][Cc][Hh]2[Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ss][Vv][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr][Ss][Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Nn][Tt].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Tt][Pp][Ss].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Ee][Ss][Ss][Aa][Gg][Ee]\\ [Rr][Oo][Uu][Tt][Ee][Rr]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ss]8[Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Mm][Yy][Ss][Qq][Ll]80.*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Cc][Ww][Dd][Bb]2.*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ww][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2008[Rr]2.*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Cc][Ll][Ee][Aa][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ww][Ee][Bb]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Ee][Hh][Tt][Tt][Pp][Ss][Rr][Yy].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp][Ss][Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*\\\"[Vv][Ee][Ee][Aa][Mm]\\ [Bb][Aa][Cc][Kk][Uu][Pp]\\ [Cc][Aa][Tt][Aa][Ll][Oo][Gg]\\ [Dd][Aa][Tt][Aa]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ss][Bb][Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Mm][Gg].*/ OR /.*[Aa][Cc][Rr][Oo][Nn][Ii][Ss][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Yy][Ss][Qq][Ll][Ss]7.*/ OR /.*[Uu][Tt][Oo][Dd][Ee][Tt][Ee][Cc][Tt].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Oo][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr][Ss][Ss][Vv][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Bb][Kk][Uu][Pp][Ee][Xx][Ee][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Pp][Rr][Aa][Cc][Tt][Tt][Ii][Cc][Ee][Bb][Gg][Cc].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Cc][Ss]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\".*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Ll][Oo][Bb][Ee][Nn][Gg][Ii][Nn][Ee].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2008[Rr]2.*/ OR /.*143[Ss][Vv][Cc].*/ OR /.*\\\"[Ss][Qq][Ll][Ss][Aa][Ff][Ee]\\ [Bb][Aa][Cc][Kk][Uu][Pp]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Cc][Xx][Dd][Bb].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ss][Aa][Ff][Ee][Ss][Tt][Oo][Rr][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Ss][Vv][Cc][Ii][Ee][Nn][Ee][Rr][Ii][Cc][Hh][Oo][Ss][Tt].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Cc][Ii][Tt][Rr][Ii][Xx]_[Mm][Ee][Tt][Aa][Ff][Rr][Aa][Mm][Ee].*/ OR /.*[Ww][Ee][Aa][Nn][Cc][Ll][Oo][Uu][Dd][Ss][Vv][Ee].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Cc][Aa][Nn][Nn][Ee][Rr]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Aa][Gg][Ee][Nn][Tt]\\\".*/ OR /.*[Mm]8[Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ff][Rr][Aa][Cc][Tt][Ii][Cc][Ee][Mm][Gg][Tt].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ OR /.*\\\"[Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Ss][Bb][Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2012.*/ OR /.*[Ss][Qq]1[Ss][Aa][Ff][Ee][Oo][Ll][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee][Hh][Aa][Nn][Aa][Gg][Ee][Rr][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Ss][Qq][Ll]\\ [Ee][Xx][Pp][Rr][Ee][Ss][Ss].*/ OR /.*[Mm][Ss][Ss][Qq]\\![Ii]\\.[Ss][Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Hh][Tt].*/ OR /.*[Ii][Mm][Aa][Nn][Ss][Vv][Cc].*/ OR /.*[Aa][Rr][Ss][Mm].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Oo][Ll][Aa][Vv][Oo][Cc][Hh][Ee][Rr].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Mm][Ii][Aa].*/ OR /.*[Tt][Rr][Uu][Ee][Kk][Ee][Yy][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*[Mm][Ss][Ss][Qq]0[Ss][Oo][Pp][Hh][Oo][Ss].*/ OR /.*\\\"[Ss][Qq][Ll]\\ [Bb][Aa][Cc][Kk][Uu][Pp][Ss]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Tt][Pp][Ss].*/ OR /.*[Ww][Ee][Ee][Mm][Ss]\\ [Jj][Yy].*/ OR /.*[Mm][Ss][Ss][Qq]0[Ss][Hh][Aa][Rr][Ee][Pp][Oo][Ii][Nn][Tt].*/ OR /.*[Mm][Ff][Ee][Vv][Tt][Oo].*/ OR /.*[Mm][Ss][Ff][Tt][Ee][Ss][Qq]1[Ss][Pp][Rr][Oo][Oo].*/ OR /.*[Ww][Oo][Zz][Yy][Pp][Rr][Oo][Bb][Aa][Cc][Kk][Uu][Pp].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ss][Qq][Ll]_2008.*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ss][Qq][Ll][Ee][Xx][Pp][Rr][Ee][Ss][Ss].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Pp][Rr][Aa][Cc][Tt][Tt][Ii][Cc][Ee][Bb][Gg][Ee].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Rr][Ii][Ss][Tt][Ss][Vv][Cc].*/ OR /.*[Hh][Mm][Ss].*/ OR /.*\\\"[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Cc][Ss]\\ [Aa][Gg][Ee][Nn][Tt]\\\".*/ OR /.*\\\"[Aa][Cc][Rr][Oo][Nn][Ii][Ss]\\ [Vv][Ss][Ss]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Vv][Ii][Ee][Aa][Mm][Ss][Qq][Ll]2008112.*/ OR /.*[Hh][Ii][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr][Ss][Ss][Hh][Aa][Rr][Ee][Pp][Oo][Ii][Nn][Ii][Tt].*/ OR /.*\\\"[Ss][Qq][Ll][Ss][Aa][Ff][Ee]\\ [Ff][Ii][Ll][Tt][Ee][Rr]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\".*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Pp][Rr][Oo][Oo].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt][Ss][Pp][Rr][Oo][Oo].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp][Ss][Tt][Pp][Ss].*/ OR /.*[Vv][Ee][Ee][Mm][Aa][Dd][Ee][Pp]\\/[Oo][Yy][Ss][Vv][Cc].*/ OR /.*\\\"[Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ \\([Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]\\)\\\".*/ OR /.*\\\"[Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ \\([Ss][Qq][Ll][Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\).*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Aa][Gg][Ee][Nn][Tt][Aa][Cc][Cc][Ee][Ll][Ee][Rr][Aa][Tt][Oo][Rr].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ee][Nn][Gg][Ii][Nn][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Aa][Gg][Ee][Nn][Tt][Bb][Rr][Oo][Ww][Ss][Ee][Rr].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Dd][Ee][Vv][Ii][Cc][Ee][Mm][Ee][Dd][Ii][Aa][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk][Mm][Cc][Aa][Ff][Ee][Ee][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Jj][Oo][Bb][Ee][Nn][Gg][Ii][Nn][Ee].*/ OR /.*[Mm][Cc][Tt][Aa][Ss][Kk][Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ff][Ee][Mm][Mm][Ss].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Rr][Pp][Cc][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ff][Ee][Vv][Tt][Pp].*/ OR /.*[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Xx][Ee][Cc][Vv][Ss][Ss][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR /.*[Mm][Mm][Ss].*/ OR /.*[Bb][Ee][Dd][Bb][Gg].*/ OR /.*[Mm][Oo][Zz][Yy][Pp][Rr][Oo][Bb][Aa][Cc][Kk][Uu][Pp].*/ OR /.*[Dd][Cc][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Ss][Dd][Tt][Ss][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Mm][Ss][Dd][Tt][Ss][Ss][Ee][Rr][Vv][Ee][Rr]100.*/ OR /.*[Mm][Ss][Dd][Tt][Ss][Ss][Ee][Rr][Vv][Ee][Rr]110.*/ OR /.*[Ee][Rr][Aa][Ss][Ee][Rr][Ss][Vv][Cc]11710.*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Ee][Ss].*/ OR /.*[Ee][Ss][Gg][Ss][Hh][Kk][Ee][Rr][Nn][Ee][Ll].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Ii][Ss].*/ OR /.*[Ff][Aa]_[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Mm][Gg][Mm][Tt].*/ OR /.*[Ii][Ii][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Mm][Tt][Aa].*/ OR /.*[Ii][Mm][Aa][Pp]4[Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Ss][Aa].*/ OR /.*[Mm][Aa][Cc][Mm][Nn][Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee][Ss][Rr][Ss].*/ OR /.*[Mm][Aa][Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Ss][Qq][Ll]_2008.*/ OR /.*[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Mm][Bb][Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Tt][Pp][Ss].*/ OR /.*[Mm][Cc][Ss][Hh][Ii][Ee][Ll][Dd].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ee][Cc][Ww][Dd][Bb]2.*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr][Aa][Dd][Hh][Ee][Ll][Pp][Ee][Rr]100.*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Pp][Rr][Aa][Cc][Tt][Ii][Cc][Ee][Mm][Gg][Tt].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr][Oo][Ll][Aa][Pp][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Pp][Rr][Aa][Cc][Tt][Tt][Ii][Cc][Ee][Bb][Gg][Cc].*/ OR /.*[Mm][Yy][Ss][Qq][Ll]57.*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Nn][Tt].*/ OR /.*[Nn][Tt][Rr][Tt][Ss][Cc][Aa][Nn].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Bb][Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Oo][Rr][Aa][Cc][Ll][Ee][Cc][Ll][Ii][Ee][Nn][Tt][Cc][Aa][Cc][Hh][Ee]80.*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Hh][Aa][Rr][Ee][Pp][Oo][Ii][Nn][Tt].*/ OR /.*[Pp][Dd][Vv][Ff][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Qq][Ll]_2008.*/ OR /.*[Pp][Oo][Pp]3[Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Tt][Pp][Ss].*/ OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr]$[Ss][Qq][Ll]_2008.*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr]$[Tt][Pp][Ss].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2012.*/ OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr].*/ OR /.*[Rr][Ee][Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Nn][Tt].*/ OR /.*[Ss][Aa][Cc][Ss][Vv][Rr].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ss][Bb][Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ss][Hh][Aa][Rr][Ee][Pp][Oo][Ii][Nn][Tt].*/ OR /.*[Ss][Aa][Mm][Ss][Ss].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ss][Qq][Ll]_2008.*/ OR /.*[Ss][Aa][Vv][Aa][Dd][Mm][Ii][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Tt][Pp][Ss].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Bb][Kk][Uu][Pp][Ee][Xx][Ee][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Ss][Mm][Cc][Ii][Nn][Ss][Tt].*/ OR /.*[Ss][Qq][Ll][Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy]$[Ee][Cc][Ww][Dd][Bb]2.*/ OR /.*[Ss][Mm][Cc][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Qq][Ll][Ww][Rr][Ii][Tt][Ee][Rr].*/ OR /.*[Ss][Mm][Tt][Pp][Ss][Vv][Cc].*/ OR /.*[Ss][Ss][Tt][Pp][Ss][Vv][Cc].*/ OR /.*[Ss][Nn][Aa][Cc].*/ OR /.*[Ss][Vv][Cc][Gg][Ee][Nn][Ee][Rr][Ii][Cc][Hh][Oo][Ss][Tt].*/ OR /.*[Ss][Nn][Tt][Pp][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ww][Ii]_[Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss][Ss][Pp][Ss].*/ OR /.*[Ss][Ww][Ii]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Bb][Kk][Uu][Pp][Ee][Xx][Ee][Cc].*/ OR /.*[Ss][Ww][Ii]_[Uu][Pp][Dd][Aa][Tt][Ee]_64.*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ee][Cc][Ww][Dd][Bb]2.*/ OR /.*[Tt][Mm][Cc][Cc][Ss][Ff].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Pp][Rr][Aa][Cc][Tt][Tt][Ii][Cc][Ee][Bb][Gg][Cc].*/ OR /.*[Tt][Mm][Ll][Ii][Ss][Tt][Ee][Nn].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Pp][Rr][Aa][Cc][Tt][Tt][Ii][Cc][Ee][Mm][Gg][Tt].*/ OR /.*[Tt][Rr][Uu][Ee][Kk][Ee][Yy].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Nn][Tt].*/ OR /.*[Tt][Rr][Uu][Ee][Kk][Ee][Yy][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Bb][Ss][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg].*/ OR /.*[Tt][Rr][Uu][Ee][Kk][Ee][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Hh][Ee][Ll][Pp][Ee][Rr].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Hh][Aa][Rr][Ee][Pp][Oo][Ii][Nn][Tt].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Qq][Ll]_2008.*/ OR /.*[Uu][Ii]0[Dd][Ee][Tt][Ee][Cc][Tt].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Tt][Pp][Ss].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Bb][Aa][Cc][Kk][Uu][Pp][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Bb][Rr][Oo][Kk][Ee][Rr][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2012.*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Cc][Aa][Tt][Aa][Ll][Oo][Gg][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Bb][Rr][Oo][Ww][Ss][Ee][Rr].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Cc][Ll][Oo][Uu][Dd][Ss][Vv][Cc].*/ OR /.*[Ss][Dd][Rr][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Ss][Aa][Ff][Ee][Oo][Ll][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ee][Pp][Mm][Aa][Ss][Tt][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Ss][Hh][Mm][Oo][Nn][Ii][Tt][Oo][Rr].*/ OR /.*[Ss][Qq][Ll][Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Nn][Ee][Tt][Mm][Ss][Mm][Qq][Aa][Cc][Tt][Ii][Vv][Aa][Tt][Oo][Rr].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Dd][Ee][Pp][Ll][Oo][Yy][Ss][Vv][Cc].*/ OR /.*[Ee][Hh][Tt][Tt][Pp][Ss][Rr][Vv].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee][Mm][Aa][Nn][Aa][Gg][Ee][Rr][Ss][Vv][Cc].*/ OR /.*[Ee][Kk][Rr][Nn].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Mm][Oo][Uu][Nn][Tt][Ss][Vv][Cc].*/ OR /.*[Ee][Ss][Hh][Aa][Ss][Rr][Vv].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Nn][Ff][Ss][Ss][Vv][Cc].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Oo][Pp][Hh][Oo][Ss].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Rr][Ee][Ss][Tt][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Oo][Pp][Hh][Oo][Ss].*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Tt][Rr][Aa][Nn][Ss][Pp][Oo][Rr][Tt][Ss][Vv][Cc].*/ OR /.*[Aa][Vv][Pp].*/ OR /.*[Ww]3[Ss][Vv][Cc].*/ OR /.*[Kk][Ll][Nn][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ss][Qq][Ll][Ee][Xx][Pp][Rr][Ee][Ss][Ss].*/ OR /.*[Ww][Rr][Ss][Vv][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ss][Qq][Ll][Ee][Xx][Pp][Rr][Ee][Ss][Ss].*/ OR /.*[Ww][Bb][Ee][Nn][Gg][Ii][Nn][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2008[Rr]2.*/ OR /.*[Kk][Aa][Vv][Ff][Ss][Ss][Ll][Pp].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Vv][Ee][Ee][Aa][Mm][Ss][Qq][Ll]2008[Rr]2.*/ OR /.*[Vv][Ee][Ee][Aa][Mm][Hh][Vv][Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn][Ss][Vv][Cc].*/ OR /.*[Kk][Aa][Vv][Ff][Ss][Gg][Tt].*/ OR /.*[Ss][Ww][Ii]_[Uu][Pp][Dd][Aa][Tt][Ee].*/ OR /.*[Kk][Aa][Vv][Ff][Ss].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Cc][Xx][Dd][Bb].*/ OR /.*[Mm][Ff][Ee][Ff][Ii][Rr][Ee].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Cc][Ii][Tt][Rr][Ii][Xx]_[Mm][Ee][Tt][Aa][Ff][Rr][Aa][Mm][Ee].*/ OR /.*“[Ss][Qq][Ll]\\ [Bb][Aa][Cc][Kk][Uu][Pp][Ss]”.*/ OR /.*“[Aa][Vv][Aa][Ss][Tt]\\!\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]”.*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Pp][Rr][Oo][Dd].*/ OR /.*[Aa][Ss][Ww][Bb][Cc][Cc].*/ OR /.*“[Zz][Oo][Oo][Ll][Zz]\\ 2\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]”.*/ OR /.*“[Aa][Vv][Aa][Ss][Tt]\\ [Bb][Uu][Ss][Ii][Nn][Ee][Ss][Ss]\\ [Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]”.*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr][Aa][Dd][Hh][Ee][Ll][Pp][Ee][Rr].*/ OR /.*[Mm][Ff][Ee][Ww][Cc].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Pp][Rr][Oo][Dd].*/ OR /.*[Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Mm][Ss][Ff][Tt][Ee][Ss][Qq][Ll]$[Pp][Rr][Oo][Dd].*/ OR /.*[Ww][Dd][Nn][Ii][Ss][Ss][Vv][Cc].*/ OR /.*[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Tt][Oo][Mm][Cc][Aa][Tt][Ss][Rr][Vv]530.*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ee][Vv][Ee][Nn][Tt][Pp][Aa][Rr][Ss][Ee][Rr][Ss][Rr][Vv].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ff][Dd][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]$[Ii][Tt][Rr][Ii][Ss].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ee][Pp][Oo][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Mm][Ss][Ss][Qq][Ll]$[Ii][Tt][Rr][Ii][Ss].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ee][Pp][Oo][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Ss][Qq][Ll][Aa][Gg][Ee][Nn][Tt]$[Ii][Tt][Rr][Ii][Ss].*/ OR /.*[Ss][Qq][Ll][Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy]$[Ii][Tt][Rr][Ii][Ss].*/ OR /.*[Ss][Ee][Nn][Tt][Ii][Nn][Ee][Ll][Hh][Ee][Ll][Pp][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Dd][Tt][Ss][Ss][Ee][Rr][Vv][Ee][Rr]130.*/ OR /.*[Ll][Oo][Gg][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Oo][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ss][Ii][Ss][Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy]130.*/ OR /.*[Ee][Pp][Uu][Pp][Dd][Aa][Tt][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Ss][Ss][Qq][Ll][Ll][Aa][Uu][Nn][Cc][Hh][Pp][Aa][Dd]$[Ii][Tt][Rr][Ii][Ss].*/ OR /.*[Tt][Mm][Pp][Ff][Ww].*/ OR /.*[Bb][Ii][Tt][Ss].*/ OR /.*[Ss][Ee][Nn][Tt][Ii][Nn][Ee][Ll][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Bb][Rr][Oo][Kk][Ee][Rr][Ii][Nn][Ff][Rr][Aa][Ss][Tt][Rr][Uu][Cc][Tt][Uu][Rr][Ee].*/ OR /.*[Ee][Pp][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Aa][Gg].*/ OR /.*[Ee][Pp][Rr][Ee][Dd][Ll][Ii][Nn][Ee].*/ OR /.*[Ee][Pp][Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/) AND (((process.pe.original_file_name:(/[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) OR process.executable:(/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/)) AND process.command_line:/.*\\ [Ss][Tt][Oo][Pp]\\ .*/) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ss][Tt][Oo][Pp]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/)))","rule_id":"ce72ef99-22f1-43d4-8695-419dcb5d9330","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus/Genshin%20Impact%20Figure%2010.jpg","https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*VSS* OR *HealthTLService* OR *ThreatLockerService* OR *\\\"Veritas\\ System\\ Recovery\\\"* OR *EPlntegrationService* OR *EPRedline* OR *\\\"Client\\ Agent\\ 7.60\\\"* OR *SQLAgent$SVSTEM_BGC* OR *\\\"Sophos\\ Device\\ Control\\ Service\\\"* OR *\\\"Zoolz\\ 2\\ Service\\\"* OR *\\\"Sophos\\ AutoUpdate\\ Service\\\"* OR *\\\"Sophos\\ System\\ Protection\\ Service\\\"* OR *POVFSService* OR *MSSQLFDLauncherSTPSAMA* OR *\\\"Symantec\\ System\\ Recovery\\\"* OR *Antivirus* OR *\\\"Sophos\\ Health\\ Service\\\"* OR *MSSQLFDLauncherSTPS* OR *AcrSch2Svc* OR *MSSQLSSVSTEM_BGC* OR *MSSQLFDLauncherSPROFXENGAGEMENT* OR *SQLAgentSTPS* OR *\\\"Sophos\\ Message\\ Router\\\"* OR *MSSQLFDLauncher$S8SMONITORING* OR *MySQL80* OR *MSSQLSECWDB2* OR *MSSQLWEEAMSQL2008R2* OR *\\\"Sophos\\ Clean\\ Service\\\"* OR *\\\"Sophos\\ Web\\ Control\\ Service\\\"* OR *EhttpSry* OR *MSOLAPSTPSAMA* OR *\\\"Veeam\\ Backup\\ Catalog\\ Data\\ Service\\\"* OR *MSSQLSSBSMONITORIMG* OR *AcronisAgent* OR *MySQLS7* OR *UTODetect* OR *MSSQLFOLauncherSSVSTEM_BGC* OR *MSSQLSBKUPEXEC* OR *SQLAgentSPRACTTICEBGC* OR *\\\"Sophos\\ MCS\\ Client\\\"* OR *BackupExeclobEngine* OR *SQLAgentSVEEAMSQL2008R2* OR *143Svc* OR *\\\"SQLsafe\\ Backup\\ Service\\\"* OR *SQLAgentSCXDB* OR *\\\"Sophos\\ Safestore\\ Service\\\"* OR *svcienericHost* OR *MSSQLSTPSAMA* OR *SQLAgentSCITRIX_METAFRAME* OR *WeanClOudSve* OR *\\\"Sophos\\ File\\ Scanner\\ Service\\\"* OR *\\\"Sophos\\ Agent\\\"* OR *M8EndpointAgent* OR *mSSQLSFRACTICEMGT* OR *SQLAgentSTPSAMA* OR *McAfeeframework* OR *\\\"Enterprise\\ Client\\ Service\\\"* OR *SQLAgentSSBSMONITORING* OR *MSSQLSVEEAMSQL2012* OR *SQ1SafeOLRService* OR *VeeamEnterpriseHanagerSvc* OR *SQLAgentSSQL\\ EXPRESS* OR *MSSQ\\!I.SPROFXENGAGEMEHT* OR *IMANSVC* OR *ARSM* OR *MSSQLFOLavocher* OR *MSExchangeMIA* OR *TruekeyScheduler* OR *MSSQ0SOPHOS* OR *\\\"SQL\\ Backups\\\"* OR *MSSQLSTPS* OR *Weems\\ JY* OR *MSSQ0SHAREPOINT* OR *mfevto* OR *msftesq1SPROO* OR *wozyprobackup* OR *MSSQLSSQL_2008* OR *MSSQLSSQLEXPRESS* OR *MSSQLSPRACTTICEBGE* OR *VeeamRISTSvc* OR *HMS* OR *\\\"Sophos\\ MCS\\ Agent\\\"* OR *\\\"Acronis\\ VSS\\ Provider\\\"* OR *MSSQLSVIEAMSQL2008112* OR *HISSQLFDLauncherSSHAREPOINIT* OR *\\\"SQLsafe\\ Filter\\ Service\\\"* OR *MSSQLSPROO* OR *SQLAgentSPROO* OR *MSOLAPSTPS* OR *VeemaDep\\/oySvc* OR *\\\"SQL\\ Server\\ \\(MSSQLSERVER\\)\\\"* OR *\\\"SQL\\ Server\\ \\(SQLEXPRESS\\)* OR *BackupExecAgentAccelerator* OR *McAfeeEngineService* OR *BackupExecAgentBrowser* OR *McAfeeFramework* OR *BackupExecDeviceMediaService* OR *McAfeeFrameworkMcAfeeFramework* OR *BackupExecJobEngine* OR *McTaskManager* OR *BackupExecManagementService* OR *mfemms* OR *BackupExecRPCService* OR *mfevtp* OR *BackupExecVSSProvider* OR *MMS* OR *bedbg* OR *mozyprobackup* OR *DCAgent* OR *MsDtsServer* OR *MsDtsServer100* OR *MsDtsServer110* OR *EraserSvc11710* OR *MSExchangeES* OR *EsgShKernel* OR *MSExchangeIS* OR *FA_Scheduler* OR *MSExchangeMGMT* OR *IISAdmin* OR *MSExchangeMTA* OR *IMAP4Svc* OR *MSExchangeSA* OR *macmnsvc* OR *MSExchangeSRS* OR *masvc* OR *MSOLAP$SQL_2008* OR *MBAMService* OR *MSOLAP$SYSTEM_BGC* OR *MBEndpointAgent* OR *MSOLAP$TPS* OR *McShield* OR *MSSQLSERVER* OR *MSSQL$ECWDB2* OR *MSSQLServerADHelper100* OR *MSSQL$PRACTICEMGT* OR *MSSQLServerOLAPService* OR *MSSQL$PRACTTICEBGC* OR *MySQL57* OR *MSSQL$PROFXENGAGEMENT* OR *ntrtscan* OR *MSSQL$SBSMONITORING* OR *OracleClientCache80* OR *MSSQL$SHAREPOINT* OR *PDVFSService* OR *MSSQL$SQL_2008* OR *POP3Svc* OR *MSSQL$SYSTEM_BGC* OR *ReportServer* OR *MSSQL$TPS* OR *ReportServer$SQL_2008* OR *MSSQL$TPSAMA* OR *ReportServer$SYSTEM_BGC* OR *ReportServer$TPS* OR *MSSQL$VEEAMSQL2012* OR *ReportServer$TPSAMA* OR *MSSQLFDLauncher* OR *RESvc* OR *MSSQLFDLauncher$PROFXENGAGEMENT* OR *sacsvr* OR *MSSQLFDLauncher$SBSMONITORING* OR *MSSQLFDLauncher$SHAREPOINT* OR *SamSs* OR *MSSQLFDLauncher$SQL_2008* OR *SAVAdminService* OR *MSSQLFDLauncher$SYSTEM_BGC* OR *SAVService* OR *MSOLAP$TPSAMA* OR *MSSQLFDLauncher$TPS* OR *MSSQL$BKUPEXEC* OR *MSSQLFDLauncher$TPSAMA* OR *Smcinst* OR *SQLTELEMETRY$ECWDB2* OR *SmcService* OR *SQLWriter* OR *SMTPSvc* OR *SstpSvc* OR *SNAC* OR *svcGenericHost* OR *SntpService* OR *swi_filter* OR *sophossps* OR *swi_service* OR *SQLAgent$BKUPEXEC* OR *swi_update_64* OR *SQLAgent$ECWDB2* OR *TmCCSF* OR *SQLAgent$PRACTTICEBGC* OR *tmlisten* OR *SQLAgent$PRACTTICEMGT* OR *TrueKey* OR *SQLAgent$PROFXENGAGEMENT* OR *TrueKeyScheduler* OR *SQLAgent$SBSMONITORING* OR *TrueKeyServiceHelper* OR *SQLAgent$SHAREPOINT* OR *SQLAgent$SQL_2008* OR *UI0Detect* OR *SQLAgent$SYSTEM_BGC* OR *SQLAgent$TPS* OR *VeeamBackupSvc* OR *SQLAgent$TPSAMA* OR *VeeamBrokerSvc* OR *SQLAgent$VEEAMSQL2012* OR *VeeamCatalogSvc* OR *SQLBrowser* OR *VeeamCloudSvc* OR *SDRSVC* OR *SQLSafeOLRService* OR *SepMasterService* OR *SQLSERVERAGENT* OR *ShMonitor* OR *SQLTELEMETRY* OR *VeeamDeploymentService* OR *NetMsmqActivator* OR *VeeamDeploySvc* OR *EhttpSrv* OR *VeeamEnterpriseManagerSvc* OR *ekrn* OR *VeeamMountSvc* OR *ESHASRV* OR *VeeamNFSSvc* OR *MSSQL$SOPHOS* OR *VeeamRESTSvc* OR *SQLAgent$SOPHOS* OR *VeeamTransportSvc* OR *AVP* OR *W3Svc* OR *klnagent* OR *MSSQL$SQLEXPRESS* OR *WRSVC* OR *SQLAgent$SQLEXPRESS* OR *wbengine* OR *MSSQL$VEEAMSQL2008R2* OR *kavfsslp* OR *SQLAgent$VEEAMSQL2008R2* OR *VeeamHvIntegrationSvc* OR *KAVFSGT* OR *swi_update* OR *KAVFS* OR *SQLAgent$CXDB* OR *mfefire* OR *SQLAgent$CITRIX_METAFRAME* OR *“SQL\\ Backups”* OR *“avast\\!\\ Antivirus”* OR *MSSQL$PROD* OR *aswBcc* OR *“Zoolz\\ 2\\ Service”* OR *“Avast\\ Business\\ Console\\ Client\\ Antivirus\\ Service”* OR *MSSQLServerADHelper* OR *mfewc* OR *SQLAgent$PROD* OR *Telemetryserver* OR *msftesql$PROD* OR *WdNisSvc* OR *WinDefend* OR *MCAFEETOMCATSRV530* OR *MCAFEEEVENTPARSERSRV* OR *MSSQLFDLauncher$ITRIS* OR *MSSQL$EPOSERVER* OR *MSSQL$ITRIS* OR *SQLAgent$EPOSERVER* OR *SQLAgent$ITRIS* OR *SQLTELEMETRY$ITRIS* OR *SentinelHelperService* OR *MsDtsServer130* OR *LogProcessorService* OR *SSISTELEMETRY130* OR *EPUpdateService* OR *MSSQLLaunchpad$ITRIS* OR *TmPfw* OR *BITS* OR *SentinelAgent* OR *BrokerInfrastructure* OR *EPProtectedService* OR *epag* OR *epredline* OR *EPIntegrationService* OR *EPSecurityService*) AND (((process.pe.original_file_name:(sc.exe OR net.exe OR net1.exe) OR process.executable:(*\\\\sc.exe OR *\\\\net.exe OR *\\\\net1.exe)) AND process.command_line:*\\ stop\\ *) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Stop\\-Service\\ *)))`"}
