{"id":"c9192ad9-75e5-43eb-8647-82a0a5b493e3","created_by":"Cian Heasley","name":"Mouse Lock Credential Gathering","tags":["attack.credential_access","attack.collection","attack.t1056.002"],"interval":"5m","description":"In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate tool \"Mouse Lock\" as being used for both credential access and collection in security incidents.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate uses of Mouse Lock software"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.product:/.*[Mm][Oo][Uu][Ss][Ee]\\ [Ll][Oo][Cc][Kk].*/ OR process.pe.company:/.*[Mm][Ii][Ss][Cc]314.*/ OR process.command_line:/.*[Mm][Oo][Uu][Ss][Ee]\\ [Ll][Oo][Cc][Kk]_.*/)","rule_id":"c9192ad9-75e5-43eb-8647-82a0a5b493e3","timestamp_override":"event.ingested","references":["https://github.com/klsecservices/Publications/blob/657deb6a6eb6e00669afd40173f425fb49682eaa/Incident-Response-Analyst-Report-2020.pdf","https://sourceforge.net/projects/mouselock/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.product:*Mouse\\ Lock* OR process.pe.company:*Misc314* OR process.command_line:*Mouse\\ Lock_*)`"}
