{"id":"1af57a4b-460a-4738-9034-db68b880c665","created_by":"Florian Roth","name":"PowerShell SAM Copy","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects suspicious PowerShell scripts accessing SAM hives","risk_score":73,"enabled":true,"severity":"high","false_positives":["Some rare backup scenarios","PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Hh][Aa][Rr][Dd][Dd][Ii][Ss][Kk][Vv][Oo][Ll][Uu][Mm][Ee][Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/ AND process.command_line:/.*[Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Aa][Mm].*/ AND process.command_line:(/.*[Cc][Oo][Pp][Yy]\\-[Ii][Tt][Ee][Mm].*/ OR /.*[Cc][Pp]\\ $_\\..*/ OR /.*[Cc][Pp][Ii]\\ $_\\..*/ OR /.*[Cc][Oo][Pp][Yy]\\ $_\\..*/ OR /.*\\.[Ff][Ii][Ll][Ee]\\]\\:\\:[Cc][Oo][Pp][Yy]\\(.*/))","rule_id":"1af57a4b-460a-4738-9034-db68b880c665","timestamp_override":"event.ingested","references":["https://twitter.com/splinter_code/status/1420546784250769408"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\HarddiskVolumeShadowCopy* AND process.command_line:*ystem32\\\\config\\\\sam* AND process.command_line:(*Copy\\-Item* OR *cp\\ $_.* OR *cpi\\ $_.* OR *copy\\ $_.* OR *.File\\]\\:\\:Copy\\(*))`"}
