{"id":"6355a919-2e97-4285-a673-74645566340d","created_by":"Florian Roth","name":"RdrLeakDiag Process Dump","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects uses of the rdrleakdiag.exe LOLOBIN utility to dump process memory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Dd][Rr][Ll][Ee][Aa][Kk][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ff][Uu][Ll][Ll][Mm][Ee][Mm][Dd][Mm][Pp].*/) OR (process.command_line:/.*\\/[Ff][Uu][Ll][Ll][Mm][Ee][Mm][Dd][Mm][Pp].*/ AND process.command_line:/.*\\ \\/[Oo]\\ .*/ AND process.command_line:/.*\\ \\/[Pp]\\ .*/))","rule_id":"6355a919-2e97-4285-a673-74645566340d","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rdrleakdiag.exe AND process.command_line:*\\/fullmemdmp*) OR (process.command_line:*\\/fullmemdmp* AND process.command_line:*\\ \\/o\\ * AND process.command_line:*\\ \\/p\\ *))`"}
