{"id":"90b63c33-2b97-4631-a011-ceb0f47b77c3","created_by":"Nasreddine Bencherchali","name":"Suspicious CLSID Folder Name In Suspicious Locations","tags":["attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects usage of a CLSID folder name located in a suspicious location from the commandline as seen being used in IcedID","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Some FP is expected with some installers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/) AND process.command_line:/.*\\\\\\{.*/ AND process.command_line:/.*\\}\\\\.*/) AND (NOT (process.executable:/.*\\\\\\{.*/ AND process.executable:/.*\\}\\\\.*/)))","rule_id":"90b63c33-2b97-4631-a011-ceb0f47b77c3","timestamp_override":"event.ingested","references":["https://twitter.com/Kostastsale/status/1565257924204986369"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:(*\\\\AppData\\\\Roaming\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\*) AND process.command_line:*\\\\\\{* AND process.command_line:*\\}\\\\*) AND (NOT (process.executable:*\\\\\\{* AND process.executable:*\\}\\\\*)))`"}
