{"id":"25676e10-2121-446e-80a4-71ff8506af47","created_by":"FPT.EagleEye","name":"Exchange PowerShell Snap-Ins Used by HAFNIUM","tags":["attack.execution","attack.t1059.001","attack.collection","attack.t1114"],"interval":"5m","description":"Detects adding and using Exchange PowerShell snap-ins to export mailbox data by HAFNIUM","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Aa][Dd][Dd]\\-[Pp][Ss][Ss][Nn][Aa][Pp][Ii][Nn]\\ [Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\.[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ss][Nn][Aa][Pp][Ii][Nn].*/)","rule_id":"25676e10-2121-446e-80a4-71ff8506af47","timestamp_override":"event.ingested","references":["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/","https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*add\\-pssnapin\\ microsoft.exchange.powershell.snapin*)`"}
