{"id":"f2c64357-b1d2-41b7-849f-34d2682c0fad","created_by":"Florian Roth","name":"Suspicious Add Scheduled Command Pattern","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"Detects suspicious scheduled task creations with commands that are uncommon","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software installers that run from temporary folders and also install scheduled tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/) AND ((process.command_line:(/.*\\/[Ss][Cc]\\ [Mm][Ii][Nn][Uu][Tt][Ee]\\ .*/ OR /.*\\/[Rr][Uu]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/) AND process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc].*/)) OR process.command_line:(/.*\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ .*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/ OR /.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ [Ii][Ee][Xx].*/ OR /.*\\ \\-[Ee][Nn][Cc]\\ .*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\/[Cc]\\ [Ss][Tt][Aa][Rr][Tt]\\ \\/[Mm][Ii][Nn]\\ .*/ OR /.*\\ [Cc][Uu][Rr][Ll]\\ .*/) OR (process.command_line:/.*\\/[Xx][Mm][Ll]\\ [Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/) OR (process.command_line:/.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/)))","rule_id":"f2c64357-b1d2-41b7-849f-34d2682c0fad","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create\\ *) AND ((process.command_line:(*\\/sc\\ minute\\ * OR *\\/ru\\ system\\ *) AND process.command_line:(*cmd.exe\\ \\/c\\ * OR *cmd\\ \\/c*)) OR process.command_line:(*\\ bypass\\ * OR *.DownloadString* OR *.DownloadFile* OR *FromBase64String* OR *\\ \\-w\\ hidden\\ * OR *\\ IEX* OR *\\ \\-enc\\ * OR *\\ \\-decode\\ * OR *\\/c\\ start\\ \\/min\\ * OR *\\ curl\\ *) OR (process.command_line:*\\/xml\\ C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\*) OR (process.command_line:*wscript.exe* AND process.command_line:*\\\\AppData\\\\*)))`"}
