{"id":"8c0eca51-0f88-4db2-9183-fdfb10c703f9","created_by":"Florian Roth","name":"Registry Disabling LSASS PPL","tags":["attack.defense_evasion","attack.t1562.010"],"interval":"5m","description":"Detects reg command lines that disables PPL on the LSA process","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa].*/ AND process.command_line:/.*\\ [Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*\\ \\/[Dd]\\ 0.*/ AND process.command_line:/.*\\ \\/[Vv]\\ [Rr][Uu][Nn][Aa][Ss][Pp][Pp][Ll]\\ .*/ AND process.command_line:(/.*[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/))","rule_id":"8c0eca51-0f88-4db2-9183-fdfb10c703f9","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa* AND process.command_line:*\\ add\\ * AND process.command_line:*\\ \\/d\\ 0* AND process.command_line:*\\ \\/v\\ RunAsPPL\\ * AND process.command_line:(*Real\\-Time\\ Protection* OR *TamperProtection*))`"}
