{"id":"79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5","created_by":"frack113","name":"Suspicious Msiexec Quiet Install","tags":["attack.defense_evasion","attack.t1218.007"],"interval":"5m","description":"Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Ii].*/ AND process.command_line:/.*\\ \\/[Qq].*/)","rule_id":"79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\msiexec.exe AND process.command_line:*\\ \\/i* AND process.command_line:*\\ \\/q*)`"}
