{"id":"44143844-0631-49ab-97a0-96387d6b2d7c","created_by":"Nasreddine Bencherchali","name":"Download Files Using Notepad++ GUP Utility","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects execution of the Notepad++ updater (gup) from a process other than Notepad++ to download files.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other parent processes other than notepad++ using GUP that are not currently identified"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Gg][Uu][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Gg][Uu][Pp]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\-[Uu][Nn][Zz][Ii][Pp][Tt][Oo]\\ .*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/)) AND (NOT (process.parent.executable:/.*\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\+\\+\\.[Ee][Xx][Ee]/)))","rule_id":"44143844-0631-49ab-97a0-96387d6b2d7c","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1535322182863179776"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\GUP.exe OR process.pe.original_file_name:gup.exe) AND (process.command_line:*\\ \\-unzipTo\\ * AND process.command_line:*http*)) AND (NOT (process.parent.executable:*\\\\notepad\\+\\+.exe)))`"}
