{"id":"ce6e34ca-966d-41c9-8d93-5b06c8b97a06","created_by":"Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Chafer Activity","tags":["attack.persistence","attack.g0049","attack.t1053.005","attack.s0111","attack.t1543.003","attack.defense_evasion","attack.t1112","attack.command_and_control","attack.t1071.004"],"interval":"5m","description":"Detects Chafer activity attributed to OilRig as reported in Nyotron report in March 2018","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*[Ii]/ OR /.*[Uu]/)) OR (process.command_line:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Aa][Ss][Kk][Bb][Aa][Rr]\\\\[Aa][Uu][Tt][Oo][Ii][Tt]3\\.[Ee][Xx][Ee]/ OR process.command_line:/[Cc]\\:\\\\[Ww][Ss][Cc]\\.[Ee][Xx][Ee].*/) OR (process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Dd][Bb]\\\\.*/ AND process.executable:/.*\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\-[Qq]\\=[Tt][Xx][Tt].*/ AND process.parent.executable:/.*\\\\[Aa][Uu][Tt][Oo][Ii][Tt].*/))","rule_id":"ce6e34ca-966d-41c9-8d93-5b06c8b97a06","timestamp_override":"event.ingested","references":["https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\\\Service.exe* AND process.command_line:(*i OR *u)) OR (process.command_line:*\\\\microsoft\\\\Taskbar\\\\autoit3.exe OR process.command_line:C\\:\\\\wsc.exe*) OR (process.executable:*\\\\Windows\\\\Temp\\\\DB\\\\* AND process.executable:*.exe) OR (process.command_line:*\\\\nslookup.exe* AND process.command_line:*\\-q\\=TXT* AND process.parent.executable:*\\\\Autoit*))`"}
