{"id":"e32d4572-9826-4738-b651-95fa63747e8a","created_by":"Florian Roth","name":"FromBase64String Command Line","tags":["attack.t1027","attack.defense_evasion","attack.t1140","attack.t1059.001"],"interval":"5m","description":"Detects suspicious FromBase64String expressions in command line arguments","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative script libraries"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\:\\:[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/","rule_id":"e32d4572-9826-4738-b651-95fa63747e8a","timestamp_override":"event.ingested","references":["https://gist.github.com/Neo23x0/6af876ee72b51676c82a2db8d2cd3639"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*\\:\\:FromBase64String\\(*`"}
