{"id":"d1aa3382-abab-446f-96ea-4de52908210b","created_by":"Florian Roth","name":"TAIDOOR RAT DLL Load","tags":["attack.execution","attack.t1055.001"],"interval":"5m","description":"Detects specific process characteristics of Chinese TAIDOOR RAT malware load","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Dd][Ll][Ll],[Mm][Yy][Ss][Tt][Aa][Rr][Tt].*/ OR /.*[Dd][Ll][Ll]\\ [Mm][Yy][Ss][Tt][Aa][Rr][Tt].*/) OR (process.command_line:/.*\\ [Mm][Yy][Ss][Tt][Aa][Rr][Tt]/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/))","rule_id":"d1aa3382-abab-446f-96ea-4de52908210b","timestamp_override":"event.ingested","references":["https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*dll,MyStart* OR *dll\\ MyStart*) OR (process.command_line:*\\ MyStart AND process.command_line:*rundll32.exe*))`"}
