{"id":"fa00b701-44c6-4679-994d-5a18afa8a707","created_by":"Florian Roth","name":"Suspicious AdvancedRun Runas Priv User","tags":null,"interval":"5m","description":"Detects the execution of AdvancedRun utility in the context of the TrustedInstaller, SYSTEM, Local Service or Network Service accounts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\/[Ee][Xx][Ee][Ff][Ii][Ll][Ee][Nn][Aa][Mm][Ee].*/ OR /.*\\/[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee].*/) AND (process.command_line:(/.*\\ \\/[Rr][Uu][Nn][Aa][Ss]\\ 8\\ .*/ OR /.*\\ \\/[Rr][Uu][Nn][Aa][Ss]\\ 4\\ .*/ OR /.*\\ \\/[Rr][Uu][Nn][Aa][Ss]\\ 10\\ .*/ OR /.*\\ \\/[Rr][Uu][Nn][Aa][Ss]\\ 11\\ .*/) OR process.command_line:(/.*\\/[Rr][Uu][Nn][Aa][Ss]\\ 8/ OR /.*\\/[Rr][Uu][Nn][Aa][Ss]\\ 4/ OR /.*\\/[Rr][Uu][Nn][Aa][Ss]\\ 10/ OR /.*\\/[Rr][Uu][Nn][Aa][Ss]\\ 11/)))","rule_id":"fa00b701-44c6-4679-994d-5a18afa8a707","timestamp_override":"event.ingested","references":["https://twitter.com/splinter_code/status/1483815103279603714","https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3","https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/","https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\/EXEFilename* OR *\\/CommandLine*) AND (process.command_line:(*\\ \\/RunAs\\ 8\\ * OR *\\ \\/RunAs\\ 4\\ * OR *\\ \\/RunAs\\ 10\\ * OR *\\ \\/RunAs\\ 11\\ *) OR process.command_line:(*\\/RunAs\\ 8 OR *\\/RunAs\\ 4 OR *\\/RunAs\\ 10 OR *\\/RunAs\\ 11)))`"}
