{"id":"58f50261-c53b-4c88-bd12-1d71f12eda4c","created_by":"frack113","name":"Windows Credential Manager Access via VaultCmd","tags":["attack.credential_access","attack.t1555.004"],"interval":"5m","description":"List credentials currently stored in Windows Credential Manager via the native Windows utility vaultcmd.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Vv][Aa][Uu][Ll][Tt][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Vv][Aa][Uu][Ll][Tt][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\/[Ll][Ii][Ss][Tt][Cc][Rr][Ee][Dd][Ss]\\:.*/)","rule_id":"58f50261-c53b-4c88-bd12-1d71f12eda4c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.004/T1555.004.md#atomic-test-1---access-saved-credentials-via-vaultcmd"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\VaultCmd.exe OR process.pe.original_file_name:VAULTCMD.EXE) AND process.command_line:*\\/listcreds\\:*)`"}
