{"id":"b98d0db6-511d-45de-ad02-e82a98729620","created_by":"Nasreddine Bencherchali","name":"Mshta Remotely Hosted HTA File Execution","tags":["attack.defense_evasion","attack.execution","attack.t1218.005"],"interval":"5m","description":"Detects execution of the \"mshta\" utility with an argument containing the \"http\" keyword, which could indicate that an attacker is executing a remotely hosted malicious hta file","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Tt][Tt][Pp]\\:\\/\\/.*/ OR /.*[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/.*/ OR /.*[Ff][Tt][Pp]\\:\\/\\/.*/))","rule_id":"b98d0db6-511d-45de-ad02-e82a98729620","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\mshta.exe OR process.pe.original_file_name:MSHTA.EXE) AND process.command_line:(*http\\:\\/\\/* OR *https\\:\\/\\/* OR *ftp\\:\\/\\/*))`"}
