{"id":"f0507c0f-a3a2-40f5-acc6-7f543c334993","created_by":"pH-T","name":"Suspicious Net Use Command Combo","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects net use command combo which executes files from WebDAV server; seen in malicious LNK files","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\ [Nn][Ee][Tt]\\ [Uu][Ss][Ee]\\ [Hh][Tt][Tt][Pp].*/ AND process.command_line:/.*\\&\\ [Ss][Tt][Aa][Rr][Tt]\\ \\/[Bb]\\ .*/ AND process.command_line:/.*\\\\[Dd][Aa][Vv][Ww][Ww][Ww][Rr][Oo][Oo][Tt]\\\\.*/ AND process.command_line:(/.*\\.[Ee][Xx][Ee]\\ .*/ OR /.*\\.[Dd][Ll][Ll]\\ .*/ OR /.*\\.[Bb][Aa][Tt]\\ .*/ OR /.*\\.[Vv][Bb][Ss]\\ .*/ OR /.*\\.[Pp][Ss]1\\ .*/))","rule_id":"f0507c0f-a3a2-40f5-acc6-7f543c334993","timestamp_override":"event.ingested","references":["https://twitter.com/ShadowChasing1/status/1552595370961944576","https://www.virustotal.com/gui/file/a63376ee1dba76361df73338928e528ca5b20171ea74c24581605366dcaa0104/behavior"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cmd.exe* AND process.command_line:*\\ net\\ use\\ http* AND process.command_line:*&\\ start\\ \\/b\\ * AND process.command_line:*\\\\DavWWWRoot\\\\* AND process.command_line:(*.exe\\ * OR *.dll\\ * OR *.bat\\ * OR *.vbs\\ * OR *.ps1\\ *))`"}
