{"id":"554601fb-9b71-4bcc-abf4-21a611be4fde","created_by":"frack113","name":"Suspicious Recursif Takeown","tags":["attack.defense_evasion","attack.t1222.001"],"interval":"5m","description":"Adversaries can interact with the DACLs using built-in Windows commands takeown which can grant adversaries higher permissions on specific files and folders","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Scripts created by developers and admins","Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Tt][Aa][Kk][Ee][Oo][Ww][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ff]\\ .*/ AND process.command_line:/.*\\/[Rr].*/)","rule_id":"554601fb-9b71-4bcc-abf4-21a611be4fde","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/takeown","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md#atomic-test-1---take-ownership-using-takeown-utility"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\takeown.exe AND process.command_line:*\\/f\\ * AND process.command_line:*\\/r*)`"}
