{"id":"24c8392b-aa3c-46b7-a545-43f71657fe98","created_by":"Nasreddine Bencherchali","name":"Suspicious Schtasks Schedule Types","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"Detects scheduled task creations or modification on a suspicious schedule type","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitmate processes that run at logon. Filter according to your environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ [Oo][Nn][Ll][Oo][Gg][Oo][Nn]\\ .*/ OR /.*\\ [Oo][Nn][Ss][Tt][Aa][Rr][Tt]\\ .*/ OR /.*\\ [Oo][Nn][Cc][Ee]\\ .*/ OR /.*\\ [Oo][Nn][Ii][Dd][Ll][Ee]\\ .*/)) AND (NOT ((process.command_line:(/.*[Nn][Tt]\\ [Aa][Uu][Tt].*/ OR /.*\\ [Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*[Hh][Ii][Gg][Hh][Ee][Ss][Tt].*/)))))","rule_id":"24c8392b-aa3c-46b7-a545-43f71657fe98","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create","http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\schtasks.exe OR process.pe.original_file_name:schtasks.exe) AND process.command_line:(*\\ ONLOGON\\ * OR *\\ ONSTART\\ * OR *\\ ONCE\\ * OR *\\ ONIDLE\\ *)) AND (NOT ((process.command_line:(*NT\\ AUT* OR *\\ SYSTEM* OR *HIGHEST*)))))`"}
