{"id":"949f1ffb-6e85-4f00-ae1e-c3c5b190d605","created_by":"Florian Roth, Nasreddine Bencherchali","name":"Explorer Process Tree Break","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"Detects a command line process that uses explorer.exe to launch arbitrary commands or binaries, which is similar to cmd.exe /c, only it breaks the process tree and makes its parent a new instance of explorer spawning from \"svchost\"","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown how many legitimate software products use that method"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\/[Ff][Aa][Cc][Tt][Oo][Rr][Yy],\\{75[Dd][Ff][Ff]2[Bb]7\\-6936\\-4[Cc]06\\-[Aa]8[Bb][Bb]\\-676[Aa]7[Bb]00[Bb]24[Bb]\\}.*/","rule_id":"949f1ffb-6e85-4f00-ae1e-c3c5b190d605","timestamp_override":"event.ingested","references":["https://twitter.com/CyberRaiju/status/1273597319322058752","https://twitter.com/bohops/status/1276357235954909188?s=12","https://twitter.com/nas_bench/status/1535322450858233858","https://securityboulevard.com/2019/09/deobfuscating-ostap-trickbots-34000-line-javascript-downloader/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*\\/factory,\\{75dff2b7\\-6936\\-4c06\\-a8bb\\-676a7b00b24b\\}*`"}
