{"id":"cc368ed0-2411-45dc-a222-510ace303cb2","created_by":"Nasreddine Bencherchali","name":"Regasm/Regsvcs Suspicious Execution","tags":["attack.defense_evasion","attack.t1218.009"],"interval":"5m","description":"Detects suspicious execution of Regasm/Regsvcs utilities","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:(/.*\\\\[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ OR /[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/)) OR ((process.executable:(/.*\\\\[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Rr][Ee][Gg][Ss][Vv][Cc][Ss]\\.[Ee][Xx][Ee]/ OR /[Rr][Ee][Gg][Aa][Ss][Mm]\\.[Ee][Xx][Ee]/)) AND (NOT (process.command_line:/.*\\.[Dd][Ll][Ll].*/))))","rule_id":"cc368ed0-2411-45dc-a222-510ace303cb2","timestamp_override":"event.ingested","references":["https://www.fortiguard.com/threat-signal-report/4718?s=09","https://lolbas-project.github.io/lolbas/Binaries/Regasm/","https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:(*\\\\Regsvcs.exe OR *\\\\Regasm.exe) OR process.pe.original_file_name:(RegSvcs.exe OR RegAsm.exe)) AND process.command_line:(*\\\\Users\\\\Public\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*)) OR ((process.executable:(*\\\\Regsvcs.exe OR *\\\\Regasm.exe) OR process.pe.original_file_name:(RegSvcs.exe OR RegAsm.exe)) AND (NOT (process.command_line:*.dll*))))`"}
