{"id":"782d6f3e-4c5d-4b8c-92a3-1d05fed72e63","created_by":"Florian Roth, oscd.community","name":"Netsh RDP Port Forwarding","tags":["attack.lateral_movement","attack.defense_evasion","attack.command_and_control","attack.t1090"],"interval":"5m","description":"Detects netsh commands that configure a port forwarding of port 3389 used for RDP","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ii].*/ AND process.command_line:/.*\\ [Pp].*/ AND process.command_line:/.*\\=3389.*/ AND process.command_line:/.*\\ [Cc].*/)","rule_id":"782d6f3e-4c5d-4b8c-92a3-1d05fed72e63","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\netsh.exe AND process.command_line:*i* AND process.command_line:*\\ p* AND process.command_line:*\\=3389* AND process.command_line:*\\ c*)`"}
