{"id":"f0f7be61-9cf5-43be-9836-99d6ef448a18","created_by":"frack113","name":"Uninstall Crowdstrike Falcon","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Adversaries may disable security tools to avoid possible detection of their tools and activities by uninstalling Crowdstrike Falcon","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Uninstall by admin"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Ss][Ee][Nn][Ss][Oo][Rr]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\ \\/[Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:/.*\\ \\/[Qq][Uu][Ii][Ee][Tt].*/)","rule_id":"f0f7be61-9cf5-43be-9836-99d6ef448a18","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\WindowsSensor.exe* AND process.command_line:*\\ \\/uninstall* AND process.command_line:*\\ \\/quiet*)`"}
