{"id":"9c8c7000-3065-44a8-a555-79bcba5d9955","created_by":"Nasreddine Bencherchali","name":"Execute MSDT Via Answer File","tags":["attack.defense_evasion","attack.t1218","attack.execution"],"interval":"5m","description":"Detects execution of \"msdt.exe\" using an answer file which is simulating the legitimate way of calling msdt via \"pcwrun.exe\" (For example from the compatibility tab)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible undocumented parents of \"msdt\" other than \"pcwrun\""],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss]\\\\[Ii][Nn][Dd][Ee][Xx]\\\\[Pp][Cc][Ww][Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc]\\.[Xx][Mm][Ll].*/ AND process.command_line:(/.*\\ \\-[Aa][Ff]\\ .*/ OR /.*\\ \\/[Aa][Ff]\\ .*/)) AND (NOT (process.parent.executable:/.*\\\\[Pp][Cc][Ww][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)))","rule_id":"9c8c7000-3065-44a8-a555-79bcba5d9955","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Msdt/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\msdt.exe AND process.command_line:*\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml* AND process.command_line:(*\\ \\-af\\ * OR *\\ \\/af\\ *)) AND (NOT (process.parent.executable:*\\\\pcwrun.exe)))`"}
