{"id":"52cad028-0ff0-4854-8f67-d25dfcbc78b4","created_by":"Maxim Pavlunin","name":"HTML Help Shell Spawn","tags":["attack.defense_evasion","attack.t1218.001","attack.t1218.010","attack.t1218.011","attack.execution","attack.t1059.001","attack.t1059.003","attack.t1059.005","attack.t1059.007","attack.t1047"],"interval":"5m","description":"Detects a suspicious child process of a Microsoft HTML Help system when executing compiled HTML files (.chm)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/))","rule_id":"52cad028-0ff0-4854-8f67-d25dfcbc78b4","timestamp_override":"event.ingested","references":["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:C\\:\\\\Windows\\\\hh.exe AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\regsvr32.exe OR *\\\\wmic.exe OR *\\\\rundll32.exe))`"}
