{"id":"4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67","created_by":"Florian Roth","name":"Renamed ProcDump","tags":["attack.defense_evasion","attack.t1036.003"],"interval":"5m","description":"Detects the execution of a renamed ProcDump executable often used by attackers or malware","risk_score":73,"enabled":true,"severity":"high","false_positives":["Procdump illegaly bundled with legitimate software","Weird admins who renamed binaries (and should be investigated)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]/ OR (process.command_line:(/.*\\ \\-[Mm][Aa]\\ .*/ OR /.*\\ \\/[Mm][Aa]\\ .*/) AND process.command_line:(/.*\\ \\-[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa]\\ .*/ OR /.*\\ \\/[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa]\\ .*/))) AND (NOT (process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/))))","rule_id":"4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/procdump"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:procdump OR (process.command_line:(*\\ \\-ma\\ * OR *\\ \\/ma\\ *) AND process.command_line:(*\\ \\-accepteula\\ * OR *\\ \\/accepteula\\ *))) AND (NOT (process.executable:(*\\\\procdump.exe OR *\\\\procdump64.exe))))`"}
