{"id":"166e9c50-8cd9-44af-815d-d1f0c0e90dde","created_by":"Tim Burrell","name":"Suspect Svchost Memory Asccess","tags":["attack.defense_evasion","attack.t1562.002"],"interval":"5m","description":"Detects suspect access to svchost process memory such as that used by Invoke-Phantom to kill the winRM windows event logging service.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]1[Ff]3[Ff][Ff][Ff]/ AND winlog.event_data.CallTrace:/.*[Uu][Nn][Kk][Nn][Oo][Ww][Nn].*/)","rule_id":"166e9c50-8cd9-44af-815d-d1f0c0e90dde","timestamp_override":"event.ingested","references":["https://github.com/hlldz/Invoke-Phant0m","https://twitter.com/timbmsft/status/900724491076214784"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\WINDOWS\\\\System32\\\\svchost.exe AND winlog.event_data.GrantedAccess:0x1F3FFF AND winlog.event_data.CallTrace:*UNKNOWN*)`"}
