{"id":"32d0d3e2-e58d-4d41-926b-18b520b2b32d","created_by":"Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community (update)","name":"Credentials Dumping Tools Accessing LSASS Memory","tags":["attack.credential_access","attack.t1003.001","attack.s0002","car.2019-04-004"],"interval":"5m","description":"Detects process access LSASS memory which is typical for credentials dumping tools","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate software accessing LSASS process for legitimate reason; please add more filters"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/0[Xx]40.*/ OR /0[Xx]100000.*/ OR /0[Xx]1410.*/ OR /0[Xx]1438.*/ OR /0[Xx]143[Aa].*/ OR /0[Xx]1418.*/ OR /0[Xx]1[Ff]0[Ff][Ff][Ff].*/ OR /0[Xx]1[Ff]1[Ff][Ff][Ff].*/ OR /0[Xx]1[Ff]2[Ff][Ff][Ff].*/ OR /0[Xx]1[Ff]3[Ff][Ff][Ff].*/)) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Ee][Rr][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.CallTrace:/.*|[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Dd][Ee][Ff][Ii][Nn][Ii][Tt][Ii][Oo][Nn]\\ [Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\\\{.*/ AND winlog.event_data.CallTrace:/.*\\}\\\\[Mm][Pp][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Dd][Ll][Ll]\\+.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1418/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\.*/ AND process.executable:/.*\\\\[Gg][Aa][Mm][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/0[Xx]1410/ OR /0[Xx]410/)) OR (process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Bb][Aa][Mm][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:(/0[Xx]1410/ OR /0[Xx]410/ OR /0[Xx]40/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\.*/ AND process.executable:/.*\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]100000/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:(/0[Xx]1410/ OR /0[Xx]410/)) OR (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\-64\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:(/0[Xx]40/ OR /0[Xx]1010/)) OR (process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]401/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:/0[Xx]1000000/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Rr][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/0[Xx]1410/ OR /0[Xx]1418/)) OR (winlog.event_data.GrantedAccess:/0[Xx]40/ AND process.executable:(/.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]64\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/) AND winlog.event_data.GrantedAccess:(/0[Xx]1410/ OR /0[Xx]410/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/ AND process.executable:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]401/))))","rule_id":"32d0d3e2-e58d-4d41-926b-18b520b2b32d","timestamp_override":"event.ingested","references":["https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow","https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html","https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(0x40* OR 0x100000* OR 0x1410* OR 0x1438* OR 0x143a* OR 0x1418* OR 0x1f0fff* OR 0x1f1fff* OR 0x1f2fff* OR 0x1f3fff*)) AND (NOT ((process.executable:(C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe OR C\\:\\\\Windows\\\\System32\\\\perfmon.exe)) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\svchost.exe AND winlog.event_data.CallTrace:*|C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Definition\\ Updates\\\\\\{* AND winlog.event_data.CallTrace:*\\}\\\\mpengine.dll\\+* AND winlog.event_data.GrantedAccess:0x1418) OR (process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable:*\\\\GamingServices.exe AND winlog.event_data.GrantedAccess:(0x1410 OR 0x410)) OR (process.executable:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE OR *C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe OR *\\\\MBAMInstallerService.exe) AND winlog.event_data.GrantedAccess:(0x1410 OR 0x410 OR 0x40)) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe AND winlog.event_data.GrantedAccess:0x100000) OR (process.executable:(C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\wmiprvse.exe OR C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe OR C\\:\\\\Windows\\\\System32\\\\msiexec.exe) AND winlog.event_data.GrantedAccess:(0x1410 OR 0x410)) OR (process.executable:(*\\\\thor.exe OR *\\\\thor64.exe OR *\\\\aurora\\-agent.exe OR *\\\\aurora\\-agent\\-64.exe) AND winlog.event_data.GrantedAccess:(0x40 OR 0x1010)) OR (process.executable:*\\\\explorer.exe AND winlog.event_data.GrantedAccess:0x401) OR (process.executable:(C\\:\\\\Windows\\\\system32\\\\wininit.exe OR C\\:\\\\Windows\\\\System32\\\\lsass.exe) AND winlog.event_data.GrantedAccess:0x1000000) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\MRT.exe AND winlog.event_data.GrantedAccess:(0x1410 OR 0x1418)) OR (winlog.event_data.GrantedAccess:0x40 AND process.executable:(*\\\\handle.exe OR *\\\\handle64.exe)) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND winlog.event_data.GrantedAccess:(0x1410 OR 0x410)) OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\* AND process.executable:*\\\\Installer\\\\setup.exe) OR (process.executable:*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe AND winlog.event_data.GrantedAccess:0x401))))`"}
