{"id":"d7eb979b-c2b5-4a6f-a3a7-c87ce6763819","created_by":"Florian Roth","name":"Suspicious Control Panel DLL Load","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects suspicious Rundll32 execution from control.exe as used by Equation Group and Exploit Kits","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]\\ /) AND (NOT (process.command_line:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/)))","rule_id":"d7eb979b-c2b5-4a6f-a3a7-c87ce6763819","timestamp_override":"event.ingested","references":["https://twitter.com/rikvduijn/status/853251879320662017"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\System32\\\\control.exe AND process.executable:*\\\\rundll32.exe\\ ) AND (NOT (process.command_line:*Shell32.dll*)))`"}
