{"id":"5cddf373-ef00-4112-ad72-960ac29bac34","created_by":"wagga, Jonhnathan Ribeiro, oscd.community","name":"Koadic Execution","tags":["attack.execution","attack.t1059.003","attack.t1059.005","attack.t1059.007"],"interval":"5m","description":"Detects command line parameters used by Koadic hack tool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Qq].*/ AND process.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*[Cc][Hh][Cc][Pp].*/)","rule_id":"5cddf373-ef00-4112-ad72-960ac29bac34","timestamp_override":"event.ingested","references":["https://unit42.paloaltonetworks.com/unit42-sofacy-groups-parallel-attacks/","https://github.com/offsecginger/koadic/blob/457f9a3ff394c989cdb4c599ab90eb34fb2c762c/data/stager/js/stdlib.js","https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cmd.exe AND process.command_line:*\\/q* AND process.command_line:*\\/c* AND process.command_line:*chcp*)`"}
