{"id":"9be34ad0-b6a7-4fbd-91cf-fc7ec1047f5f","created_by":"Florian Roth","name":"UNC2452 Process Creation Patterns","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects a specific process creation patterns as seen used by UNC2452 and provided by Microsoft as Microsoft Defender ATP queries","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((process.command_line:/.*7[Zz]\\.[Ee][Xx][Ee]\\ [Aa]\\ \\-[Vv]500[Mm]\\ \\-[Mm][Xx]9\\ \\-[Rr]0\\ \\-[Pp].*/ OR (process.parent.command_line:/.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee].*/ AND process.parent.command_line:/.*\\.[Vv][Bb][Ss].*/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll],[Tt][Kk]_.*/)) OR (process.parent.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/ AND process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/)) OR (process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ AND process.command_line:/.*\\.[Dd][Ll][Ll]\\ .*/)) OR ((process.parent.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) AND (NOT (process.command_line:(\\  OR \"\")))))","rule_id":"9be34ad0-b6a7-4fbd-91cf-fc7ec1047f5f","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((process.command_line:*7z.exe\\ a\\ \\-v500m\\ \\-mx9\\ \\-r0\\ \\-p* OR (process.parent.command_line:*wscript.exe* AND process.parent.command_line:*.vbs* AND process.command_line:*rundll32.exe* AND process.command_line:*C\\:\\\\Windows* AND process.command_line:*.dll,Tk_*)) OR (process.parent.executable:*\\\\rundll32.exe AND process.parent.command_line:*C\\:\\\\Windows* AND process.command_line:*cmd.exe\\ \\/C\\ *)) OR (process.command_line:*rundll32\\ c\\:\\\\windows\\\\* AND process.command_line:*.dll\\ *)) OR ((process.parent.executable:*\\\\rundll32.exe AND process.executable:*\\\\dllhost.exe) AND (NOT (process.command_line:(\\  OR \"\")))))`"}
