{"id":"df55196f-f105-44d3-a675-e9dfb6cc2f2b","created_by":"Florian Roth","name":"Renamed AdFind Detection","tags":["attack.discovery","attack.t1018","attack.t1087.002","attack.t1482","attack.t1069.002"],"interval":"5m","description":"Detects the use of a renamed Adfind.exe. AdFind continues to be seen across majority of breaches. It is used to domain trust discovery to plan out subsequent steps in the attack chain.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.imphash:(/[Bb][Cc][Aa]5675746[Dd]13[Aa]1[Ff]246[Ee]2[Dd][Aa]3[Cc]2217492/ OR /53[Ee]117[Aa]96057[Ee][Aa][Ff]19[Cc]41380[Dd]0[Ee]87[Ff]1[Cc]2/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Bb][Cc][Aa]5675746[Dd]13[Aa]1[Ff]246[Ee]2[Dd][Aa]3[Cc]2217492.*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=53[Ee]117[Aa]96057[Ee][Aa][Ff]19[Cc]41380[Dd]0[Ee]87[Ff]1[Cc]2.*/)) AND (NOT (process.executable:/.*\\\\[Aa][Dd][Ff][Ii][Nn][Dd]\\.[Ee][Xx][Ee]/ AND process.pe.original_file_name:/[Aa][Dd][Ff][Ii][Nn][Dd]\\.[Ee][Xx][Ee]/)))","rule_id":"df55196f-f105-44d3-a675-e9dfb6cc2f2b","timestamp_override":"event.ingested","references":["https://www.joeware.net/freetools/tools/adfind/","https://thedfirreport.com/2020/05/08/adfind-recon/","https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/","https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/","https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx","https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.imphash:(bca5675746d13a1f246e2da3c2217492 OR 53e117a96057eaf19c41380d0e87f1c2) OR related.hash:(*IMPHASH\\=BCA5675746D13A1F246E2DA3C2217492* OR *IMPHASH\\=53E117A96057EAF19C41380D0E87F1C2*)) AND (NOT (process.executable:*\\\\AdFind.exe AND process.pe.original_file_name:AdFind.exe)))`"}
