{"id":"dc4576d4-7467-424f-9eee-fd2b02855fe0","created_by":"Nasreddine Bencherchali","name":"MSDT.EXE Execution With Suspicious Cab Option","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects execution of msdt.exe using the \"cab\" flag which could indicates suspicious diagcab files with embedded answer files leveraging CVE-2022-30190","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of \".diagcab\" files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\/[Cc][Aa][Bb]\\ .*/ OR /.*\\ \\-[Cc][Aa][Bb]\\ .*/))","rule_id":"dc4576d4-7467-424f-9eee-fd2b02855fe0","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1537896324837781506"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\msdt.exe OR process.pe.original_file_name:msdt.exe) AND process.command_line:(*\\ \\/cab\\ * OR *\\ \\-cab\\ *))`"}
