{"id":"82880171-b475-4201-b811-e9c826cd5eaa","created_by":"Oddvar Moe, Sander Wiebing, oscd.community","name":"Exports Critical Registry Keys To a File","tags":["attack.exfiltration","attack.t1012"],"interval":"5m","description":"Detects the export of a crital Registry key to a file.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Ee]\\ .*/ OR /.*\\ \\-[Ee]\\ .*/) AND process.command_line:(/.*[Hh][Kk][Ll][Mm].*/ OR /.*[Hh][Kk][Ee][Yy]_[Ll][Oo][Cc][Aa][Ll]_[Mm][Aa][Cc][Hh][Ii][Nn][Ee].*/) AND process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]/ OR /.*\\\\[Ss][Aa][Mm]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]/))","rule_id":"82880171-b475-4201-b811-e9c826cd5eaa","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Regedit/","https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/E\\ * OR *\\ \\-E\\ *) AND process.command_line:(*hklm* OR *hkey_local_machine*) AND process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security))`"}
