{"id":"4833155a-4053-4c9c-a997-777fcea0baa7","created_by":"frack113","name":"SQLite Firefox Cookie DB Access","tags":["attack.credential_access","attack.t1539"],"interval":"5m","description":"Detect use of sqlite binary to query the Firefox cookies.sqlite database and steal the cookie data contained within it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.product:/[Ss][Qq][Ll][Ii][Tt][Ee]/ OR process.executable:/.*\\\\[Ss][Qq][Ll][Ii][Tt][Ee]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Cc][Oo][Oo][Kk][Ii][Ee][Ss]\\.[Ss][Qq][Ll][Ii][Tt][Ee].*/)","rule_id":"4833155a-4053-4c9c-a997-777fcea0baa7","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1539/T1539.md#atomic-test-1---steal-firefox-cookies-windows"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.product:SQLite OR process.executable:*\\\\sqlite.exe) AND process.command_line:*cookies.sqlite*)`"}
