{"id":"fb3722e4-1a06-46b6-b772-253e2e7db933","created_by":"oscd.community, Dmitry Uchakin","name":"Load Undocumented Autoelevated COM Interface","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"COM interface (EditionUpgradeManager) that is not used by standard executables.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.CallTrace:/.*[Ee][Dd][Ii][Tt][Ii][Oo][Nn][Uu][Pp][Gg][Rr][Aa][Dd][Ee][Mm][Aa][Nn][Aa][Gg][Ee][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll].*/","rule_id":"fb3722e4-1a06-46b6-b772-253e2e7db933","timestamp_override":"event.ingested","references":["https://www.snip2code.com/Snippet/4397378/UAC-bypass-using-EditionUpgradeManager-C/","https://gist.github.com/hfiref0x/de9c83966623236f5ebf8d9ae2407611"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.CallTrace:*editionupgrademanagerobj.dll*`"}
