{"id":"edc2f8ae-2412-4dfd-b9d5-0c57727e70be","created_by":"FPT.EagleEye, wagga","name":"Powershell Reverse Shell Connection","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the Nishang Invoke-PowerShellTcpOneLine reverse shell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative might use this function for checking network connectivity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Nn][Ee][Tt]\\.[Ss][Oo][Cc][Kk][Ee][Tt][Ss]\\.[Tt][Cc][Pp][Cc][Ll][Ii][Ee][Nn][Tt].*/)","rule_id":"edc2f8ae-2412-4dfd-b9d5-0c57727e70be","timestamp_override":"event.ingested","references":["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/","https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*new\\-object\\ system.net.sockets.tcpclient*)`"}
