{"id":"e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1","created_by":"frack113","name":"Enumeration for Credentials in Registry","tags":["attack.credential_access","attack.t1552.002"],"interval":"5m","description":"Adversaries may search the Registry on compromised systems for insecurely stored credentials.\nThe Windows Registry stores configuration information that can be used by the system or other programs.\nAdversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ [Qq][Uu][Ee][Rr][Yy]\\ .*/ AND process.command_line:/.*\\/[Tt]\\ .*/ AND process.command_line:/.*[Rr][Ee][Gg]_[Ss][Zz].*/ AND process.command_line:/.*\\/[Ss].*/) AND ((process.command_line:/.*\\/[Ff]\\ .*/ AND process.command_line:/.*[Hh][Kk][Ll][Mm].*/) OR (process.command_line:/.*\\/[Ff]\\ .*/ AND process.command_line:/.*[Hh][Kk][Cc][Uu].*/) OR process.command_line:/.*[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ss][Ii][Mm][Oo][Nn][Tt][Aa][Tt][Hh][Aa][Mm]\\\\[Pp][Uu][Tt][Tt][Yy]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss].*/))","rule_id":"e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe AND process.command_line:*\\ query\\ * AND process.command_line:*\\/t\\ * AND process.command_line:*REG_SZ* AND process.command_line:*\\/s*) AND ((process.command_line:*\\/f\\ * AND process.command_line:*HKLM*) OR (process.command_line:*\\/f\\ * AND process.command_line:*HKCU*) OR process.command_line:*HKCU\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions*))`"}
