{"id":"4627c6ae-6899-46e2-aa0c-6ebcb1becd19","created_by":"Florian Roth","name":"Impacket Tool Execution","tags":["attack.execution","attack.t1557.001"],"interval":"5m","description":"Detects the execution of different compiled Windows binaries of the impacket toolset (based on names or part of their names - could lead to false positives)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of the impacket tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Gg][Oo][Ll][Dd][Ee][Nn][Pp][Aa][Cc].*/ OR /.*\\\\[Kk][Aa][Rr][Mm][Aa][Ss][Mm][Bb].*/ OR /.*\\\\[Kk][Ii][Nn][Tt][Ee][Rr][Cc][Ee][Pp][Tt].*/ OR /.*\\\\[Nn][Tt][Ll][Mm][Rr][Ee][Ll][Aa][Yy][Xx].*/ OR /.*\\\\[Rr][Pp][Cc][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Ss][Aa][Mm][Rr][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Ss][Ee][Cc][Rr][Ee][Tt][Ss][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Ss][Mm][Bb][Ee][Xx][Ee][Cc].*/ OR /.*\\\\[Ss][Mm][Bb][Rr][Ee][Ll][Aa][Yy][Xx].*/ OR /.*\\\\[Ww][Mm][Ii][Ee][Xx][Ee][Cc].*/ OR /.*\\\\[Ww][Mm][Ii][Pp][Ee][Rr][Ss][Ii][Ss][Tt].*/) OR process.executable:(/.*\\\\[Aa][Tt][Ee][Xx][Ee][Cc]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Cc][Oo][Mm][Ee][Xx][Ee][Cc]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Pp][Aa][Pp][Ii]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ii][Oo][Nn]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Aa][Dd][Uu][Ss][Ee][Rr][Ss]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Nn][Pp][Uu][Ss][Ee][Rr][Ss]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Pp][Aa][Cc]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Ss][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Tt][Gg][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ee][Tt][Uu][Ss][Ee][Rr][Ss][Pp][Nn][Ss]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Ff][Mm][Aa][Pp]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Vv][Ii][Ee][Ww]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Mm][Aa][Pp][Aa][Nn][Ss][Ww][Ee][Rr][Mm][Aa][Cc][Hh][Ii][Nn][Ee]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Dd][Uu][Mm][Pp]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Dd][Pp]_[Cc][Hh][Ee][Cc][Kk]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Aa][Mm][Bb][Aa][Pp][Ii][Pp][Ee]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Bb][Cc][Ll][Ii][Ee][Nn][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Bb][Ss][Ee][Rr][Vv][Ee][Rr]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Nn][Ii][Ff][Ff][Ee][Rr]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Nn][Ii][Ff][Ff]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Ll][Ii][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ii][Cc][Kk][Ee][Tt][Ee][Rr]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ee][Xx][Ee]/))","rule_id":"4627c6ae-6899-46e2-aa0c-6ebcb1becd19","timestamp_override":"event.ingested","references":["https://github.com/ropnop/impacket_static_binaries/releases/tag/0.9.21-dev-binaries"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\goldenPac* OR *\\\\karmaSMB* OR *\\\\kintercept* OR *\\\\ntlmrelayx* OR *\\\\rpcdump* OR *\\\\samrdump* OR *\\\\secretsdump* OR *\\\\smbexec* OR *\\\\smbrelayx* OR *\\\\wmiexec* OR *\\\\wmipersist*) OR process.executable:(*\\\\atexec_windows.exe OR *\\\\dcomexec_windows.exe OR *\\\\dpapi_windows.exe OR *\\\\findDelegation_windows.exe OR *\\\\GetADUsers_windows.exe OR *\\\\GetNPUsers_windows.exe OR *\\\\getPac_windows.exe OR *\\\\getST_windows.exe OR *\\\\getTGT_windows.exe OR *\\\\GetUserSPNs_windows.exe OR *\\\\ifmap_windows.exe OR *\\\\mimikatz_windows.exe OR *\\\\netview_windows.exe OR *\\\\nmapAnswerMachine_windows.exe OR *\\\\opdump_windows.exe OR *\\\\psexec_windows.exe OR *\\\\rdp_check_windows.exe OR *\\\\sambaPipe_windows.exe OR *\\\\smbclient_windows.exe OR *\\\\smbserver_windows.exe OR *\\\\sniffer_windows.exe OR *\\\\sniff_windows.exe OR *\\\\split_windows.exe OR *\\\\ticketer_windows.exe))`"}
