{"id":"ca2092a1-c273-4878-9b4b-0d60115bf5ea","created_by":"Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, Anton Kutepov, oscd.community","name":"Suspicious Encoded PowerShell Command Line","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious powershell process starts with base64 encoded commands (e.g. Emotet)","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((process.command_line:/.*\\ \\-[Ee].*/ AND process.command_line:/.*\\ [Jj][Aa][Bb].*/) OR (process.command_line:/.*\\ \\-[Ee].*/ AND process.command_line:/.*\\ [Jj][Aa][Bb].*/ AND process.command_line:/.*\\ \\-[Ww].*/ AND process.command_line:/.*\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/)) OR (process.command_line:/.*\\ \\-[Ee].*/ AND process.command_line:(/.*\\ [Bb][Aa]\\^[Jj].*/ OR /.*\\ [Ss][Uu][Vv][Yy][Ii].*/ OR /.*\\ [Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa].*/ OR /.*\\ [Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa].*/ OR /.*\\ [Aa][Ww][Vv]4[Ii].*/ OR /.*\\ [Ii][Aa][Aa].*/ OR /.*\\ [Ii][Aa][Bb].*/ OR /.*\\ [Uu][Ww][Bb].*/ OR /.*\\ [Cc][Ww][Bb].*/)) OR process.command_line:/.*\\.[Ee][Xx][Ee]\\ \\-[Ee][Nn][Cc][Oo][Dd]\\ .*/) AND (NOT (process.command_line:/.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy].*/ AND process.command_line:/.*[Rr][Ee][Mm][Oo][Tt][Ee][Ss][Ii][Gg][Nn][Ee][Dd]\\ .*/)))","rule_id":"ca2092a1-c273-4878-9b4b-0d60115bf5ea","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((process.command_line:*\\ \\-e* AND process.command_line:*\\ JAB*) OR (process.command_line:*\\ \\-e* AND process.command_line:*\\ JAB* AND process.command_line:*\\ \\-w* AND process.command_line:*\\ hidden\\ *)) OR (process.command_line:*\\ \\-e* AND process.command_line:(*\\ BA\\^J* OR *\\ SUVYI* OR *\\ SQBFAFgA* OR *\\ aQBlAHgA* OR *\\ aWV4I* OR *\\ IAA* OR *\\ IAB* OR *\\ UwB* OR *\\ cwB*)) OR process.command_line:*.exe\\ \\-ENCOD\\ *) AND (NOT (process.command_line:*\\ \\-ExecutionPolicy* AND process.command_line:*remotesigned\\ *)))`"}
