{"id":"7fd4bb39-12d0-45ab-bb36-cebabc73dc7b","created_by":"Nasreddine Bencherchali","name":"Suspicious Execution of Sc to Delete AV Services","tags":["attack.execution","attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects when attackers use \"sc.exe\" to delete AV services from the system in order to avoid detection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate software deleting using the same method of deletion (Add it to a filter if you find cases as such)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ss][Cc]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ [Dd][Ee][Ll][Ee][Tt][Ee]\\ .*/ AND process.command_line:(/.*[Aa][Vv][Gg][Aa][Dd][Mm][Ii][Nn][Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Aa][Vv][Gg]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR /.*[Mm][Bb][Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Bb][Cc][Ll][Oo][Uu][Dd][Ee][Aa].*/ OR /.*[Aa][Vv][Gg][Aa][Dd][Mm][Ii][Nn][Cc][Ll][Ii][Ee][Nn][Tt].*/ OR /.*[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Aa][Vv][Aa][Dd][Mm][Ii][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Aa][Uu][Tt][Oo][Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Cc][Ll][Ee][Aa][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Dd][Ee][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Cc][Aa][Nn][Nn][Ee][Rr]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Hh][Ee][Aa][Ll][Tt][Hh]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Cc][Ss]\\ [Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Cc][Ss]\\ [Cc][Ll][Ii][Ee][Nn][Tt].*/ OR /.*[Ss][Nn][Tt][Pp][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ww][Cc]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ww][Ii]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Uu][Ii].*/ OR /.*[Ss][Ww][Ii]_[Uu][Pp][Dd][Aa][Tt][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ww][Ee][Bb]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ss][Aa][Ff][Ee][Ss][Tt][Oo][Rr][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Hh][Mm][Pp][Aa][Ll][Ee][Rr][Tt][Ss][Vv][Cc].*/ OR /.*[Rr][Pp][Cc][Ee][Pp][Tt][Mm][Aa][Pp][Pp][Ee][Rr].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss][Ff][Ii][Mm].*/ OR /.*[Ss][Ww][Ii]_[Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*[Ff][Ii][Rr][Ee][Bb][Ii][Rr][Dd][Gg][Uu][Aa][Rr][Dd][Ii][Aa][Nn][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*[Ff][Ii][Rr][Ee][Bb][Ii][Rr][Dd][Ss][Ee][Rr][Vv][Ee][Rr][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*[Ww][Rr][Ss][Vv][Cc].*/ OR /.*[Ee][Kk][Rr][Nn].*/ OR /.*[Ee][Kk][Rr][Nn][Ee][Pp][Ss][Ww].*/ OR /.*[Kk][Ll][Ii][Mm]6.*/ OR /.*[Aa][Vv][Pp]18\\.0\\.0.*/ OR /.*[Kk][Ll][Ii][Ff].*/ OR /.*[Kk][Ll][Pp][Dd].*/ OR /.*[Kk][Ll][Ff][Ll][Tt].*/ OR /.*[Kk][Ll][Bb][Aa][Cc][Kk][Uu][Pp][Dd][Ii][Ss][Kk].*/ OR /.*[Kk][Ll][Bb][Aa][Cc][Kk][Uu][Pp][Ff][Ll][Tt].*/ OR /.*[Kk][Ll][Kk][Bb][Dd][Ff][Ll][Tt].*/ OR /.*[Kk][Ll][Mm][Oo][Uu][Ff][Ll][Tt].*/ OR /.*[Kk][Ll][Hh][Kk].*/ OR /.*[Kk][Ss][Dd][Ee]1\\.0\\.0.*/ OR /.*[Kk][Ll][Tt][Aa][Pp].*/ OR /.*[Ss][Cc][Ss][Ee][Cc][Ss][Vv][Cc].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Mm][Aa][Ii][Ll]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ [Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ [Ss][Ee][Rr][Vv][Ee][Rr][Ee][Xx].*/ OR /.*[Oo][Nn][Ll][Ii][Nn][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ [Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*[Rr][Ee][Pp][Aa][Ii][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Bb][Rr][Oo][Ww][Ss][Ii][Nn][Gg]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Qq][Uu][Ii][Cc][Kk]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ OR /.*[Mm][Aa][Cc][Mm][Nn][Ss][Vv][Cc].*/ OR /.*[Mm][Aa][Ss][Vv][Cc].*/ OR /.*[Mm][Ff][Ee][Mm][Mm][Ss].*/ OR /.*[Mm][Ff][Ee][Vv][Tt][Pp].*/ OR /.*[Tt][Mm][Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*[Tt][Mm][Ll][Ww][Cc][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Tt][Mm][Uu][Ss][Aa].*/ OR /.*[Tt][Mm][Pp][Rr][Ee][Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*[Tt][Mm][Ss][Mm][Aa][Rr][Tt][Rr][Ee][Ll][Aa][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Tt][Mm][Ii][Cc][Rr][Cc][Ss][Cc][Aa][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Vv][Ss][Aa][Pp][Ii][Nn][Tt].*/ OR /.*[Tt][Mm][Cc][Cc][Ss][Ff].*/ OR /.*[Tt][Mm][Ll][Ii][Ss][Tt][Ee][Nn].*/ OR /.*[Tt][Mm][Pp][Rr][Oo][Xx][Yy].*/ OR /.*[Nn][Tt][Rr][Tt][Ss][Cc][Aa][Nn].*/ OR /.*[Oo][Ff][Cc][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Tt][Mm][Pp][Ff][Ww].*/ OR /.*[Pp][Cc][Cc][Nn][Tt][Uu][Pp][Dd].*/ OR /.*[Pp][Aa][Nn][Dd][Aa][Aa][Ee][Tt][Hh][Ee][Rr][Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Pp][Ss][Uu][Aa][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Nn][Aa][Nn][Oo][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Mm][Aa][Ii][Nn].*/ OR /.*[Ee][Pp][Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Rr][Ee][Dd][Ll][Ii][Nn][Ee].*/ OR /.*[Ee][Pp][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ee][Pp][Uu][Pp][Dd][Aa][Tt][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/))","rule_id":"7fd4bb39-12d0-45ab-bb36-cebabc73dc7b","timestamp_override":"event.ingested","references":["https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sc.exe OR process.pe.original_file_name:sc.exe) AND process.command_line:*\\ delete\\ * AND process.command_line:(*AvgAdminServer* OR *AVG\\ Antivirus* OR *MBEndpointAgent* OR *MBAMService* OR *MBCloudEA* OR *avgAdminClient* OR *SAVService* OR *SAVAdminService* OR *Sophos\\ AutoUpdate\\ Service* OR *Sophos\\ Clean\\ Service* OR *Sophos\\ Device\\ Control\\ Service* OR *Sophos\\ File\\ Scanner\\ Service* OR *Sophos\\ Health\\ Service* OR *Sophos\\ MCS\\ Agent* OR *Sophos\\ MCS\\ Client* OR *SntpService* OR *swc_service* OR *swi_service* OR *Sophos\\ UI* OR *swi_update* OR *Sophos\\ Web\\ Control\\ Service* OR *Sophos\\ System\\ Protection\\ Service* OR *Sophos\\ Safestore\\ Service* OR *hmpalertsvc* OR *RpcEptMapper* OR *Sophos\\ Endpoint\\ Defense\\ Service* OR *SophosFIM* OR *swi_filter* OR *FirebirdGuardianDefaultInstance* OR *FirebirdServerDefaultInstance* OR *WRSVC* OR *ekrn* OR *ekrnEpsw* OR *klim6* OR *AVP18.0.0* OR *KLIF* OR *klpd* OR *klflt* OR *klbackupdisk* OR *klbackupflt* OR *klkbdflt* OR *klmouflt* OR *klhk* OR *KSDE1.0.0* OR *kltap* OR *ScSecSvc* OR *Core\\ Mail\\ Protection* OR *Core\\ Scanning\\ Server* OR *Core\\ Scanning\\ ServerEx* OR *Online\\ Protection\\ System* OR *RepairService* OR *Core\\ Browsing\\ Protection* OR *Quick\\ Update\\ Service* OR *McAfeeFramework* OR *macmnsvc* OR *masvc* OR *mfemms* OR *mfevtp* OR *TmFilter* OR *TMLWCSService* OR *tmusa* OR *TmPreFilter* OR *TMSmartRelayService* OR *TMiCRCScanService* OR *VSApiNt* OR *TmCCSF* OR *tmlisten* OR *TmProxy* OR *ntrtscan* OR *ofcservice* OR *TmPfw* OR *PccNTUpd* OR *PandaAetherAgent* OR *PSUAService* OR *NanoServiceMain* OR *EPIntegrationService* OR *EPProtectedService* OR *EPRedline* OR *EPSecurityService* OR *EPUpdateService*))`"}
