{"id":"56321594-9087-49d9-bf10-524fe8479452","created_by":"Victor Sergeev, oscd.community","name":"Suspicious Netsh DLL Persistence","tags":["attack.privilege_escalation","attack.t1546.007","attack.s0108"],"interval":"5m","description":"Detects persitence via netsh helper","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Hh][Ee][Ll][Pp][Ee][Rr].*/)","rule_id":"56321594-9087-49d9-bf10-524fe8479452","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.007/T1546.007.md","https://attack.mitre.org/software/S0108/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\netsh.exe AND process.command_line:*add* AND process.command_line:*helper*)`"}
