{"id":"1ca6bd18-0ba0-44ca-851c-92ed89a61085","created_by":"Christian Burkard","name":"UAC Bypass Using Consent and Comctl32 - Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using consent.exe and comctl32.dll (UACMe 22)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/))","rule_id":"1ca6bd18-0ba0-44ca-851c-92ed89a61085","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\consent.exe AND process.executable:*\\\\werfault.exe AND winlog.event_data.IntegrityLevel:(High OR System))`"}
