{"id":"7fe71fc9-de3b-432a-8d57-8c809efc10ab","created_by":"Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community","name":"New Service Creation","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects creation of a new service.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrator or user creates a service for legitimate reasons."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*[Bb][Ii][Nn][Pp][Aa][Tt][Hh].*/) OR (process.command_line:/.*[Nn][Ee][Ww]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ AND process.command_line:/.*\\-[Bb][Ii][Nn][Aa][Rr][Yy][Pp][Aa][Tt][Hh][Nn][Aa][Mm][Ee].*/))","rule_id":"7fe71fc9-de3b-432a-8d57-8c809efc10ab","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sc.exe AND process.command_line:*create* AND process.command_line:*binPath*) OR (process.command_line:*New\\-Service* AND process.command_line:*\\-BinaryPathName*))`"}
