{"id":"dbc1f800-0fe0-4bc0-9c66-292c2abe3f78","created_by":"Nasreddine Bencherchali","name":"Delete Important Scheduled Task","tags":["attack.impact","attack.t1489"],"interval":"5m","description":"Detects when adversaries stop services or processes by disabling their respective schdueled tasks in order to conduct data destructive activities","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Dd][Ee][Ll][Ee][Tt][Ee].*/ AND process.command_line:/.*\\/[Tt][Nn].*/ AND process.command_line:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Tt][Oo][Rr][Ee]\\\\[Ss][Rr].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Bb][Ii][Tt][Ll][Oo][Cc][Kk][Ee][Rr].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Bb][Aa][Cc][Kk][Uu][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Uu][Pp][Dd][Aa][Tt][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Oo][Rr][Cc][Hh][Ee][Ss][Tt][Rr][Aa][Tt][Oo][Rr]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Ii][Tt][Gg][Uu][Aa][Rr][Dd].*/))","rule_id":"dbc1f800-0fe0-4bc0-9c66-292c2abe3f78","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\/delete* AND process.command_line:*\\/tn* AND process.command_line:(*\\\\Windows\\\\SystemRestore\\\\SR* OR *\\\\Windows\\\\Windows\\ Defender\\\\* OR *\\\\Windows\\\\BitLocker* OR *\\\\Windows\\\\WindowsBackup\\\\* OR *\\\\Windows\\\\WindowsUpdate\\\\* OR *\\\\Windows\\\\UpdateOrchestrator\\\\* OR *\\\\Windows\\\\ExploitGuard*))`"}
