{"id":"f956c7c1-0f60-4bc5-b7d7-b39ab3c08908","created_by":"frack113","name":"Use of PktMon.exe","tags":["attack.credential_access","attack.t1040"],"interval":"5m","description":"Tools to Capture Network Packets on the windows 10 with October 2018 Update or later.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*[Pp][Kk][Tt][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Pp][Kk][Tt][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/)","rule_id":"f956c7c1-0f60-4bc5-b7d7-b39ab3c08908","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Pktmon/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*PktMon.exe OR process.pe.original_file_name:PktMon.exe)`"}
