{"id":"8de1cbe8-d6f5-496d-8237-5f44a721c7a0","created_by":"Florian Roth","name":"Whoami Execution Anomaly","tags":["attack.discovery","attack.t1033","car.2016-03-001"],"interval":"5m","description":"Detects the execution of whoami with suspicious parents or parameters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Admin activity","Scripts and administrative tools used in the monitored environment","Monitoring activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((((process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/) AND (NOT (process.parent.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/)))) AND (NOT (process.parent.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ [Aa][Gg][Ee][Nn][Tt]\\\\[Aa][Gg][Ee][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR \"\")))) AND (NOT (NOT _exists_:process.parent.executable))) OR process.command_line:(/.*[Ww][Hh][Oo][Aa][Mm][Ii]\\ \\-[Aa][Ll][Ll].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\ \\/[Aa][Ll][Ll].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]\\ \\-[Aa][Ll][Ll].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]\\ \\/[Aa][Ll][Ll].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]\\ \\>.*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\ \\>.*/))","rule_id":"8de1cbe8-d6f5-496d-8237-5f44a721c7a0","timestamp_override":"event.ingested","references":["https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/","https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/","https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((((process.executable:*\\\\whoami.exe OR process.pe.original_file_name:whoami.exe) AND (NOT (process.parent.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe)))) AND (NOT (process.parent.executable:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Monitoring\\ Agent\\\\Agent\\\\MonitoringHost.exe OR \"\")))) AND (NOT (NOT _exists_:process.parent.executable))) OR process.command_line:(*whoami\\ \\-all* OR *whoami\\ \\/all* OR *whoami.exe\\ \\-all* OR *whoami.exe\\ \\/all* OR *whoami.exe\\ >* OR *whoami\\ >*))`"}
