{"id":"c4e49831-1496-40cf-8ce1-b53f942b02f9","created_by":"Florian Roth","name":"Renamed PAExec","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects suspicious renamed PAExec execution as often used by attackers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Weird admins that rename their tools","Software companies that bundle PAExec with their software and rename it, so that it is less embarrassing"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.description:/[Pp][Aa][Ee][Xx][Ee][Cc]\\ [Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]/ OR process.pe.original_file_name:/[Pp][Aa][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/) AND (NOT (process.executable:(/.*\\\\[Pp][Aa][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Aa][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/))))","rule_id":"c4e49831-1496-40cf-8ce1-b53f942b02f9","timestamp_override":"event.ingested","references":["https://www.poweradmin.com/paexec/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.description:PAExec\\ Application OR process.pe.original_file_name:PAExec.exe) AND (NOT (process.executable:(*\\\\PAexec.exe OR *\\\\paexec.exe))))`"}
