{"id":"0eb2107b-a596-422e-b123-b389d5594ed7","created_by":"Florian Roth","name":"Hurricane Panda Activity","tags":["attack.privilege_escalation","attack.g0009","attack.t1068"],"interval":"5m","description":"Detects Hurricane Panda Activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp].*/ AND process.command_line:/.*[Aa][Dd][Mm][Ii][Nn].*/ AND process.command_line:/.*\\/[Aa][Dd][Dd].*/) OR process.command_line:/.*\\\\[Ww][Ii][Nn]64\\.[Ee][Xx][Ee].*/)","rule_id":"0eb2107b-a596-422e-b123-b389d5594ed7","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/blog/crowdstrike-discovers-use-64-bit-zero-day-privilege-escalation-exploit-cve-2014-4113-hurricane-panda/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*localgroup* AND process.command_line:*admin* AND process.command_line:*\\/add*) OR process.command_line:*\\\\Win64.exe*)`"}
