{"id":"aaf46cdc-934e-4284-b329-34aa701e3771","created_by":"Beyu Denis, oscd.community","name":"Application Whitelisting Bypass via Bginfo","tags":["attack.execution","attack.t1059.005","attack.defense_evasion","attack.t1218","attack.t1202"],"interval":"5m","description":"Execute VBscript code that is referenced within the *.bgi file.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Bb][Gg][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Pp][Oo][Pp][Uu][Pp].*/ AND process.command_line:/.*\\/[Nn][Oo][Ll][Ii][Cc][Pp][Rr][Oo][Mm][Pp][Tt].*/)","rule_id":"aaf46cdc-934e-4284-b329-34aa701e3771","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Bginfo/","https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\bginfo.exe AND process.command_line:*\\/popup* AND process.command_line:*\\/nolicprompt*)`"}
