{"id":"869b9ca7-9ea2-4a5a-8325-e80e62f75445","created_by":"FPT.EagleEye Team, wagga","name":"Suspicious Shells Spawn by SQL Server","tags":["attack.t1505.003","attack.t1190","attack.initial_access","attack.persistence","attack.privilege_escalation"],"interval":"5m","description":"Detects suspicious shell spawn from MSSQL process, this might be sight of RCE or SQL Injection","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ss][Qq][Ll][Ss][Ee][Rr][Vv][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/ AND process.parent.executable:/.*[Dd][Aa][Tt][Ee][Vv]_[Dd][Bb][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Mm][Ss][Ss][Qq][Ll]\\\\[Bb][Ii][Nn][Nn]\\\\[Ss][Qq][Ll][Ss][Ee][Rr][Vv][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\\"\\ .*/))))","rule_id":"869b9ca7-9ea2-4a5a-8325-e80e62f75445","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\sqlservr.exe AND process.executable:(*\\\\cmd.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\bitsadmin.exe)) AND (NOT ((process.parent.executable:C\\:\\\\Program\\ Files\\\\Microsoft\\ SQL\\ Server\\\\* AND process.parent.executable:*DATEV_DBENGINE\\\\MSSQL\\\\Binn\\\\sqlservr.exe AND process.executable:C\\:\\\\Windows\\\\System32\\\\cmd.exe AND process.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\cmd.exe\\\"\\ *))))`"}
