{"id":"6e30c82f-a9f8-4aab-b79c-7c12bce6f248","created_by":"Florian Roth","name":"Bitsadmin Download to Uncommon Target Folder","tags":["attack.defense_evasion","attack.persistence","attack.t1197","attack.s0190","attack.t1036.003"],"interval":"5m","description":"Detects usage of bitsadmin downloading a file to uncommon target folder","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*%[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]%.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/))","rule_id":"6e30c82f-a9f8-4aab-b79c-7c12bce6f248","timestamp_override":"event.ingested","references":["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin","https://isc.sans.edu/diary/22264","https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\bitsadmin.exe AND process.command_line:(*\\ \\/transfer\\ * OR *\\ \\/create\\ * OR *\\ \\/addfile\\ *) AND process.command_line:(*C\\:\\\\Windows\\\\Temp\\\\* OR *%temp%* OR *C\\:\\\\ProgramData\\\\* OR *%ProgramData%* OR *\\\\AppData\\\\Local\\\\* OR *%AppData%*))`"}
