{"id":"6c6d9280-e6d0-4b9d-80ac-254701b64916","created_by":"Nasreddine Bencherchali","name":"NTLM Coercion Via Certutil.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects possible NTLM coercion via certutil using the 'syncwithWU' flag","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\-[Ss][Yy][Nn][Cc][Ww][Ii][Tt][Hh][Ww][Uu]\\ .*/ AND process.command_line:/.*\\ \\\\\\\\\\*/))","rule_id":"6c6d9280-e6d0-4b9d-80ac-254701b64916","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/issues/243"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\certutil.exe OR process.pe.original_file_name:CertUtil.exe) AND (process.command_line:*\\ \\-syncwithWU\\ * AND process.command_line:*\\ \\\\\\\\\\*))`"}
