{"id":"8f02c935-effe-45b3-8fc9-ef8696a9e41d","created_by":"Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community","name":"Non-privileged Usage of Reg or Powershell","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Search for usage of reg or Powershell by non-privileged users to modify service configuration in registry","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Rr][Ee][Gg]\\ .*/ AND process.command_line:/.*[Aa][Dd][Dd].*/) OR process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Ss][Ee][Tt]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/ OR /.*\\ [Ss][Pp]\\ .*/ OR /.*[Nn][Ee][Ww]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/)) AND (winlog.event_data.IntegrityLevel:/[Mm][Ee][Dd][Ii][Uu][Mm]/ AND process.command_line:/.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt].*/ AND process.command_line:/.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss].*/ AND process.command_line:(/.*[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh].*/ OR /.*[Ff][Aa][Ii][Ll][Uu][Rr][Ee][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll].*/)))","rule_id":"8f02c935-effe-45b3-8fc9-ef8696a9e41d","timestamp_override":"event.ingested","references":["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*reg\\ * AND process.command_line:*add*) OR process.command_line:(*powershell* OR *set\\-itemproperty* OR *\\ sp\\ * OR *new\\-itemproperty*)) AND (winlog.event_data.IntegrityLevel:Medium AND process.command_line:*ControlSet* AND process.command_line:*Services* AND process.command_line:(*ImagePath* OR *FailureCommand* OR *ServiceDLL*)))`"}
