{"id":"5ef9853e-4d0e-4a70-846f-a9ca37d876da","created_by":"Samir Bousseaden, Michael Haag","name":"LSASS Memory Dump","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up.","risk_score":73,"enabled":true,"severity":"high","false_positives":["False positives are present when looking for 0x1410. Exclusions may be required."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/.*0[Xx]1038.*/ OR /.*0[Xx]1438.*/ OR /.*0[Xx]143[Aa].*/) AND winlog.event_data.CallTrace:(/.*[Dd][Bb][Gg][Hh][Ee][Ll][Pp]\\.[Dd][Ll][Ll].*/ OR /.*[Dd][Bb][Gg][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll].*/ OR /.*[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/)) AND (NOT ((winlog.event_data.CallTrace:/.*|[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND winlog.event_data.CallTrace:/.*\\\\[Tt][Hh][Oo][Rr]\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]\\+.*/ AND winlog.event_data.CallTrace:/.*|[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\(.*/ AND winlog.event_data.GrantedAccess:/0[Xx]103800/))))","rule_id":"5ef9853e-4d0e-4a70-846f-a9ca37d876da","timestamp_override":"event.ingested","references":["https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html","https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.001/T1003.001.md","https://research.splunk.com/endpoint/windows_possible_credential_dumping/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*0x1038* OR *0x1438* OR *0x143a*) AND winlog.event_data.CallTrace:(*dbghelp.dll* OR *dbgcore.dll* OR *ntdll.dll*)) AND (NOT ((winlog.event_data.CallTrace:*|C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND winlog.event_data.CallTrace:*\\\\thor\\\\thor64.exe\\+* AND winlog.event_data.CallTrace:*|UNKNOWN\\(* AND winlog.event_data.GrantedAccess:0x103800))))`"}
