{"id":"5e3cc4d8-3e68-43db-8656-eaaeefdec9cc","created_by":"Nasreddine Bencherchali","name":"Suspicious Invoke-WebRequest Usage","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects a suspicious call to Invoke-WebRequest cmdlet where the and output is located in a suspicious location","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*[Ww][Gg][Ee][Tt]\\ .*/ OR /.*[Cc][Uu][Rr][Ll]\\ .*/) AND process.command_line:(/.*\\ \\-[Uu][Rr].*/ OR /.*\\ \\-[Oo].*/) AND process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*%[Pp][Uu][Bb][Ll][Ii][Cc]%.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/))","rule_id":"5e3cc4d8-3e68-43db-8656-eaaeefdec9cc","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe) AND process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ *) AND process.command_line:(*\\ \\-ur* OR *\\ \\-o*) AND process.command_line:(*\\\\AppData\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Temp\\\\* OR *%AppData%* OR *%Temp%* OR *%Public%* OR *\\\\Desktop\\\\* OR *C\\:\\\\Windows\\\\*))`"}
