{"id":"ac20ae82-8758-4f38-958e-b44a3140ca88","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use MSHTA","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use MSHTA in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ss][Ee][Tt].*/ AND process.command_line:/.*\\&\\&.*/ AND process.command_line:/.*[Mm][Ss][Hh][Tt][Aa].*/ AND process.command_line:/.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\:[Cc][Rr][Ee][Aa][Tt][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.command_line:/.*\\.[Rr][Uu][Nn].*/ AND process.command_line:/.*\\([Ww][Ii][Nn][Dd][Oo][Ww]\\.[Cc][Ll][Oo][Ss][Ee]\\).*/)","rule_id":"ac20ae82-8758-4f38-958e-b44a3140ca88","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*set* AND process.command_line:*\\&&* AND process.command_line:*mshta* AND process.command_line:*vbscript\\:createobject* AND process.command_line:*.run* AND process.command_line:*\\(window.close\\)*)`"}
