{"id":"fcdf69e5-a3d3-452a-9724-26f2308bf2b1","created_by":"Florian Roth","name":"Phishing Pattern ISO in Archive","tags":["attack.initial_access","attack.t1566"],"interval":"5m","description":"Detects cases in which an ISO files is opend within an archiver like 7Zip or Winrar, which is open a signa of phishing as threat actors put small ISO files in archives as email attachments to bypass certain filters and protective measures (mark of web)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate cases in which archives contain ISO or IMG files and the user opens the archive and the image via clicking and not extraction"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Rr][Aa][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\7[Zz][Ff][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ee][Aa][Zz][Ii][Pp]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Ii][Ss][Oo][Bb][Uu][Rr][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ii][Ss][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Mm][Gg][Bb][Uu][Rr][Nn]\\.[Ee][Xx][Ee]/))","rule_id":"fcdf69e5-a3d3-452a-9724-26f2308bf2b1","timestamp_override":"event.ingested","references":["https://twitter.com/1ZRR4H/status/1534259727059787783","https://app.any.run/tasks/e1fe6a62-bce8-4323-a49a-63795d9afd5d/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\Winrar.exe OR *\\\\7zFM.exe OR *\\\\peazip.exe) AND process.executable:(*\\\\isoburn.exe OR *\\\\PowerISO.exe OR *\\\\ImgBurn.exe))`"}
