{"id":"966e4016-627f-44f7-8341-f394905c361f","created_by":"Florian Roth","name":"WMIExec VBS Script","tags":["attack.execution","attack.g0045","attack.t1059.005"],"interval":"5m","description":"Detects wmiexec vbs version execution by wscript or cscript","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\.[Vv][Bb][Ss].*/ AND process.command_line:/.*\\/[Ss][Hh][Ee][Ll][Ll].*/)","rule_id":"966e4016-627f-44f7-8341-f394905c361f","timestamp_override":"event.ingested","references":["https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\cscript.exe OR *\\\\wscript.exe) AND process.command_line:*.vbs* AND process.command_line:*\\/shell*)`"}
