{"id":"b4dc61f5-6cce-468e-a608-b48b469feaa2","created_by":"frack113","name":"Launch DirLister Executable","tags":["attack.discovery","attack.t1083"],"interval":"5m","description":"Detect use of DirLister.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Dd][Ii][Rr][Ll][Ii][Ss][Tt][Ee][Rr]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Dd][Ii][Rr][Ll][Ii][Ss][Tt][Ee][Rr]\\.[Ee][Xx][Ee]/)","rule_id":"b4dc61f5-6cce-468e-a608-b48b469feaa2","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1083/T1083.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:DirLister.exe OR process.executable:*\\\\dirlister.exe)`"}
