{"id":"ce7cf472-6fcc-490a-9481-3786840b5d9b","created_by":"frack113","name":"InfDefaultInstall.exe .inf Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Executes SCT script using scrobj.dll from a command in entered into a specially prepared INF file.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ii][Nn][Ff][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Ee][Xx][Ee]\\ .*/ AND process.command_line:/.*\\.[Ii][Nn][Ff].*/)","rule_id":"ce7cf472-6fcc-490a-9481-3786840b5d9b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md#atomic-test-4---infdefaultinstallexe-inf-execution","https://lolbas-project.github.io/lolbas/Binaries/Infdefaultinstall/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*InfDefaultInstall.exe\\ * AND process.command_line:*.inf*)`"}
