{"id":"c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78","created_by":"@Kostastsale, @TheDFIRReport, slightly modified by pH-T","name":"Scheduled Task Executing Powershell Encoded Payload from Registry","tags":["attack.execution","attack.persistence","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects the creation of a schtask that executes a base64 encoded payload stored in the Windows Registry using PowerShell.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*\\/[Ss][Cc].*/ AND process.command_line:/.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ AND process.command_line:/.*[Gg][Ee][Tt]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/ AND process.command_line:(/.*[Hh][Kk][Cc][Uu]\\:.*/ OR /.*[Hh][Kk][Ll][Mm]\\:.*/ OR /.*[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\:\\:.*/ OR /.*[Hh][Kk][Ee][Yy]_.*/))","rule_id":"c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create* AND process.command_line:*\\/SC* AND process.command_line:*FromBase64String* AND process.command_line:*Get\\-ItemProperty* AND process.command_line:(*HKCU\\:* OR *HKLM\\:* OR *registry\\:\\:* OR *HKEY_*))`"}
