{"id":"81ebd28b-9607-4478-bf06-974ed9d53ed7","created_by":"Beyu Denis, oscd.community","name":"Application Whitelisting Bypass via Dnx.exe","tags":["attack.defense_evasion","attack.t1218","attack.t1027.004"],"interval":"5m","description":"Execute C# code located in the consoleapp folder","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of dnx.exe by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Dd][Nn][Xx]\\.[Ee][Xx][Ee]/","rule_id":"81ebd28b-9607-4478-bf06-974ed9d53ed7","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/","https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\dnx.exe`"}
