{"id":"8e2b24c9-4add-46a0-b4bb-0057b4e6187d","created_by":"Florian Roth, oscd.community, Tim Shelton","name":"Regsvr32 Anomaly","tags":["attack.defense_evasion","attack.t1218.010","car.2019-04-002","car.2019-04-003"],"interval":"5m","description":"Detects various anomalies in relation to regsvr32.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ii]\\:.*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/ AND process.command_line:/.*[Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ii]\\:.*/ AND process.command_line:/.*[Ff][Tt][Pp].*/ AND process.command_line:/.*[Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/) OR (process.executable:/.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.\\.\\\\\\.\\.\\\\\\.\\.\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]\\ .*/) OR (process.parent.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll].*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc].*/)) OR (process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\.[Jj][Pp][Gg]/ OR /.*\\.[Jj][Pp][Ee][Gg]/ OR /.*\\.[Pp][Nn][Gg]/ OR /.*\\.[Gg][Ii][Ff]/ OR /.*\\.[Bb][Ii][Nn]/ OR /.*\\.[Tt][Mm][Pp]/ OR /.*\\.[Tt][Ee][Mm][Pp]/ OR /.*\\.[Tt][Xx][Tt]/))) AND (NOT ((process.command_line:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx]64\\\\[Mm][Ee][Ee][Tt][Ii][Nn][Gg][Ss]\\\\[Aa][Tt][Uu][Cc][Ff][Oo][Bb][Jj]\\.[Dd][Ll][Ll].*/)) OR (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Bb][Oo][Xx]\\\\[Bb][Oo][Xx]\\\\[Ff][Ss]\\\\[Ss][Tt][Rr][Ee][Ee][Mm]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Bb][Oo][Xx]\\\\[Bb][Oo][Xx]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))))","rule_id":"8e2b24c9-4add-46a0-b4bb-0057b4e6187d","timestamp_override":"event.ingested","references":["https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html","https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\regsvr32.exe AND process.command_line:*\\\\Temp\\\\*) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe)) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:*\\\\cmd.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*\\/i\\:* AND process.command_line:*http* AND process.command_line:*scrobj.dll) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*\\/i\\:* AND process.command_line:*ftp* AND process.command_line:*scrobj.dll) OR (process.executable:*\\\\wscript.exe AND process.parent.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\EXCEL.EXE AND process.command_line:*..\\\\..\\\\..\\\\Windows\\\\System32\\\\regsvr32.exe\\ *) OR (process.parent.executable:*\\\\mshta.exe AND process.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:(*\\\\AppData\\\\Local* OR *C\\:\\\\Users\\\\Public*)) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:(*.jpg OR *.jpeg OR *.png OR *.gif OR *.bin OR *.tmp OR *.temp OR *.txt))) AND (NOT ((process.command_line:(*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams* OR *\\\\AppData\\\\Local\\\\WebEx\\\\WebEx64\\\\Meetings\\\\atucfobj.dll*)) OR (process.parent.executable:C\\:\\\\Program\\ Files\\\\Box\\\\Box\\\\FS\\\\streem.exe AND process.command_line:*\\\\Program\\ Files\\\\Box\\\\Box\\\\Temp\\\\*))))`"}
