{"id":"67f113fa-e23d-4271-befa-30113b3e08b1","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Mshta JavaScript Execution","tags":["attack.defense_evasion","attack.t1218.005"],"interval":"5m","description":"Identifies suspicious mshta.exe commands.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt].*/)","rule_id":"67f113fa-e23d-4271-befa-30113b3e08b1","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/6bc283c4-21f2-4aed-a05c-a9a3ffa95dd4.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.005/T1218.005.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\mshta.exe AND process.command_line:*javascript*)`"}
