{"id":"a16980c2-0c56-4de0-9a79-17971979efdd","created_by":"Florian Roth","name":"Missing Space Characters in Command Lines","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe. This could be a sign of obfuscation of a fat finger problem (typo by the developer).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\/[Cc].*/ OR /.*\\\\[Cc][Mm][Dd]\\/[Cc].*/ OR /.*\\\"[Cc][Mm][Dd]\\/[Cc].*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\/[Kk].*/ OR /.*\\\\[Cc][Mm][Dd]\\/[Kk].*/ OR /.*\\\"[Cc][Mm][Dd]\\/[Kk].*/) OR process.command_line:(/.*\\/[Cc][Ww][Hh][Oo][Aa][Mm][Ii].*/ OR /.*\\/[Cc][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\/[Cc][Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss].*/ OR /.*\\/[Cc][Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*\\/[Cc][Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll].*/ OR /.*\\/[Kk][Ww][Hh][Oo][Aa][Mm][Ii].*/ OR /.*\\/[Kk][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\/[Kk][Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss].*/ OR /.*\\/[Kk][Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*\\/[Kk][Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll].*/) OR process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc].*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc].*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk].*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk].*/)) AND (NOT ((process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk]\\ .*/)) OR (process.command_line:/.*[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee][Ss]\\\\[Aa][Pp][Pp]\\\\[Nn][Oo][Dd][Ee]_[Mm][Oo][Dd][Uu][Ll][Ee][Ss].*/ OR process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\/[Cc]\\ \\./ OR process.command_line:/[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]/))))","rule_id":"a16980c2-0c56-4de0-9a79-17971979efdd","timestamp_override":"event.ingested","references":["https://twitter.com/cyb3rops/status/1562072617552678912","https://ss64.com/nt/cmd.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:(*cmd.exe\\/c* OR *\\\\cmd\\/c* OR *\\\"cmd\\/c* OR *cmd.exe\\/k* OR *\\\\cmd\\/k* OR *\\\"cmd\\/k*) OR process.command_line:(*\\/cwhoami* OR *\\/cpowershell* OR *\\/cschtasks* OR *\\/cbitsadmin* OR *\\/ccertutil* OR *\\/kwhoami* OR *\\/kpowershell* OR *\\/kschtasks* OR *\\/kbitsadmin* OR *\\/kcertutil*) OR process.command_line:(*cmd.exe\\ \\/c* OR *cmd\\ \\/c* OR *cmd.exe\\ \\/k* OR *cmd\\ \\/k*)) AND (NOT ((process.command_line:(*cmd.exe\\ \\/c\\ * OR *cmd\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ * OR *cmd\\ \\/k\\ *)) OR (process.command_line:*AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\resources\\\\app\\\\node_modules* OR process.command_line:*cmd.exe\\/c\\ . OR process.command_line:cmd.exe\\ \\/c))))`"}
