{"id":"e312efd0-35a1-407f-8439-b8d434b438a6","created_by":"Florian Roth","name":"PowerShell Encoded Character Syntax","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects suspicious encoded character syntax often used for defense evasion","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\([Ww][Cc][Hh][Aa][Rr]\\)0[Xx].*/","rule_id":"e312efd0-35a1-407f-8439-b8d434b438a6","timestamp_override":"event.ingested","references":["https://twitter.com/0gtweet/status/1281103918693482496"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*\\(WCHAR\\)0x*`"}
