{"id":"961e0abb-1b1e-4c84-a453-aafe56ad0d34","created_by":"Austin Songer (@austinsonger)","name":"Execution via stordiag.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe and fltmc.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of stordiag.exe."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ss][Tt][Oo][Rr][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ll][Tt][Mm][Cc]\\.[Ee][Xx][Ee]/)) AND (NOT (process.parent.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))","rule_id":"961e0abb-1b1e-4c84-a453-aafe56ad0d34","timestamp_override":"event.ingested","references":["https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html","https://twitter.com/eral4m/status/1451112385041911809"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\stordiag.exe AND process.executable:(*\\\\schtasks.exe OR *\\\\systeminfo.exe OR *\\\\fltmc.exe)) AND (NOT (process.parent.executable:(c\\:\\\\windows\\\\system32\\\\* OR c\\:\\\\windows\\\\syswow64\\\\*))))`"}
