{"id":"aaafa146-074c-11eb-adc1-0242ac120002","created_by":"Vasiliy Burov","name":"Hydra Password Guessing Hack Tool","tags":["attack.credential_access","attack.t1110","attack.t1110.001"],"interval":"5m","description":"Detects command line parameters used by Hydra password guessing hack tool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software that uses the caret encased keywords PASS and USER in its command line"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-[Uu]\\ .*/ AND process.command_line:/.*\\-[Pp]\\ .*/ AND process.command_line:(/.*\\^[Uu][Ss][Ee][Rr]\\^.*/ OR /.*\\^[Pp][Aa][Ss][Ss]\\^.*/))","rule_id":"aaafa146-074c-11eb-adc1-0242ac120002","timestamp_override":"event.ingested","references":["https://github.com/vanhauser-thc/thc-hydra","https://attack.mitre.org/techniques/T1110/001/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-u\\ * AND process.command_line:*\\-p\\ * AND process.command_line:(*\\^USER\\^* OR *\\^PASS\\^*))`"}
