{"id":"57c4bf16-227f-4394-8ec7-1b745ee061c3","created_by":"Fatih Sirin","name":"Firewall Disabled via Netsh","tags":["attack.defense_evasion","attack.t1562.004","attack.s0108"],"interval":"5m","description":"Detects netsh commands that turns off the Windows firewall","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Nn][Ee][Tt][Ss][Hh].*/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Ss][Ee][Tt].*/ AND process.command_line:/.*[Oo][Pp][Mm][Oo][Dd][Ee].*/ AND process.command_line:/.*[Mm][Oo][Dd][Ee]\\=[Dd][Ii][Ss][Aa][Bb][Ll][Ee].*/) OR (process.command_line:/.*[Nn][Ee][Tt][Ss][Hh].*/ AND process.command_line:/.*[Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Ss][Ee][Tt].*/ AND process.command_line:/.*[Ss][Tt][Aa][Tt][Ee].*/ AND process.command_line:/.*[Oo][Ff][Ff].*/))","rule_id":"57c4bf16-227f-4394-8ec7-1b745ee061c3","timestamp_override":"event.ingested","references":["https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/","https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*netsh* AND process.command_line:*firewall* AND process.command_line:*set* AND process.command_line:*opmode* AND process.command_line:*mode\\=disable*) OR (process.command_line:*netsh* AND process.command_line:*advfirewall* AND process.command_line:*set* AND process.command_line:*state* AND process.command_line:*off*))`"}
