{"id":"0f9c21f1-6a73-4b0e-9809-cb562cb8d981","created_by":"Teymur Kheirkhabarov","name":"Possible Privilege Escalation via Service Permissions Weakness","tags":["attack.privilege_escalation","attack.t1574.011"],"interval":"5m","description":"Detect modification of services configuration (ImagePath, FailureCommand and ServiceDLL) in registry by processes with Medium integrity level","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.IntegrityLevel:/[Mm][Ee][Dd][Ii][Uu][Mm]/ AND process.command_line:/.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt].*/ AND process.command_line:/.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss].*/ AND process.command_line:(/.*\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh].*/ OR /.*\\\\[Ff][Aa][Ii][Ll][Uu][Rr][Ee][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll].*/))","rule_id":"0f9c21f1-6a73-4b0e-9809-cb562cb8d981","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://pentestlab.blog/2017/03/31/insecure-registry-permissions/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.IntegrityLevel:Medium AND process.command_line:*ControlSet* AND process.command_line:*services* AND process.command_line:(*\\\\ImagePath* OR *\\\\FailureCommand* OR *\\\\ServiceDll*))`"}
