{"id":"d80d5c81-04ba-45b4-84e4-92eba40e0ad3","created_by":"Beyu Denis, oscd.community","name":"Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN","tags":["attack.execution","attack.t1218"],"interval":"5m","description":"dotnet.exe will execute any DLL and execute unsigned code","risk_score":47,"enabled":true,"severity":"medium","false_positives":["System administrator Usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Cc][Ss][Pp][Rr][Oo][Jj]/) AND process.executable:/.*\\\\[Dd][Oo][Tt][Nn][Ee][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"d80d5c81-04ba-45b4-84e4-92eba40e0ad3","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dotnet/","https://twitter.com/_felamos/status/1204705548668555264","https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*.dll OR *.csproj) AND process.executable:*\\\\dotnet.exe)`"}
