{"id":"692f0bec-83ba-4d04-af7e-e884a96059b6","created_by":"Markus Neis / @Karneades","name":"WMI Spawning Windows PowerShell","tags":["attack.execution","attack.t1047","attack.t1059.001"],"interval":"5m","description":"Detects WMI spawning a PowerShell process","risk_score":73,"enabled":true,"severity":"high","false_positives":["AppvClient","CCM"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.parent.executable:/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/))) AND (NOT (process.command_line:null))) AND (NOT (NOT _exists_:process.command_line)))","rule_id":"692f0bec-83ba-4d04-af7e-e884a96059b6","timestamp_override":"event.ingested","references":["https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.parent.executable:*\\\\wmiprvse.exe AND (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) OR process.pe.original_file_name:(PowerShell.EXE OR pwsh.dll))) AND (NOT (process.command_line:null))) AND (NOT (NOT _exists_:process.command_line)))`"}
