{"id":"8acf3cfa-1e8c-4099-83de-a0c4038e18f0","created_by":"Florian Roth","name":"EvilNum Golden Chickens Deployment via OCX Files","tags":["attack.defense_evasion","attack.t1218.011"],"interval":"5m","description":"Detects Golden Chickens deployment method as used by Evilnum in report published in July 2020","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ AND process.command_line:/.*\\/[Ss].*/ AND process.command_line:/.*\\/[Ii].*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/ AND process.command_line:/.*\\.[Oo][Cc][Xx].*/)","rule_id":"8acf3cfa-1e8c-4099-83de-a0c4038e18f0","timestamp_override":"event.ingested","references":["https://www.welivesecurity.com/2020/07/09/more-evil-deep-look-evilnum-toolset/","https://app.any.run/tasks/33d37fdf-158d-4930-aa68-813e1d5eb8ba/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*regsvr32* AND process.command_line:*\\/s* AND process.command_line:*\\/i* AND process.command_line:*\\\\AppData\\\\Roaming\\\\* AND process.command_line:*.ocx*)`"}
