{"id":"73d70463-75c9-4258-92c6-17500fe972f2","created_by":"Florian Roth, oscd.community","name":"Winnti Pipemon Characteristics","tags":["attack.defense_evasion","attack.t1574.002","attack.g0044"],"interval":"5m","description":"Detects specific process characteristics of Winnti Pipemon malware reported by ESET","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Legitimate setups that use similar flags"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ss][Ee][Tt][Uu][Pp]0\\.[Ee][Xx][Ee]\\ \\-[Pp].*/ OR (process.command_line:/.*[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee].*/ AND process.command_line:(/.*\\-[Xx]\\:0/ OR /.*\\-[Xx]\\:1/ OR /.*\\-[Xx]\\:2/)))","rule_id":"73d70463-75c9-4258-92c6-17500fe972f2","timestamp_override":"event.ingested","references":["https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*setup0.exe\\ \\-p* OR (process.command_line:*setup.exe* AND process.command_line:(*\\-x\\:0 OR *\\-x\\:1 OR *\\-x\\:2)))`"}
