{"id":"ae215552-081e-44c7-805f-be16f975c8a2","created_by":"Florian Roth, oscd.community, Jonhnathan Ribeiro","name":"Suspicious Debugger Registration Cmdline","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.008"],"interval":"5m","description":"Detects the registration of a debugger for a program that is available in the logon screen (sticky key backdoor).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\.*/ AND process.command_line:(/.*[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee].*/ OR /.*[Uu][Tt][Ii][Ll][Mm][Aa][Nn]\\.[Ee][Xx][Ee].*/ OR /.*[Oo][Ss][Kk]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Aa][Gg][Nn][Ii][Ff][Yy]\\.[Ee][Xx][Ee].*/ OR /.*[Nn][Aa][Rr][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee].*/ OR /.*[Dd][Ii][Ss][Pp][Ll][Aa][Yy][Ss][Ww][Ii][Tt][Cc][Hh]\\.[Ee][Xx][Ee].*/ OR /.*[Aa][Tt][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*[Hh][Ee][Ll][Pp][Pp][Aa][Nn][Ee]\\.[Ee][Xx][Ee].*/))","rule_id":"ae215552-081e-44c7-805f-be16f975c8a2","timestamp_override":"event.ingested","references":["https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/","https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\* AND process.command_line:(*sethc.exe* OR *utilman.exe* OR *osk.exe* OR *magnify.exe* OR *narrator.exe* OR *displayswitch.exe* OR *atbroker.exe* OR *HelpPane.exe*))`"}
