{"id":"18da1007-3f26-470f-875d-f77faf1cab31","created_by":"Florian Roth","name":"Ps.exe Renamed SysInternals Tool","tags":["attack.defense_evasion","attack.g0035","attack.t1036.003","car.2013-05-009"],"interval":"5m","description":"Detects renamed SysInternals tool execution with a binary named ps.exe as used by Dragonfly APT group and documented in TA17-293A report","risk_score":73,"enabled":true,"severity":"high","false_positives":["Renamed SysInternals tool"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/[Pp][Ss]\\.[Ee][Xx][Ee]\\ \\-[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa]/","rule_id":"18da1007-3f26-470f-875d-f77faf1cab31","timestamp_override":"event.ingested","references":["https://www.us-cert.gov/ncas/alerts/TA17-293A"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:ps.exe\\ \\-accepteula`"}
