{"id":"322ed9ec-fcab-4f67-9a34-e7c6aef43614","created_by":"Florian Roth, omkar72, oscd.community","name":"Netsh Port Forwarding","tags":["attack.lateral_movement","attack.defense_evasion","attack.command_and_control","attack.t1090"],"interval":"5m","description":"Detects netsh commands that configure a port forwarding (PortProxy)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administration","WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ii][Nn][Tt][Ee][Rr][Ff][Aa][Cc][Ee].*/ AND process.command_line:/.*[Pp][Oo][Rr][Tt][Pp][Rr][Oo][Xx][Yy].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Vv]4[Tt][Oo][Vv]4.*/) OR (process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Oo][Nn][Nn][Ee][Cc][Tt][Pp].*/ AND process.command_line:/.*[Ll][Ii][Ss][Tt][Ee][Nn][Aa].*/ AND process.command_line:/.*[Cc]\\=.*/))","rule_id":"322ed9ec-fcab-4f67-9a34-e7c6aef43614","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html","https://adepts.of0x.cc/netsh-portproxy-code/","https://www.dfirnotes.net/portproxy_detection/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\netsh.exe AND process.command_line:*interface* AND process.command_line:*portproxy* AND process.command_line:*add* AND process.command_line:*v4tov4*) OR (process.executable:*\\\\netsh.exe AND process.command_line:*connectp* AND process.command_line:*listena* AND process.command_line:*c\\=*))`"}
