{"id":"92626ddd-662c-49e3-ac59-f6535f12d189","created_by":"Florian Roth","name":"Scheduled Task Creation","tags":["attack.execution","attack.persistence","attack.privilege_escalation","attack.t1053.005","attack.s0111","car.2013-08-001"],"interval":"5m","description":"Detects the creation of scheduled tasks in user session","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrative activity","Software installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/) AND (NOT (winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/))))","rule_id":"92626ddd-662c-49e3-ac59-f6535f12d189","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/create\\ *) AND (NOT (winlog.event_data.User:(*AUTHORI* OR *AUTORI*))))`"}
