{"id":"b7966f4a-b333-455b-8370-8ca53c229762","created_by":"Sreeman","name":"Dropping Of Password Filter DLL","tags":["attack.credential_access","attack.t1556.002"],"interval":"5m","description":"Detects dropping of dll files in system32 that may be used to retrieve user credentials from LSASS","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa].*/ AND process.command_line:/.*[Ss][Cc][Ee][Cc][Ll][Ii]\\\\0.*/ AND process.command_line:/.*[Rr][Ee][Gg]\\ [Aa][Dd][Dd].*/)","rule_id":"b7966f4a-b333-455b-8370-8ca53c229762","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/","https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa* AND process.command_line:*scecli\\\\0* AND process.command_line:*reg\\ add*)`"}
