{"id":"a4694263-59a8-4608-a3a0-6f8d3a51664c","created_by":"Florian Roth","name":"Suspicious Key Manager Access","tags":["attack.credential_access","attack.t1555.004"],"interval":"5m","description":"Detects the invocation of the Stored User Names and Passwords dialogue (Key Manager)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Kk][Ee][Yy][Mm][Gg][Rr].*/ AND process.command_line:/.*[Kk][Rr][Ss][Hh][Oo][Ww][Kk][Ee][Yy][Mm][Gg][Rr].*/)","rule_id":"a4694263-59a8-4608-a3a0-6f8d3a51664c","timestamp_override":"event.ingested","references":["https://twitter.com/NinjaParanoid/status/1516442028963659777"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.command_line:*keymgr* AND process.command_line:*KRShowKeyMgr*)`"}
