{"id":"59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9","created_by":"Nasreddine Bencherchali","name":"Wusa Extracting Cab Files","tags":["attack.execution"],"interval":"5m","description":"Detects usage of the \"wusa.exe\" (Windows Update Standalone Installer) utility to extract cab using the \"/extract\" argument which is not longer supported. This could indicate an attacker using an old technique","risk_score":47,"enabled":true,"severity":"medium","false_positives":["The \"extract\" flag still works on older 'wusa.exe' versions, which could be a legitimate use (monitor the path of the cab being extracted)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Uu][Ss][Aa]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ee][Xx][Tt][Rr][Aa][Cc][Tt]\\:.*/)","rule_id":"59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9","timestamp_override":"event.ingested","references":["https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wusa.exe AND process.command_line:*\\/extract\\:*)`"}
