{"id":"af77cf95-c469-471c-b6a0-946c685c4798","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth, Sreeman, FPT.EagleEye Team","name":"Proxy Execution via Wuauclt","tags":["attack.defense_evasion","attack.t1218","attack.execution"],"interval":"5m","description":"Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*[Ww][Uu][Aa][Uu][Cc][Ll][Tt].*/ OR process.pe.original_file_name:/[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*[Uu][Pp][Dd][Aa][Tt][Ee][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Rr][Uu][Nn][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Cc][Oo][Mm][Ss][Ee][Rr][Vv][Ee][Rr].*/)) AND (NOT (process.command_line:(/.*\\ \\/[Uu][Pp][Dd][Aa][Tt][Ee][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\ [Uu][Pp][Dd][Aa][Tt][Ee][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\.[Dd][Ll][Ll]\\ .*/ OR /.*\\ [Ww][Uu][Aa][Uu][Ee][Nn][Gg]\\.[Dd][Ll][Ll]\\ .*/))))","rule_id":"af77cf95-c469-471c-b6a0-946c685c4798","timestamp_override":"event.ingested","references":["https://dtm.uk/wuauclt/","https://blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-campaign/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*wuauclt* OR process.pe.original_file_name:wuauclt.exe) AND (process.command_line:*UpdateDeploymentProvider* AND process.command_line:*.dll* AND process.command_line:*RunHandlerComServer*)) AND (NOT (process.command_line:(*\\ \\/UpdateDeploymentProvider\\ UpdateDeploymentProvider.dll\\ * OR *\\ wuaueng.dll\\ *))))`"}
