{"id":"b3512211-c67e-4707-bedc-66efc7848863","created_by":"Harish Segar (rule)","name":"PowerShell Downgrade Attack","tags":["attack.defense_evasion","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\ 2\\ .*/ OR /.*\\ \\-[Vv][Ee][Rr][Ss][Ii][Oo]\\ 2\\ .*/ OR /.*\\ \\-[Vv][Ee][Rr][Ss][Ii]\\ 2\\ .*/ OR /.*\\ \\-[Vv][Ee][Rr][Ss]\\ 2\\ .*/ OR /.*\\ \\-[Vv][Ee][Rr]\\ 2\\ .*/ OR /.*\\ \\-[Vv][Ee]\\ 2\\ .*/))","rule_id":"b3512211-c67e-4707-bedc-66efc7848863","timestamp_override":"event.ingested","references":["http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\ \\-version\\ 2\\ * OR *\\ \\-versio\\ 2\\ * OR *\\ \\-versi\\ 2\\ * OR *\\ \\-vers\\ 2\\ * OR *\\ \\-ver\\ 2\\ * OR *\\ \\-ve\\ 2\\ *))`"}
