{"id":"28c8f68b-098d-45af-8d43-8089f3e35403","created_by":"Austin Songer @austinsonger","name":"Suspicious Registration via cscript.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects when the registration of a VSS/VDS Provider as a COM+ application.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr].*/ AND process.command_line:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt][Ss]\\\\10\\\\[Bb][Ii][Nn]\\\\10\\.0\\.22000\\.0\\\\[Xx]64.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt][Ss]\\\\10\\\\[Bb][Ii][Nn]\\\\10\\.0\\.19041\\.0\\\\[Xx]64.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt][Ss]\\\\10\\\\[Bb][Ii][Nn]\\\\10\\.0\\.17763\\.0\\\\[Xx]64.*/))","rule_id":"28c8f68b-098d-45af-8d43-8089f3e35403","timestamp_override":"event.ingested","references":["https://twitter.com/sblmsrsn/status/1456613494783160325?s=20","https://ss64.com/vb/cscript.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cscript.exe AND process.command_line:*\\-register* AND process.command_line:(*\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.22000.0\\\\x64* OR *\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.19041.0\\\\x64* OR *\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.17763.0\\\\x64*))`"}
