{"id":"7d1aaf3d-4304-425c-b7c3-162055e0b3ab","created_by":"Nasreddine Bencherchali","name":"Possible Exfiltration Of Data Via CLI","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the use of various cli utility related to web request exfiltrating data","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*[Ww][Gg][Ee][Tt]\\ .*/ OR /.*[Cc][Uu][Rr][Ll]\\ .*/) AND process.command_line:/.*\\ \\-[Uu][Rr].*/ AND process.command_line:/.*\\ \\-[Mm][Ee].*/ AND process.command_line:/.*\\ \\-[Bb].*/ AND process.command_line:/.*\\ [Pp][Oo][Ss][Tt]\\ .*/) OR (process.executable:/.*\\\\[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-\\-[Uu][Rr].*/ AND process.command_line:(/.*\\ \\-[Dd]\\ .*/ OR /.*\\ \\-\\-[Dd][Aa][Tt][Aa]\\ .*/))) AND (process.command_line:(/.*[Tt][Oo][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii].*/ OR /.*[Nn][Ll][Tt][Ee][Ss][Tt].*/ OR /.*[Ii][Ff][Cc][Oo][Nn][Ff][Ii][Gg].*/ OR /.*[Hh][Oo][Ss][Tt][Nn][Aa][Mm][Ee].*/ OR /.*[Nn][Ee][Tt]\\ [Vv][Ii][Ee][Ww].*/ OR /.*[Qq][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Nn][Ee][Tt][Ss][Tt][Aa][Tt].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo].*/ OR /.*[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt].*/ OR /.*[Ss][Cc]\\ [Qq][Uu][Ee][Rr][Yy].*/) OR (process.command_line:/.*[Tt][Yy][Pp][Ee]\\ .*/ AND process.command_line:/.*\\ \\>\\ .*/ AND process.command_line:/.*\\ [Cc]\\:\\\\.*/)))","rule_id":"7d1aaf3d-4304-425c-b7c3-162055e0b3ab","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe) AND process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ *) AND process.command_line:*\\ \\-ur* AND process.command_line:*\\ \\-me* AND process.command_line:*\\ \\-b* AND process.command_line:*\\ POST\\ *) OR (process.executable:*\\\\curl.exe AND process.command_line:*\\-\\-ur* AND process.command_line:(*\\ \\-d\\ * OR *\\ \\-\\-data\\ *))) AND (process.command_line:(*ToBase64String* OR *whoami* OR *nltest* OR *ifconfig* OR *hostname* OR *net\\ view* OR *qprocess* OR *netstat* OR *systeminfo* OR *tasklist* OR *sc\\ query*) OR (process.command_line:*type\\ * AND process.command_line:*\\ >\\ * AND process.command_line:*\\ C\\:\\\\*)))`"}
