{"id":"a35f5a72-f347-4e36-8895-9869b0d5fc6d","created_by":"Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Netsh Program Allowed with Suspcious Location","tags":["attack.defense_evasion","attack.t1562.004"],"interval":"5m","description":"Detects Netsh commands that allows a suspcious application location on Windows Firewall","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/) OR (process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*[Rr][Uu][Ll][Ee].*/ AND process.command_line:/.*[Aa][Cc][Tt][Ii][Oo][Nn]\\=[Aa][Ll][Ll][Oo][Ww].*/ AND process.command_line:/.*[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\=.*/)) AND (process.command_line:(/.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*\\:\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr]\\\\.*/ OR /.*[Cc]\\:\\\\$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]\\\\.*/ OR /.*\\:\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Vv][Oo][Ll][Uu][Mm][Ee][Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\.*/ OR /.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\.*/ OR /.*\\\\[Ll][Oo][Cc][Aa][Ll]\\ [Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/) OR process.command_line:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Ee][Bb][Uu][Gg]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Oo][Nn][Tt][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Hh][Ee][Ll][Pp]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Ss][Oo][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/ OR /%[Pp][Uu][Bb][Ll][Ii][Cc]%\\\\.*/)))","rule_id":"a35f5a72-f347-4e36-8895-9869b0d5fc6d","timestamp_override":"event.ingested","references":["https://www.virusradar.com/en/Win32_Kasidet.AD/description","https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\netsh.exe AND process.command_line:*firewall* AND process.command_line:*add* AND process.command_line:*allowedprogram*) OR (process.executable:*\\\\netsh.exe AND process.command_line:*advfirewall* AND process.command_line:*firewall* AND process.command_line:*add* AND process.command_line:*rule* AND process.command_line:*action\\=allow* AND process.command_line:*program\\=*)) AND (process.command_line:(*%TEMP%* OR *\\:\\\\RECYCLER\\\\* OR *C\\:\\\\$Recycle.bin\\\\* OR *\\:\\\\SystemVolumeInformation\\\\* OR *C\\:\\\\Windows\\\\Temp\\\\* OR *C\\:\\\\Temp\\\\* OR *C\\:\\\\Users\\\\Public\\\\* OR *C\\:\\\\Users\\\\Default\\\\* OR *C\\:\\\\Users\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Temporary\\ Internet\\ Files\\\\Content.Outlook\\\\* OR *\\\\Local\\ Settings\\\\Temporary\\ Internet\\ Files\\\\*) OR process.command_line:(C\\:\\\\Windows\\\\Tasks\\\\* OR C\\:\\\\Windows\\\\debug\\\\* OR C\\:\\\\Windows\\\\fonts\\\\* OR C\\:\\\\Windows\\\\help\\\\* OR C\\:\\\\Windows\\\\drivers\\\\* OR C\\:\\\\Windows\\\\addins\\\\* OR C\\:\\\\Windows\\\\cursors\\\\* OR C\\:\\\\Windows\\\\system32\\\\tasks\\\\* OR %Public%\\\\*)))`"}
