{"id":"431a1fdb-4799-4f3b-91c3-a683b003fc49","created_by":"Nasreddine Bencherchali","name":"New Kernel Driver Via SC.EXE","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects creation of a new service (kernel driver) with the type \"kernel\"","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Rare legitimate installation of kernel drivers via sc.exe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/ OR /.*[Cc][Oo][Nn][Ff][Ii][Gg].*/) AND process.command_line:/.*[Bb][Ii][Nn][Pp][Aa][Tt][Hh].*/ AND process.command_line:/.*[Tt][Yy][Pp][Ee].*/ AND process.command_line:/.*[Kk][Ee][Rr][Nn][Ee][Ll].*/)","rule_id":"431a1fdb-4799-4f3b-91c3-a683b003fc49","timestamp_override":"event.ingested","references":["https://www.aon.com/cyber-solutions/aon_cyber_labs/yours-truly-signed-av-driver-weaponizing-an-antivirus-driver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\sc.exe AND process.command_line:(*create* OR *config*) AND process.command_line:*binPath* AND process.command_line:*type* AND process.command_line:*kernel*)`"}
