{"id":"fa34b441-961a-42fa-a100-ecc28c886725","created_by":"Florian Roth","name":"LSASS Access from Program in Suspicious Folder","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects process access to LSASS memory with suspicious access flags and from a suspicious folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate software accessing LSASS process for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/.*10/ OR /.*30/ OR /.*50/ OR /.*70/ OR /.*90/ OR /.*[Bb]0/ OR /.*[Dd]0/ OR /.*[Ff]0/ OR /.*18/ OR /.*38/ OR /.*58/ OR /.*78/ OR /.*98/ OR /.*[Bb]8/ OR /.*[Dd]8/ OR /.*[Ff]8/ OR /.*1[Aa]/ OR /.*3[Aa]/ OR /.*5[Aa]/ OR /.*7[Aa]/ OR /.*9[Aa]/ OR /.*[Bb][Aa]/ OR /.*[Dd][Aa]/ OR /.*[Ff][Aa]/ OR /.*0[Xx]14[Cc]2/ OR /.*[Ff][Ff]/) AND process.executable:(/.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy].*/)) AND (NOT ((process.executable:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ AND process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]_[Rr][Ee][Pp][Oo][Rr][Tt][Ee][Rr]_[Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Bb][Aa][Mm][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Bb][Ee][Xx][Mm][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:/0[Xx]410/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\.[Tt][Mm][Pp]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]410/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:(/0[Xx]1[Ff][Ff][Ff][Ff][Ff]/ OR /0[Xx]1010/)) OR (process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\\\[Vv][Ss]_[Bb][Oo][Oo][Tt][Ss][Tt][Rr][Aa][Pp][Pp][Ee][Rr]_.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1410/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\.[Tt][Mm][Pp]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]410/))))","rule_id":"fa34b441-961a-42fa-a100-ecc28c886725","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights","https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow","https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html","https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF) AND process.executable:(*\\\\Temp\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\AppData\\\\* OR *\\\\Temporary*)) AND (NOT ((process.executable:*C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\Local\\\\* AND process.executable:(*\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR *\\\\software_reporter_tool.exe OR *\\\\DropboxUpdate.exe OR *\\\\MBAMInstallerService.exe OR *\\\\WebexMTA.exe OR *\\\\WebEx\\\\WebexHost.exe) AND winlog.event_data.GrantedAccess:0x410) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable:*.tmp\\\\DropboxUpdate.exe AND winlog.event_data.GrantedAccess:0x410) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe) AND winlog.event_data.GrantedAccess:(0x1fffff OR 0x1010)) OR (process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable:*\\\\vs_bootstrapper_* AND winlog.event_data.GrantedAccess:0x1410) OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Google\\\\Temp\\\\* AND process.executable:*.tmp\\\\GoogleUpdate.exe AND winlog.event_data.GrantedAccess:0x410))))`"}
