{"id":"75edd216-1939-4c73-8d61-7f3a0d85b5cc","created_by":"Nasreddine Bencherchali","name":"Suspicious Execution of InstallUtil To Download","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the use the .NET InstallUtil.exe application in order to download arbitrary files. The files will be written to %LOCALAPPDATA%\\Microsoft\\Windows\\INetCache\\IE\\","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Tt][Tt][Pp]\\:\\/\\/.*/ OR /.*[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/.*/ OR /.*[Ff][Tt][Pp]\\:\\/\\/.*/))","rule_id":"75edd216-1939-4c73-8d61-7f3a0d85b5cc","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/pull/239"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\InstallUtil.exe OR process.pe.original_file_name:InstallUtil.exe) AND process.command_line:(*http\\:\\/\\/* OR *https\\:\\/\\/* OR *ftp\\:\\/\\/*))`"}
