{"id":"60bfeac3-0d35-4302-8efb-1dd16f715bc6","created_by":"Florian Roth","name":"Suspicious SysAidServer Child","tags":null,"interval":"5m","description":"Detects suspicious child processes of SysAidServer (as seen in MERCURY threat actor intrusions)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.command_line:/.*[Ss][Yy][Ss][Aa][Ii][Dd][Ss][Ee][Rr][Vv][Ee][Rr].*/)","rule_id":"60bfeac3-0d35-4302-8efb-1dd16f715bc6","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.command_line:*SysAidServer*)`"}
