{"id":"a7ee1722-c3c5-aeff-3212-c777e4733217","created_by":"ok @securonix invrep-de, oscd.community, frack113","name":"Powershell Used To Disable Windows Defender AV Security Monitoring","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects attackers attempting to disable Windows Defender using Powershell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Minimal, for some older versions of dev tools, such as pycharm, developers were known to sometimes disable Windows Defender to improve performance, but this generally is not considered a good security practice."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Uu][Nn][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/)) OR (process.command_line:/.*[Ss][Cc].*/ AND process.command_line:/.*[Ss][Tt][Oo][Pp].*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd].*/) OR (process.command_line:/.*[Ss][Cc].*/ AND process.command_line:/.*[Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd].*/ AND process.command_line:/.*[Ss][Tt][Aa][Rr][Tt]\\=[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd].*/))","rule_id":"a7ee1722-c3c5-aeff-3212-c777e4733217","timestamp_override":"event.ingested","references":["https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/","https://rvsec0n.wordpress.com/2020/01/24/malwares-that-bypass-windows-defender/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\-DisableBehaviorMonitoring\\ $true* OR *\\-DisableRuntimeMonitoring\\ $true*)) OR (process.command_line:*sc* AND process.command_line:*stop* AND process.command_line:*WinDefend*) OR (process.command_line:*sc* AND process.command_line:*config* AND process.command_line:*WinDefend* AND process.command_line:*start\\=disabled*))`"}
