{"id":"4f73421b-5a0b-4bbf-a892-5a7fb99bea66","created_by":"frack113, Florian Roth","name":"Mavinject Inject DLL Into Running Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1055.001","attack.t1218.013"],"interval":"5m","description":"Detects process injection using the signed Windows tool \"Mavinject\" via the \"INJECTRUNNING\" flag or a renamed execution of the tool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\/[Ii][Nn][Jj][Ee][Cc][Tt][Rr][Uu][Nn][Nn][Ii][Nn][Gg]\\ .*/ OR (process.pe.original_file_name:(/[Mm][Aa][Vv][Ii][Nn][Jj][Ee][Cc][Tt]32\\.[Ee][Xx][Ee]/ OR /[Mm][Aa][Vv][Ii][Nn][Jj][Ee][Cc][Tt]64\\.[Ee][Xx][Ee]/) AND (NOT (process.executable:(/.*\\\\[Mm][Aa][Vv][Ii][Nn][Jj][Ee][Cc][Tt]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Aa][Vv][Ii][Nn][Jj][Ee][Cc][Tt]64\\.[Ee][Xx][Ee]/)))))","rule_id":"4f73421b-5a0b-4bbf-a892-5a7fb99bea66","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.004/T1056.004.md","https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e","https://twitter.com/gN3mes1s/status/941315826107510784","https://reaqta.com/2017/12/mavinject-microsoft-injector/","https://twitter.com/Hexacorn/status/776122138063409152"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\/INJECTRUNNING\\ * OR (process.pe.original_file_name:(mavinject32.exe OR mavinject64.exe) AND (NOT (process.executable:(*\\\\mavinject32.exe OR *\\\\mavinject64.exe)))))`"}
