{"id":"bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c","created_by":"Florian Roth","name":"SharpEvtMute EvtMuteHook Load","tags":["attack.defense_evasion","attack.t1562.002"],"interval":"5m","description":"Detects the use of SharpEvtHook, a tool to tamper with Windows event logs","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Hh][Aa][Rr][Pp][Ee][Vv][Tt][Mm][Uu][Tt][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Ss][Hh][Aa][Rr][Pp][Ee][Vv][Tt][Mm][Uu][Tt][Ee]/ OR process.command_line:(/.*\\-\\-[Ff][Ii][Ll][Tt][Ee][Rr]\\ \\\"[Rr][Uu][Ll][Ee]\\ .*/ OR /.*\\-\\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd]\\ \\-\\-[Ff][Ii][Ll][Tt][Ee][Rr]\\ \\\\\\\".*/))","rule_id":"bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c","timestamp_override":"event.ingested","references":["https://github.com/bats3c/EvtMute"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SharpEvtMute.exe OR process.pe.description:SharpEvtMute OR process.command_line:(*\\-\\-Filter\\ \\\"rule\\ * OR *\\-\\-Encoded\\ \\-\\-Filter\\ \\\\\\\"*))`"}
