{"id":"2e65275c-8288-4ab4-aeb7-6274f58b6b20","created_by":"Florian Roth","name":"Procdump Usage","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects usage of the SysInternals Procdump utility","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of procdump by a developer or administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/)","rule_id":"2e65275c-8288-4ab4-aeb7-6274f58b6b20","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:(*\\\\procdump.exe OR *\\\\procdump64.exe)`"}
