{"id":"36d88494-1d43-4dc0-b3fa-35c8fea0ca9d","created_by":"Florian Roth","name":"CreateMiniDump Hacktool","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects the use of CreateMiniDump hack tool used to dump the LSASS process memory for credential extraction on the attacker's machine","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Rr][Ee][Aa][Tt][Ee][Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee].*/ OR process.pe.imphash:/4[Aa]07[Ff]944[Aa]83[Ee]8[Aa]7[Cc]2525[Ee][Ff][Aa]35[Dd][Dd]30[Ee]2[Ff]/ OR related.hash:/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=4[Aa]07[Ff]944[Aa]83[Ee]8[Aa]7[Cc]2525[Ee][Ff][Aa]35[Dd][Dd]30[Ee]2[Ff].*/)","rule_id":"36d88494-1d43-4dc0-b3fa-35c8fea0ca9d","timestamp_override":"event.ingested","references":["https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\CreateMiniDump.exe* OR process.pe.imphash:4a07f944a83e8a7c2525efa35dd30e2f OR related.hash:*IMPHASH\\=4a07f944a83e8a7c2525efa35dd30e2f*)`"}
