{"id":"39ed3c80-e6a1-431b-9df3-911ac53d08a7","created_by":"Christian Burkard","name":"UAC Bypass Using NTFS Reparse Point - Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe DLL hijacking (UACMe 36)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Uu][Ss][Aa]\\.[Ee][Xx][Ee]\\\"\\ \\ \\/[Qq][Uu][Ii][Ee][Tt]\\ [Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Mm][Ss][Uu]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/)) OR (process.parent.command_line:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]\\\"\\ \\/[Oo][Nn][Ll][Ii][Nn][Ee]\\ \\/[Qq][Uu][Ii][Ee][Tt]\\ \\/[Nn][Oo][Rr][Ee][Ss][Tt][Aa][Rr][Tt]\\ \\/[Aa][Dd][Dd]\\-[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ \\/[Pp][Aa][Cc][Kk][Aa][Gg][Ee][Pp][Aa][Tt][Hh]\\:\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Ee]386\\\"\\ \\/[Ii][Gg][Nn][Oo][Rr][Ee][Cc][Hh][Ee][Cc][Kk]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/) AND process.command_line:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.command_line:/.*\\\\[Dd][Ii][Ss][Mm][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\{.*/ AND process.executable:/.*\\\\[Dd][Ii][Ss][Mm][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))","rule_id":"39ed3c80-e6a1-431b-9df3-911ac53d08a7","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\wusa.exe\\\"\\ \\ \\/quiet\\ C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Temp\\\\update.msu AND winlog.event_data.IntegrityLevel:(High OR System)) OR (process.parent.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\dism.exe\\\"\\ \\/online\\ \\/quiet\\ \\/norestart\\ \\/add\\-package\\ \\/packagepath\\:\\\"C\\:\\\\Windows\\\\system32\\\\pe386\\\"\\ \\/ignorecheck AND winlog.event_data.IntegrityLevel:(High OR System) AND process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.command_line:*\\\\dismhost.exe\\ \\{* AND process.executable:*\\\\DismHost.exe))`"}
