{"id":"efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6","created_by":"Florian Roth","name":"Suspicious Program Names","tags":null,"interval":"5m","description":"Detects suspicious patterns in program names or folders that are often found in malicious samples or hacktools","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate tools that accidentally match on the searched patterns"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Vv][Ee]\\-202.*/ OR process.executable:(/.*\\\\[Pp][Oo][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Tt][Ii][Ff][Aa][Cc][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Tt][Ii][Ff][Aa][Cc][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Tt][Ii][Ff][Aa][Cc][Tt]_[Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Tt][Ii][Ff][Aa][Cc][Tt]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Tt][Ii][Ff][Aa][Cc][Tt]32[Bb][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /.*[Oo][Bb][Ff][Uu][Ss][Cc][Aa][Tt][Ee][Dd]\\.[Ee][Xx][Ee]/ OR /.*[Oo][Bb][Ff][Uu][Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ee][Tt][Ee][Rr][Pp][Rr][Ee][Tt][Ee][Rr]/) OR process.command_line:(/.*[Ii][Nn][Jj][Ee][Cc][Tt]\\.[Pp][Ss]1.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Vv][Ee].*/ OR /.*[Pp][Uu][Pp][Yy]\\.[Pp][Ss]1.*/ OR /.*[Pp][Aa][Yy][Ll][Oo][Aa][Dd]\\.[Pp][Ss]1.*/ OR /.*[Bb][Ee][Aa][Cc][Oo][Nn]\\.[Pp][Ss]1.*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Vv][Ii][Ee][Ww]\\.[Pp][Ss]1.*/ OR /.*[Bb][Yy][Pp][Aa][Ss][Ss]\\.[Pp][Ss]1.*/ OR /.*[Oo][Bb][Ff][Uu][Ss][Cc][Aa][Tt][Ee][Dd]\\.[Pp][Ss]1.*/ OR /.*[Oo][Bb][Ff][Uu][Ss][Cc]\\.[Pp][Ss]1.*/ OR /.*[Oo][Bb][Ff][Uu][Ss]\\.[Pp][Ss]1.*/ OR /.*[Oo][Bb][Ff][Ss]\\.[Pp][Ss]1.*/ OR /.*[Ee][Vv][Ii][Ll]\\.[Pp][Ss]1.*/ OR /.*[Mm][Ii][Nn][Ii][Dd][Oo][Gg][Zz]\\.[Pp][Ss]1.*/ OR /.*_[Ee][Nn][Cc]\\.[Pp][Ss]1.*/ OR /.*\\\\[Ss][Hh][Ee][Ll][Ll]\\.[Pp][Ss]1.*/ OR /.*\\\\[Rr][Ss][Hh][Ee][Ll][Ll]\\.[Pp][Ss]1.*/ OR /.*[Rr][Ee][Vv][Ss][Hh][Ee][Ll][Ll]\\.[Pp][Ss]1.*/ OR /.*\\\\[Aa][Vv]\\.[Pp][Ss]1.*/ OR /.*\\\\[Aa][Vv]_[Tt][Ee][Ss][Tt]\\.[Pp][Ss]1.*/ OR /.*[Aa][Dd][Rr][Ee][Cc][Oo][Nn]\\.[Pp][Ss]1.*/ OR /.*[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz]\\.[Pp][Ss]1.*/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Uu][Pp]_.*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Uu][Pp]\\.[Pp][Ss]1.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\[Aa]\\.[Pp][Ss]1.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\[Pp]\\.[Pp][Ss]1.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\1\\.[Pp][Ss]1.*/ OR /.*[Hh][Oo][Uu][Nn][Dd]\\.[Pp][Ss]1.*/ OR /.*[Ee][Nn][Cc][Oo][Dd][Ee]\\.[Pp][Ss]1.*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Cc][Aa][Tt]\\.[Pp][Ss]1.*/))","rule_id":"efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\CVE\\-202* OR process.executable:(*\\\\poc.exe OR *\\\\artifact.exe OR *\\\\artifact64.exe OR *\\\\artifact_protected.exe OR *\\\\artifact32.exe OR *\\\\artifact32big.exe OR *obfuscated.exe OR *obfusc.exe OR *\\\\meterpreter) OR process.command_line:(*inject.ps1* OR *Invoke\\-CVE* OR *pupy.ps1* OR *payload.ps1* OR *beacon.ps1* OR *PowerView.ps1* OR *bypass.ps1* OR *obfuscated.ps1* OR *obfusc.ps1* OR *obfus.ps1* OR *obfs.ps1* OR *evil.ps1* OR *MiniDogz.ps1* OR *_enc.ps1* OR *\\\\shell.ps1* OR *\\\\rshell.ps1* OR *revshell.ps1* OR *\\\\av.ps1* OR *\\\\av_test.ps1* OR *adrecon.ps1* OR *mimikatz.ps1* OR *\\\\PowerUp_* OR *powerup.ps1* OR *\\\\Temp\\\\a.ps1* OR *\\\\Temp\\\\p.ps1* OR *\\\\Temp\\\\1.ps1* OR *Hound.ps1* OR *encode.ps1* OR *powercat.ps1*))`"}
