{"id":"8834e2f7-6b4b-4f09-8906-d2276470ee23","created_by":"Florian Roth","name":"PsExec/PAExec Escalation to LOCAL SYSTEM","tags":["attack.resource_development","attack.t1587.001"],"interval":"5m","description":"Detects suspicious flags used by PsExec and PAExec to escalate a command line to LOCAL_SYSTEM rights","risk_score":73,"enabled":true,"severity":"high","false_positives":["Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance purposes (rare)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\-[Ss]\\ [Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /.*[Pp][Aa][Ee][Xx][Ee][Cc].*/ OR /.*[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa].*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\ \\/[Kk]\\ .*/))","rule_id":"8834e2f7-6b4b-4f09-8906-d2276470ee23","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec","https://www.poweradmin.com/paexec/","https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\-s\\ cmd.exe AND process.command_line:(*PsExec* OR *PAExec* OR *accepteula* OR *cmd\\ \\/c\\ * OR *cmd\\ \\/k\\ *))`"}
