{"id":"53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2","created_by":"Nasreddine Bencherchali","name":"Query Usage To Exfil Data","tags":["attack.execution"],"interval":"5m","description":"Detects usage of \"query.exe\" a system binary to exfil information such as \"sessions\" and \"processes\" for later use","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Qq][Uu][Ee][Rr][Yy]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ \\>.*/ OR /.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ \\>.*/))","rule_id":"53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2","timestamp_override":"event.ingested","references":["https://twitter.com/MichalKoczwara/status/1553634816016498688"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\Windows\\\\System32\\\\query.exe AND process.command_line:(*session\\ >* OR *process\\ >*))`"}
