{"id":"22e58743-4ac8-4a9f-bf19-00a0428d8c5f","created_by":"Nasreddine Bencherchali","name":"Base64 MZ Header In CommandLine","tags":["attack.execution"],"interval":"5m","description":"Detects encoded base64 MZ header in the commandline","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Tt][Vv][Qq][Qq][Aa][Aa][Mm][Aa][Aa][Aa][Aa][Ee][Aa][Aa][Aa][Aa].*/ OR /.*[Tt][Vv][Pp][Qq][Aa][Aa][Ii][Aa][Aa][Aa][Aa][Ee][Aa][Aa]8[Aa].*/ OR /.*[Tt][Vv][Qq][Aa][Aa][Aa][Ee][Aa][Aa][Aa][Aa][Ee][Aa][Bb][Aa][Aa].*/ OR /.*[Tt][Vv][Oo][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa][Aa].*/ OR /.*[Tt][Vv][Pp][Tt][Aa][Qq][Ee][Aa][Aa][Aa][Aa][Ee][Aa][Aa][Aa][Aa].*/)","rule_id":"22e58743-4ac8-4a9f-bf19-00a0428d8c5f","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*TVqQAAMAAAAEAAAA* OR *TVpQAAIAAAAEAA8A* OR *TVqAAAEAAAAEABAA* OR *TVoAAAAAAAAAAAAA* OR *TVpTAQEAAAAEAAAA*)`"}
