{"id":"bab049ca-7471-4828-9024-38279a4c04da","created_by":"Janantha Marasinghe","name":"Detect Virtualbox Driver Installation OR Starting Of VMs","tags":["attack.defense_evasion","attack.t1564.006","attack.t1564"],"interval":"5m","description":"Adversaries can carry out malicious operations using a virtual instance to avoid detection. This rule is built to detect the registration of the Virtualbox driver or start of a Virtualbox VM.","risk_score":21,"enabled":true,"severity":"low","false_positives":["This may have false positives on hosts where Virtualbox is legitimately being used for operations"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Vv][Bb][Oo][Xx][Rr][Tt]\\.[Dd][Ll][Ll],[Rr][Tt][Rr]3[Ii][Nn][Ii][Tt].*/ OR /.*[Vv][Bb][Oo][Xx][Cc]\\.[Dd][Ll][Ll].*/ OR /.*[Vv][Bb][Oo][Xx][Dd][Rr][Vv]\\.[Ss][Yy][Ss].*/) OR process.command_line:(/.*[Ss][Tt][Aa][Rr][Tt][Vv][Mm].*/ OR /.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Vv][Mm].*/))","rule_id":"bab049ca-7471-4828-9024-38279a4c04da","timestamp_override":"event.ingested","references":["https://attack.mitre.org/techniques/T1564/006/","https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomware-deploys-virtual-machine-to-dodge-security/","https://threatpost.com/maze-ransomware-ragnar-locker-virtual-machine/159350/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*VBoxRT.dll,RTR3Init* OR *VBoxC.dll* OR *VBoxDrv.sys*) OR process.command_line:(*startvm* OR *controlvm*))`"}
