{"id":"18988e1b-9087-4f8a-82fe-0414dce49878","created_by":"frack113, Nasreddine Bencherchali","name":"Execute Code with Pester.bat as Parent","tags":["attack.execution","attack.t1059.001","attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects code execution via Pester.bat (Pester - Powershell Modulte for testing)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of Pester for writing tests for Powershell scripts and modules"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.parent.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Mm][Oo][Dd][Uu][Ll][Ee][Ss]\\\\[Pp][Ee][Ss][Tt][Ee][Rr]\\\\.*/ AND process.parent.command_line:(/.*\\{\\ [Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ee][Ss][Tt][Ee][Rr]\\ \\-[Ee][Nn][Aa][Bb][Ll][Ee][Ee][Xx][Ii][Tt]\\ ;.*/ OR /.*\\{\\ [Gg][Ee][Tt]\\-[Hh][Ee][Ll][Pp]\\ \\\".*/))","rule_id":"18988e1b-9087-4f8a-82fe-0414dce49878","timestamp_override":"event.ingested","references":["https://twitter.com/Oddvarmoe/status/993383596244258816","https://twitter.com/_st0pp3r_/status/1560072680887525378"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.parent.command_line:*\\\\WindowsPowerShell\\\\Modules\\\\Pester\\\\* AND process.parent.command_line:(*\\{\\ Invoke\\-Pester\\ \\-EnableExit\\ ;* OR *\\{\\ Get\\-Help\\ \\\"*))`"}
