{"id":"7453575c-a747-40b9-839b-125a0aae324b","created_by":"@41thexplorer, Microsoft Defender ATP","name":"Unidentified Attacker November 2018","tags":["attack.execution","attack.t1218.011"],"interval":"5m","description":"A sigma rule detecting an unidetefied attacker who used phishing emails to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29 campaign in 2016.","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Cc][Yy][Zz][Ff][Cc]\\.[Dd][Aa][Tt],.*/ AND process.command_line:/.*[Pp][Oo][Ii][Nn][Tt][Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn][Cc][Aa][Ll][Ll]/)","rule_id":"7453575c-a747-40b9-839b-125a0aae324b","timestamp_override":"event.ingested","references":["https://twitter.com/DrunkBinary/status/1063075530180886529"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*cyzfc.dat,* AND process.command_line:*PointFunctionCall)`"}
