{"id":"5edc2273-c26f-406c-83f3-f4d948e740dd","created_by":"frack113","name":"Suspicious Subsystem for Linux Bash Execution","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Performs execution of specified file, can be used for defensive evasion.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\-[Cc]\\ .*/) AND (NOT ((process.parent.command_line:(/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Ii][Tt]\\\\[Pp][Oo][Ss][Tt]\\-[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Bb][Aa][Tt].*/ OR /.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Ii][Tt]\\\\[Pp][Oo][Ss][Tt]\\-[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Bb][Aa][Tt].*/)))))","rule_id":"5edc2273-c26f-406c-83f3-f4d948e740dd","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Bash/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*bash.exe* AND process.command_line:*\\-c\\ *) AND (NOT ((process.parent.command_line:(*C\\:\\\\Program\\ Files\\\\Git\\\\post\\-install.bat* OR *C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Git\\\\post\\-install.bat*)))))`"}
