{"id":"0b80ade5-6997-4b1d-99a1-71701778ea61","created_by":"Oddvar Moe, Sander Wiebing, oscd.community","name":"Imports Registry Key From an ADS","tags":["attack.t1112","attack.defense_evasion"],"interval":"5m","description":"Detects the import of a alternate datastream to the registry with regedit.exe.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Ii]\\ .*/ OR /.*\\.[Rr][Ee][Gg].*/) AND process.command_line:/:[^ \\\\\\\\]/) AND (NOT (process.command_line:(/.*\\ \\/[Ee]\\ .*/ OR /.*\\ \\/[Aa]\\ .*/ OR /.*\\ \\/[Cc]\\ .*/ OR /.*\\ \\-[Ee]\\ .*/ OR /.*\\ \\-[Aa]\\ .*/ OR /.*\\ \\-[Cc]\\ .*/))))","rule_id":"0b80ade5-6997-4b1d-99a1-71701778ea61","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Regedit/","https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/i\\ * OR *.reg*) AND process.command_line:/:[^ \\\\\\\\]/) AND (NOT (process.command_line:(*\\ \\/e\\ * OR *\\ \\/a\\ * OR *\\ \\/c\\ * OR *\\ \\-e\\ * OR *\\ \\-a\\ * OR *\\ \\-c\\ *))))`"}
