{"id":"56c217c3-2de2-479b-990f-5c109ba8458f","created_by":"Markus Neis, @Karneades","name":"Default PowerSploit and Empire Schtasks Persistence","tags":["attack.execution","attack.persistence","attack.privilege_escalation","attack.s0111","attack.g0022","attack.g0060","car.2013-08-001","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects the creation of a schtask via PowerSploit or Empire Default Configuration.","risk_score":73,"enabled":true,"severity":"high","false_positives":["False positives are possible, depends on organisation and processes"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*\\/[Ss][Cc].*/ AND process.command_line:/.*\\/[Tt][Nn].*/ AND process.command_line:/.*[Uu][Pp][Dd][Aa][Tt][Ee][Rr].*/ AND process.command_line:/.*\\/[Tt][Rr].*/ AND process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:(/.*[Oo][Nn][Ll][Oo][Gg][Oo][Nn].*/ OR /.*[Dd][Aa][Ii][Ll][Yy].*/ OR /.*[Oo][Nn][Ii][Dd][Ll][Ee].*/ OR /.*[Uu][Pp][Dd][Aa][Tt][Ee][Rr].*/))","rule_id":"56c217c3-2de2-479b-990f-5c109ba8458f","timestamp_override":"event.ingested","references":["https://github.com/0xdeadbeefJERKY/PowerSploit/blob/8690399ef70d2cad10213575ac67e8fa90ddf7c3/Persistence/Persistence.psm1","https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/powershell/persistence/userland/schtasks.py"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create* AND process.command_line:*\\/SC* AND process.command_line:*\\/TN* AND process.command_line:*Updater* AND process.command_line:*\\/TR* AND process.command_line:*powershell* AND process.command_line:(*ONLOGON* OR *DAILY* OR *ONIDLE* OR *Updater*))`"}
