{"id":"c0e1c3d5-4381-4f18-8145-2583f06a1fe5","created_by":"Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)","name":"Excel Proxy Executing Regsvr32 With Payload","tags":["attack.t1204.002","attack.t1047","attack.t1218.010","attack.execution","attack.defense_evasion"],"interval":"5m","description":"Excel called wmic to finally proxy execute regsvr32 with the payload. An attacker wanted to break suspicious parent-child chain (Office app spawns LOLBin).But we have command-line in the event which allow us to \"restore\" this suspicious parent-child chain and detect it. Monitor process creation with \"wmic process call create\" and LOLBins in command-line with parent Office application processes.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Mm][Ss][Ii][Ee][Xx][Ee][Cc].*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*[Vv][Ee][Rr][Cc][Ll][Ss][Ii][Dd].*/) AND (process.executable:/.*\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.command_line:/.*[Ww][Mm][Ii][Cc]\\ .*/) AND process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*[Cc][Aa][Ll][Ll].*/))","rule_id":"c0e1c3d5-4381-4f18-8145-2583f06a1fe5","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/","https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*regsvr32* OR *rundll32* OR *msiexec* OR *mshta* OR *verclsid*) AND (process.executable:*\\\\wbem\\\\WMIC.exe OR process.command_line:*wmic\\ *) AND process.parent.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe) AND (process.command_line:*process* AND process.command_line:*create* AND process.command_line:*call*))`"}
