{"id":"aeab5ec5-be14-471a-80e8-e344418305c2","created_by":"Florian Roth","name":"Executable Used by PlugX in Uncommon Location","tags":["attack.s0013","attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects the execution of an executable that is typically used by PlugX for DLL side loading started from an uncommon location","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((((((((((((process.executable:/.*\\\\[Cc][Aa][Mm][Mm][Uu][Tt][Ee]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Ll][Ee][Nn][Oo][Vv][Oo]\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\ [Uu][Tt][Ii][Ll][Ii][Tt][Yy]\\\\.*/ OR /.*\\\\[Ll][Ee][Nn][Oo][Vv][Oo]\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss]\\ [Uu][Tt][Ii][Ll][Ii][Tt][Yy]\\\\.*/)))) OR (process.executable:/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]_[Ff][Rr][Aa][Mm][Ee]_[Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/)))) OR (process.executable:/.*\\\\[Dd][Vv][Cc][Ee][Mm][Uu][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Dd][Ee][Vv][Ii][Cc][Ee]\\ [Ee][Mm][Uu][Ll][Aa][Tt][Oo][Rr]\\\\.*/)))) OR (process.executable:/.*\\\\[Gg][Aa][Dd][Gg][Ee][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Mm][Ee][Dd][Ii][Aa]\\ [Pp][Ll][Aa][Yy][Ee][Rr]\\\\.*/)))) OR (process.executable:/.*\\\\[Hh][Cc][Cc]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Hh][Tt][Mm][Ll]\\ [Hh][Ee][Ll][Pp]\\ [Ww][Oo][Rr][Kk][Ss][Hh][Oo][Pp]\\\\.*/)))) OR (process.executable:/.*\\\\[Hh][Kk][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\\\[Ss][Yy][Ss][Nn][Aa][Tt][Ii][Vv][Ee]\\\\.*/ OR /.*\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))) OR (process.executable:/.*\\\\[Mm][Cc]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Dd][Kk].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt].*/))))) OR (process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*\\\\[Aa][Nn][Tt][Ii][Mm][Aa][Ll][Ww][Aa][Rr][Ee]\\\\.*/))))) OR (process.executable:/.*\\\\[Mm][Ss][Ss][Ee][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ee][Nn][Tt][Ee][Rr]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Ee][Ss][Ss][Ee][Nn][Tt][Ii][Aa][Ll][Ss]\\\\.*/))))) OR (process.executable:/.*\\\\[Oo][Ii][Nn][Ff][Oo][Pp]11\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\.*/)))) OR (process.executable:/.*\\\\[Oo][Ll][Ee][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Dd][Kk].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee]\\ [Kk][Ii][Tt]\\\\.*/))))) OR (process.executable:/.*\\\\[Rr][Cc]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Dd][Kk].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Kk][Ii][Tt].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee]\\ [Kk][Ii][Tt]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\.*/)))))","rule_id":"aeab5ec5-be14-471a-80e8-e344418305c2","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/","https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((((((((((((process.executable:*\\\\CamMute.exe AND (NOT (process.executable:(*\\\\Lenovo\\\\Communication\\ Utility\\\\* OR *\\\\Lenovo\\\\Communications\\ Utility\\\\*)))) OR (process.executable:*\\\\chrome_frame_helper.exe AND (NOT (process.executable:*\\\\Google\\\\Chrome\\\\application\\\\*)))) OR (process.executable:*\\\\dvcemumanager.exe AND (NOT (process.executable:*\\\\Microsoft\\ Device\\ Emulator\\\\*)))) OR (process.executable:*\\\\Gadget.exe AND (NOT (process.executable:*\\\\Windows\\ Media\\ Player\\\\*)))) OR (process.executable:*\\\\hcc.exe AND (NOT (process.executable:*\\\\HTML\\ Help\\ Workshop\\\\*)))) OR (process.executable:*\\\\hkcmd.exe AND (NOT (process.executable:(*\\\\System32\\\\* OR *\\\\SysNative\\\\* OR *\\\\SysWow64\\\\*))))) OR (process.executable:*\\\\Mc.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit*))))) OR (process.executable:*\\\\MsMpEng.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Security\\ Client\\\\* OR *\\\\Windows\\ Defender\\\\* OR *\\\\AntiMalware\\\\*))))) OR (process.executable:*\\\\msseces.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Security\\ Center\\\\* OR *\\\\Microsoft\\ Security\\ Client\\\\* OR *\\\\Microsoft\\ Security\\ Essentials\\\\*))))) OR (process.executable:*\\\\OInfoP11.exe AND (NOT (process.executable:*\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\*)))) OR (process.executable:*\\\\OleView.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit* OR *\\\\Windows\\ Resource\\ Kit\\\\*))))) OR (process.executable:*\\\\rc.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit* OR *\\\\Windows\\ Resource\\ Kit\\\\* OR *\\\\Microsoft.NET\\\\*)))))`"}
