{"id":"d2b749ee-4225-417e-b20e-a8d2193cbb84","created_by":"Florian Roth","name":"Suspicious AdvancedRun Execution","tags":null,"interval":"5m","description":"Detects the execution of AdvancedRun utility","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ OR (process.command_line:/.*\\ \\/[Ee][Xx][Ee][Ff][Ii][Ll][Ee][Nn][Aa][Mm][Ee]\\ .*/ AND process.command_line:/.*\\ \\/[Rr][Uu][Nn].*/) OR (process.command_line:/.*\\ \\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Aa][Tt][Ee]\\ 0.*/ AND process.command_line:/.*\\ \\/[Rr][Uu][Nn][Aa][Ss]\\ .*/ AND process.command_line:/.*\\ \\/[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee]\\ .*/))","rule_id":"d2b749ee-4225-417e-b20e-a8d2193cbb84","timestamp_override":"event.ingested","references":["https://twitter.com/splinter_code/status/1483815103279603714","https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3","https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/","https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:AdvancedRun.exe OR (process.command_line:*\\ \\/EXEFilename\\ * AND process.command_line:*\\ \\/Run*) OR (process.command_line:*\\ \\/WindowState\\ 0* AND process.command_line:*\\ \\/RunAs\\ * AND process.command_line:*\\ \\/CommandLine\\ *))`"}
