{"id":"fdfcbd78-48f1-4a4b-90ac-d82241e368c5","created_by":"Romaissa Adjailia, FLorian Roth","name":"PsExec Service Execution","tags":["attack.execution"],"interval":"5m","description":"Detects launch of the PSEXESVC service, which means that this system was the target of a psexec remote execution","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/)","rule_id":"fdfcbd78-48f1-4a4b-90ac-d82241e368c5","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec","https://www.youtube.com/watch?v=ro2QuZTIMBM"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:C\\:\\\\Windows\\\\PSEXESVC.exe OR process.pe.original_file_name:psexesvc.exe)`"}
