{"id":"dcdbc940-0bff-46b2-95f3-2d73f848e33b","created_by":"Justin C. (@endisphotic), @dreadphones (detection), Thomas Patzke (Sigma rule)","name":"Suspicious Spool Service Child Process","tags":["attack.execution","attack.t1203","attack.privilege_escalation","attack.t1068"],"interval":"5m","description":"Detects suspicious print spool service (spoolsv.exe) child processes.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:/[Ss][Yy][Ss][Tt][Ee][Mm]/) AND (((((process.executable:(/.*\\\\[Gg][Pp][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ll][Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Kk][Ii][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Gg][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Cc][Hh][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Cc][Dd][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ii][Pp][Hh][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Rr][Ii][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:/.*[Ss][Tt][Aa][Rr][Tt].*/)))) OR (process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:(/.*\\.[Ss][Pp][Ll].*/ OR /.*[Rr][Oo][Uu][Tt][Ee]\\ [Aa][Dd][Dd].*/ OR /.*[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/))))) OR (process.executable:/.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:(/.*[Aa][Dd][Dd]\\ [Pp][Oo][Rr][Tt][Oo][Pp][Ee][Nn][Ii][Nn][Gg].*/ OR /.*[Rr][Uu][Ll][Ee]\\ [Nn][Aa][Mm][Ee].*/))))) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND (NOT (process.command_line:/.*\\.[Ss][Pp][Ll].*/)))) OR (process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/)))","rule_id":"dcdbc940-0bff-46b2-95f3-2d73f848e33b","timestamp_override":"event.ingested","references":["https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\spoolsv.exe AND winlog.event_data.IntegrityLevel:System) AND (((((process.executable:(*\\\\gpupdate.exe OR *\\\\whoami.exe OR *\\\\nltest.exe OR *\\\\taskkill.exe OR *\\\\wmic.exe OR *\\\\taskmgr.exe OR *\\\\sc.exe OR *\\\\findstr.exe OR *\\\\curl.exe OR *\\\\wget.exe OR *\\\\certutil.exe OR *\\\\bitsadmin.exe OR *\\\\accesschk.exe OR *\\\\wevtutil.exe OR *\\\\bcdedit.exe OR *\\\\fsutil.exe OR *\\\\cipher.exe OR *\\\\schtasks.exe OR *\\\\write.exe OR *\\\\wuauclt.exe) OR (process.executable:*\\\\net.exe AND (NOT (process.command_line:*start*)))) OR (process.executable:*\\\\cmd.exe AND (NOT (process.command_line:(*.spl* OR *route\\ add* OR *program\\ files*))))) OR (process.executable:*\\\\netsh.exe AND (NOT (process.command_line:(*add\\ portopening* OR *rule\\ name*))))) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND (NOT (process.command_line:*.spl*)))) OR (process.executable:*\\\\rundll32.exe AND process.command_line:*rundll32.exe)))`"}
