{"id":"ae6f14e6-14de-45b0-9f44-c0986f50dc89","created_by":"Nasreddine Bencherchali","name":"Change Default File Association To Executable","tags":["attack.persistence","attack.t1546.001"],"interval":"5m","description":"Detects when a program changes the default file association of any extension to an executable","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Cc][Mm][Dd].*/ AND process.command_line:/.*\\ \\/[Cc]\\ .*/ AND process.command_line:/.*[Aa][Ss][Ss][Oo][Cc]\\ .*/ AND process.command_line:/.*[Ee][Xx][Ee][Ff][Ii][Ll][Ee].*/) AND (NOT (process.command_line:/.*\\.[Ee][Xx][Ee]\\=[Ee][Xx][Ee][Ff][Ii][Ll][Ee].*/)))","rule_id":"ae6f14e6-14de-45b0-9f44-c0986f50dc89","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/assoc"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*cmd* AND process.command_line:*\\ \\/c\\ * AND process.command_line:*assoc\\ * AND process.command_line:*exefile*) AND (NOT (process.command_line:*.exe\\=exefile*)))`"}
