{"id":"1a0d4aba-7668-4365-9ce4-6d79ab088dfd","created_by":"Florian Roth","name":"Ping Hex IP","tags":["attack.defense_evasion","attack.t1140","attack.t1027"],"interval":"5m","description":"Detects a ping command that uses a hex encoded IP address","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely, because no sane admin pings IP addresses in a hexadecimal form"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*0[Xx].*/)","rule_id":"1a0d4aba-7668-4365-9ce4-6d79ab088dfd","timestamp_override":"event.ingested","references":["https://github.com/vysecurity/Aggressor-VYSEC/blob/0d61c80387b9432dab64b8b8a9fb52d20cfef80e/ping.cna","https://twitter.com/vysecurity/status/977198418354491392"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\ping.exe AND process.command_line:*0x*)`"}
