{"id":"4a12fa47-c735-4032-a214-6fab5b120670","created_by":"Bhabesh Raj","name":"Lazarus Activity","tags":["attack.g0032","attack.execution","attack.t1106"],"interval":"5m","description":"Detects different process creation events as described in Malwarebytes's threat report on Lazarus group activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Should not be any false positives"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Mm][Ss][Hh][Tt][Aa].*/ AND process.command_line:/.*\\.[Zz][Ii][Pp].*/) OR (process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:/.*\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/))","rule_id":"4a12fa47-c735-4032-a214-6fab5b120670","timestamp_override":"event.ingested","references":["https://blog.malwarebytes.com/malwarebytes-news/2021/04/lazarus-apt-conceals-malicious-code-within-bmp-file-to-drop-its-rat/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*mshta* AND process.command_line:*.zip*) OR (process.parent.executable:C\\:\\\\Windows\\\\System32\\\\wbem\\\\wmiprvse.exe AND process.executable:C\\:\\\\Windows\\\\System32\\\\mshta.exe) OR (process.parent.executable:*\\:\\\\Users\\\\Public\\\\* AND process.executable:C\\:\\\\Windows\\\\System32\\\\rundll32.exe))`"}
