{"id":"dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a","created_by":"Florian Roth","name":"Disabled Volume Snapshots","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects commands that temporarily turn off Volume Snapshots","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Ee][Gg].*/ AND process.command_line:/.*\\ [Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Vv][Ss][Ss]\\\\[Dd][Ii][Aa][Gg].*/ AND process.command_line:/.*\\/[Dd]\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd].*/)","rule_id":"dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a","timestamp_override":"event.ingested","references":["https://twitter.com/0gtweet/status/1354766164166115331"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*reg* AND process.command_line:*\\ add\\ * AND process.command_line:*\\\\Services\\\\VSS\\\\Diag* AND process.command_line:*\\/d\\ Disabled*)`"}
