{"id":"a18dd26b-6450-46de-8c91-9659150cf088","created_by":"Florian Roth","name":"Suspicious GrantedAccess Flags on LSASS Access","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects process access to LSASS memory with suspicious access flags","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate software accessing LSASS process for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:(/.*30/ OR /.*50/ OR /.*70/ OR /.*90/ OR /.*[Bb]0/ OR /.*[Dd]0/ OR /.*[Ff]0/ OR /.*18/ OR /.*38/ OR /.*58/ OR /.*78/ OR /.*98/ OR /.*[Bb]8/ OR /.*[Dd]8/ OR /.*[Ff]8/ OR /.*1[Aa]/ OR /.*3[Aa]/ OR /.*5[Aa]/ OR /.*7[Aa]/ OR /.*9[Aa]/ OR /.*[Bb][Aa]/ OR /.*[Dd][Aa]/ OR /.*[Ff][Aa]/ OR /.*0[Xx]14[Cc]2/)) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Aa][Ll][Ww][Aa][Rr][Ee][Bb][Yy][Tt][Ee][Ss]\\\\[Aa][Nn][Tt][Ii]\\-[Mm][Aa][Ll][Ww][Aa][Rr][Ee]\\\\[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Aa][Ll][Ww][Aa][Rr][Ee][Bb][Yy][Tt][Ee][Ss]\\\\[Mm][Bb][Aa][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Cc][Tt][Ll][Rr][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Mm][Bb][Uu][Pp][Dd][Aa][Tt][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Ee][Rr][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Ii][Ss][Cc][Oo]\\\\[Cc][Ii][Ss][Cc][Oo]\\ [Aa][Nn][Yy][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ee]\\ [Mm][Oo][Bb][Ii][Ll][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Vv][Pp][Nn][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Cc][Ii][Ss][Cc][Oo]\\\\[Cc][Ii][Ss][Cc][Oo]\\ [Aa][Nn][Yy][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ee]\\ [Mm][Oo][Bb][Ii][Ll][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Vv][Pp][Nn][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\.*/ AND process.executable:/.*\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/) AND process.executable:/.*[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Rr][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]1418/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\[Mm][Mm][Ss][Ss][Hh][Oo][Ss][Tt]\\\\[Mm][Mm][Ss][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/) AND winlog.event_data.GrantedAccess:/0[Xx]1[Ff][Ff][Ff][Ff][Ff]/) OR (winlog.event_data.CallTrace:/.*|[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Dd][Ee][Ff][Ii][Nn][Ii][Tt][Ii][Oo][Nn]\\ [Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\\\{.*/ AND winlog.event_data.CallTrace:/.*\\}\\\\[Mm][Pp][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Dd][Ll][Ll]\\+.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1418/))))","rule_id":"a18dd26b-6450-46de-8c91-9659150cf088","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights","https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow","https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html","https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2)) AND (NOT ((process.executable:(C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe OR C\\:\\\\Program\\ Files\\\\Malwarebytes\\\\Anti\\-Malware\\\\MBAMService.exe OR C\\:\\\\PROGRAMDATA\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe OR C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe OR C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe OR C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe OR C\\:\\\\Windows\\\\System32\\\\msiexec.exe OR C\\:\\\\Windows\\\\System32\\\\lsass.exe OR C\\:\\\\WINDOWS\\\\System32\\\\perfmon.exe OR C\\:\\\\Windows\\\\System32\\\\MRT.exe OR C\\:\\\\Program\\ Files\\\\Cisco\\\\Cisco\\ AnyConnect\\ Secure\\ Mobility\\ Client\\\\vpnagent.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Cisco\\\\Cisco\\ AnyConnect\\ Secure\\ Mobility\\ Client\\\\vpnagent.exe)) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND process.executable:*Antivirus*) OR (process.executable:C\\:\\\\WINDOWS\\\\system32\\\\MRT.exe AND winlog.event_data.GrantedAccess:0x1418) OR (process.executable:C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\McAfee\\\\MMSSHost\\\\MMSSHOST.exe) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe) AND winlog.event_data.GrantedAccess:0x1fffff) OR (winlog.event_data.CallTrace:*|C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Definition\\ Updates\\\\\\{* AND winlog.event_data.CallTrace:*\\}\\\\mpengine.dll\\+* AND winlog.event_data.GrantedAccess:0x1418))))`"}
