{"id":"7be5fb68-f9ef-476d-8b51-0256ebece19e","created_by":"frack113","name":"Suspicious Execution of Hostname","tags":["attack.discovery","attack.t1082"],"interval":"5m","description":"Use of hostname to get information","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Hh][Oo][Ss][Tt][Nn][Aa][Mm][Ee]\\.[Ee][Xx][Ee]/","rule_id":"7be5fb68-f9ef-476d-8b51-0256ebece19e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-6---hostname-discovery-windows","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/hostname"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\HOSTNAME.EXE`"}
