{"id":"ff23ffbc-3378-435e-992f-0624dcf93ab4","created_by":"Florian Roth","name":"PurpleSharp Indicator","tags":["attack.t1587","attack.resource_development"],"interval":"5m","description":"Detects the execution of the PurpleSharp adversary simulation tool","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Xx][Yy][Zz]123456\\.[Ee][Xx][Ee].*/ OR /.*[Pp][Uu][Rr][Pp][Ll][Ee][Ss][Hh][Aa][Rr][Pp].*/) OR process.pe.original_file_name:/[Pp][Uu][Rr][Pp][Ll][Ee][Ss][Hh][Aa][Rr][Pp]\\.[Ee][Xx][Ee]/)","rule_id":"ff23ffbc-3378-435e-992f-0624dcf93ab4","timestamp_override":"event.ingested","references":["https://github.com/mvelazc0/PurpleSharp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*xyz123456.exe* OR *PurpleSharp*) OR process.pe.original_file_name:PurpleSharp.exe)`"}
