{"id":"bed2a484-9348-4143-8a8a-b801c979301c","created_by":"Florian Roth, Jonhnathan Ribeiro, Anton Kutepov, oscd.community","name":"Webshell Detection With Command Line Keywords","tags":["attack.persistence","attack.t1505.003","attack.t1018","attack.t1033","attack.t1087"],"interval":"5m","description":"Detects certain command line parameters often used during reconnaissance activity via web shells","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Dd][Dd][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss]_[Tt][Oo][Mm][Cc][Aa][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.executable:(/.*\\-[Tt][Oo][Mm][Cc][Aa][Tt]\\-.*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/)) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]\\.[Jj][Aa][Rr].*/ OR /.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]_[Hh][Oo][Mm][Ee].*/))) AND ((process.pe.original_file_name:(/[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ [Uu][Ss][Ee][Rr]\\ .*/ OR /.*\\ [Uu][Ss][Ee]\\ .*/ OR /.*\\ [Gg][Rr][Oo][Uu][Pp]\\ .*/)) OR (process.pe.original_file_name:/[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Nn]\\ .*/) OR process.command_line:(/.*\\&[Cc][Dd]\\&[Ee][Cc][Hh][Oo].*/ OR /.*[Cc][Dd]\\ \\/[Dd]\\ .*/) OR (process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Nn][Oo][Dd][Ee]\\:.*/) OR (process.executable:(/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Qq][Uu][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Pp][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Aa][Tt][Hh][Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Rr][Aa][Cc][Ee][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /[Ss][Yy][Ss][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /[Qq][Uu][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Ii][Pp][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /[Pp][Aa][Tt][Hh][Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Tt][Rr][Aa][Cc][Ee][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR process.command_line:(/.*\\ [Tt][Ee][Ss][Tt]\\-[Nn][Ee][Tt][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn]\\ .*/ OR /.*[Dd][Ii][Rr]\\ \\\\.*/)))","rule_id":"bed2a484-9348-4143-8a8a-b801c979301c","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-ii.html","https://unit42.paloaltonetworks.com/bumblebee-webshell-xhunt-campaign/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe OR *\\\\caddy.exe OR *\\\\ws_tomcatservice.exe) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.executable:(*\\-tomcat\\-* OR *\\\\tomcat*)) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.command_line:(*catalina.jar* OR *CATALINA_HOME*))) AND ((process.pe.original_file_name:(net.exe OR net1.exe) AND process.command_line:(*\\ user\\ * OR *\\ use\\ * OR *\\ group\\ *)) OR (process.pe.original_file_name:ping.exe AND process.command_line:*\\ \\-n\\ *) OR process.command_line:(*&cd&echo* OR *cd\\ \\/d\\ *) OR (process.pe.original_file_name:wmic.exe AND process.command_line:*\\ \\/node\\:*) OR (process.executable:(*\\\\whoami.exe OR *\\\\systeminfo.exe OR *\\\\quser.exe OR *\\\\ipconfig.exe OR *\\\\pathping.exe OR *\\\\tracert.exe OR *\\\\netstat.exe OR *\\\\schtasks.exe OR *\\\\vssadmin.exe OR *\\\\wevtutil.exe OR *\\\\tasklist.exe) OR process.pe.original_file_name:(whoami.exe OR sysinfo.exe OR quser.exe OR ipconfig.exe OR pathping.exe OR tracert.exe OR netstat.exe OR schtasks.exe OR VSSADMIN.EXE OR wevtutil.exe OR tasklist.exe)) OR process.command_line:(*\\ Test\\-NetConnection\\ * OR *dir\\ \\\\*)))`"}
