{"id":"931b6802-d6a6-4267-9ffa-526f57f22aaf","created_by":"Olaf Hartong","name":"Windows 10 Scheduled Task SandboxEscaper 0-day","tags":["attack.privilege_escalation","attack.t1053.005","car.2013-08-001"],"interval":"5m","description":"Detects Task Scheduler .job import arbitrary DACL write\\par","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.pe.original_file_name:/[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Hh][Aa][Nn][Gg][Ee].*/ AND process.command_line:/.*\\/[Tt][Nn].*/ AND process.command_line:/.*\\/[Rr][Uu].*/ AND process.command_line:/.*\\/[Rr][Pp].*/)","rule_id":"931b6802-d6a6-4267-9ffa-526f57f22aaf","timestamp_override":"event.ingested","references":["https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.pe.original_file_name:schtasks.exe AND process.command_line:*\\/change* AND process.command_line:*\\/TN* AND process.command_line:*\\/RU* AND process.command_line:*\\/RP*)`"}
