{"id":"b9cbbc17-d00d-4e3d-a827-b06d03d2380d","created_by":"Sreeman","name":"Monitoring For Persistence Via BITS","tags":["attack.defense_evasion","attack.t1197"],"interval":"5m","description":"BITS will allow you to schedule a command to execute after a successful download to notify you that the job is finished. When the job runs on the system the command specified in the BITS job will be executed. This can be abused by actors to create a backdoor within the system and for persistence. It will be chained in a BITS job to schedule the download of malware/additional binaries and execute the program after being downloaded","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ AND process.command_line:/.*\\/[Ss][Ee][Tt][Nn][Oo][Tt][Ii][Ff][Yy][Cc][Mm][Dd][Ll][Ii][Nn][Ee].*/ AND process.command_line:(/.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ OR /.*[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee].*/)) OR (process.command_line:/.*[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ AND process.command_line:/.*\\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee].*/ AND process.command_line:(/.*[Hh][Tt][Tt][Pp]\\:.*/ OR /.*[Hh][Tt][Tt][Pp][Ss]\\:.*/ OR /.*[Ff][Tt][Pp]\\:.*/ OR /.*[Ff][Tt][Pp][Ss]\\:.*/)))","rule_id":"b9cbbc17-d00d-4e3d-a827-b06d03d2380d","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html","http://0xthem.blogspot.com/2014/03/t-emporal-persistence-with-and-schtasks.html","https://isc.sans.edu/diary/Wipe+the+drive+Stealthy+Malware+Persistence+Mechanism+-+Part+1/15394"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*bitsadmin* AND process.command_line:*\\/SetNotifyCmdLine* AND process.command_line:(*%COMSPEC%* OR *cmd.exe* OR *regsvr32.exe*)) OR (process.command_line:*bitsadmin* AND process.command_line:*\\/Addfile* AND process.command_line:(*http\\:* OR *https\\:* OR *ftp\\:* OR *ftps\\:*)))`"}
