{"id":"cc7abbd0-762b-41e3-8a26-57ad50d2eea3","created_by":"Diego Perez (@darkquassar), Markus Neis, Swisscom (Improve Rule)","name":"MSHTA Suspicious Execution 01","tags":["attack.defense_evasion","attack.t1140","attack.t1218.005","attack.execution","attack.t1059.007","cve.2020.1599"],"interval":"5m","description":"Detection for mshta.exe suspicious execution patterns sometimes involving file polyglotism","risk_score":73,"enabled":true,"severity":"high","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*\\.[Jj][Pp][Gg].*/ OR /.*\\.[Pp][Nn][Gg].*/ OR /.*\\.[Ll][Nn][Kk].*/ OR /.*\\.[Xx][Ll][Ss].*/ OR /.*\\.[Dd][Oo][Cc].*/ OR /.*\\.[Zz][Ii][Pp].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Ee][Xx][Ee].*/))","rule_id":"cc7abbd0-762b-41e3-8a26-57ad50d2eea3","timestamp_override":"event.ingested","references":["http://blog.sevagas.com/?Hacking-around-HTA-files","https://0x00sec.org/t/clientside-exploitation-in-2018-how-pentesting-has-changed/7356","https://docs.microsoft.com/en-us/dotnet/standard/data/xml/xslt-stylesheet-scripting-using-msxsl-script","https://medium.com/tsscyber/pentesting-and-hta-bypassing-powershell-constrained-language-mode-53a42856c997","https://twitter.com/mattifestation/status/1326228491302563846"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\mshta.exe AND process.command_line:(*vbscript* OR *.jpg* OR *.png* OR *.lnk* OR *.xls* OR *.doc* OR *.zip* OR *.dll* OR *.exe*))`"}
