{"id":"9465ddf4-f9e4-4ebd-8d98-702df3a93239","created_by":"Florian Roth","name":"IIS Native-Code Module Command Line Installation","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Detects suspicious IIS native-code module installations via command line","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown as it may vary from organisation to organisation how admins use to install IIS modules"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Pp][Pp][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:/.*[Mm][Oo][Dd][Uu][Ll][Ee].*/ AND process.command_line:/.*\\/[Nn][Aa][Mm][Ee]\\:.*/)","rule_id":"9465ddf4-f9e4-4ebd-8d98-702df3a93239","timestamp_override":"event.ingested","references":["https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/","https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\appcmd.exe AND process.command_line:*install* AND process.command_line:*module* AND process.command_line:*\\/name\\:*)`"}
