{"id":"1c8774a0-44d4-4db0-91f8-e792359c70bd","created_by":"Nasreddine Bencherchali","name":"REGISTER_APP.VBS Proxy Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register a VSS/VDS Provider as a COM+ application.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of the script. Always investigate what's being registered to confirm if it's benign"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr]_[Aa][Pp][Pp]\\.[Vv][Bb][Ss].*/ AND process.command_line:/.*\\-[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr].*/)","rule_id":"1c8774a0-44d4-4db0-91f8-e792359c70bd","timestamp_override":"event.ingested","references":["https://twitter.com/sblmsrsn/status/1456613494783160325?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\register_app.vbs* AND process.command_line:*\\-register*)`"}
