{"id":"6a5f68d1-c4b5-46b9-94ee-5324892ea939","created_by":"frack113","name":"Uninstall Sysinternals Sysmon","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the uninstallation of Sysinternals Sysmon, which could be the result of legitimate administration or a manipulation for defense evasion","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ss][Yy][Ss][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\-[Uu].*/)","rule_id":"6a5f68d1-c4b5-46b9-94ee-5324892ea939","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-11---uninstall-sysmon"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\Sysmon64.exe OR *\\\\Sysmon.exe) AND process.command_line:*\\-u*)`"}
