{"id":"459f2f98-397b-4a4a-9f47-6a5ec2f1c69d","created_by":"Nasreddine Bencherchali","name":"Download Arbitrary Files Via MSOHTMED.EXE","tags":["attack.defense_evasion","attack.execution","attack.t1218"],"interval":"5m","description":"Detects usage of \"MSOHTMED\" to download arbitrary files","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Mm][Ss][Oo][Hh][Tt][Mm][Ee][Dd]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ss][Oo][Hh][Tt][Mm][Ee][Dd]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Hh][Tt][Tt][Pp]\\:\\/\\/.*/ OR /.*[Hh][Tt][Tt][Pp][Ss]\\:\\/\\/.*/ OR /.*[Ff][Tt][Pp]\\:\\/\\/.*/))","rule_id":"459f2f98-397b-4a4a-9f47-6a5ec2f1c69d","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/pull/238/files"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\MSOHTMED.exe OR process.pe.original_file_name:MsoHtmEd.exe) AND process.command_line:(*http\\:\\/\\/* OR *https\\:\\/\\/* OR *ftp\\:\\/\\/*))`"}
