{"id":"e42af9df-d90b-4306-b7fb-05c863847ebd","created_by":"frack113","name":"WMI Remote Command Execution","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"An adversary might use WMI to execute commands on a remote system","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\/[Nn][Oo][Dd][Ee]\\:.*/ AND process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ AND process.command_line:/.*[Cc][Aa][Ll][Ll].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee].*/))","rule_id":"e42af9df-d90b-4306-b7fb-05c863847ebd","timestamp_override":"event.ingested","references":["https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\WMIC.exe OR process.pe.original_file_name:wmic.exe) AND (process.command_line:*\\/node\\:* AND process.command_line:*process* AND process.command_line:*call* AND process.command_line:*create*))`"}
