{"id":"3abd6094-7027-475f-9630-8ab9be7b9725","created_by":"oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st, wagga","name":"Mounted Windows Admin Shares with net.exe","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Detects when an admin share is mounted using net.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ [Uu][Ss][Ee]\\ .*/ AND process.command_line:/.*\\\\\\*\\\\.*$.*/)","rule_id":"3abd6094-7027-475f-9630-8ab9be7b9725","timestamp_override":"event.ingested","references":["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*\\ use\\ * AND process.command_line:*\\\\\\*\\\\*$*)`"}
