{"id":"37ae075c-271b-459b-8d7b-55ad5f993dd8","created_by":"Jakob Weinzettl, oscd.community, Nasreddine Bencherchali","name":"File or Folder Permissions Modifications","tags":["attack.defense_evasion","attack.t1222.001"],"interval":"5m","description":"Detects a file or folder's permissions being modified.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Users interacting with the files on their own (unlikely unless privileged users).","Dynatrace app"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:(/.*\\\\[Tt][Aa][Kk][Ee][Oo][Ww][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Cc][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\/[Gg][Rr][Aa][Nn][Tt].*/) OR (process.executable:/.*\\\\[Aa][Tt][Tt][Rr][Ii][Bb]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Rr].*/)) AND (NOT ((process.command_line:/.*[Ii][Cc][Aa][Cc][Ll][Ss]\\ [Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Yy][Nn][Aa][Tt][Rr][Aa][Cc][Ee]\\\\[Gg][Aa][Tt][Ee][Ww][Aa][Yy]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Vv][Ii][Tt][Yy]\\.[Hh][Ii][Ss][Tt][Oo][Rr][Yy]\\ \\/[Rr][Ee][Ss][Ee][Tt]/) OR (process.command_line:/.*[Ii][Cc][Aa][Cc][Ll][Ss]\\ [Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Yy][Nn][Aa][Tt][Rr][Aa][Cc][Ee]\\\\[Gg][Aa][Tt][Ee][Ww][Aa][Yy]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\.[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Ii][Ee][Ss]\\ \\/[Gg][Rr][Aa][Nn][Tt]\\ \\:[Rr]\\ .*/ AND process.command_line:/.*[Ss]\\-1\\-5\\-19\\:[Ff].*/) OR (process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee].*/ OR process.parent.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/))))","rule_id":"37ae075c-271b-459b-8d7b-55ad5f993dd8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh750728(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:(*\\\\takeown.exe OR *\\\\cacls.exe OR *\\\\icacls.exe OR *\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*\\/grant*) OR (process.executable:*\\\\attrib.exe AND process.command_line:*\\-r*)) AND (NOT ((process.command_line:*ICACLS\\ C\\:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\connectivity.history\\ \\/reset) OR (process.command_line:*ICACLS\\ C\\:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\config.properties\\ \\/grant\\ \\:r\\ * AND process.command_line:*S\\-1\\-5\\-19\\:F*) OR (process.command_line:*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code* OR process.parent.executable:*\\\\Microsoft\\ VS\\ Code\\\\Code.exe))))`"}
