{"id":"3b5b0213-0460-4e3f-8937-3abf98ff7dcc","created_by":"frack113","name":"Suspicious Workstation Locking via Rundll32","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects a suspicious call to the user32.dll function that locks the user workstation","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Scripts or links on the user desktop used to lock the workstation instead of Windows+L or the menu option"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Uu][Ss][Ee][Rr]32\\.[Dd][Ll][Ll],.*/ AND process.command_line:/.*[Ll][Oo][Cc][Kk][Ww][Oo][Rr][Kk][Ss][Tt][Aa][Tt][Ii][Oo][Nn].*/)","rule_id":"3b5b0213-0460-4e3f-8937-3abf98ff7dcc","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rundll32.exe AND process.parent.executable:*\\\\cmd.exe AND process.command_line:*user32.dll,* AND process.command_line:*LockWorkStation*)`"}
