{"id":"66e563f9-1cbd-4a22-a957-d8b7c0f44372","created_by":"Florian Roth","name":"XORDump Use","tags":["attack.defense_evasion","attack.t1036","attack.t1003.001"],"interval":"5m","description":"Detects suspicious use of XORDump process memory dumping utility","risk_score":73,"enabled":true,"severity":"high","false_positives":["Another tool that uses the command line switches of XORdump"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Xx][Oo][Rr][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*\\ \\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]\\ .*/ OR /.*\\ \\-[Mm]\\ [Cc][Oo][Mm][Ss][Vv][Cc][Ss]\\ .*/ OR /.*\\ \\-[Mm]\\ [Dd][Bb][Gg][Hh][Ee][Ll][Pp]\\ .*/ OR /.*\\ \\-[Mm]\\ [Dd][Bb][Gg][Cc][Oo][Rr][Ee]\\ .*/))","rule_id":"66e563f9-1cbd-4a22-a957-d8b7c0f44372","timestamp_override":"event.ingested","references":["https://github.com/audibleblink/xordump"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\xordump.exe OR process.command_line:(*\\ \\-process\\ lsass.exe\\ * OR *\\ \\-m\\ comsvcs\\ * OR *\\ \\-m\\ dbghelp\\ * OR *\\ \\-m\\ dbgcore\\ *))`"}
