{"id":"7d4aaec2-08ed-4430-8b96-28420e030e04","created_by":"Nasreddine Bencherchali","name":"Suspicious Sigverif Execution","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects the execution of sigverif binary as a parent process which could indicate it being used as a LOLBIN to proxy execution","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.parent.executable:/.*\\\\[Ss][Ii][Gg][Vv][Ee][Rr][Ii][Ff]\\.[Ee][Xx][Ee]/","rule_id":"7d4aaec2-08ed-4430-8b96-28420e030e04","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/","https://twitter.com/0gtweet/status/1457676633809330184"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.parent.executable:*\\\\sigverif.exe`"}
