{"id":"57712d7a-679c-4a41-a913-87e7175ae429","created_by":"frack113","name":"Suspicious Sc Query","tags":["attack.discovery","attack.t1007"],"interval":"5m","description":"Adversaries may try to get information about registered services","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Ss][Cc]\\ [Qq][Uu][Ee][Rr][Yy].*/","rule_id":"57712d7a-679c-4a41-a913-87e7175ae429","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1007/T1007.md#atomic-test-1---system-service-discovery"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*sc\\ query*`"}
