{"id":"2b30fa36-3a18-402f-a22d-bf4ce2189f35","created_by":"Florian Roth","name":"Baby Shark Activity","tags":["attack.execution","attack.t1059.003","attack.t1059.001","attack.discovery","attack.t1012","attack.defense_evasion","attack.t1218.005"],"interval":"5m","description":"Detects activity that could be related to Baby Shark malware","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/[Rr][Ee][Gg]\\ [Qq][Uu][Ee][Rr][Yy]\\ \\\"[Hh][Kk][Ee][Yy]_[Cc][Uu][Rr][Rr][Ee][Nn][Tt]_[Uu][Ss][Ee][Rr]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\"/ OR /[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]\\ [Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]\\ [Hh][Tt][Tt][Pp].*/ OR /[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ [Tt][Aa][Ss][Kk][Kk][Ii][Ll][Ll]\\ \\/[Ii][Mm]\\ [Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)","rule_id":"2b30fa36-3a18-402f-a22d-bf4ce2189f35","timestamp_override":"event.ingested","references":["https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(reg\\ query\\ \\\"HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Default\\\" OR powershell.exe\\ mshta.exe\\ http* OR cmd.exe\\ \\/c\\ taskkill\\ \\/im\\ cmd.exe)`"}
