{"id":"07e3cb2c-0608-410d-be4b-1511cb1a0448","created_by":"Nasreddine Bencherchali","name":"Tamper Windows Defender Remove-MpPreference","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects attempts to remove windows defender configuration using the 'MpPreference' cmdlet","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee].*/ AND process.command_line:(/.*\\-[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Dd][Ff][Oo][Ll][Dd][Ee][Rr][Aa][Cc][Cc][Ee][Ss][Ss][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Ff][Oo][Ll][Dd][Ee][Rr][Ss]\\ .*/ OR /.*\\-[Aa][Tt][Tt][Aa][Cc][Kk][Ss][Uu][Rr][Ff][Aa][Cc][Ee][Rr][Ee][Dd][Uu][Cc][Tt][Ii][Oo][Nn][Rr][Uu][Ll][Ee][Ss]_[Ii][Dd][Ss]\\ .*/ OR /.*\\-[Aa][Tt][Tt][Aa][Cc][Kk][Ss][Uu][Rr][Ff][Aa][Cc][Ee][Rr][Ee][Dd][Uu][Cc][Tt][Ii][Oo][Nn][Rr][Uu][Ll][Ee][Ss]_[Aa][Cc][Tt][Ii][Oo][Nn][Ss]\\ .*/ OR /.*\\-[Cc][Hh][Ee][Cc][Kk][Ff][Oo][Rr][Ss][Ii][Gg][Nn][Aa][Tt][Uu][Rr][Ee][Ss][Bb][Ee][Ff][Oo][Rr][Ee][Rr][Uu][Nn][Nn][Ii][Nn][Gg][Ss][Cc][Aa][Nn]\\ .*/))","rule_id":"07e3cb2c-0608-410d-be4b-1511cb1a0448","timestamp_override":"event.ingested","references":["https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/windows-10-controlled-folder-access-event-search/ba-p/2326088"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Remove\\-MpPreference* AND process.command_line:(*\\-ControlledFolderAccessProtectedFolders\\ * OR *\\-AttackSurfaceReductionRules_Ids\\ * OR *\\-AttackSurfaceReductionRules_Actions\\ * OR *\\-CheckForSignaturesBeforeRunningScan\\ *))`"}
