{"id":"590a5f4c-6c8c-4f10-8307-89afe9453a9d","created_by":"Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research (OTR)","name":"Suspicious Child Process Created as System","tags":["attack.privilege_escalation","attack.t1134.002"],"interval":"5m","description":"Detection of child processes spawned with SYSTEM privileges by parents with LOCAL SERVICE or NETWORK SERVICE accounts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.ParentUser:(/[Nn][Tt]\\ [Aa][Uu][Tt][Hh][Oo][Rr][Ii][Tt][Yy]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]/ OR /[Nn][Tt]\\ [Aa][Uu][Tt][Hh][Oo][Rr][Ii][Tt][Yy]\\\\[Ll][Oo][Cc][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]/ OR /[Aa][Uu][Tt][Oo][Rr][Ii][Tt][Ee]\\ [Nn][Tt]\\\\/) AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/) AND winlog.event_data.User:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]/ OR /.*\\\\СИСТЕМА/) AND winlog.event_data.IntegrityLevel:/[Ss][Yy][Ss][Tt][Ee][Mm]/) AND (NOT (process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Dd][Aa][Vv][Ss][Ee][Tt][Cc][Oo][Oo][Kk][Ii][Ee].*/)))","rule_id":"590a5f4c-6c8c-4f10-8307-89afe9453a9d","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/","https://github.com/antonioCoco/RogueWinRM","https://twitter.com/Cyb3rWard0g/status/1453123054243024897"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.ParentUser:(NT\\ AUTHORITY\\\\NETWORK\\ SERVICE OR NT\\ AUTHORITY\\\\LOCAL\\ SERVICE OR AUTORITE\\ NT\\\\) AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*) AND winlog.event_data.User:(*\\\\SYSTEM OR *\\\\СИСТЕМА) AND winlog.event_data.IntegrityLevel:System) AND (NOT (process.executable:*\\\\rundll32.exe AND process.command_line:*DavSetCookie*)))`"}
