{"id":"9719a8aa-401c-41af-8108-ced7ec9cd75c","created_by":"frack113","name":"Remove Windows Defender Definition Files","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Adversaries may disable security tools to avoid possible detection of their tools and activities by removing Windows Defender Definition Files","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Rr][Ee][Mm][Oo][Vv][Ee][Dd][Ee][Ff][Ii][Nn][Ii][Tt][Ii][Oo][Nn][Ss].*/ AND process.command_line:/.*\\ \\-[Aa][Ll][Ll].*/)","rule_id":"9719a8aa-401c-41af-8108-ced7ec9cd75c","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:MpCmdRun.exe AND process.command_line:*\\ \\-RemoveDefinitions* AND process.command_line:*\\ \\-All*)`"}
