{"id":"1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd","created_by":"Florian Roth","name":"Suspicious Rundll32 Invoking Inline VBScript","tags":["attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Detects suspicious process related to rundll32 based on command line that invokes inline VBScript as seen being used by UNC2452","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ AND process.command_line:/.*[Rr][Ee][Gg][Rr][Ee][Aa][Dd].*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww]\\.[Cc][Ll][Oo][Ss][Ee].*/)","rule_id":"1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*rundll32.exe* AND process.command_line:*Execute* AND process.command_line:*RegRead* AND process.command_line:*window.close*)`"}
