{"id":"97a80ec7-0e2f-4d05-9ef4-65760e634f6b","created_by":"Florian Roth","name":"Run Whoami Showing Privileges","tags":["attack.privilege_escalation","attack.discovery","attack.t1033"],"interval":"5m","description":"Detects a whoami.exe executed with the /priv command line flag instructing the tool to show all current user privieleges. This is often used after a privilege escalation attempt.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity (rare lookups on current privileges)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\/[Pp][Rr][Ii][Vv].*/)","rule_id":"97a80ec7-0e2f-4d05-9ef4-65760e634f6b","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\whoami.exe OR process.pe.original_file_name:whoami.exe) AND process.command_line:*\\/priv*)`"}
