{"id":"5817e76f-4804-41e6-8f1d-5fa0b3ecae2d","created_by":"frack113","name":"Use Radmin Viewer Utility","tags":["attack.execution","attack.lateral_movement","attack.t1072"],"interval":"5m","description":"An adversary may use Radmin Viewer Utility to remotely control Windows device","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.description:/[Rr][Aa][Dd][Mm][Ii][Nn]\\ [Vv][Ii][Ee][Ww][Ee][Rr]/ OR process.pe.product:/[Rr][Aa][Dd][Mm][Ii][Nn]\\ [Vv][Ii][Ee][Ww][Ee][Rr]/ OR process.pe.original_file_name:/[Rr][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)","rule_id":"5817e76f-4804-41e6-8f1d-5fa0b3ecae2d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1072/T1072.md","https://www.radmin.fr/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.description:Radmin\\ Viewer OR process.pe.product:Radmin\\ Viewer OR process.pe.original_file_name:Radmin.exe)`"}
