{"id":"39b31e81-5f5f-4898-9c0e-2160cfc0f9bf","created_by":"frack113","name":"Password Cracking with Hashcat","tags":["attack.credential_access","attack.t1110.002"],"interval":"5m","description":"Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against","risk_score":73,"enabled":true,"severity":"high","false_positives":["Tools that accidentally use the same command line flags and values"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Hh][Aa][Ss][Hh][Cc][Aa][Tt]\\.[Ee][Xx][Ee]/ OR (process.command_line:/.*\\-[Aa]\\ .*/ AND process.command_line:/.*\\-[Mm]\\ 1000\\ .*/ AND process.command_line:/.*\\-[Rr]\\ .*/))","rule_id":"39b31e81-5f5f-4898-9c0e-2160cfc0f9bf","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat","https://hashcat.net/wiki/doku.php?id=hashcat"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\hashcat.exe OR (process.command_line:*\\-a\\ * AND process.command_line:*\\-m\\ 1000\\ * AND process.command_line:*\\-r\\ *))`"}
