{"id":"7cce6fc8-a07f-4d84-a53e-96e1879843c9","created_by":"frack113","name":"False Sysinternals Suite Tools","tags":["attack.execution","attack.defense_evasion","attack.t1218","attack.t1202"],"interval":"5m","description":"Rename as a legitimate Sysinternals Suite tool to evade detection","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Cc][Hh][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Cc][Hh][Kk]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Ee][Nn][Uu][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ii][Nn][Ss][Ii][Gg][Hh][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ii][Nn][Ss][Ii][Gg][Hh][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Rr][Ee][Ss][Tt][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Rr][Ee][Ss][Tt][Oo][Rr][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Ll][Oo][Gg][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn][Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn][Ss][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Gg][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Gg][Ii][Nn][Ff][Oo]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Cc][Hh][Ee][Ss][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Cc][Hh][Ee][Ss][Ee][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ll][Oo][Cc][Kk][Rr][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ll][Oo][Cc][Kk][Rr][Ee][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Tt][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Tt][Ii][Gg]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Rr][Ee][Ii][Nn][Ff][Oo]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Pp][Uu][Ss][Tt][Rr][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Pp][Uu][Ss][Tt][Rr][Ee][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Tt][Rr][Ll]2[Cc][Aa][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Bb][Gg][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Bb][Gg][Vv][Ii][Ee][Ww]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk]2[Vv][Hh][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk]2[Vv][Hh][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Ee][Xx][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Ee][Xx][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Kk][Vv][Ii][Ee][Ww]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Uu]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Uu]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Ff][Ss][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Ll][Ii][Nn][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Ll][Ii][Nn][Kk][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Ee][Xx]2[Dd][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Ee][Xx]2[Dd][Ee][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Uu][Nn][Cc][Tt][Ii][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Uu][Nn][Cc][Tt][Ii][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Dd][Mm][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Ss][Tt][Dd][Ll][Ll][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Ss][Tt][Dd][Ll][Ll][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Aa][Dd][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Aa][Dd][Oo][Rr][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Aa][Dd][Oo][Rr][Dd][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Aa][Dd][Oo][Rr][Dd][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Gg][Oo][Nn][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Gg][Oo][Nn][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Oo][Vv][Ee][Ff][Ii][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Oo][Vv][Ee][Ff][Ii][Ll][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Mm][Yy][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Mm][Yy][Ff][Aa][Uu][Ll][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Mm][Yy][Ff][Aa][Uu][Ll][Tt][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Mm][Yy][Ff][Aa][Uu][Ll][Tt][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Tt][Ff][Ss][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Tt][Ff][Ss][Ii][Nn][Ff][Oo]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ee][Nn][Dd][Mm][Oo][Vv][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ee][Nn][Dd][Mm][Oo][Vv][Ee][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ii][Pp][Ee][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ii][Pp][Ee][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Rr][Tt][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ff][Ii][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ff][Ii][Ll][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Gg][Ee][Tt][Ss][Ii][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Gg][Ee][Tt][Ss][Ii][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ii][Nn][Ff][Oo]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Kk][Ii][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Kk][Ii][Ll][Ll]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Gg][Ee][Dd][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Ii][Nn][Gg]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Uu][Ss][Pp][Ee][Nn][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ss][Uu][Ss][Pp][Ee][Nn][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Aa][Mm][Mm][Aa][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Dd][Cc][Mm][Aa][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Dd][Ee][Ll][Nn][Uu][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Dd][Ee][Ll][Nn][Uu][Ll][Ll]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Jj][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Dd][Ee][Ll][Ee][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Dd][Ee][Ll][Ee][Tt][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh][Aa][Rr][Ee][Ee][Nn][Uu][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh][Aa][Rr][Ee][Ee][Nn][Uu][Mm]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh][Ee][Ll][Ll][Rr][Uu][Nn][Aa][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ii][Gg][Cc][Hh][Ee][Cc][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ii][Gg][Cc][Hh][Ee][Cc][Kk]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Tt][Rr][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Tt][Rr][Ee][Aa][Mm][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Tt][Rr][Ii][Nn][Gg][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Tt][Rr][Ii][Nn][Gg][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Nn][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Nn][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Cc][Pp][Vv][Cc][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Cc][Pp][Vv][Cc][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Cc][Pp][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Cc][Pp][Vv][Ii][Ee][Ww]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ee][Ss][Tt][Ll][Ii][Mm][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ee][Ss][Tt][Ll][Ii][Mm][Ii][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Mm][Mm][Aa][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Mm][Mm][Aa][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Oo][Ll][Uu][Mm][Ee][Ii][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Oo][Ll][Uu][Mm][Ee][Ii][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Ii][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Ii][Ss]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Oo][Bb][Jj]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Oo][Bb][Jj]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Zz][Oo][Oo][Mm][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Zz][Oo][Oo][Mm][Ii][Tt]64\\.[Ee][Xx][Ee]/) AND (NOT ((process.pe.company:(/[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]\\ \\-\\ [Ww][Ww][Ww]\\.[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]\\.[Cc][Oo][Mm]/ OR /[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]/)) OR (NOT _exists_:process.pe.company))))","rule_id":"7cce6fc8-a07f-4d84-a53e-96e1879843c9","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/sysinternals-suite"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\accesschk.exe OR *\\\\accesschk64.exe OR *\\\\AccessEnum.exe OR *\\\\ADExplorer.exe OR *\\\\ADExplorer64.exe OR *\\\\ADInsight.exe OR *\\\\ADInsight64.exe OR *\\\\adrestore.exe OR *\\\\adrestore64.exe OR *\\\\Autologon.exe OR *\\\\Autologon64.exe OR *\\\\Autoruns.exe OR *\\\\Autoruns64.exe OR *\\\\autorunsc.exe OR *\\\\autorunsc64.exe OR *\\\\Bginfo.exe OR *\\\\Bginfo64.exe OR *\\\\Cacheset.exe OR *\\\\Cacheset64.exe OR *\\\\Clockres.exe OR *\\\\Clockres64.exe OR *\\\\Contig.exe OR *\\\\Contig64.exe OR *\\\\Coreinfo.exe OR *\\\\Coreinfo64.exe OR *\\\\CPUSTRES.EXE OR *\\\\CPUSTRES64.EXE OR *\\\\ctrl2cap.exe OR *\\\\Dbgview.exe OR *\\\\dbgview64.exe OR *\\\\Desktops.exe OR *\\\\Desktops64.exe OR *\\\\disk2vhd.exe OR *\\\\disk2vhd64.exe OR *\\\\diskext.exe OR *\\\\diskext64.exe OR *\\\\Diskmon.exe OR *\\\\Diskmon64.exe OR *\\\\DiskView.exe OR *\\\\DiskView64.exe OR *\\\\du.exe OR *\\\\du64.exe OR *\\\\efsdump.exe OR *\\\\FindLinks.exe OR *\\\\FindLinks64.exe OR *\\\\handle.exe OR *\\\\handle64.exe OR *\\\\hex2dec.exe OR *\\\\hex2dec64.exe OR *\\\\junction.exe OR *\\\\junction64.exe OR *\\\\ldmdump.exe OR *\\\\listdlls.exe OR *\\\\listdlls64.exe OR *\\\\livekd.exe OR *\\\\livekd64.exe OR *\\\\loadOrd.exe OR *\\\\loadOrd64.exe OR *\\\\loadOrdC.exe OR *\\\\loadOrdC64.exe OR *\\\\logonsessions.exe OR *\\\\logonsessions64.exe OR *\\\\movefile.exe OR *\\\\movefile64.exe OR *\\\\notmyfault.exe OR *\\\\notmyfault64.exe OR *\\\\notmyfaultc.exe OR *\\\\notmyfaultc64.exe OR *\\\\ntfsinfo.exe OR *\\\\ntfsinfo64.exe OR *\\\\pendmoves.exe OR *\\\\pendmoves64.exe OR *\\\\pipelist.exe OR *\\\\pipelist64.exe OR *\\\\portmon.exe OR *\\\\procdump.exe OR *\\\\procdump64.exe OR *\\\\procexp.exe OR *\\\\procexp64.exe OR *\\\\Procmon.exe OR *\\\\Procmon64.exe OR *\\\\psExec.exe OR *\\\\psExec64.exe OR *\\\\psfile.exe OR *\\\\psfile64.exe OR *\\\\psGetsid.exe OR *\\\\psGetsid64.exe OR *\\\\psInfo.exe OR *\\\\psInfo64.exe OR *\\\\pskill.exe OR *\\\\pskill64.exe OR *\\\\pslist.exe OR *\\\\pslist64.exe OR *\\\\psLoggedon.exe OR *\\\\psLoggedon64.exe OR *\\\\psloglist.exe OR *\\\\psloglist64.exe OR *\\\\pspasswd.exe OR *\\\\pspasswd64.exe OR *\\\\psping.exe OR *\\\\psping64.exe OR *\\\\psService.exe OR *\\\\psService64.exe OR *\\\\psshutdown.exe OR *\\\\psshutdown64.exe OR *\\\\pssuspend.exe OR *\\\\pssuspend64.exe OR *\\\\RAMMap.exe OR *\\\\RDCMan.exe OR *\\\\RegDelNull.exe OR *\\\\RegDelNull64.exe OR *\\\\regjump.exe OR *\\\\ru.exe OR *\\\\ru64.exe OR *\\\\sdelete.exe OR *\\\\sdelete64.exe OR *\\\\ShareEnum.exe OR *\\\\ShareEnum64.exe OR *\\\\shellRunas.exe OR *\\\\sigcheck.exe OR *\\\\sigcheck64.exe OR *\\\\streams.exe OR *\\\\streams64.exe OR *\\\\strings.exe OR *\\\\strings64.exe OR *\\\\sync.exe OR *\\\\sync64.exe OR *\\\\Sysmon.exe OR *\\\\Sysmon64.exe OR *\\\\tcpvcon.exe OR *\\\\tcpvcon64.exe OR *\\\\tcpview.exe OR *\\\\tcpview64.exe OR *\\\\Testlimit.exe OR *\\\\Testlimit64.exe OR *\\\\vmmap.exe OR *\\\\vmmap64.exe OR *\\\\Volumeid.exe OR *\\\\Volumeid64.exe OR *\\\\whois.exe OR *\\\\whois64.exe OR *\\\\Winobj.exe OR *\\\\Winobj64.exe OR *\\\\ZoomIt.exe OR *\\\\ZoomIt64.exe) AND (NOT ((process.pe.company:(Sysinternals\\ \\-\\ www.sysinternals.com OR Sysinternals)) OR (NOT _exists_:process.pe.company))))`"}
