{"id":"b9aeac14-2ffd-4ad3-b967-1354a4e628c3","created_by":"Nasreddine Bencherchali","name":"PowerShell Get-Clipboard Cmdlet Via CLI","tags":["attack.collection","attack.t1115"],"interval":"5m","description":"Detects usage of the 'Get-Clipboard' cmdlet via CLI","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Gg][Ee][Tt]\\-[Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd].*/","rule_id":"b9aeac14-2ffd-4ad3-b967-1354a4e628c3","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/16","https://threathunterplaybook.com/evals/apt29/detections/7.A.2_F4609F7E-C4DB-4327-91D4-59A58C962A02.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*Get\\-Clipboard*`"}
