{"id":"03552375-cc2c-4883-bbe4-7958d5a980be","created_by":"Aleksey Potapov, oscd.community","name":"SILENTTRINITY Stager Execution","tags":["attack.command_and_control","attack.t1071"],"interval":"5m","description":"Detects SILENTTRINITY stager use","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.pe.description:/.*[Ss][Tt]2[Ss][Tt][Aa][Gg][Ee][Rr].*/","rule_id":"03552375-cc2c-4883-bbe4-7958d5a980be","timestamp_override":"event.ingested","references":["https://github.com/byt3bl33d3r/SILENTTRINITY"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.pe.description:*st2stager*`"}
