{"id":"534f2ef7-e8a2-4433-816d-c91bccde289b","created_by":"Florian Roth","name":"Explorer NOUACCHECK Flag","tags":["attack.defense_evasion","attack.t1548.002"],"interval":"5m","description":"Detects suspicious starts of explorer.exe that use the /NOUACCHECK flag that allows to run all sub processes of that newly started explorer.exe without any UAC checks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Domain Controller User Logon","Unknown how many legitimate software products use that method"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Nn][Oo][Uu][Aa][Cc][Cc][Hh][Ee][Cc][Kk].*/) AND (NOT ((process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss]\\ \\-[Pp]\\ \\-[Ss]\\ [Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]/ OR process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"534f2ef7-e8a2-4433-816d-c91bccde289b","timestamp_override":"event.ingested","references":["https://twitter.com/ORCA6665/status/1496478087244095491"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\explorer.exe AND process.command_line:*\\/NOUACCHECK*) AND (NOT ((process.parent.command_line:C\\:\\\\Windows\\\\system32\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ Schedule OR process.parent.executable:C\\:\\\\Windows\\\\System32\\\\svchost.exe))))`"}
