{"id":"40f9af16-589d-4984-b78d-8c2aec023197","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"High Integrity Sdclt Process","tags":["attack.privilege_escalation","attack.defense_evasion","attack.t1548.002"],"interval":"5m","description":"A General detection for sdclt being spawned as an elevated process. This could be an indicator of sdclt being used for bypass UAC techniques.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*[Ss][Dd][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:/[Hh][Ii][Gg][Hh]/)","rule_id":"40f9af16-589d-4984-b78d-8c2aec023197","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/6","https://threathunterplaybook.com/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*sdclt.exe AND winlog.event_data.IntegrityLevel:High)`"}
