{"id":"a2ea3ae7-d3d0-40a0-a55c-25a45c87cac1","created_by":"Hai Vaknin @LuxNoBulIshit, Avihay eldad  @aloneliassaf, Austin Songer @austinsonger","name":"Suspicious Driver Install by pnputil.exe","tags":["attack.persistence","attack.t1547"],"interval":"5m","description":"Detects when a possible suspicious driver is being installed via pnputil.exe lolbin","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Pnputil.exe being used may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Pnputil.exe being executed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\-[Ii].*/ OR /.*\\/[Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ OR /.*\\-[Aa].*/ OR /.*\\/[Aa][Dd][Dd]\\-[Dd][Rr][Ii][Vv][Ee][Rr].*/ OR /.*\\.[Ii][Nn][Ff].*/) AND process.executable:/.*\\\\[Pp][Nn][Pp][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/)","rule_id":"a2ea3ae7-d3d0-40a0-a55c-25a45c87cac1","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/pnputil-command-syntax","https://strontic.github.io/xcyclopedia/library/pnputil.exe-60EDC5E6BDBAEE441F2E3AEACD0340D2.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\-i* OR *\\/install* OR *\\-a* OR *\\/add\\-driver* OR *.inf*) AND process.executable:*\\\\pnputil.exe)`"}
