{"id":"d0d28567-4b9a-45e2-8bbc-fb1b66a1f7f6","created_by":"oscd.community, Natalia Shornikova","name":"Too Long PowerShell Commandlines","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Too long PowerShell command lines","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/) OR process.pe.description:/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]/ OR process.pe.product:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ [Cc][Oo][Rr][Ee]\\ 6/) AND process.command_line:/.{1000,}/)","rule_id":"d0d28567-4b9a-45e2-8bbc-fb1b66a1f7f6","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:(*powershell* OR *pwsh*) OR process.pe.description:Windows\\ Powershell OR process.pe.product:PowerShell\\ Core\\ 6) AND process.command_line:/.{1000,}/)`"}
