{"id":"730fc21b-eaff-474b-ad23-90fd265d4988","created_by":"omkar72","name":"Psexec Accepteula Condition","tags":["attack.execution","attack.t1569","attack.t1021"],"interval":"5m","description":"Detects user accept agreement execution in psexec commandline","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa].*/)","rule_id":"730fc21b-eaff-474b-ad23-90fd265d4988","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\psexec.exe AND process.command_line:*accepteula*)`"}
