{"id":"646bc99f-6682-4b47-a73a-17b1b64c9d34","created_by":"Beyu Denis, oscd.community","name":"Execute Files with Msdeploy.exe","tags":["attack.execution","attack.t1218"],"interval":"5m","description":"Detects file execution using the msdeploy.exe lolbin","risk_score":47,"enabled":true,"severity":"medium","false_positives":["System administrator Usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Vv][Ee][Rr][Bb]\\:[Ss][Yy][Nn][Cc].*/ AND process.command_line:/.*\\-[Ss][Oo][Uu][Rr][Cc][Ee]\\:[Rr][Uu][Nn][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ AND process.command_line:/.*\\-[Dd][Ee][Ss][Tt]\\:[Rr][Uu][Nn][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ AND process.executable:/.*\\\\[Mm][Ss][Dd][Ee][Pp][Ll][Oo][Yy]\\.[Ee][Xx][Ee]/)","rule_id":"646bc99f-6682-4b47-a73a-17b1b64c9d34","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msdeploy/","https://twitter.com/pabraeken/status/995837734379032576","https://twitter.com/pabraeken/status/999090532839313408"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*verb\\:sync* AND process.command_line:*\\-source\\:RunCommand* AND process.command_line:*\\-dest\\:runCommand* AND process.executable:*\\\\msdeploy.exe)`"}
