{"id":"74db3488-fd28-480a-95aa-b7af626de068","created_by":"Vasiliy Burov, oscd.community","name":"LockerGoga Ransomware","tags":["attack.impact","attack.t1486"],"interval":"5m","description":"Detects LockerGoga Ransomware command line.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*\\-[Ii]\\ [Ss][Mm]\\-[Tt][Gg][Yy][Tt][Uu][Tt][Rr][Cc]\\ \\-[Ss].*/","rule_id":"74db3488-fd28-480a-95aa-b7af626de068","timestamp_override":"event.ingested","references":["https://medium.com/@malwaredancer/lockergoga-input-arguments-ipc-communication-and-others-bd4e5a7ba80a","https://blog.f-secure.com/analysis-of-lockergoga-ransomware/","https://www.carbonblack.com/blog/tau-threat-intelligence-notification-lockergoga-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*\\-i\\ SM\\-tgytutrc\\ \\-s*`"}
