{"id":"a20391f8-76fb-437b-abc0-dba2df1952c6","created_by":"Florian Roth","name":"NodejsTools PressAnyKey Lolbin","tags":["attack.execution","attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects a certain command line flag combination used by Microsoft.NodejsTools.PressAnyKey.exe that can be used to execute any other binary","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other tools with the same command line flag combination","Legitimate uses as part of Visual Studio development"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Oo][Dd][Ee][Jj][Ss][Tt][Oo][Oo][Ll][Ss]\\.[Pp][Rr][Ee][Ss][Ss][Aa][Nn][Yy][Kk][Ee][Yy]\\.[Ee][Xx][Ee]\\ [Nn][Oo][Rr][Mm][Aa][Ll]\\ .*/ OR (process.command_line:/.*\\.[Ee][Xx][Ee]\\ [Nn][Oo][Rr][Mm][Aa][Ll]\\ .*/ AND process.command_line:/.*\\.[Ee][Xx][Ee]/)) AND (NOT ((process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Nn][Oo][Dd][Ee][Jj][Ss][Tt][Oo][Oo][Ll][Ss]\\\\[Nn][Oo][Dd][Ee][Jj][Ss][Tt][Oo][Oo][Ll][Ss].*/))))","rule_id":"a20391f8-76fb-437b-abc0-dba2df1952c6","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1463526834918854661"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*Microsoft.NodejsTools.PressAnyKey.exe\\ normal\\ * OR (process.command_line:*.exe\\ normal\\ * AND process.command_line:*.exe)) AND (NOT ((process.executable:*\\\\Microsoft\\\\NodeJsTools\\\\NodeJsTools*))))`"}
