{"id":"871b9555-69ca-4993-99d3-35a59f9f3599","created_by":"Bhabesh Raj","name":"Suspicious UltraVNC Execution","tags":["attack.lateral_movement","attack.g0047","attack.t1021.005"],"interval":"5m","description":"Detects suspicious UltraVNC command line flag combination that indicate a auto reconnect upon execution, e.g. startup (as seen being used by Gamaredon threat group)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-[Aa][Uu][Tt][Oo][Rr][Ee][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\ .*/ AND process.command_line:/.*\\-[Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\ .*/ AND process.command_line:/.*\\-[Ii][Dd]\\:.*/)","rule_id":"871b9555-69ca-4993-99d3-35a59f9f3599","timestamp_override":"event.ingested","references":["https://www.ria.ee/sites/default/files/content-editors/kuberturve/tale_of_gamaredon_infection.pdf","https://unit42.paloaltonetworks.com/unit-42-title-gamaredon-group-toolset-evolution"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-autoreconnect\\ * AND process.command_line:*\\-connect\\ * AND process.command_line:*\\-id\\:*)`"}
