{"id":"68c8acb4-1b60-4890-8e82-3ddf7a6dba84","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Dan Beavin), oscd.community","name":"HH.exe Execution","tags":["attack.defense_evasion","attack.t1218.001"],"interval":"5m","description":"Identifies usage of hh.exe executing recently modified .chm files.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Cc][Hh][Mm].*/)","rule_id":"68c8acb4-1b60-4890-8e82-3ddf7a6dba84","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.001/T1218.001.md","https://eqllib.readthedocs.io/en/latest/analytics/b25aa548-7937-11e9-8f5c-d46d6d62a49e.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\hh.exe AND process.command_line:*.chm*)`"}
