{"id":"3c05e90d-7eba-4324-9972-5d7f711a60a8","created_by":"Christian Burkard","name":"UAC Bypass Tools Using ComputerDefaults","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/) AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Ss]\\.[Ee][Xx][Ee]/) AND (NOT (process.parent.executable:(/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32.*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/))))","rule_id":"3c05e90d-7eba-4324-9972-5d7f711a60a8","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.IntegrityLevel:(High OR System) AND process.executable:C\\:\\\\Windows\\\\System32\\\\ComputerDefaults.exe) AND (NOT (process.parent.executable:(*\\:\\\\Windows\\\\System32* OR *\\:\\\\Program\\ Files*))))`"}
