{"id":"8202070f-edeb-4d31-a010-a26c72ac5600","created_by":"Thomas Patzke, Florian Roth, Zach Stanford @svch0st, Tim Shelton, Nasreddine Bencherchali (update)","name":"Shells Spawned by Web Servers","tags":["attack.persistence","attack.t1505.003","attack.t1190"],"interval":"5m","description":"Detects web servers that spawn shell processes which could be the result of a successfully placed web shell or another attack","risk_score":73,"enabled":true,"severity":"high","false_positives":["Particular web applications may spawn a shell process legitimately"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.parent.executable:(/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Dd][Dd][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss]_[Tt][Oo][Mm][Cc][Aa][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Uu][Mm][Ww][Oo][Rr][Kk][Ee][Rr][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.executable:(/.*\\-[Tt][Oo][Mm][Cc][Aa][Tt]\\-.*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/)) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.command_line:(/.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]\\.[Jj][Aa][Rr].*/ OR /.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]_[Hh][Oo][Mm][Ee].*/ OR /.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]\\.[Hh][Oo][Mm][Ee].*/))) AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ss][Gg][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ss][Qq][Uu][Ee][Rr][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Oo][Ss][Tt][Nn][Aa][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Pp][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Bb][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Dd][Oo][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ll][Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Tt][Dd][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Aa][Tt][Hh][Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Qq][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Qq][Uu][Ee][Rr][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Qq][Ww][Ii][Nn][Ss][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Rr][Aa][Cc][Ee][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Uu][Ss][Aa]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ [Cc]\\:\\\\[Mm][Aa][Nn][Aa][Gg][Ee][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Aa][Dd][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ \\\"[Pp][Ll][Uu][Ss]\\\\[Ee][Ss]\\\\[Bb][Ii][Nn]\\\\[Ee][Ll][Aa][Ss][Tt][Ii][Cc][Ss][Ee][Aa][Rr][Cc][Hh]\\.[Bb][Aa][Tt]\\ \\-[Ee][Nn][Oo][Dd][Ee]\\.[Nn][Aa][Mm][Ee]\\=[Rr][Mm][Pp]\\-[Nn][Oo][Dd][Ee]1\\ \\-[Pp][Ee][Ll][Aa][Ss][Tt][Ii][Cc][Ss][Ee][Aa][Rr][Cc][Hh]\\-[Pp][Ii][Dd]\\.[Tt][Xx][Tt]/) OR (process.command_line:/.*[Ss][Cc]\\ [Qq][Uu][Ee][Rr][Yy].*/ AND process.command_line:/.*[Aa][Dd][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ [Pp][Ll][Uu][Ss].*/))))","rule_id":"8202070f-edeb-4d31-a010-a26c72ac5600","timestamp_override":"event.ingested","references":["https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.parent.executable:(*\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe OR *\\\\caddy.exe OR *\\\\ws_TomcatService.exe OR *\\\\tomcat.exe OR *\\\\UMWorkerProcess.exe) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.executable:(*\\-tomcat\\-* OR *\\\\tomcat*)) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.command_line:(*catalina.jar* OR *CATALINA_HOME* OR *catalina.home*))) AND process.executable:(*\\\\cmd.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\bitsadmin.exe OR *\\\\arp.exe OR *\\\\at.exe OR *\\\\certutil.exe OR *\\\\dsget.exe OR *\\\\dsquery.exe OR *\\\\find.exe OR *\\\\findstr.exe OR *\\\\fsutil.exe OR *\\\\hostname.exe OR *\\\\ipconfig.exe OR *\\\\nbtstat.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\netdom.exe OR *\\\\netsh.exe OR *\\\\netstat.exe OR *\\\\nltest.exe OR *\\\\nslookup.exe OR *\\\\ntdutil.exe OR *\\\\pathping.exe OR *\\\\ping.exe OR *\\\\qprocess.exe OR *\\\\query.exe OR *\\\\qwinsta.exe OR *\\\\reg.exe OR *\\\\rundll32.exe OR *\\\\sc.exe OR *\\\\schtasks.exe OR *\\\\systeminfo.exe OR *\\\\tasklist.exe OR *\\\\tracert.exe OR *\\\\ver.exe OR *\\\\vssadmin.exe OR *\\\\wevtutil.exe OR *\\\\whoami.exe OR *\\\\wmic.exe OR *\\\\wusa.exe)) AND (NOT ((process.command_line:*Windows\\\\system32\\\\cmd.exe\\ \\/c\\ C\\:\\\\ManageEngine\\\\ADManager\\ \\\"Plus\\\\ES\\\\bin\\\\elasticsearch.bat\\ \\-Enode.name\\=RMP\\-NODE1\\ \\-pelasticsearch\\-pid.txt) OR (process.command_line:*sc\\ query* AND process.command_line:*ADManager\\ Plus*))))`"}
