{"id":"d059842b-6b9d-4ed1-b5c3-5b89143c6ede","created_by":"Michael Haag, FPT.EagleEye","name":"Bitsadmin Download","tags":["attack.defense_evasion","attack.persistence","attack.t1197","attack.s0190","attack.t1036.003"],"interval":"5m","description":"Detects usage of bitsadmin downloading a file","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Some legitimate apps use this, but limited."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/) OR (process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/) OR process.command_line:/.*[Cc][Oo][Pp][Yy]\\ [Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee].*/)","rule_id":"d059842b-6b9d-4ed1-b5c3-5b89143c6ede","timestamp_override":"event.ingested","references":["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin","https://isc.sans.edu/diary/22264","https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\bitsadmin.exe AND process.command_line:(*\\ \\/create\\ * OR *\\ \\/addfile\\ *) AND process.command_line:*http*) OR (process.executable:*\\\\bitsadmin.exe AND process.command_line:*\\ \\/transfer\\ *) OR process.command_line:*copy\\ bitsadmin.exe*)`"}
