{"id":"6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca","created_by":"elhoim","name":"Regsvr32 Spawning Explorer","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects \"regsvr32.exe\" spawning \"explorer.exe\", which is very uncommon.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)","rule_id":"6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/intelligence-insights-april-2022/","https://www.echotrail.io/insights/search/regsvr32.exe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\regsvr32.exe AND process.executable:*\\\\explorer.exe)`"}
