{"id":"d3b70aad-097e-409c-9df2-450f80dc476b","created_by":"Furkan Caliskan (@caliskanfurkan_)","name":"DIT Snapshot Viewer Use","tags":["attack.credential_access","attack.t1003.003"],"interval":"5m","description":"Detects the use of Ditsnap tool. Seems to be a tool for ransomware groups.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate admin usage"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Ii][Tt][Ss][Nn][Aa][Pp]\\.[Ee][Xx][Ee]/ OR process.command_line:/.*[Dd][Ii][Tt][Ss][Nn][Aa][Pp]\\.[Ee][Xx][Ee].*/)","rule_id":"d3b70aad-097e-409c-9df2-450f80dc476b","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2020/06/21/snatch-ransomware/","https://github.com/yosqueoy/ditsnap"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\ditsnap.exe OR process.command_line:*ditsnap.exe*)`"}
