{"id":"fb50eb7a-5ab1-43ae-bcc9-091818cb8424","created_by":"Florian Roth","name":"Disabled IE Security Features","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects command lines that indicate unwanted modifications to registry keys that disable important Internet Explorer security features","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown, maybe some security software installer disables these features temporarily"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\ \\-[Nn][Aa][Mm][Ee]\\ [Ii][Ee][Hh][Aa][Rr][Dd][Ee][Nn]\\ .*/ AND process.command_line:/.*\\ \\-[Vv][Aa][Ll][Uu][Ee]\\ 0\\ .*/) OR (process.command_line:/.*\\ \\-[Nn][Aa][Mm][Ee]\\ [Dd][Ee][Pp][Oo][Ff][Ff]\\ .*/ AND process.command_line:/.*\\ \\-[Vv][Aa][Ll][Uu][Ee]\\ 1\\ .*/) OR (process.command_line:/.*\\ \\-[Nn][Aa][Mm][Ee]\\ [Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ff][Ii][Rr][Ss][Tt][Rr][Uu][Nn][Cc][Uu][Ss][Tt][Oo][Mm][Ii][Zz][Ee]\\ .*/ AND process.command_line:/.*\\ \\-[Vv][Aa][Ll][Uu][Ee]\\ 2\\ .*/))","rule_id":"fb50eb7a-5ab1-43ae-bcc9-091818cb8424","timestamp_override":"event.ingested","references":["https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\ \\-name\\ IEHarden\\ * AND process.command_line:*\\ \\-value\\ 0\\ *) OR (process.command_line:*\\ \\-name\\ DEPOff\\ * AND process.command_line:*\\ \\-value\\ 1\\ *) OR (process.command_line:*\\ \\-name\\ DisableFirstRunCustomize\\ * AND process.command_line:*\\ \\-value\\ 2\\ *))`"}
