{"id":"6a69f62d-ce75-4b57-8dce-6351eb55b362","created_by":"frack113","name":"Esentutl Steals Browser Information","tags":["attack.collection","attack.t1005"],"interval":"5m","description":"One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\/[Rr]\\ .*/ AND process.command_line:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ee][Bb][Cc][Aa][Cc][Hh][Ee].*/))","rule_id":"6a69f62d-ce75-4b57-8dce-6351eb55b362","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/","https://redcanary.com/threat-detection-report/threats/qbot/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\esentutl.exe OR process.pe.original_file_name:esentutl.exe) AND (process.command_line:*\\/r\\ * AND process.command_line:*\\\\Windows\\\\WebCache*))`"}
