{"id":"6f3e2987-db24-4c78-a860-b4f4095a7095","created_by":"Timur Zinniatullin, E.M. Anhaus, oscd.community","name":"Data Compressed - rar.exe","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Highly likely if rar is a default archiver in the monitored environment."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Aa][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ [Aa]\\ .*/)","rule_id":"6f3e2987-db24-4c78-a860-b4f4095a7095","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md","https://eqllib.readthedocs.io/en/latest/analytics/1ec33c93-3d0b-4a28-8014-dbdaae5c60ae.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\rar.exe AND process.command_line:*\\ a\\ *)`"}
