{"id":"7dc2dedd-7603-461a-bc13-15803d132355","created_by":"omkar72","name":"Conhost Parent Process Executions","tags":["attack.defense_evasion","attack.t1202"],"interval":"5m","description":"Detects the conhost execution as parent process. Can be used to evaded defense mechanism.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely, conhost is a child less process"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (winlog.provider_name:/[Ss][Yy][Ss][Tt][Ee][Mm][Tt][Rr][Aa][Cc][Ee][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]/)))","rule_id":"7dc2dedd-7603-461a-bc13-15803d132355","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\conhost.exe AND (NOT (winlog.provider_name:SystemTraceProvider\\-Process)))`"}
