{"id":"d78b5d61-187d-44b6-bf02-93486a80de5a","created_by":"Florian Roth","name":"DInject PowerShell Cradle CommandLine Flags","tags":["attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Detects the use of the Dinject PowerShell cradle based on the specific flags","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ \\/[Aa][Mm]51.*/ OR /.*\\ \\/[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/) AND (NOT ((process.command_line:/.*\\ \\/[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Cc][Hh][Gg].*/ OR process.parent.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Ee][Ee][Tt][Ii][Ss]\\\\[Cc][Ee][Ee][Tt][Ii][Ss]_[Ii][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Cc][Ee][Ee][Tt][Ii][Ss]\\\\[Cc][Ee][Ee][Tt][Ii][Ss]_[Ii][Dd][Ee]\\.[Ee][Xx][Ee]/)))))","rule_id":"d78b5d61-187d-44b6-bf02-93486a80de5a","timestamp_override":"event.ingested","references":["https://github.com/snovvcrash/DInjector"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ \\/am51* OR *\\ \\/password*) AND (NOT ((process.command_line:*\\ \\/PASSWORDCHG* OR process.parent.executable:(C\\:\\\\Program\\ Files\\\\CEETIS\\\\CEETIS_IDE.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\CEETIS\\\\CEETIS_IDE.exe)))))`"}
