{"id":"089fc3d2-71e8-4763-a8a5-c97fbb0a403e","created_by":"frack113","name":"Suspicious Regsvr32 Execution With Image Extension","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"utilizes REGSVR32.exe to execute this DLL masquerading as a Image file","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Jj][Pp][Gg]/)","rule_id":"089fc3d2-71e8-4763-a8a5-c97fbb0a403e","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/","https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\regsvr32.exe AND process.command_line:*.jpg)`"}
