{"id":"2fdefcb3-dbda-401e-ae23-f0db027628bc","created_by":"Florian Roth, @twjackomo, Jonhnathan Ribeiro, oscd.community","name":"Sticky Key Like Backdoor Usage","tags":["attack.privilege_escalation","attack.persistence","attack.t1546.008","car.2014-11-003","car.2014-11-008"],"interval":"5m","description":"Detects the usage and installation of a backdoor that uses an option to register a malicious debugger for built-in tools that are accessible in the login screen","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee].*/ OR /.*[Uu][Tt][Ii][Ll][Mm][Aa][Nn]\\.[Ee][Xx][Ee].*/ OR /.*[Oo][Ss][Kk]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Aa][Gg][Nn][Ii][Ff][Yy]\\.[Ee][Xx][Ee].*/ OR /.*[Nn][Aa][Rr][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee].*/ OR /.*[Dd][Ii][Ss][Pp][Ll][Aa][Yy][Ss][Ww][Ii][Tt][Cc][Hh]\\.[Ee][Xx][Ee].*/))","rule_id":"2fdefcb3-dbda-401e-ae23-f0db027628bc","timestamp_override":"event.ingested","references":["https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\winlogon.exe AND process.executable:*\\\\cmd.exe AND process.command_line:(*sethc.exe* OR *utilman.exe* OR *osk.exe* OR *Magnify.exe* OR *Narrator.exe* OR *DisplaySwitch.exe*))`"}
