{"id":"480e7e51-e797-47e3-8d72-ebfce65b6d8d","created_by":"Nextron Systems","name":"Python Spawning Pretty TTY on Windows","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects python spawning a pretty tty","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*[Pp][Yy][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]3\\.[Ee][Xx][Ee]/ OR /.*[Pp][Yy][Tt][Hh][Oo][Nn]2\\.[Ee][Xx][Ee]/) AND ((process.command_line:/.*[Ii][Mm][Pp][Oo][Rr][Tt]\\ [Pp][Tt][Yy].*/ AND process.command_line:/.*\\.[Ss][Pp][Aa][Ww][Nn]\\(.*/) OR process.command_line:/.*[Ff][Rr][Oo][Mm]\\ [Pp][Tt][Yy]\\ [Ii][Mm][Pp][Oo][Rr][Tt]\\ [Ss][Pp][Aa][Ww][Nn].*/))","rule_id":"480e7e51-e797-47e3-8d72-ebfce65b6d8d","timestamp_override":"event.ingested","references":["https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*python.exe OR *python3.exe OR *python2.exe) AND ((process.command_line:*import\\ pty* AND process.command_line:*.spawn\\(*) OR process.command_line:*from\\ pty\\ import\\ spawn*))`"}
