{"id":"0bbc6369-43e3-453d-9944-cae58821c173","created_by":"Maxime Thiebaut (@0xThiebaut)","name":"Execution via WorkFolders.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects using WorkFolders.exe to execute an arbitrary control.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate usage of the uncommon Windows Work Folders feature."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Ww][Oo][Rr][Kk][Ff][Oo][Ll][Dd][Ee][Rr][Ss]\\.[Ee][Xx][Ee]/) AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/)))","rule_id":"0bbc6369-43e3-453d-9944-cae58821c173","timestamp_override":"event.ingested","references":["https://twitter.com/elliotkillick/status/1449812843772227588"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\control.exe AND process.parent.executable:*\\\\WorkFolders.exe) AND (NOT (process.executable:C\\:\\\\Windows\\\\System32\\\\control.exe)))`"}
