{"id":"646ea171-dded-4578-8a4d-65e9822892e3","created_by":"Florian Roth, Modexp, Nasreddine Bencherchali (update)","name":"Process Dump via Rundll32 and Comsvcs.dll","tags":["attack.defense_evasion","attack.credential_access","attack.t1036","attack.t1003.001","car.2013-05-009"],"interval":"5m","description":"Detects process memory dump via comsvcs.dll and rundll32 using different techniques (ordinal, minidump function...etc)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely, because no one should dump the process memory in that way"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/) AND (process.command_line:/.*[Cc][Oo][Mm][Ss][Vv][Cc][Ss].*/ AND process.command_line:/.*[Ff][Uu][Ll][Ll].*/ AND Commandline:(/.*24\\ .*/ OR /.*#24.*/ OR /.*#\\+24.*/ OR /.*[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp].*/))) OR process.command_line:/.*#\\-4294967272.*/)","rule_id":"646ea171-dded-4578-8a4d-65e9822892e3","timestamp_override":"event.ingested","references":["https://twitter.com/shantanukhande/status/1229348874298388484","https://twitter.com/pythonresponder/status/1385064506049630211?s=21","https://twitter.com/Hexacorn/status/1224848930795552769","https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/","https://twitter.com/SBousseaden/status/1167417096374050817","https://twitter.com/Wietze/status/1542107456507203586"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\rundll32.exe OR process.pe.original_file_name:RUNDLL32.EXE OR process.command_line:*rundll32*) AND (process.command_line:*comsvcs* AND process.command_line:*full* AND Commandline:(*24\\ * OR *#24* OR *#\\+24* OR *MiniDump*))) OR process.command_line:*#\\-4294967272*)`"}
