{"id":"12827a56-61a4-476a-a9cb-f3068f191073","created_by":"Florian Roth","name":"KrbRelayUp Hack Tool","tags":["attack.credential_access","attack.t1558.003","attack.lateral_movement","attack.t1550.003"],"interval":"5m","description":"Detects KrbRelayUp used to perform a universal no-fix local privilege escalation in windows domain environments where LDAP signing is not enforced","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Kk][Rr][Bb][Rr][Ee][Ll][Aa][Yy][Uu][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Kk][Rr][Bb][Rr][Ee][Ll][Aa][Yy][Uu][Pp]\\.[Ee][Xx][Ee]/ OR (process.command_line:/.*\\ [Rr][Ee][Ll][Aa][Yy]\\ .*/ AND process.command_line:/.*\\ \\-[Dd][Oo][Mm][Aa][Ii][Nn]\\ .*/ AND process.command_line:/.*\\ \\-[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr][Nn][Aa][Mm][Ee]\\ .*/) OR (process.command_line:/.*\\ [Kk][Rr][Bb][Ss][Cc][Mm]\\ .*/ AND process.command_line:/.*\\ \\-[Ss][Cc]\\ .*/) OR (process.command_line:/.*\\ [Ss][Pp][Aa][Ww][Nn]\\ .*/ AND process.command_line:/.*\\ \\-[Dd]\\ .*/ AND process.command_line:/.*\\ \\-[Cc][Nn]\\ .*/ AND process.command_line:/.*\\ \\-[Cc][Pp]\\ .*/))","rule_id":"12827a56-61a4-476a-a9cb-f3068f191073","timestamp_override":"event.ingested","references":["https://github.com/Dec0ne/KrbRelayUp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\KrbRelayUp.exe OR process.pe.original_file_name:KrbRelayUp.exe OR (process.command_line:*\\ relay\\ * AND process.command_line:*\\ \\-Domain\\ * AND process.command_line:*\\ \\-ComputerName\\ *) OR (process.command_line:*\\ krbscm\\ * AND process.command_line:*\\ \\-sc\\ *) OR (process.command_line:*\\ spawn\\ * AND process.command_line:*\\ \\-d\\ * AND process.command_line:*\\ \\-cn\\ * AND process.command_line:*\\ \\-cp\\ *))`"}
