{"id":"213d6a77-3d55-4ce8-ba74-fcfef741974e","created_by":"frack113","name":"Discover Private Keys","tags":["attack.credential_access","attack.t1552.004"],"interval":"5m","description":"Adversaries may search for private key certificate files on compromised systems for insecurely stored credential","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Dd][Ii][Rr]\\ .*/ OR /.*[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\ .*/) AND process.command_line:(/.*\\.[Kk][Ee][Yy].*/ OR /.*\\.[Pp][Gg][Pp].*/ OR /.*\\.[Gg][Pp][Gg].*/ OR /.*\\.[Pp][Pp][Kk].*/ OR /.*\\.[Pp]12.*/ OR /.*\\.[Pp][Ee][Mm].*/ OR /.*\\.[Pp][Ff][Xx].*/ OR /.*\\.[Cc][Ee][Rr].*/ OR /.*\\.[Pp]7[Bb].*/ OR /.*\\.[Aa][Ss][Cc].*/))","rule_id":"213d6a77-3d55-4ce8-ba74-fcfef741974e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*dir\\ * OR *findstr\\ *) AND process.command_line:(*.key* OR *.pgp* OR *.gpg* OR *.ppk* OR *.p12* OR *.pem* OR *.pfx* OR *.cer* OR *.p7b* OR *.asc*))`"}
