{"id":"d7bcd677-645d-4691-a8d4-7a5602b780d1","created_by":"Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton (fp)","name":"Suspicious PowerShell Command Line","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the PowerShell command lines with special characters","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely","Amazon SSM Document Worker","Windows Defender ATP"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((((((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*/) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*/)) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*{.*{.*{.*{.*{.*/)) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\^.*\\^.*\\^.*\\^.*\\^.*/)) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*`.*`.*`.*`.*`.*/)) AND (NOT (process.parent.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ss][Ss][Mm]\\\\[Ss][Ss][Mm]\\-[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt]\\-[Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/))) AND (NOT ((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*{.*{.*{.*{.*{.*/ AND process.command_line:(/.*[Nn][Ee][Ww]\\ [Ee][Vv][Ee][Nn][Tt][Ss][Oo][Uu][Rr][Cc][Ee]\\(\\\"[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ss][Ee][Nn][Ss][Ee]\\.[Cc][Ll][Ii][Ee][Nn][Tt]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\\".*/ OR /.*[Pp][Uu][Bb][Ll][Ii][Cc]\\ [Ss][Tt][Aa][Tt][Ii][Cc]\\ [Ee][Xx][Tt][Ee][Rr][Nn]\\ [Bb][Oo][Oo][Ll]\\ [Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Ll][Aa][Mm][Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee][Ii][Nn][Ff][Oo]\\([Ss][Aa][Ff][Ee][Ff][Ii][Ll][Ee][Hh][Aa][Nn][Dd][Ll][Ee]\\ [Hh][Aa][Nn][Dd][Ll][Ee]\\);.*/)))))","rule_id":"d7bcd677-645d-4691-a8d4-7a5602b780d1","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=64"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((((((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*/) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*/)) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*{.*{.*{.*{.*{.*/)) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*\\^.*\\^.*\\^.*\\^.*\\^.*/)) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*`.*`.*`.*`.*`.*/)) AND (NOT (process.parent.executable:C\\:\\\\Program\\ Files\\\\Amazon\\\\SSM\\\\ssm\\-document\\-worker.exe))) AND (NOT ((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/.*{.*{.*{.*{.*{.*/ AND process.command_line:(*new\\ EventSource\\(\\\"Microsoft.Windows.Sense.Client.Management\\\"* OR *public\\ static\\ extern\\ bool\\ InstallELAMCertificateInfo\\(SafeFileHandle\\ handle\\);*)))))`"}
