{"id":"7bdde3bf-2a42-4c39-aa31-a92b3e17afac","created_by":"Christian Burkard","name":"LittleCorporal Generated Maldoc Injection","tags":["attack.execution","attack.t1204.002","attack.t1055.003"],"interval":"5m","description":"Detects the process injection of a LittleCorporal generated Maldoc.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ AND winlog.event_data.CallTrace:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\[Vv]2\\..*/ AND winlog.event_data.CallTrace:/.*[Uu][Nn][Kk][Nn][Oo][Ww][Nn].*/)","rule_id":"7bdde3bf-2a42-4c39-aa31-a92b3e17afac","timestamp_override":"event.ingested","references":["https://github.com/connormcgarr/LittleCorporal"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\winword.exe AND winlog.event_data.CallTrace:*\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.* AND winlog.event_data.CallTrace:*UNKNOWN*)`"}
