{"id":"0e0255bf-2548-47b8-9582-c0955c9283f5","created_by":"frack113","name":"Suspicious Reg Add BitLocker","tags":["attack.impact","attack.t1486"],"interval":"5m","description":"Detects suspicious addition to BitLocker related registry keys via the reg.exe utility","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Rr][Ee][Gg].*/ AND process.command_line:/.*[Aa][Dd][Dd].*/ AND process.command_line:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ff][Vv][Ee].*/ AND process.command_line:/.*\\/[Vv].*/ AND process.command_line:/.*\\/[Ff].*/ AND process.command_line:(/.*[Ee][Nn][Aa][Bb][Ll][Ee][Bb][Dd][Ee][Ww][Ii][Tt][Hh][Nn][Oo][Tt][Pp][Mm].*/ OR /.*[Uu][Ss][Ee][Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd][Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/ OR /.*[Uu][Ss][Ee][Tt][Pp][Mm].*/ OR /.*[Uu][Ss][Ee][Tt][Pp][Mm][Kk][Ee][Yy].*/ OR /.*[Uu][Ss][Ee][Tt][Pp][Mm][Kk][Ee][Yy][Pp][Ii][Nn].*/ OR /.*[Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy][Kk][Ee][Yy][Mm][Ee][Ss][Ss][Aa][Gg][Ee][Ss][Oo][Uu][Rr][Cc][Ee].*/ OR /.*[Uu][Ss][Ee][Tt][Pp][Mm][Pp][Ii][Nn].*/ OR /.*[Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy][Kk][Ee][Yy][Mm][Ee][Ss][Ss][Aa][Gg][Ee].*/))","rule_id":"0e0255bf-2548-47b8-9582-c0955c9283f5","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*REG* AND process.command_line:*ADD* AND process.command_line:*\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE* AND process.command_line:*\\/v* AND process.command_line:*\\/f* AND process.command_line:(*EnableBDEWithNoTPM* OR *UseAdvancedStartup* OR *UseTPM* OR *UseTPMKey* OR *UseTPMKeyPIN* OR *RecoveryKeyMessageSource* OR *UseTPMPIN* OR *RecoveryKeyMessage*))`"}
