{"id":"93199800-b52a-4dec-b762-75212c196542","created_by":"Florian Roth","name":"RunXCmd Tool Execution As System","tags":["attack.execution","attack.t1569.002","attack.s0029"],"interval":"5m","description":"Detects the use of RunXCmd tool for command execution","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use by administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\/[Aa][Cc][Cc][Oo][Uu][Nn][Tt]\\=[Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/ AND process.command_line:/.*\\/[Ee][Xx][Ee][Cc]\\=.*/)","rule_id":"93199800-b52a-4dec-b762-75212c196542","timestamp_override":"event.ingested","references":["https://www.d7xtech.com/free-software/runx/","https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\/account\\=system\\ * AND process.command_line:*\\/exec\\=*)`"}
