{"id":"3a6586ad-127a-4d3b-a677-1e6eacdf8fde","created_by":"Florian Roth, Tim Shelton","name":"Windows Shell Spawning Suspicious Program","tags":["attack.execution","attack.defense_evasion","attack.t1059.005","attack.t1059.001","attack.t1218"],"interval":"5m","description":"Detects a suspicious child process of a Windows shell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative scripts","Microsoft SCCM"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.working_directory:/.*\\\\[Cc][Cc][Mm][Cc][Aa][Cc][Hh][Ee]\\\\.*/) OR (process.parent.command_line:(/.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Ee][Tt][Uu][Pp]\\-[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk]\\.[Pp][Ss]1.*/ OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Ee][Tt]\\-[Ss][Ee][Ll][Ff][Hh][Ee][Aa][Ll][Ii][Nn][Gg]\\.[Pp][Ss]1.*/ OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Cc][Hh][Ee][Cc][Kk]\\-[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Hh][Ee][Aa][Ll][Tt][Hh]\\.[Pp][Ss]1.*/ OR /.*\\\\[Nn][Ee][Ss][Ss][Uu][Ss]_.*/)) OR (process.command_line:/.*\\\\[Nn][Ee][Ss][Ss][Uu][Ss]_.*/))))","rule_id":"3a6586ad-127a-4d3b-a677-1e6eacdf8fde","timestamp_override":"event.ingested","references":["https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\mshta.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\rundll32.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\wmiprvse.exe OR *\\\\regsvr32.exe) AND process.executable:(*\\\\schtasks.exe OR *\\\\nslookup.exe OR *\\\\certutil.exe OR *\\\\bitsadmin.exe OR *\\\\mshta.exe)) AND (NOT ((process.working_directory:*\\\\ccmcache\\\\*) OR (process.parent.command_line:(*\\\\Program\\ Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\setup\\-scheduledtask.ps1* OR *\\\\Program\\ Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\set\\-selfhealing.ps1* OR *\\\\Program\\ Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\check\\-workspacehealth.ps1* OR *\\\\nessus_*)) OR (process.command_line:*\\\\nessus_*))))`"}
