{"id":"9ac94dc8-9042-493c-ba45-3b5e7c86b980","created_by":"frack113, Nasreddine Bencherchali","name":"Disable Important Scheduled Task","tags":["attack.impact","attack.t1489"],"interval":"5m","description":"Detects when adversaries stop services or processes by disabling their respective schdueled tasks in order to conduct data destructive activities","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Hh][Aa][Nn][Gg][Ee].*/ AND process.command_line:/.*\\/[Tt][Nn].*/ AND process.command_line:/.*\\/[Dd][Ii][Ss][Aa][Bb][Ll][Ee].*/ AND process.command_line:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Tt][Oo][Rr][Ee]\\\\[Ss][Rr].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Bb][Ii][Tt][Ll][Oo][Cc][Kk][Ee][Rr].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Bb][Aa][Cc][Kk][Uu][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Uu][Pp][Dd][Aa][Tt][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Oo][Rr][Cc][Hh][Ee][Ss][Tt][Rr][Aa][Tt][Oo][Rr]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Ii][Tt][Gg][Uu][Aa][Rr][Dd].*/))","rule_id":"9ac94dc8-9042-493c-ba45-3b5e7c86b980","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task","https://twitter.com/MichalKoczwara/status/1553634816016498688","https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Change* AND process.command_line:*\\/TN* AND process.command_line:*\\/disable* AND process.command_line:(*\\\\Windows\\\\SystemRestore\\\\SR* OR *\\\\Windows\\\\Windows\\ Defender\\\\* OR *\\\\Windows\\\\BitLocker* OR *\\\\Windows\\\\WindowsBackup\\\\* OR *\\\\Windows\\\\WindowsUpdate\\\\* OR *\\\\Windows\\\\UpdateOrchestrator\\\\* OR *\\\\Windows\\\\ExploitGuard*))`"}
