{"id":"0d5675be-bc88-4172-86d3-1e96a4476536","created_by":"@Kostastsale, @TheDFIRReport, slightly modified by pH-T","name":"Enabling RDP Service via Reg.exe","tags":["attack.defense_evasion","attack.lateral_movement","attack.t1021.001","attack.t1112"],"interval":"5m","description":"Detects the execution of reg.exe and subsequent command line arguments for enabling RDP service on the host by tampering with the 'CurrentControlSet\\Control\\Terminal Server' subkeys","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ [Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr].*/ AND process.command_line:/.*[Rr][Ee][Gg]_[Dd][Ww][Oo][Rr][Dd].*/ AND process.command_line:/.*\\ \\/[Ff].*/) AND ((process.command_line:/.*[Ll][Ii][Cc][Ee][Nn][Ss][Ii][Nn][Gg]\\ [Cc][Oo][Rr][Ee].*/ AND process.command_line:/.*[Ee][Nn][Aa][Bb][Ll][Ee][Cc][Oo][Nn][Cc][Uu][Rr][Rr][Ee][Nn][Tt][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss].*/) OR process.command_line:(/.*[Ww][Ii][Nn][Ss][Tt][Aa][Tt][Ii][Oo][Nn][Ss]\\\\[Rr][Dd][Pp]\\-[Tt][Cc][Pp].*/ OR /.*[Mm][Aa][Xx][Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee][Cc][Oo][Uu][Nn][Tt].*/ OR /.*[Ff][Ee][Nn][Aa][Bb][Ll][Ee][Ww][Ii][Nn][Ss][Tt][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Ss][Uu][Ss][Ee][Rr][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*[Tt][Ss][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*[Tt][Ss][Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt].*/ OR /.*[Ii][Dd][Ll][Ee][Ww][Ii][Nn][Ss][Tt][Aa][Tt][Ii][Oo][Nn][Pp][Oo][Oo][Ll][Cc][Oo][Uu][Nn][Tt].*/ OR /.*[Tt][Ss][Aa][Dd][Vv][Ee][Rr][Tt][Ii][Ss][Ee].*/ OR /.*[Aa][Ll][Ll][Oo][Ww][Tt][Ss][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Ss].*/ OR /.*[Ff][Ss][Ii][Nn][Gg][Ll][Ee][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Pp][Ee][Rr][Uu][Ss][Ee][Rr].*/ OR /.*[Ff][Dd][Ee][Nn][Yy][Tt][Ss][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Ss].*/)))","rule_id":"0d5675be-bc88-4172-86d3-1e96a4476536","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\reg.exe AND process.command_line:*\\ add\\ * AND process.command_line:*\\\\CurrentControlSet\\\\Control\\\\Terminal\\ Server* AND process.command_line:*REG_DWORD* AND process.command_line:*\\ \\/f*) AND ((process.command_line:*Licensing\\ Core* AND process.command_line:*EnableConcurrentSessions*) OR process.command_line:(*WinStations\\\\RDP\\-Tcp* OR *MaxInstanceCount* OR *fEnableWinStation* OR *TSUserEnabled* OR *TSEnabled* OR *TSAppCompat* OR *IdleWinStationPoolCount* OR *TSAdvertise* OR *AllowTSConnections* OR *fSingleSessionPerUser* OR *fDenyTSConnections*)))`"}
