{"id":"01d2e2a1-5f09-44f7-9fc1-24faa7479b6d","created_by":"Florian Roth","name":"Suspicious Svchost Process","tags":["attack.defense_evasion","attack.t1036.005"],"interval":"5m","description":"Detects a suspicious svchost process start","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND (NOT ((process.parent.executable:(/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Pp][Cc][Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ee][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (NOT _exists_:process.parent.executable) OR (process.parent.executable:\"\") OR (process.parent.executable:\\-))))","rule_id":"01d2e2a1-5f09-44f7-9fc1-24faa7479b6d","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\svchost.exe AND (NOT ((process.parent.executable:(*\\\\services.exe OR *\\\\MsMpEng.exe OR *\\\\Mrt.exe OR *\\\\rpcnet.exe OR *\\\\ngen.exe OR *\\\\TiWorker.exe)) OR (NOT _exists_:process.parent.executable) OR (process.parent.executable:\"\") OR (process.parent.executable:\\-))))`"}
