{"id":"27ba3207-dd30-4812-abbf-5d20c57d474e","created_by":"Aedan Russell, frack113 (sigma)","name":"Powershell ChromeLoader Browser Hijacker","tags":["attack.persistence","attack.t1176"],"interval":"5m","description":"Detects PowerShell process spawning a 'chrome.exe' process with the 'load-extension' flag to start a new chrome instance with custom extensions, as seen being used in 'ChromeLoader'","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\-\\-[Ll][Oo][Aa][Dd]\\-[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn]\\=.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/)","rule_id":"27ba3207-dd30-4812-abbf-5d20c57d474e","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/chromeloader/","https://emkc.org/s/RJjuLa"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\chrome.exe AND process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*\\-\\-load\\-extension\\=* AND process.command_line:*\\\\AppData\\\\Local\\\\*)`"}
