{"id":"91a2c315-9ee6-4052-a853-6f6a8238f90d","created_by":"frack113","name":"Findstr GPP Passwords","tags":["attack.credential_access","attack.t1552.006"],"interval":"5m","description":"Look for the encrypted cpassword value within Group Policy Preference files on the Domain Controller. This value can be decrypted with gpp-decrypt.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ AND process.command_line:/.*\\\\[Ss][Yy][Ss][Vv][Oo][Ll]\\\\.*/ AND process.command_line:/.*\\.[Xx][Mm][Ll].*/)","rule_id":"91a2c315-9ee6-4052-a853-6f6a8238f90d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\findstr.exe AND process.command_line:*cpassword* AND process.command_line:*\\\\sysvol\\\\* AND process.command_line:*.xml*)`"}
