{"id":"f1f3bf22-deb2-418d-8cce-e1a45e46a5bd","created_by":"@2xxeformyshirt (Security Risk Advisors) - rule; Teymur Kheirkhabarov (idea)","name":"MMC20 Lateral Movement","tags":["attack.execution","attack.t1021.003"],"interval":"5m","description":"Detects MMC20.Application Lateral Movement; specifically looks for the spawning of the parent MMC.exe with a command line of \"-Embedding\" as a child of svchost.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg].*/)","rule_id":"f1f3bf22-deb2-418d-8cce-e1a45e46a5bd","timestamp_override":"event.ingested","references":["https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/","https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view?usp=sharing"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\svchost.exe AND process.executable:*\\\\mmc.exe AND process.command_line:*\\-Embedding*)`"}
