{"id":"2c28c248-7f50-417a-9186-a85b223010ee","created_by":"Nasreddine Bencherchali","name":"Wscript Shell Run In CommandLine","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects the presence of the keywords \"Wscript\", \"Shell\" and \"Run\" in the command, which could indicate a suspicious activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare legitimate inline scripting by some administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\..*/ AND process.command_line:/.*\\.[Ss][Hh][Ee][Ll][Ll].*/ AND process.command_line:/.*\\.[Rr][Uu][Nn].*/)","rule_id":"2c28c248-7f50-417a-9186-a85b223010ee","timestamp_override":"event.ingested","references":["http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*Wscript.* AND process.command_line:*.Shell* AND process.command_line:*.Run*)`"}
