{"id":"07f8bdc2-c9b3-472a-9817-5a670b872f53","created_by":"jmallette, Florian Roth, Nasreddine Bencherchali (update)","name":"Cmdkey Cached Credentials Recon","tags":["attack.credential_access","attack.t1003.005"],"interval":"5m","description":"Detects usage of cmdkey to look for cached credentials","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Mm][Dd][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Mm][Dd][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\/[Ll].*/ OR /.*\\ \\-[Ll].*/))","rule_id":"07f8bdc2-c9b3-472a-9817-5a670b872f53","timestamp_override":"event.ingested","references":["https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation","https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\cmdkey.exe OR process.pe.original_file_name:cmdkey.exe) AND process.command_line:(*\\ \\/l* OR *\\ \\-l*))`"}
