{"id":"e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d","created_by":"frack113","name":"Compress Data and Lock With Password for Exfiltration With WINZIP","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Ww][Ii][Nn][Zz][Ii][Pp]\\.[Ee][Xx][Ee].*/ OR /.*[Ww][Ii][Nn][Zz][Ii][Pp]64\\.[Ee][Xx][Ee].*/) AND process.command_line:/.*\\-[Ss]\\\".*/ AND process.command_line:(/.*\\ \\-[Mm][Ii][Nn]\\ .*/ OR /.*\\ \\-[Aa]\\ .*/))","rule_id":"e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*winzip.exe* OR *winzip64.exe*) AND process.command_line:*\\-s\\\"* AND process.command_line:(*\\ \\-min\\ * OR *\\ \\-a\\ *))`"}
