{"id":"7eedcc9d-9fdb-4d94-9c54-474e8affc0c7","created_by":"Timur Zinniatullin, oscd.community","name":"Invoke-Obfuscation COMPRESS OBFUSCATION","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via COMPRESS OBFUSCATION","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.command_line:/.*[Tt][Ee][Xx][Tt]\\.[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg]\\]\\:\\:[Aa][Ss][Cc][Ii][Ii].*/ AND process.command_line:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn]\\.[Dd][Ee][Ff][Ll][Aa][Tt][Ee][Ss][Tt][Rr][Ee][Aa][Mm].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Ss][Tt][Rr][Ee][Aa][Mm][Rr][Ee][Aa][Dd][Ee][Rr].*/) AND process.command_line:/.*[Rr][Ee][Aa][Dd][Tt][Oo][Ee][Nn][Dd]/)","rule_id":"7eedcc9d-9fdb-4d94-9c54-474e8affc0c7","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*new\\-object* AND process.command_line:*text.encoding\\]\\:\\:ascii* AND process.command_line:(*system.io.compression.deflatestream* OR *system.io.streamreader*) AND process.command_line:*readtoend)`"}
