{"id":"03e2746e-2b31-42f1-ab7a-eb39365b2422","created_by":"Florian Roth","name":"Judgement Panda Exfil Activity","tags":["attack.lateral_movement","attack.g0010","attack.credential_access","attack.t1003.001","attack.exfiltration","attack.t1560.001"],"interval":"5m","description":"Detects Judgement Panda activity as described in Global Threat Report 2019 by Crowdstrike","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee][Pp][Rr][Oo][Dd]\\.[Ll][Dd][Ff]/ OR process.command_line:(/.*\\\\[Ll][Dd][Ii][Ff][Dd][Ee]\\.[Ee][Xx][Ee]\\ \\-[Ff]\\ \\-[Nn]\\ .*/ OR /.*\\\\7[Zz][Aa]\\.[Ee][Xx][Ee]\\ [Aa]\\ 1\\.7[Zz]\\ .*/ OR /.*\\\\[Aa][Aa][Aa][Aa]\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Aa][Aa][Aa][Aa]\\\\[Nn][Ee][Tt][Ss][Ee][Ss][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Aa][Aa][Aa][Aa]\\\\7[Zz][Aa]\\.[Ee][Xx][Ee].*/ OR /.*[Cc][Oo][Pp][Yy]\\ \\.\\\\1\\.7[Zz]\\ \\\\.*/ OR /.*[Cc][Oo][Pp][Yy]\\ \\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Cc]$\\\\[Aa][Aa][Aa][Aa]\\\\.*/) OR process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\7[Zz][Aa]\\.[Ee][Xx][Ee]/)","rule_id":"03e2746e-2b31-42f1-ab7a-eb39365b2422","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*eprod.ldf OR process.command_line:(*\\\\ldifde.exe\\ \\-f\\ \\-n\\ * OR *\\\\7za.exe\\ a\\ 1.7z\\ * OR *\\\\aaaa\\\\procdump64.exe* OR *\\\\aaaa\\\\netsess.exe* OR *\\\\aaaa\\\\7za.exe* OR *copy\\ .\\\\1.7z\\ \\\\* OR *copy\\ \\\\client\\\\c$\\\\aaaa\\\\*) OR process.executable:C\\:\\\\Users\\\\Public\\\\7za.exe)`"}
