{"id":"f5240972-3938-4e56-8e4b-e33893176c1f","created_by":"frack113","name":"Suspicious Query of MachineGUID","tags":["attack.discovery","attack.t1082"],"interval":"5m","description":"Use of reg to get MachineGuid information","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy].*/ AND process.command_line:/.*\\/[Vv]\\ .*/ AND process.command_line:/.*[Mm][Aa][Cc][Hh][Ii][Nn][Ee][Gg][Uu][Ii][Dd].*/)","rule_id":"f5240972-3938-4e56-8e4b-e33893176c1f","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-8---windows-machineguid-discovery"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:*SOFTWARE\\\\Microsoft\\\\Cryptography* AND process.command_line:*\\/v\\ * AND process.command_line:*MachineGuid*)`"}
