{"id":"7ec2c172-dceb-4c10-92c9-87c1881b7e18","created_by":"Florian Roth","name":"Rubeus Hack Tool","tags":["attack.credential_access","attack.t1003","attack.t1558.003","attack.lateral_movement","attack.t1550.003"],"interval":"5m","description":"Detects the execution of the hacktool Rubeus via PE information of command line parameters","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Uu][Bb][Ee][Uu][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Uu][Bb][Ee][Uu][Ss]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*\\ [Aa][Ss][Rr][Ee][Pp][Rr][Oo][Aa][Ss][Tt]\\ .*/ OR /.*\\ [Dd][Uu][Mm][Pp]\\ \\/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\:[Kk][Rr][Bb][Tt][Gg][Tt]\\ .*/ OR /.*\\ [Kk][Ee][Rr][Bb][Ee][Rr][Oo][Aa][Ss][Tt]\\ .*/ OR /.*\\ [Cc][Rr][Ee][Aa][Tt][Ee][Nn][Ee][Tt][Oo][Nn][Ll][Yy]\\ \\/[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\:.*/ OR /.*\\ [Pp][Tt][Tt]\\ \\/[Tt][Ii][Cc][Kk][Ee][Tt]\\:.*/ OR /.*\\ \\/[Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ee][Uu][Ss][Ee][Rr]\\:.*/ OR /.*\\ [Rr][Ee][Nn][Ee][Ww]\\ \\/[Tt][Ii][Cc][Kk][Ee][Tt]\\:.*/ OR /.*\\ [Aa][Ss][Kk][Tt][Gg][Tt]\\ \\/[Uu][Ss][Ee][Rr]\\:.*/ OR /.*\\ [Hh][Aa][Rr][Vv][Ee][Ss][Tt]\\ \\/[Ii][Nn][Tt][Ee][Rr][Vv][Aa][Ll]\\:.*/ OR /.*\\ [Ss]4[Uu]\\ \\/[Uu][Ss][Ee][Rr]\\:.*/ OR /.*\\ [Ss]4[Uu]\\ \\/[Tt][Ii][Cc][Kk][Ee][Tt]\\:.*/ OR /.*\\ [Hh][Aa][Ss][Hh]\\ \\/[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]\\:.*/))","rule_id":"7ec2c172-dceb-4c10-92c9-87c1881b7e18","timestamp_override":"event.ingested","references":["https://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/","https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\Rubeus.exe OR process.pe.original_file_name:Rubeus.exe OR process.command_line:(*\\ asreproast\\ * OR *\\ dump\\ \\/service\\:krbtgt\\ * OR *\\ kerberoast\\ * OR *\\ createnetonly\\ \\/program\\:* OR *\\ ptt\\ \\/ticket\\:* OR *\\ \\/impersonateuser\\:* OR *\\ renew\\ \\/ticket\\:* OR *\\ asktgt\\ \\/user\\:* OR *\\ harvest\\ \\/interval\\:* OR *\\ s4u\\ \\/user\\:* OR *\\ s4u\\ \\/ticket\\:* OR *\\ hash\\ \\/password\\:*))`"}
