{"id":"24c4d154-05a4-4b99-b57d-9b977472443a","created_by":"Florian Roth","name":"Lazarus Activity","tags":["attack.g0032","attack.execution","attack.t1059"],"interval":"5m","description":"Detects different process creation events as described in various threat reports on Lazarus group activity","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Overlap with legitimate process activity in some cases (especially selection 3 and 4)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Rr][Ee][Gg]\\.[Ee][Xx][Ee]\\ [Ss][Aa][Vv][Ee]\\ [Hh][Kk][Ll][Mm]\\\\[Ss][Aa][Mm]\\ %[Tt][Ee][Mm][Pp]%\\\\\\~[Rr][Ee][Gg]_[Ss][Aa][Mm]\\.[Ss][Aa][Vv][Ee].*/ OR /.*1[Qq]2[Ww]3[Ee]4[Rr]\\@#$\\@#$\\@#$.*/ OR /.*\\ \\-[Hh][Pp]1[Qq]2[Ww]3[Ee]4\\ .*/ OR /.*\\.[Dd][Aa][Tt]\\ [Dd][Aa][Tt][Aa]03\\ 10000\\ \\-[Pp]\\ .*/) OR (process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Cc][Aa][Ll][Ll]\\ [Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:/.*\\ \\>\\ %[Tt][Ee][Mm][Pp]%\\\\\\~.*/) OR (process.command_line:/.*[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\ \\-[Aa][Oo][Nn]\\ |\\ [Ff][Ii][Nn][Dd]\\ .*/ AND process.command_line:/.*\\ \\>\\ %[Tt][Ee][Mm][Pp]%\\\\\\~.*/) OR process.command_line:/.*\\.255\\ 10\\ [Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/)","rule_id":"24c4d154-05a4-4b99-b57d-9b977472443a","timestamp_override":"event.ingested","references":["https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/","https://www.hvs-consulting.de/lazarus-report/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*reg.exe\\ save\\ hklm\\\\sam\\ %temp%\\\\\\~reg_sam.save* OR *1q2w3e4r@#$@#$@#$* OR *\\ \\-hp1q2w3e4\\ * OR *.dat\\ data03\\ 10000\\ \\-p\\ *) OR (process.command_line:*process\\ call\\ create* AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR (process.command_line:*netstat\\ \\-aon\\ |\\ find\\ * AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR process.command_line:*.255\\ 10\\ C\\:\\\\ProgramData\\\\*)`"}
