{"id":"51ae86a2-e2e1-4097-ad85-c46cb6851de4","created_by":"FLorian Roth","name":"Renamed PsExec Service Execution","tags":["attack.execution"],"interval":"5m","description":"Detects suspicious launch of a renamed version of the PSEXESVC service with, which is not often used by legitimate administrators","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/)))","rule_id":"51ae86a2-e2e1-4097-ad85-c46cb6851de4","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec","https://www.youtube.com/watch?v=ro2QuZTIMBM"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:psexesvc.exe AND (NOT (process.executable:C\\:\\\\Windows\\\\PSEXESVC.exe)))`"}
