{"id":"a537cfc3-4297-4789-92b5-345bfd845ad0","created_by":"Andreas Hunkeler (@Karneades)","name":"Abuse of Service Permissions to Hide Services in Tools","tags":["attack.persistence","attack.defense_evasion","attack.privilege_escalation","attack.t1574.011"],"interval":"5m","description":"Detection of sc.exe utility adding a new service with special permission which hides that service.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Rare intended use of hidden services"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ss][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*[Ss][Dd][Ss][Ee][Tt].*/ AND process.command_line:/.*[Dd][Cc][Ll][Cc][Ww][Pp][Dd][Tt][Ss][Dd].*/))","rule_id":"a537cfc3-4297-4789-92b5-345bfd845ad0","timestamp_override":"event.ingested","references":["https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html","https://www.sans.org/blog/red-team-tactics-hiding-windows-services/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sc.exe OR process.pe.original_file_name:sc.exe) AND (process.command_line:*sdset* AND process.command_line:*DCLCWPDTSD*))`"}
