{"id":"cd8c163e-a19b-402e-bdd5-419ff5859f12","created_by":"Florian Roth","name":"ADCSPwn Hack Tool","tags":["attack.credential_access","attack.t1557.001"],"interval":"5m","description":"Detects command line parameters used by ADCSPwn, a tool to escalate privileges in an active directory network by coercing authenticate from machine accounts and relaying to the certificate service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ \\-\\-[Aa][Dd][Cc][Ss]\\ .*/ AND process.command_line:/.*\\ \\-\\-[Pp][Oo][Rr][Tt]\\ .*/)","rule_id":"cd8c163e-a19b-402e-bdd5-419ff5859f12","timestamp_override":"event.ingested","references":["https://github.com/bats3c/ADCSPwn"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ \\-\\-adcs\\ * AND process.command_line:*\\ \\-\\-port\\ *)`"}
