{"id":"2617e7ed-adb7-40ba-b0f3-8f9945fe6c09","created_by":"Florian Roth (rule), David ANDRE (additional keywords)","name":"Suspicious SYSTEM User Process Creation","tags":null,"interval":"5m","description":"Detects a suspicious process creation as SYSTEM user (suspicious program or command line parameter)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative activity","Scripts and administrative tools used in the monitored environment","Monitoring activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((winlog.event_data.IntegrityLevel:/[Ss][Yy][Ss][Tt][Ee][Mm]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)) AND (process.executable:(/.*\\\\[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/) OR process.command_line:(/.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Uu][Rr][Ll][Cc][Aa][Cc][Hh][Ee]\\ .*/ OR /.*\\ \\-[Uu][Rr][Ll][Cc][Aa][Cc][Hh][Ee]\\ .*/ OR /.*\\ \\-[Ee].*\\ [Jj][Aa][Bb].*/ OR /.*\\ \\-[Ee].*\\ [Ss][Uu][Vv][Yy][Ii].*/ OR /.*\\ \\-[Ee].*\\ [Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa].*/ OR /.*\\ \\-[Ee].*\\ [Aa][Ww][Vv]4[Ii].*/ OR /.*\\ \\-[Ee].*\\ [Ii][Aa][Bb].*/ OR /.*\\ \\-[Ee].*\\ [Pp][Aa][Aa].*/ OR /.*\\ \\-[Ee].*\\ [Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa].*/ OR /.*[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\ [Dd][Ee][Ll][Ee][Tt][Ee]\\ [Ss][Hh][Aa][Dd][Oo][Ww][Ss].*/ OR /.*[Rr][Ee][Gg]\\ [Ss][Aa][Vv][Ee]\\ [Hh][Kk][Ll][Mm].*/ OR /.*\\ \\-[Mm][Aa]\\ .*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\ \\/[Tt][Ii][Cc][Kk][Ee][Tt]\\:.*/ OR /.*[Dd][Pp][Aa][Pp][Ii]\\:\\:.*/ OR /.*[Ee][Vv][Ee][Nn][Tt]\\:\\:[Cc][Ll][Ee][Aa][Rr].*/ OR /.*[Ee][Vv][Ee][Nn][Tt]\\:\\:[Dd][Rr][Oo][Pp].*/ OR /.*[Ii][Dd]\\:\\:[Mm][Oo][Dd][Ii][Ff][Yy].*/ OR /.*[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Ss]\\:\\:.*/ OR /.*[Ll][Ss][Aa][Dd][Uu][Mm][Pp]\\:\\:.*/ OR /.*[Mm][Ii][Ss][Cc]\\:\\:.*/ OR /.*[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee]\\:\\:.*/ OR /.*[Rr][Pp][Cc]\\:\\:.*/ OR /.*[Ss][Ee][Kk][Uu][Rr][Ll][Ss][Aa]\\:\\:.*/ OR /.*[Ss][Ii][Dd]\\:\\:.*/ OR /.*[Tt][Oo][Kk][Ee][Nn]\\:\\:.*/ OR /.*[Vv][Aa][Uu][Ll][Tt]\\:\\:[Cc][Rr][Ee][Dd].*/ OR /.*[Vv][Aa][Uu][Ll][Tt]\\:\\:[Ll][Ii][Ss][Tt].*/ OR /.*\\ [Pp]\\:\\:[Dd]\\ .*/ OR /.*;[Ii][Ee][Xx]\\(.*/ OR /.*[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp].*/ OR /.*[Nn][Ee][Tt]\\ [Uu][Ss][Ee][Rr]\\ .*/))) AND (NOT ((process.command_line:/[Pp][Ii][Nn][Gg]\\ 127\\.0\\.0\\.1\\ \\-[Nn]\\ 5/) OR (process.executable:/.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*\\\\[Dd][Ii][Ss][Mm][Ff][Oo][Dd][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\.[Cc][Mm][Dd].*/))))","rule_id":"2617e7ed-adb7-40ba-b0f3-8f9945fe6c09","timestamp_override":"event.ingested","references":["Internal Research","https://tools.thehacker.recipes/mimikatz/modules"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((winlog.event_data.IntegrityLevel:System AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)) AND (process.executable:(*\\\\calc.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\hh.exe OR *\\\\mshta.exe OR *\\\\forfiles.exe OR *\\\\ping.exe) OR process.command_line:(*\\ \\-NoP\\ * OR *\\ \\-W\\ Hidden\\ * OR *\\ \\-decode\\ * OR *\\ \\/decode\\ * OR *\\ \\/urlcache\\ * OR *\\ \\-urlcache\\ * OR *\\ \\-e*\\ JAB* OR *\\ \\-e*\\ SUVYI* OR *\\ \\-e*\\ SQBFAFgA* OR *\\ \\-e*\\ aWV4I* OR *\\ \\-e*\\ IAB* OR *\\ \\-e*\\ PAA* OR *\\ \\-e*\\ aQBlAHgA* OR *vssadmin\\ delete\\ shadows* OR *reg\\ SAVE\\ HKLM* OR *\\ \\-ma\\ * OR *Microsoft\\\\Windows\\\\CurrentVersion\\\\Run* OR *.downloadstring\\(* OR *.downloadfile\\(* OR *\\ \\/ticket\\:* OR *dpapi\\:\\:* OR *event\\:\\:clear* OR *event\\:\\:drop* OR *id\\:\\:modify* OR *kerberos\\:\\:* OR *lsadump\\:\\:* OR *misc\\:\\:* OR *privilege\\:\\:* OR *rpc\\:\\:* OR *sekurlsa\\:\\:* OR *sid\\:\\:* OR *token\\:\\:* OR *vault\\:\\:cred* OR *vault\\:\\:list* OR *\\ p\\:\\:d\\ * OR *;iex\\(* OR *MiniDump* OR *net\\ user\\ *))) AND (NOT ((process.command_line:ping\\ 127.0.0.1\\ \\-n\\ 5) OR (process.executable:*\\\\PING.EXE AND process.parent.command_line:*\\\\DismFoDInstall.cmd*))))`"}
