{"id":"b57ba453-b384-4ab9-9f40-1038086b4e53","created_by":"frack113","name":"VeeamBackup Database Credentials Dump","tags":["attack.collection","attack.t1005"],"interval":"5m","description":"Detects dump of credentials in VeeamBackup dbo","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Qq][Ll][Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ss][Ee][Ll][Ee][Cc][Tt].*/ AND process.command_line:/.*[Tt][Oo][Pp].*/ AND process.command_line:/.*\\[[Vv][Ee][Ee][Aa][Mm][Bb][Aa][Cc][Kk][Uu][Pp]\\]\\.\\[[Dd][Bb][Oo]\\]\\.\\[[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll][Ss]\\].*/)","rule_id":"b57ba453-b384-4ab9-9f40-1038086b4e53","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/12/13/diavol-ransomware/","https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\sqlcmd.exe AND process.command_line:*SELECT* AND process.command_line:*TOP* AND process.command_line:*\\[VeeamBackup\\].\\[dbo\\].\\[Credentials\\]*)`"}
