{"id":"83865853-59aa-449e-9600-74b9d89a6d6e","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Audio Capture via SoundRecorder","tags":["attack.collection","attack.t1123"],"interval":"5m","description":"Detect attacker collecting audio via SoundRecorder application.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate audio capture by legitimate user."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Oo][Uu][Nn][Dd][Rr][Ee][Cc][Oo][Rr][Dd][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Ff][Ii][Ll][Ee].*/)","rule_id":"83865853-59aa-449e-9600-74b9d89a6d6e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1123/T1123.md","https://eqllib.readthedocs.io/en/latest/analytics/f72a98cb-7b3d-4100-99c3-a138b6e9ff6e.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SoundRecorder.exe AND process.command_line:*\\/FILE*)`"}
