{"id":"b53317a0-8acf-4fd1-8de8-a5401e776b96","created_by":"frac113","name":"WMI Uninstall An Application","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Uninstall an application with wmic","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Cc][Aa][Ll][Ll]\\ [Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/)","rule_id":"b53317a0-8acf-4fd1-8de8-a5401e776b96","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md#atomic-test-10---application-uninstall-using-wmic"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\WMIC.exe OR process.pe.original_file_name:wmic.exe) AND process.command_line:*call\\ uninstall*)`"}
