{"id":"95eadcb2-92e4-4ed1-9031-92547773a6db","created_by":"Florian Roth","name":"Suspicious PowerShell Invocation Based on Parent Process","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects suspicious powershell invocations from interpreters or unusual programs","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Microsoft Operations Manager (MOM)","Other scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/)) AND (NOT (process.working_directory:/.*\\\\[Hh][Ee][Aa][Ll][Tt][Hh]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Ss][Tt][Aa][Tt][Ee]\\\\.*/)))","rule_id":"95eadcb2-92e4-4ed1-9031-92547773a6db","timestamp_override":"event.ingested","references":["https://www.carbonblack.com/2017/03/15/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\wscript.exe OR *\\\\cscript.exe) AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe)) AND (NOT (process.working_directory:*\\\\Health\\ Service\\ State\\\\*)))`"}
