{"id":"26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160","created_by":"frack113","name":"Suspicious Execution of Adidnsdump","tags":["attack.discovery","attack.t1018"],"interval":"5m","description":"This tool enables enumeration and exporting of all DNS records in the zone for recon purposes of internal networks Python 3 and python.exe must be installed,\nUsee to Query/modify DNS records for Active Directory integrated DNS via LDAP\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Yy][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Ii][Dd][Nn][Ss][Dd][Uu][Mm][Pp].*/)","rule_id":"26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md#atomic-test-9---remote-system-discovery---adidnsdump"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\python.exe AND process.command_line:*adidnsdump*)`"}
