{"id":"b697e69c-746f-4a86-9f59-7bfff8eab881","created_by":"Christian Burkard","name":"UAC Bypass Using Disk Cleanup","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using scheduled tasks and variable expansion of cleanmgr.exe (UACMe 34)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\"\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ll][Ee][Aa][Nn][Mm][Gg][Rr]\\.[Ee][Xx][Ee]\\ \\/[Aa][Uu][Tt][Oo][Cc][Ll][Ee][Aa][Nn]\\ \\/[Dd]\\ [Cc]\\:/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ \\-[Kk]\\ [Nn][Ee][Tt][Ss][Vv][Cc][Ss]\\ \\-[Pp]\\ \\-[Ss]\\ [Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/))","rule_id":"b697e69c-746f-4a86-9f59-7bfff8eab881","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\"\\\\system32\\\\cleanmgr.exe\\ \\/autoclean\\ \\/d\\ C\\: AND process.parent.command_line:C\\:\\\\Windows\\\\system32\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ Schedule AND winlog.event_data.IntegrityLevel:(High OR System))`"}
