{"id":"30edb182-aa75-42c0-b0a9-e998bb29067c","created_by":"Markus Neis","name":"Powershell AMSI Bypass via .NET Reflection","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects Request to amsiInitFailed that can be used to disable AMSI Scanning","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Aa][Mm][Ss][Ii][Uu][Tt][Ii][Ll][Ss].*/ OR /.*[Aa][Mm][Ss][Ii][Ii][Nn][Ii][Tt][Ff][Aa][Ii][Ll][Ee][Dd].*/)","rule_id":"30edb182-aa75-42c0-b0a9-e998bb29067c","timestamp_override":"event.ingested","references":["https://twitter.com/mattifestation/status/735261176745988096","https://www.hybrid-analysis.com/sample/0ced17419e01663a0cd836c9c2eb925e3031ffb5b18ccf35f4dea5d586d0203e?environmentId=120"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*System.Management.Automation.AmsiUtils* OR *amsiInitFailed*)`"}
