{"id":"baef1ec6-2ca9-47a3-97cc-4cf2bda10b77","created_by":"Nasreddine Bencherchali","name":"New Network Provider - CommandLine","tags":["attack.credential_access","attack.t1003"],"interval":"5m","description":"Detects when an attacker tries to add a new network provider in order to dump clear text credentials, similar to how the NPPSpy tool does it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other legitimate network providers used and not filtred in this rule"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/) AND (NOT (process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ll][Aa][Nn][Mm][Aa][Nn][Ww][Oo][Rr][Kk][Ss][Tt][Aa][Tt][Ii][Oo][Nn]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Rr][Dd][Pp][Nn][Pp]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/))))","rule_id":"baef1ec6-2ca9-47a3-97cc-4cf2bda10b77","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/troubleshoot/windows-client/deployment/network-provider-settings-removed-in-place-upgrade","https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND process.command_line:*\\\\NetworkProvider*) AND (NOT (process.command_line:(*\\\\System\\\\CurrentControlSet\\\\Services\\\\WebClient\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\LanmanWorkstation\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\RDPNP\\\\NetworkProvider*))))`"}
