{"id":"fff9d2b7-e11c-4a69-93d3-40ef66189767","created_by":"Florian Roth, Markus Neis, Tim Shelton (HAWK.IO), Nasreddine Bencherchali (update)","name":"Suspicious Copy From or To System32","tags":["attack.defense_evasion","attack.t1036.003"],"interval":"5m","description":"Detects a suspicious copy operation that tries to copy a program from a system (System32 or SysWOW64) directory to another on disk.\nOften used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Depend on scripts and administrative tools used in the monitored environment (For example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)","When cmd.exe and xcopy.exe are called directly","When the command contains the keywords but not in the correct order"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc][Oo][Pp][Yy]\\ .*/) OR (process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Cc][Oo][Pp][Yy]\\-[Ii][Tt][Ee][Mm].*/ OR /.*\\ [Cc][Oo][Pp][Yy]\\ .*/ OR /.*[Cc][Pp][Ii]\\ .*/ OR /.*\\ [Cc][Pp]\\ .*/)) OR process.executable:(/.*\\\\[Rr][Oo][Bb][Oo][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Xx][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32.*/ OR /.*\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64.*/))","rule_id":"fff9d2b7-e11c-4a69-93d3-40ef66189767","timestamp_override":"event.ingested","references":["https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120","https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\cmd.exe AND process.command_line:*copy\\ *) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*copy\\-item* OR *\\ copy\\ * OR *cpi\\ * OR *\\ cp\\ *)) OR process.executable:(*\\\\robocopy.exe OR *\\\\xcopy.exe)) AND process.command_line:(*\\\\System32* OR *\\\\SysWOW64*))`"}
