{"id":"9e2e51c5-c699-4794-ba5a-29f5da40ac0c","created_by":"Florian Roth","name":"Turla Group Commands May 2020","tags":["attack.g0010","attack.execution","attack.t1059.001","attack.t1053.005","attack.t1027"],"interval":"5m","description":"Detects commands used by Turla group as reported by ESET in May 2020","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Tt][Rr][Aa][Cc][Ee][Rr][Tt]\\ \\-[Hh]\\ 10\\ [Yy][Aa][Hh][Oo][Oo]\\.[Cc][Oo][Mm].*/ OR /.*\\.[Ww][Ss][Qq][Mm][Cc][Oo][Nn][Ss]\\)\\)|[Ii][Ee][Xx];.*/ OR /.*[Ff][Rr]`[Oo][Mm][Bb][Aa]`[Ss][Ee]6`4[Ss][Tt][Rr]`[Ii][Nn][Gg].*/) OR (process.command_line:/.*[Nn][Ee][Tt]\\ [Uu][Ss][Ee]\\ [Hh][Tt][Tt][Pp][Ss]\\:\\/\\/[Dd][Oo][Cc][Ss]\\.[Ll][Ii][Vv][Ee]\\.[Nn][Ee][Tt].*/ AND process.command_line:/.*\\@[Aa][Oo][Ll]\\.[Cc][Oo]\\.[Uu][Kk].*/))","rule_id":"9e2e51c5-c699-4794-ba5a-29f5da40ac0c","timestamp_override":"event.ingested","references":["https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*tracert\\ \\-h\\ 10\\ yahoo.com* OR *.WSqmCons\\)\\)|iex;* OR *Fr`omBa`se6`4Str`ing*) OR (process.command_line:*net\\ use\\ https\\:\\/\\/docs.live.net* AND process.command_line:*@aol.co.uk*))`"}
