{"id":"eee00933-a761-4cd0-be70-c42fe91731e7","created_by":"Victor Sergeev, oscd.community","name":"GfxDownloadWrapper.exe Downloads File from Suspicious URL","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects when GfxDownloadWrapper.exe downloads file from non standard URL","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Gg][Ff][Xx][Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ww][Rr][Aa][Pp][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:/.*[Gg][Aa][Mm][Ee][Pp][Ll][Aa][Yy][Aa][Pp][Ii]\\.[Ii][Nn][Tt][Ee][Ll]\\.[Cc][Oo][Mm].*/ AND process.parent.executable:/.*\\\\[Gg][Ff][Xx][Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ww][Rr][Aa][Pp][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/)))","rule_id":"eee00933-a761-4cd0-be70-c42fe91731e7","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/GfxDownloadWrapper/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\GfxDownloadWrapper.exe AND (NOT (process.command_line:*gameplayapi.intel.com* AND process.parent.executable:*\\\\GfxDownloadWrapper.exe)))`"}
