{"id":"aae1243f-d8af-40d8-ab20-33fc6d0c55bc","created_by":"Nasreddine Bencherchali @nas_bench","name":"Suspicious Use of PsLogList","tags":["attack.discovery","attack.t1087","attack.t1087.001","attack.t1087.002"],"interval":"5m","description":"Threat actors can use the PsLogList utility to dump event log in order to extract admin accounts and perform account discovery.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Another tool that uses the command line switches of PsLogList","Legitimate use of PsLogList by an administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR process.executable:(/.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/)) OR (process.command_line:/.*[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/ AND process.command_line:/.*[Aa][Cc][Cc][Ee][Pp][Tt][Ee][Uu][Ll][Aa].*/ AND process.command_line:(/.*\\ \\-[Dd].*/ OR /.*\\ \\/[Dd].*/ OR /.*\\ \\-[Xx].*/ OR /.*\\ \\/[Xx].*/ OR /.*\\ \\-[Ss].*/ OR /.*\\ \\/[Ss].*/)))","rule_id":"aae1243f-d8af-40d8-ab20-33fc6d0c55bc","timestamp_override":"event.ingested","references":["https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/","https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos","https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:psloglist.exe OR process.executable:(*\\\\psloglist.exe OR *\\\\psloglist64.exe)) OR (process.command_line:*security* AND process.command_line:*accepteula* AND process.command_line:(*\\ \\-d* OR *\\ \\/d* OR *\\ \\-x* OR *\\ \\/x* OR *\\ \\-s* OR *\\ \\/s*)))`"}
