{"id":"93671f99-04eb-4ab4-a161-70d446a84003","created_by":"Julia Fomina, oscd.community","name":"Capture Credentials with Rpcping.exe","tags":["attack.credential_access","attack.t1003"],"interval":"5m","description":"Detects using Rpcping.exe to send a RPC test connection to the target server (-s) and force the NTLM hash to be sent in the process.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Pp][Cc][Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\-[Ss].*/ OR /.*\\/[Ss].*/)) AND ((process.command_line:/.*\\-[Uu].*/ AND process.command_line:/.*[Nn][Tt][Ll][Mm].*/) OR (process.command_line:/.*\\/[Uu].*/ AND process.command_line:/.*[Nn][Tt][Ll][Mm].*/) OR (process.command_line:/.*\\-[Tt].*/ AND process.command_line:/.*[Nn][Cc][Aa][Cc][Nn]_[Nn][Pp].*/) OR (process.command_line:/.*\\/[Tt].*/ AND process.command_line:/.*[Nn][Cc][Aa][Cc][Nn]_[Nn][Pp].*/)))","rule_id":"93671f99-04eb-4ab4-a161-70d446a84003","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Rpcping/","https://twitter.com/vysecurity/status/974806438316072960","https://twitter.com/vysecurity/status/873181705024266241","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\rpcping.exe AND process.command_line:(*\\-s* OR *\\/s*)) AND ((process.command_line:*\\-u* AND process.command_line:*NTLM*) OR (process.command_line:*\\/u* AND process.command_line:*NTLM*) OR (process.command_line:*\\-t* AND process.command_line:*ncacn_np*) OR (process.command_line:*\\/t* AND process.command_line:*ncacn_np*)))`"}
