{"id":"b7155193-8a81-4d8f-805d-88de864ca50c","created_by":"Florian Roth","name":"UNC2452 PowerShell Pattern","tags":["attack.execution","attack.t1059.001","attack.t1047"],"interval":"5m","description":"Detects a specific PowerShell command line pattern used by the UNC2452 actors as mentioned in Microsoft and Symantec reports","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Mm][Ii][Mm][Ee][Tt][Hh][Oo][Dd]\\ [Ww][Ii][Nn]32_[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ \\-[Nn][Aa][Mm][Ee]\\ [Cc][Rr][Ee][Aa][Tt][Ee]\\ \\-[Aa][Rr][Gg][Uu][Mm][Ee][Nn][Tt][Ll][Ii][Ss][Tt].*/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/) OR (process.command_line:/.*[Ww][Mm][Ii][Cc]\\ \\/[Nn][Oo][Dd][Ee]\\:.*/ AND process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Cc][Aa][Ll][Ll]\\ [Cc][Rr][Ee][Aa][Tt][Ee]\\ \\\"[Rr][Uu][Nn][Dd][Ll][Ll]32\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/))","rule_id":"b7155193-8a81-4d8f-805d-88de864ca50c","timestamp_override":"event.ingested","references":["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware","https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md#atomic-test-7---create-a-process-using-wmi-query-and-an-encoded-command"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*Invoke\\-WMIMethod\\ win32_process\\ \\-name\\ create\\ \\-argumentlist* AND process.command_line:*rundll32\\ c\\:\\\\windows*) OR (process.command_line:*wmic\\ \\/node\\:* AND process.command_line:*process\\ call\\ create\\ \\\"rundll32\\ c\\:\\\\windows*))`"}
