{"id":"3d7679bd-0c00-440c-97b0-3f204273e6c7","created_by":"Florian Roth","name":"Taskmgr as Parent","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"Detects the creation of a process from Windows task manager","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Rr][Ee][Ss][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/))))","rule_id":"3d7679bd-0c00-440c-97b0-3f204273e6c7","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\taskmgr.exe AND (NOT (process.executable:(*\\\\resmon.exe OR *\\\\mmc.exe OR *\\\\taskmgr.exe))))`"}
