{"id":"033fe7d6-66d1-4240-ac6b-28908009c71f","created_by":"Florian Roth","name":"APT29","tags":["attack.execution","attack.g0016","attack.t1059.001"],"interval":"5m","description":"This method detects a suspicious PowerShell command line combination as used by APT29 in a campaign against U.S. think tanks.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-[Nn][Oo][Nn][Ii].*/ AND process.command_line:/.*\\-[Ee][Pp].*/ AND process.command_line:/.*[Bb][Yy][Pp][Aa][Ss][Ss].*/ AND process.command_line:/.*$.*/)","rule_id":"033fe7d6-66d1-4240-ac6b-28908009c71f","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2018/12/03/analysis-of-cyberattack-on-u-s-think-tanks-non-profits-public-sector-by-unidentified-attackers/","https://www.fireeye.com/blog/threat-research/2018/11/not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-noni* AND process.command_line:*\\-ep* AND process.command_line:*bypass* AND process.command_line:*$*)`"}
