{"id":"4e762605-34a8-406d-b72e-c1a089313320","created_by":"Sreeman","name":"Detecting Fake Instances Of Hxtsr.exe","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"HxTsr.exe is a Microsoft compressed executable file called Microsoft Outlook Communications.HxTsr.exe is part of Outlook apps, because it resides in a hidden \"WindowsApps\" subfolder of \"C:\\Program Files\". Its path includes a version number, e.g., \"C:\\Program Files\\WindowsApps\\microsoft.windowscommunicationsapps_17.7466.41167.0_x64__8wekyb3d8bbwe\\HxTsr.exe\". Any instances of hxtsr.exe not in this folder may be malware camouflaging itself as HxTsr.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/[Hh][Xx][Tt][Ss][Rr]\\.[Ee][Xx][Ee]/ AND (NOT (process.working_directory:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Cc][Oo][Mm][Mm][Uu][Nn][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss][Aa][Pp][Pp][Ss]_.*/ AND process.working_directory:/.*\\\\[Hh][Xx][Tt][Ss][Rr]\\.[Ee][Xx][Ee]/)))","rule_id":"4e762605-34a8-406d-b72e-c1a089313320","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:hxtsr.exe AND (NOT (process.working_directory:C\\:\\\\program\\ files\\\\windowsapps\\\\microsoft.windowscommunicationsapps_* AND process.working_directory:*\\\\hxtsr.exe)))`"}
