{"id":"3c89a1e8-0fba-449e-8f1b-8409d6267ec8","created_by":"Florian Roth, Nasreddine Bencherchali","name":"Suspicious WMIC Execution - ProcessCallCreate","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Detects WMIC executing \"process call create\" with suspicious calls to processes such as \"rundll32\", \"regsrv32\"...etc","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ .*/ AND process.command_line:/.*[Cc][Aa][Ll][Ll]\\ .*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ AND process.command_line:(/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn].*/ OR /.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Kk]\\ .*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/ OR /.*[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*%[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ OR /.*%[Ll][Oo][Cc][Aa][Ll][Aa][Pp][Pp][Dd][Aa][Tt][Aa]%.*/))","rule_id":"3c89a1e8-0fba-449e-8f1b-8409d6267ec8","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2020/10/08/ryuks-return/","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*process\\ * AND process.command_line:*call\\ * AND process.command_line:*create\\ * AND process.command_line:(*rundll32* OR *bitsadmin* OR *regsvr32* OR *cmd.exe\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ * OR *powershell* OR *pwsh* OR *certutil* OR *cscript* OR *wscript* OR *mshta* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\AppData\\\\Local\\\\* OR *%temp%* OR *%ProgramData%* OR *%appdata%* OR *%comspec%* OR *%localappdata%*))`"}
