{"id":"a642964e-bead-4bed-8910-1bb4d63e3b4d","created_by":"Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim Shelton","name":"Mimikatz Command Line","tags":["attack.credential_access","attack.t1003.001","attack.t1003.002","attack.t1003.004","attack.t1003.005","attack.t1003.006"],"interval":"5m","description":"Detection well-known mimikatz command line arguments","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate Administrator using tool for password recovery"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:(/.*[Dd][Uu][Mm][Pp][Cc][Rr][Ee][Dd][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz].*/) OR (process.command_line:(/.*[Rr][Pp][Cc].*/ OR /.*[Tt][Oo][Kk][Ee][Nn].*/ OR /.*[Cc][Rr][Yy][Pp][Tt][Oo].*/ OR /.*[Dd][Pp][Aa][Pp][Ii].*/ OR /.*[Ss][Ee][Kk][Uu][Rr][Ll][Ss][Aa].*/ OR /.*[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Ss].*/ OR /.*[Ll][Ss][Aa][Dd][Uu][Mm][Pp].*/ OR /.*[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee].*/ OR /.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ OR /.*[Vv][Aa][Uu][Ll][Tt].*/) AND process.command_line:/.*\\:\\:.*/)) OR (process.command_line:(/.*[Aa][Aa][Dd][Cc][Oo][Oo][Kk][Ii][Ee].*/ OR /.*[Dd][Ee][Tt][Oo][Uu][Rr][Ss].*/ OR /.*[Mm][Ee][Mm][Ss][Ss][Pp].*/ OR /.*[Mm][Ff][Ll][Tt].*/ OR /.*[Nn][Cc][Rr][Oo][Uu][Tt][Ee][Mm][Oo][Nn].*/ OR /.*[Nn][Gg][Cc][Ss][Ii][Gg][Nn].*/ OR /.*[Pp][Rr][Ii][Nn][Tt][Nn][Ii][Gg][Hh][Tt][Mm][Aa][Rr][Ee].*/ OR /.*[Ss][Kk][Ee][Ll][Ee][Tt][Oo][Nn].*/ OR /.*[Pp][Rr][Ee][Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn].*/ OR /.*[Mm][Ss][Tt][Ss][Cc].*/ OR /.*[Mm][Uu][Ll][Tt][Ii][Rr][Dd][Pp].*/) AND process.command_line:/.*\\:\\:.*/)) AND (NOT ((process.command_line:/.*[Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn]\\ [Cc][Oo][Nn][Vv][Ee][Rr][Tt]\\-[Gg][Uu][Ii][Dd][Tt][Oo][Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ee][Dd][Gg][Uu][Ii][Dd].*/))))","rule_id":"a642964e-bead-4bed-8910-1bb4d63e3b4d","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment","https://tools.thehacker.recipes/mimikatz/modules"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:(*DumpCreds* OR *invoke\\-mimikatz*) OR (process.command_line:(*rpc* OR *token* OR *crypto* OR *dpapi* OR *sekurlsa* OR *kerberos* OR *lsadump* OR *privilege* OR *process* OR *vault*) AND process.command_line:*\\:\\:*)) OR (process.command_line:(*aadcookie* OR *detours* OR *memssp* OR *mflt* OR *ncroutemon* OR *ngcsign* OR *printnightmare* OR *skeleton* OR *preshutdown* OR *mstsc* OR *multirdp*) AND process.command_line:*\\:\\:*)) AND (NOT ((process.command_line:*function\\ Convert\\-GuidToCompressedGuid*))))`"}
