{"id":"bef37fa2-f205-4a7b-b484-0759bfd5f86f","created_by":"@ROxPinTeddy, Nasreddine Bencherchali @nas_bench","name":"Advanced IP Scanner","tags":["attack.discovery","attack.t1046","attack.t1135"],"interval":"5m","description":"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]_[Ii][Pp]_[Ss][Cc][Aa][Nn][Nn][Ee][Rr].*/ OR (process.command_line:/.*\\/[Pp][Oo][Rr][Tt][Aa][Bb][Ll][Ee].*/ AND process.command_line:/.*\\/[Ll][Nn][Gg].*/))","rule_id":"bef37fa2-f205-4a7b-b484-0759bfd5f86f","timestamp_override":"event.ingested","references":["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/","https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html","https://labs.f-secure.com/blog/prelude-to-ransomware-systembc","https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf","https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer","https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\advanced_ip_scanner* OR (process.command_line:*\\/portable* AND process.command_line:*\\/lng*))`"}
