{"id":"5325945e-f1f0-406e-97b8-65104d393fff","created_by":"Florian Roth","name":"Snatch Ransomware","tags":["attack.execution","attack.t1204"],"interval":"5m","description":"Detects specific process characteristics of Snatch ransomware word document droppers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Scripts that shutdown the system immediately and reboot them in safe mode are unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn]\\ \\/[Rr]\\ \\/[Ff]\\ \\/[Tt]\\ 00.*/ OR /.*[Nn][Ee][Tt]\\ [Ss][Tt][Oo][Pp]\\ [Ss][Uu][Pp][Ee][Rr][Bb][Aa][Cc][Kk][Uu][Pp][Mm][Aa][Nn].*/)","rule_id":"5325945e-f1f0-406e-97b8-65104d393fff","timestamp_override":"event.ingested","references":["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*shutdown\\ \\/r\\ \\/f\\ \\/t\\ 00* OR *net\\ stop\\ SuperBackupMan*)`"}
