{"id":"5f60740a-f57b-4e76-82a1-15b6ff2cb134","created_by":"Eli Salem, Sander Wiebing, oscd.community","name":"Modifies the Registry From a File","tags":["attack.t1112","attack.defense_evasion"],"interval":"5m","description":"Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate modification of keys"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Rr][Ee][Gg][Ii][Nn][Ii]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Rr][Ee][Gg][Ii][Nn][Ii]\\.[Ee][Xx][Ee]/) AND (NOT (process.command_line:/:[^ \\\\\\\\]/)))","rule_id":"5f60740a-f57b-4e76-82a1-15b6ff2cb134","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Regini/","https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\regini.exe OR process.pe.original_file_name:REGINI.EXE) AND (NOT (process.command_line:/:[^ \\\\\\\\]/)))`"}
