{"id":"c73124a7-3e89-44a3-bdc1-25fe4df754b1","created_by":"Max Altgelt, Tobias Michalski","name":"Copy from Volume Shadow Copy","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Detects a copy execution that targets a shadow copy (sometimes used to copy registry hives that are in use)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Some rare backup scenarios"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Cc][Oo][Pp][Yy]\\ \\\\\\\\\\?\\\\[Gg][Ll][Oo][Bb][Aa][Ll][Rr][Oo][Oo][Tt]\\\\[Dd][Ee][Vv][Ii][Cc][Ee]\\\\[Hh][Aa][Rr][Dd][Dd][Ii][Ss][Kk][Vv][Oo][Ll][Uu][Mm][Ee][Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/","rule_id":"c73124a7-3e89-44a3-bdc1-25fe4df754b1","timestamp_override":"event.ingested","references":["https://twitter.com/vxunderground/status/1423336151860002816?s=20","https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection","https://pentestlab.blog/2018/07/04/dumping-domain-password-hashes/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*copy\\ \\\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy*`"}
