{"id":"cbec226f-63d9-4eca-9f52-dfb6652f24df","created_by":"Florian Roth","name":"Suspicious Process Parents","tags":null,"interval":"5m","description":"Detects suspicious parent processes that should not have any children or should only have a single possible child program","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Mm][Ii][Nn][Ee][Ss][Ww][Ee][Ee][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:(/.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Vv][Ee][Nn][Tt][Vv][Ww][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/) AND (NOT ((process.executable:(/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Rr][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn]32[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/)) OR (NOT _exists_:process.executable)))))","rule_id":"cbec226f-63d9-4eca-9f52-dfb6652f24df","timestamp_override":"event.ingested","references":["https://twitter.com/x86matthew/status/1505476263464607744?s=12","https://svch0st.medium.com/stats-from-hunting-cobalt-strike-beacons-c17e56255f9b"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\minesweeper.exe OR *\\\\winver.exe OR *\\\\bitsadmin.exe) OR (process.parent.executable:(*\\\\csrss.exe OR *\\\\certutil.exe OR *\\\\eventvwr.exe OR *\\\\calc.exe OR *\\\\notepad.exe) AND (NOT ((process.executable:(*\\\\WerFault.exe OR *\\\\wermgr.exe OR *\\\\conhost.exe OR *\\\\mmc.exe OR *\\\\win32calc.exe OR *\\\\notepad.exe)) OR (NOT _exists_:process.executable)))))`"}
