{"id":"2569ed8c-1147-498a-9b8c-2ad3656b10ed","created_by":"Nasreddine Bencherchali","name":"DllRegisterServer Call From Non Rundll32","tags":["attack.execution"],"interval":"5m","description":"Detects when 'DllRegisterServer' is called in the commandline and the image is not rundll32. This could mean that the 'rundll32' utility has been renamed in order to avoid detection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Dd][Ll][Ll][Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Ss][Ee][Rr][Vv][Ee][Rr].*/ AND (NOT (process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/)))","rule_id":"2569ed8c-1147-498a-9b8c-2ad3656b10ed","timestamp_override":"event.ingested","references":["https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20","https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*DllRegisterServer* AND (NOT (process.executable:*\\\\rundll32.exe)))`"}
