{"id":"847d5ff3-8a31-4737-a970-aeae8fe21765","created_by":"Florian Roth, Nasreddine Bencherchali","name":"Wmic Uninstall Security Product","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects uninstallation or termination of security products using the WMIC utility","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*[Ww][Mm][Ii][Cc].*/ AND process.command_line:/.*[Pp][Rr][Oo][Dd][Uu][Cc][Tt]\\ [Ww][Hh][Ee][Rr][Ee]\\ .*/ AND process.command_line:/.*[Cc][Aa][Ll][Ll]\\ [Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll].*/ AND process.command_line:/.*\\/[Nn][Oo][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee].*/) OR (process.command_line:/.*[Ww][Mm][Ii][Cc].*/ AND process.command_line:/.*[Cc][Aa][Pp][Tt][Ii][Oo][Nn]\\ [Ll][Ii][Kk][Ee]\\ .*/ AND process.command_line:(/.*[Cc][Aa][Ll][Ll]\\ [Dd][Ee][Ll][Ee][Tt][Ee].*/ OR /.*[Cc][Aa][Ll][Ll]\\ [Tt][Ee][Rr][Mm][Ii][Nn][Aa][Tt][Ee].*/))) AND process.command_line:(/.*[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR /.*[Aa][Vv][Gg]\\ .*/ OR /.*[Cc][Rr][Oo][Ww][Dd][Ss][Tt][Rr][Ii][Kk][Ee]\\ [Ss][Ee][Nn][Ss][Oo][Rr].*/ OR /.*[Dd][Ll][Pp]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt].*/ OR /.*[Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/ OR /.*[Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Ss][Ee][Nn][Ss][Oo][Rr].*/ OR /.*[Ee][Ss][Ee][Tt]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/ OR /.*[Mm][Aa][Ll][Ww][Aa][Rr][Ee][Bb][Yy][Tt][Ee][Ss].*/ OR /.*[Mm][Cc][Aa][Ff][Ee][Ee]\\ [Aa][Gg][Ee][Nn][Tt].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt].*/ OR /.*[Tt][Hh][Rr][Ee][Aa][Tt]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Vv][Ii][Rr][Uu][Ss][Ss][Cc][Aa][Nn].*/ OR /.*[Ww][Ee][Bb][Rr][Oo][Oo][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ee][Aa][Nn][Yy][Ww][Hh][Ee][Rr][Ee].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*/ OR /.*[Cc][Aa][Rr][Bb][Oo][Nn][Bb][Ll][Aa][Cc][Kk].*/ OR /.*[Cc][Aa][Rr][Bb][Oo][Nn]\\ [Bb][Ll][Aa][Cc][Kk].*/ OR /.*[Cc][Bb]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\ [Ss][Ee][Nn][Ss][Oo][Rr]\\ 64\\-[Bb][Ii][Tt].*/ OR /.*[Dd][Ee][Ll][Ll]\\ [Tt][Hh][Rr][Ee][Aa][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee].*/ OR /.*[Cc][Yy][Ll][Aa][Nn][Cc][Ee]\\ .*/ OR /.*[Ll][Oo][Gg][Rr][Hh][Yy][Tt][Hh][Mm]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Aa][Nn][Tt][Ii]\\-[Vv][Ii][Rr][Uu][Ss].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Aa][Uu][Tt][Oo][Uu][Pp][Dd][Aa][Tt][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Cc][Oo][Nn][Ss][Oo][Ll][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Dd][Aa][Tt][Aa][Bb][Aa][Ss][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Ss][Tt][Oo][Rr][Ee].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Ss][Ee][Rr][Vv][Ee][Rr].*/ OR /.*[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Rr][Ee][Mm][Oo][Tt][Ee]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Ss][Yy][Ss][Tt][Ee][Mm].*/ OR /.*%[Ss][Oo][Pp][Hh][Oo][Ss]%.*/ OR /.*%[Cc][Aa][Rr][Bb][Oo][Nn]%.*/ OR /.*%[Cc][Yy][Ll][Aa][Nn][Cc][Ee]%.*/ OR /.*%[Ee][Ss][Ee][Tt]%.*/ OR /.*%[Ss][Yy][Mm][Aa][Nn][Tt][Ee][Cc]%.*/))","rule_id":"847d5ff3-8a31-4737-a970-aeae8fe21765","timestamp_override":"event.ingested","references":["https://twitter.com/cglyer/status/1355171195654709249","https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/","https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions","https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*wmic* AND process.command_line:*product\\ where\\ * AND process.command_line:*call\\ uninstall* AND process.command_line:*\\/nointeractive*) OR (process.command_line:*wmic* AND process.command_line:*caption\\ like\\ * AND process.command_line:(*call\\ delete* OR *call\\ terminate*))) AND process.command_line:(*Antivirus* OR *AVG\\ * OR *Crowdstrike\\ Sensor* OR *DLP\\ Endpoint* OR *Endpoint\\ Detection* OR *Endpoint\\ Protection* OR *Endpoint\\ Security* OR *Endpoint\\ Sensor* OR *ESET\\ File\\ Security* OR *Malwarebytes* OR *McAfee\\ Agent* OR *Microsoft\\ Security\\ Client* OR *Threat\\ Protection* OR *VirusScan* OR *Webroot\\ SecureAnywhere* OR *Windows\\ Defender* OR *CarbonBlack* OR *Carbon\\ Black* OR *Cb\\ Defense\\ Sensor\\ 64\\-bit* OR *Dell\\ Threat\\ Defense* OR *Cylance\\ * OR *LogRhythm\\ System\\ Monitor\\ Service* OR *Sophos\\ Anti\\-Virus* OR *Sophos\\ AutoUpdate* OR *Sophos\\ Management\\ Console* OR *Sophos\\ Management\\ Database* OR *Sophos\\ Credential\\ Store* OR *Sophos\\ Update\\ Manager* OR *Sophos\\ Management\\ Server* OR *Sophos\\ Remote\\ Management\\ System* OR *%Sophos%* OR *%carbon%* OR *%cylance%* OR *%eset%* OR *%symantec%*))`"}
