{"id":"7679d464-4f74-45e2-9e01-ac66c5eb041a","created_by":"Florian Roth","name":"SecurityXploded Tool","tags":["attack.credential_access","attack.t1555"],"interval":"5m","description":"Detects the execution of SecurityXploded Tools","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.company:/[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Xx][Pp][Ll][Oo][Dd][Ee][Dd]/ OR process.executable:/.*[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/.*[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/)","rule_id":"7679d464-4f74-45e2-9e01-ac66c5eb041a","timestamp_override":"event.ingested","references":["https://securityxploded.com/","https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.company:SecurityXploded OR process.executable:*PasswordDump.exe OR process.pe.original_file_name:*PasswordDump.exe)`"}
