{"id":"689308fc-cfba-4f72-9897-796c1dc61487","created_by":"frack113","name":"Conti Ransomware Execution","tags":["attack.impact","attack.s0575","attack.t1486"],"interval":"5m","description":"Conti ransomware command line ioc","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\-[Mm]\\ .*/ AND process.command_line:/.*\\-[Nn][Ee][Tt]\\ .*/ AND process.command_line:/.*\\-[Ss][Ii][Zz][Ee]\\ .*/ AND process.command_line:/.*\\-[Nn][Oo][Mm][Uu][Tt][Ee][Xx]\\ .*/ AND process.command_line:/.*\\-[Pp]\\ \\\\\\\\\\*/ AND process.command_line:/.*$.*/)","rule_id":"689308fc-cfba-4f72-9897-796c1dc61487","timestamp_override":"event.ingested","references":["https://news.sophos.com/en-us/2021/09/03/conti-affiliates-use-proxyshell-exchange-exploit-in-ransomware-attacks/","https://twitter.com/VK_Intel/status/1447795359900704769?t=Xz7vaLTvaaCZ5kHoZa6gMw&s=19"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\-m\\ * AND process.command_line:*\\-net\\ * AND process.command_line:*\\-size\\ * AND process.command_line:*\\-nomutex\\ * AND process.command_line:*\\-p\\ \\\\\\\\\\* AND process.command_line:*$*)`"}
