{"id":"3268b746-88d8-4cd3-bffc-30077d02c787","created_by":"Ecco","name":"Empire PowerShell UAC Bypass","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002","car.2019-04-001"],"interval":"5m","description":"Detects some Empire PowerShell UAC bypass methods","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*\\ \\-[Nn][Oo][Pp]\\ \\-[Nn][Oo][Nn][Ii]\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ \\-[Cc]\\ $[Xx]\\=$\\(\\([Gg][Pp]\\ [Hh][Kk][Cc][Uu]\\:[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\)\\.[Uu][Pp][Dd][Aa][Tt][Ee]\\).*/ OR /.*\\ \\-[Nn][Oo][Pp]\\ \\-[Nn][Oo][Nn][Ii]\\ \\-[Cc]\\ $[Xx]\\=$\\(\\([Gg][Pp]\\ [Hh][Kk][Cc][Uu]\\:[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\)\\.[Uu][Pp][Dd][Aa][Tt][Ee]\\);.*/)","rule_id":"3268b746-88d8-4cd3-bffc-30077d02c787","timestamp_override":"event.ingested","references":["https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64","https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-FodHelperBypass.ps1#L64"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*\\ \\-NoP\\ \\-NonI\\ \\-w\\ Hidden\\ \\-c\\ $x\\=$\\(\\(gp\\ HKCU\\:Software\\\\Microsoft\\\\Windows\\ Update\\).Update\\)* OR *\\ \\-NoP\\ \\-NonI\\ \\-c\\ $x\\=$\\(\\(gp\\ HKCU\\:Software\\\\Microsoft\\\\Windows\\ Update\\).Update\\);*)`"}
