{"id":"cdf05894-89e7-4ead-b2b0-0a5f97a90f2f","created_by":"Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton","name":"Encoded PowerShell Command Line","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects specific combinations of encoding methods in the PowerShell command lines","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND ((process.command_line:(/.*[Tt][Oo][Ii][Nn][Tt].*/ OR /.*[Tt][Oo][Dd][Ee][Cc][Ii][Mm][Aa][Ll].*/ OR /.*[Tt][Oo][Bb][Yy][Tt][Ee].*/ OR /.*[Tt][Oo][Uu][Ii][Nn][Tt].*/ OR /.*[Tt][Oo][Ss][Ii][Nn][Gg][Ll][Ee].*/ OR /.*[Tt][Oo][Ss][Bb][Yy][Tt][Ee].*/) AND process.command_line:(/.*[Tt][Oo][Cc][Hh][Aa][Rr].*/ OR /.*[Tt][Oo][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*[Ss][Tt][Rr][Ii][Nn][Gg].*/)) OR ((process.command_line:/.*[Cc][Hh][Aa][Rr].*/ AND process.command_line:/.*[Jj][Oo][Ii][Nn].*/) OR (process.command_line:/.*[Ss][Pp][Ll][Ii][Tt].*/ AND process.command_line:/.*[Jj][Oo][Ii][Nn].*/))))","rule_id":"cdf05894-89e7-4ead-b2b0-0a5f97a90f2f","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND ((process.command_line:(*ToInt* OR *ToDecimal* OR *ToByte* OR *ToUint* OR *ToSingle* OR *ToSByte*) AND process.command_line:(*ToChar* OR *ToString* OR *String*)) OR ((process.command_line:*char* AND process.command_line:*join*) OR (process.command_line:*split* AND process.command_line:*join*))))`"}
