{"id":"f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd","created_by":"juju4","name":"Suspicious Commandline Escape","tags":["attack.defense_evasion","attack.t1140"],"interval":"5m","description":"Detects suspicious process that use escape characters","risk_score":21,"enabled":true,"severity":"low","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Hh]\\^[Tt]\\^[Tt]\\^[Pp].*/ OR /.*[Hh]\\\"[Tt]\\\"[Tt]\\\"[Pp].*/)","rule_id":"f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd","timestamp_override":"event.ingested","references":["https://twitter.com/vysecurity/status/885545634958385153","https://twitter.com/Hexacorn/status/885553465417756673","https://twitter.com/Hexacorn/status/885570278637678592","https://www.fireeye.com/blog/threat-research/2017/06/obfuscation-in-the-wild.html","http://www.windowsinspired.com/understanding-the-command-line-string-and-arguments-received-by-a-windows-program/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*h\\^t\\^t\\^p* OR *h\\\"t\\\"t\\\"p*)`"}
