{"id":"c83bf4b5-cdf0-437c-90fa-43d734f7c476","created_by":"Moriarty Meng (idea), Anton Kutepov (rule), oscd.community","name":"Run PowerShell Script from Redirected Input Stream","tags":["attack.defense_evasion","attack.execution","attack.t1059"],"interval":"5m","description":"Detects PowerShell script execution via input stream redirect","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/\\s-\\s*</)","rule_id":"c83bf4b5-cdf0-437c-90fa-43d734f7c476","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Powershell.yml","https://twitter.com/Moriarty_Meng/status/984380793383370752"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:/\\s-\\s*</)`"}
