{"id":"954f0af7-62dd-418f-b3df-a84bc2c7a774","created_by":"frack113","name":"Remote Desktop Protocol Use Mstsc","tags":["attack.lateral_movement","attack.t1021.001"],"interval":"5m","description":"Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Mm][Ss][Tt][Ss][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Mm][Ss][Tt][Ss][Cc]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ \\/[Vv]\\:.*/) OR ((process.executable:/.*\\\\[Cc][Mm][Dd][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Mm][Dd][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\/[Gg].*/ AND process.command_line:/.*\\ \\/[Uu].*/ AND process.command_line:/.*\\ \\/[Pp].*/)))","rule_id":"954f0af7-62dd-418f-b3df-a84bc2c7a774","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/mstsc"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\mstsc.exe OR process.pe.original_file_name:mstsc.exe) AND process.command_line:*\\ \\/v\\:*) OR ((process.executable:*\\\\cmdkey.exe OR process.pe.original_file_name:cmdkey.exe) AND (process.command_line:*\\ \\/g* AND process.command_line:*\\ \\/u* AND process.command_line:*\\ \\/p*)))`"}
