{"id":"f4bbd493-b796-416e-bbf2-121235348529","created_by":"Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)","name":"Non Interactive PowerShell","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects non-interactive PowerShell activity by looking at powershell.exe with not explorer.exe as a parent.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate programs executing PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ AND (NOT (process.parent.executable:(/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/))))","rule_id":"f4bbd493-b796-416e-bbf2-121235348529","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\powershell.exe AND (NOT (process.parent.executable:(*\\\\explorer.exe OR *\\\\CompatTelRunner.exe))))`"}
