{"id":"c9fbe8e9-119d-40a6-9b59-dd58a5d84429","created_by":"@neu5ron","name":"Possible Ransomware or Unauthorized MBR Modifications","tags":["attack.defense_evasion","attack.t1070","attack.persistence","attack.t1542.003"],"interval":"5m","description":"Detects, possibly, malicious unauthorized usage of bcdedit.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Bb][Cc][Dd][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Dd][Ee][Ll][Ee][Tt][Ee].*/ OR /.*[Dd][Ee][Ll][Ee][Tt][Ee][Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Ii][Mm][Pp][Oo][Rr][Tt].*/ OR /.*[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt].*/ OR /.*[Nn][Ee][Tt][Ww][Oo][Rr][Kk].*/))","rule_id":"c9fbe8e9-119d-40a6-9b59-dd58a5d84429","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set","https://twitter.com/malwrhunterteam/status/1372536434125512712/photo/2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\bcdedit.exe AND process.command_line:(*delete* OR *deletevalue* OR *import* OR *safeboot* OR *network*))`"}
