{"id":"74403157-20f5-415d-89a7-c505779585cf","created_by":"Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton","name":"Encoded PowerShell Command Line Usage of ConvertTo-SecureString","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects specific encoding method of cOnvErTTO-SECUreStRIng in the PowerShell command lines","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt][Tt][Oo]\\-[Ss][Ee][Cc][Uu][Rr][Ee][Ss][Tt][Rr][Ii][Nn][Gg].*/)","rule_id":"74403157-20f5-415d-89a7-c505779585cf","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*ConvertTo\\-SecureString*)`"}
