{"id":"f1086bf7-a0c4-4a37-9102-01e573caf4a0","created_by":"Florian Roth","name":"Renamed Whoami Execution","tags":["attack.discovery","attack.t1033","car.2016-03-001"],"interval":"5m","description":"Detects the execution of whoami that has been renamed to a different name to avoid detection","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/)))","rule_id":"f1086bf7-a0c4-4a37-9102-01e573caf4a0","timestamp_override":"event.ingested","references":["https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/","https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:whoami.exe AND (NOT (process.executable:*\\\\whoami.exe)))`"}
