{"id":"d7825193-b70a-48a4-b992-8b5b3015cc11","created_by":"FPT.EagleEye Team","name":"Windows Update Client LOLBIN","tags":["attack.command_and_control","attack.execution","attack.t1105","attack.t1218"],"interval":"5m","description":"Detects code execution via the Windows Update client (wuauclt)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*\\/[Uu][Pp][Dd][Aa][Tt][Ee][Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ AND process.command_line:/.*\\/[Rr][Uu][Nn][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Cc][Oo][Mm][Ss][Ee][Rr][Vv][Ee][Rr].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/) AND (process.executable:/.*\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/)) AND (NOT (process.command_line:(/.*\\ \\/[Cc][Ll][Aa][Ss][Ss][Ii][Dd]\\ .*/ OR /.*\\ [Ww][Uu][Aa][Uu][Ee][Nn][Gg]\\.[Dd][Ll][Ll]\\ .*/))))","rule_id":"d7825193-b70a-48a4-b992-8b5b3015cc11","timestamp_override":"event.ingested","references":["https://dtm.uk/wuauclt/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*\\/UpdateDeploymentProvider* AND process.command_line:*\\/RunHandlerComServer* AND process.command_line:*.dll*) AND (process.executable:*\\\\wuauclt.exe OR process.pe.original_file_name:wuauclt.exe)) AND (NOT (process.command_line:(*\\ \\/ClassId\\ * OR *\\ wuaueng.dll\\ *))))`"}
