{"id":"e290b10b-1023-4452-a4a9-eb31a9013b3a","created_by":"Ialle Teixeira @teixeira0xfffff, Austin Songer @austinsonger","name":"LOLBAS Data Exfiltration by DataSvcUtil.exe","tags":["attack.exfiltration","attack.t1567"],"interval":"5m","description":"Detects when a user performs data exfiltration by using DataSvcUtil.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["DataSvcUtil.exe being used may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","DataSvcUtil.exe being executed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\/[Ii][Nn]\\:.*/ OR /.*\\/[Oo][Uu][Tt]\\:.*/ OR /.*\\/[Uu][Rr][Ii]\\:.*/) AND (process.executable:/.*\\\\[Dd][Aa][Tt][Aa][Ss][Vv][Cc][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Dd][Aa][Tt][Aa][Ss][Vv][Cc][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/))","rule_id":"e290b10b-1023-4452-a4a9-eb31a9013b3a","timestamp_override":"event.ingested","references":["https://gist.github.com/teixeira0xfffff/837e5bfed0d1b0a29a7cb1e5dbdd9ca6","https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/wcf-data-service-client-utility-datasvcutil-exe","https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/generating-the-data-service-client-library-wcf-data-services","https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/how-to-add-a-data-service-reference-wcf-data-services","https://lolbas-project.github.io/lolbas/Binaries/DataSvcUtil/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\/in\\:* OR *\\/out\\:* OR *\\/uri\\:*) AND (process.executable:*\\\\DataSvcUtil.exe OR process.pe.original_file_name:DataSvcUtil.exe))`"}
