{"id":"bac9fb54-2da7-44e9-988f-11e9a5edbc0c","created_by":"Nasreddine Bencherchali","name":"Password Spraying Attempts Using Dsacls","tags":["attack.execution","attack.t1218"],"interval":"5m","description":"Detects possible password spraying attempts using Dsacls","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of dsacls to bind to an LDAP session"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Ss][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Dd][Ss][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\/[Uu][Ss][Ee][Rr]\\:.*/ AND process.command_line:/.*\\/[Pp][Aa][Ss][Ss][Ww][Dd]\\:.*/))","rule_id":"bac9fb54-2da7-44e9-988f-11e9a5edbc0c","timestamp_override":"event.ingested","references":["https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone","https://ss64.com/nt/dsacls.html","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\dsacls.exe OR process.pe.original_file_name:DSACLS.EXE) AND (process.command_line:*\\/user\\:* AND process.command_line:*\\/passwd\\:*))`"}
