{"id":"20c3f09d-c53d-4e85-8b74-6aa50e2f1b61","created_by":"Florian Roth","name":"Suspicious VBScript UN2452 Pattern","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects suspicious inline VBScript keywords as used by UNC2452","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.command_line:/.*[Rr][Ee][Gg][Rr][Ee][Aa][Dd].*/ AND process.command_line:/.*[Ww][Ii][Nn][Dd][Oo][Ww]\\.[Cc][Ll][Oo][Ss][Ee].*/ AND process.command_line:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/) AND (NOT (process.command_line:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/)))","rule_id":"20c3f09d-c53d-4e85-8b74-6aa50e2f1b61","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*Execute* AND process.command_line:*CreateObject* AND process.command_line:*RegRead* AND process.command_line:*window.close* AND process.command_line:*\\\\Microsoft\\\\Windows\\\\CurrentVersion*) AND (NOT (process.command_line:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run*)))`"}
