{"id":"1fb76ab8-fa60-4b01-bddd-71e89bf555da","created_by":"frack113","name":"Pubprn.vbs Proxy Execution","tags":["attack.defense_evasion","attack.t1216.001"],"interval":"5m","description":"Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute commands.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\\\[Pp][Uu][Bb][Pp][Rr][Nn]\\.[Vv][Bb][Ss].*/ AND process.command_line:/.*[Ss][Cc][Rr][Ii][Pp][Tt]\\:.*/)","rule_id":"1fb76ab8-fa60-4b01-bddd-71e89bf555da","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Scripts/Pubprn/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\\\pubprn.vbs* AND process.command_line:*script\\:*)`"}
