{"id":"beaa66d6-aa1b-4e3c-80f5-e0145369bfaf","created_by":"Nasreddine Bencherchali","name":"Wevtutil Recon","tags":["attack.discovery"],"interval":"5m","description":"Detects usage of the wevtutil utility to perform reconnaissance","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitmate usage of the utility by administrators to query the event log"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ [Qq][Ee]\\ .*/ OR /.*\\ [Qq][Uu][Ee][Rr][Yy]\\-[Ee][Vv][Ee][Nn][Tt][Ss]\\ .*/) AND process.command_line:(/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\-[Ll][Oo][Cc][Aa][Ll][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\-[Rr][Ee][Mm][Oo][Tt][Ee][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll].*/))","rule_id":"beaa66d6-aa1b-4e3c-80f5-e0145369bfaf","timestamp_override":"event.ingested","references":["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wevtutil.exe AND process.command_line:(*\\ qe\\ * OR *\\ query\\-events\\ *) AND process.command_line:(*Microsoft\\-Windows\\-TerminalServices\\-LocalSessionManager\\/Operational* OR *Microsoft\\-Windows\\-Terminal\\-Services\\-RemoteConnectionManager\\/Operational*))`"}
