{"id":"0058b9e5-bcd7-40d4-9205-95ca5a16d7b2","created_by":"Christian Burkard","name":"UAC Bypass Using Windows Media Player - Process","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Mm][Ee][Dd][Ii][Aa]\\ [Pp][Ll][Aa][Yy][Ee][Rr]\\\\[Oo][Ss][Kk]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]\\\"\\ \\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ee][Vv][Ee][Nn][Tt][Vv][Ww][Rr]\\.[Mm][Ss][Cc]\\\"\\ \\/[Ss]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/)))","rule_id":"0058b9e5-bcd7-40d4-9205-95ca5a16d7b2","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:C\\:\\\\Program\\ Files\\\\Windows\\ Media\\ Player\\\\osk.exe AND winlog.event_data.IntegrityLevel:(High OR System)) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\cmd.exe AND process.parent.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\mmc.exe\\\"\\ \\\"C\\:\\\\Windows\\\\system32\\\\eventvwr.msc\\\"\\ \\/s AND winlog.event_data.IntegrityLevel:(High OR System)))`"}
