{"id":"bbeaed61-1990-4773-bf57-b81dbad7db2d","created_by":"Florian Roth","name":"Curl Usage on Windows","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects a curl process start on Windows, which indicates a file download from a remote location or a simple web request to a remote server","risk_score":21,"enabled":true,"severity":"low","false_positives":["Scripts created by developers and admins","Administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/ OR process.pe.product:/[Tt][Hh][Ee]\\ [Cc][Uu][Rr][Ll]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Aa][Bb][Ll][Ee]/)","rule_id":"bbeaed61-1990-4773-bf57-b81dbad7db2d","timestamp_override":"event.ingested","references":["https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\curl.exe OR process.pe.product:The\\ curl\\ executable)`"}
