{"id":"8d63dadf-b91b-4187-87b6-34a1114577ea","created_by":"Markus Neis, Florian Roth","name":"SquiblyTwo Execution","tags":["attack.defense_evasion","attack.t1047","attack.t1220","attack.execution","attack.t1059.005","attack.t1059.007"],"interval":"5m","description":"Detects WMI SquiblyTwo Attack with possible renamed WMI by looking for imphash","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ww][Mm][Ii][Cc].*/ AND process.command_line:/.*[Ff][Oo][Rr][Mm][Aa][Tt].*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/) OR ((process.pe.imphash:(/1[Bb]1[Aa]3[Ff]43[Bb][Ff]37[Bb]5[Bb][Ff][Ee]60751[Ff]2[Ee][Ee]2[Ff]326[Ee]/ OR /37777[Aa]96245[Aa]3[Cc]74[Ee][Bb]217308[Ff]3546[Ff]4[Cc]/ OR /9[Dd]87[Cc]9[Dd]67[Cc][Ee]724033[Cc]0[Bb]40[Cc][Cc]4[Cc][Aa]1[Bb]206/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=1[Bb]1[Aa]3[Ff]43[Bb][Ff]37[Bb]5[Bb][Ff][Ee]60751[Ff]2[Ee][Ee]2[Ff]326[Ee].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=37777[Aa]96245[Aa]3[Cc]74[Ee][Bb]217308[Ff]3546[Ff]4[Cc].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=9[Dd]87[Cc]9[Dd]67[Cc][Ee]724033[Cc]0[Bb]40[Cc][Cc]4[Cc][Aa]1[Bb]206.*/)) AND (process.command_line:/.*[Ff][Oo][Rr][Mm][Aa][Tt]\\:.*/ AND process.command_line:/.*[Hh][Tt][Tt][Pp].*/)))","rule_id":"8d63dadf-b91b-4187-87b6-34a1114577ea","timestamp_override":"event.ingested","references":["https://subt0x11.blogspot.ch/2018/04/wmicexe-whitelisting-bypass-hacking.html","https://twitter.com/mattifestation/status/986280382042595328"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\wmic.exe AND process.command_line:*wmic* AND process.command_line:*format* AND process.command_line:*http*) OR ((process.pe.imphash:(1B1A3F43BF37B5BFE60751F2EE2F326E OR 37777A96245A3C74EB217308F3546F4C OR 9D87C9D67CE724033C0B40CC4CA1B206) OR related.hash:(*IMPHASH\\=1B1A3F43BF37B5BFE60751F2EE2F326E* OR *IMPHASH\\=37777A96245A3C74EB217308F3546F4C* OR *IMPHASH\\=9D87C9D67CE724033C0B40CC4CA1B206*)) AND (process.command_line:*format\\:* AND process.command_line:*http*)))`"}
