{"id":"725a9768-0f5e-4cb3-aec2-bc5719c6831a","created_by":"frack113, Nasreddine Bencherchali","name":"Suspicious Where Execution","tags":["attack.discovery","attack.t1217"],"interval":"5m","description":"Adversaries may enumerate browser bookmarks to learn more about compromised hosts.\nBrowser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about\ninternal network resources such as servers, tools/dashboards, or other related infrastructure.\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Hh][Ee][Rr][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Hh][Ee][Rr][Ee]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Pp][Ll][Aa][Cc][Ee][Ss]\\.[Ss][Qq][Ll][Ii][Tt][Ee].*/ OR /.*[Cc][Oo][Oo][Kk][Ii][Ee][Ss]\\.[Ss][Qq][Ll][Ii][Tt][Ee].*/ OR /.*[Ff][Oo][Rr][Mm][Hh][Ii][Ss][Tt][Oo][Rr][Yy]\\.[Ss][Qq][Ll][Ii][Tt][Ee].*/ OR /.*[Ll][Oo][Gg][Ii][Nn][Ss]\\.[Jj][Ss][Oo][Nn].*/ OR /.*[Kk][Ee][Yy]4\\.[Dd][Bb].*/ OR /.*[Kk][Ee][Yy]3\\.[Dd][Bb].*/ OR /.*[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss][Tt][Oo][Rr][Ee]\\.[Jj][Ss][Oo][Nn][Ll][Zz]4.*/ OR /.*[Hh][Ii][Ss][Tt][Oo][Rr][Yy].*/ OR /.*[Bb][Oo][Oo][Kk][Mm][Aa][Rr][Kk][Ss].*/ OR /.*[Cc][Oo][Oo][Kk][Ii][Ee][Ss].*/ OR /.*[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa].*/))","rule_id":"725a9768-0f5e-4cb3-aec2-bc5719c6831a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\where.exe OR process.pe.original_file_name:where.exe) AND process.command_line:(*places.sqlite* OR *cookies.sqlite* OR *formhistory.sqlite* OR *logins.json* OR *key4.db* OR *key3.db* OR *sessionstore.jsonlz4* OR *History* OR *Bookmarks* OR *Cookies* OR *Login\\ Data*))`"}
