{"id":"4b60e6f2-bf39-47b4-b4ea-398e33cfe253","created_by":"Nik Seetharaman, Christian Burkard","name":"CMSTP UAC Bypass via COM Object Access","tags":["attack.execution","attack.defense_evasion","attack.privilege_escalation","attack.t1548.002","attack.t1218.003","attack.g0069","car.2019-04-001"],"interval":"5m","description":"Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or 65)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate CMSTP use (unlikely in modern enterprise environments)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/) AND process.parent.command_line:(/.*\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{3[Ee]5[Ff][Cc]7[Ff]9\\-9[Aa]51\\-4367\\-9063\\-[Aa]120244[Ff][Bb][Ee][Cc]7\\}.*/ OR /.*\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{3[Ee]000[Dd]72\\-[Aa]845\\-4[Cc][Dd]9\\-[Bb][Dd]83\\-80[Cc]07[Cc]3[Bb]881[Ff]\\}.*/ OR /.*\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{[Bb][Dd]54[Cc]901\\-076[Bb]\\-434[Ee]\\-[Bb]6[Cc]7\\-17[Cc]531[Ff]4[Aa][Bb]41\\}.*/ OR /.*\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{[Dd]2[Ee]7041[Bb]\\-2927\\-42[Ff][Bb]\\-8[Ee]9[Ff]\\-7[Cc][Ee]93[Bb]6[Dd][Cc]937\\}.*/ OR /.*\\ \\/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ii][Dd]\\:\\{[Ee]9495[Bb]87\\-[Dd]950\\-4[Aa][Bb]5\\-87[Aa]5\\-[Ff][Ff]6[Dd]70[Bb][Ff]3[Ee]90\\}.*/))","rule_id":"4b60e6f2-bf39-47b4-b4ea-398e33cfe253","timestamp_override":"event.ingested","references":["https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/","https://twitter.com/hFireF0X/status/897640081053364225","https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf","https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\DllHost.exe AND winlog.event_data.IntegrityLevel:(High OR System) AND process.parent.command_line:(*\\ \\/Processid\\:\\{3E5FC7F9\\-9A51\\-4367\\-9063\\-A120244FBEC7\\}* OR *\\ \\/Processid\\:\\{3E000D72\\-A845\\-4CD9\\-BD83\\-80C07C3B881F\\}* OR *\\ \\/Processid\\:\\{BD54C901\\-076B\\-434E\\-B6C7\\-17C531F4AB41\\}* OR *\\ \\/Processid\\:\\{D2E7041B\\-2927\\-42FB\\-8E9F\\-7CE93B6DC937\\}* OR *\\ \\/Processid\\:\\{E9495B87\\-D950\\-4AB5\\-87A5\\-FF6D70BF3E90\\}*))`"}
