{"id":"d21374ff-f574-44a7-9998-4a8c8bf33d7d","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Wmiprvse Spawning Process","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Detects wmiprvse spawning processes","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND (NOT (winlog.event_data.LogonId:(/0[Xx]3[Ee]7/ OR null) OR winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/) OR process.executable:(/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/)))) AND (NOT (NOT _exists_:winlog.event_data.LogonId)))","rule_id":"d21374ff-f574-44a7-9998-4a8c8bf33d7d","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\WmiPrvSe.exe AND (NOT (winlog.event_data.LogonId:(0x3e7 OR null) OR winlog.event_data.User:(*AUTHORI* OR *AUTORI*) OR process.executable:(*\\\\WmiPrvSE.exe OR *\\\\WerFault.exe)))) AND (NOT (NOT _exists_:winlog.event_data.LogonId)))`"}
