{"id":"46123129-1024-423e-9fae-43af4a0fa9a5","created_by":"Matthew Matchen","name":"Windows Defender Download Activity","tags":["attack.defense_evasion","attack.t1218","attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detect the use of Windows Defender to download payloads","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee].*/ OR process.pe.description:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Mm][Aa][Ll][Ww][Aa][Rr][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ [Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Ll][Ii][Nn][Ee]\\ [Uu][Tt][Ii][Ll][Ii][Tt][Yy]/) AND (process.command_line:/.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/ AND process.command_line:/.*[Uu][Rr][Ll].*/))","rule_id":"46123129-1024-423e-9fae-43af4a0fa9a5","timestamp_override":"event.ingested","references":["https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866","https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*MpCmdRun.exe* OR process.pe.description:Microsoft\\ Malware\\ Protection\\ Command\\ Line\\ Utility) AND (process.command_line:*DownloadFile* AND process.command_line:*url*))`"}
