{"id":"b0524451-19af-4efa-a46f-562a977f792e","created_by":"Florian Roth","name":"ShimCache Flush","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects actions that clear the local ShimCache and remove forensic evidence","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Aa][Pp][Pp][Hh][Ee][Ll][Pp]\\.[Dd][Ll][Ll].*/ AND process.command_line:(/.*[Ss][Hh][Ii][Mm][Ff][Ll][Uu][Ss][Hh][Cc][Aa][Cc][Hh][Ee].*/ OR /.*#250.*/)) OR (process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Kk][Ee][Rr][Nn][Ee][Ll]32\\.[Dd][Ll][Ll].*/ AND process.command_line:(/.*[Bb][Aa][Ss][Ee][Ff][Ll][Uu][Ss][Hh][Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Cc][Aa][Cc][Hh][Ee].*/ OR /.*#46.*/)))","rule_id":"b0524451-19af-4efa-a46f-562a977f792e","timestamp_override":"event.ingested","references":["https://medium.com/@blueteamops/shimcache-flush-89daff28d15e"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*rundll32* AND process.command_line:*apphelp.dll* AND process.command_line:(*ShimFlushCache* OR *#250*)) OR (process.command_line:*rundll32* AND process.command_line:*kernel32.dll* AND process.command_line:(*BaseFlushAppcompatCache* OR *#46*)))`"}
