{"id":"1cfac73c-be78-4f9a-9b08-5bde0c3953ab","created_by":"Florian Roth, frack113","name":"Operation Wocao Activity","tags":["attack.discovery","attack.t1012","attack.defense_evasion","attack.t1036.004","attack.t1027","attack.execution","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects activity mentioned in Operation Wocao report","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrators that use checkadmin.exe tool to enumerate local administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Cc][Hh][Ee][Cc][Kk][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]\\ 127\\.0\\.0\\.1\\ \\-[Aa][Ll][Ll].*/ OR /.*[Nn][Ee][Tt][Ss][Hh]\\ [Aa][Dd][Vv][Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll]\\ [Aa][Dd][Dd]\\ [Rr][Uu][Ll][Ee]\\ [Nn][Aa][Mm][Ee]\\=[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ [Dd][Ii][Rr]\\=[Ii][Nn].*/ OR /.*[Cc][Mm][Dd]\\ \\/[Cc]\\ [Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ \\-[Ff][Ii][Ll][Ee]\\ [Cc]\\:\\\\[Ss]\\.[Pp][Ss]1.*/ OR /.*\\/[Tt][Nn]\\ [Ww][Ii][Nn]32[Tt][Ii][Mm][Ee][Ss]\\ \\/[Ff].*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee]\\ [Ww][Ii][Nn]32[Tt][Ii][Mm][Ee][Ss]\\ [Bb][Ii][Nn][Pp][Aa][Tt][Hh]\\=.*/ OR /.*\\\\[Cc]$\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ee][Vv][Mm][Gg][Rr]\\.[Dd][Ll][Ll].*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ \\-[Ee][Nn][Cc]\\ [Jj][Gg][Aa][Gg].*/ OR /.*[Tt][Yy][Pp][Ee]\\ .*[Kk][Ee][Ee][Pp][Aa][Ss][Ss]\\\\[Kk][Ee][Ee][Pp][Aa][Ss][Ss]\\.[Cc][Oo][Nn][Ff][Ii][Gg]\\.[Xx][Mm][Ll].*/ OR /.*[Ii][Ii][Ee]\\.[Ee][Xx][Ee]\\ [Ii][Ii][Ee]\\.[Tt][Xx][Tt].*/ OR /.*[Rr][Ee][Gg]\\ [Qq][Uu][Ee][Rr][Yy]\\ [Hh][Kk][Ee][Yy]_[Cc][Uu][Rr][Rr][Ee][Nn][Tt]_[Uu][Ss][Ee][Rr]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\.*\\\\[Pp][Uu][Tt][Tt][Yy]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]\\\\.*/)","rule_id":"1cfac73c-be78-4f9a-9b08-5bde0c3953ab","timestamp_override":"event.ingested","references":["https://www.fox-it.com/en/news/whitepapers/operation-wocao-shining-a-light-on-one-of-chinas-hidden-hacking-groups/","https://twitter.com/SBousseaden/status/1207671369963646976"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*checkadmin.exe\\ 127.0.0.1\\ \\-all* OR *netsh\\ advfirewall\\ firewall\\ add\\ rule\\ name\\=powershell\\ dir\\=in* OR *cmd\\ \\/c\\ powershell.exe\\ \\-ep\\ bypass\\ \\-file\\ c\\:\\\\s.ps1* OR *\\/tn\\ win32times\\ \\/f* OR *create\\ win32times\\ binPath\\=* OR *\\\\c$\\\\windows\\\\system32\\\\devmgr.dll* OR *\\ \\-exec\\ bypass\\ \\-enc\\ JgAg* OR *type\\ *keepass\\\\KeePass.config.xml* OR *iie.exe\\ iie.txt* OR *reg\\ query\\ HKEY_CURRENT_USER\\\\Software\\\\*\\\\PuTTY\\\\Sessions\\\\*)`"}
