{"id":"36c5146c-d127-4f85-8e21-01bf62355d5a","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Rundll32","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Rundll32 in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\&\\&.*/ AND process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND process.command_line:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND process.command_line:(/.*[Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Cc][Oo][Mm][Ss][Pp][Ee][Cc].*/ OR /.*[Ii][Ee][Xx].*/))","rule_id":"36c5146c-d127-4f85-8e21-01bf62355d5a","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\&&* AND process.command_line:*rundll32* AND process.command_line:*shell32.dll* AND process.command_line:*shellexec_rundll* AND process.command_line:(*value* OR *invoke* OR *comspec* OR *iex*))`"}
