{"id":"af491bca-e752-4b44-9c86-df5680533dbc","created_by":"Florian Roth, omkar72, oscd.community","name":"Finger.exe Suspicious Invocation","tags":["attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects suspicious aged finger.exe tool execution often used in malware attacks nowadays","risk_score":73,"enabled":true,"severity":"high","false_positives":["Admin activity (unclear what they do nowadays with finger.exe)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Ff][Ii][Nn][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ff][Ii][Nn][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/)","rule_id":"af491bca-e752-4b44-9c86-df5680533dbc","timestamp_override":"event.ingested","references":["https://twitter.com/bigmacjpg/status/1349727699863011328?s=12","https://app.any.run/tasks/40115012-a919-4208-bfed-41e82cb3dadf/","http://hyp3rlinx.altervista.org/advisories/Windows_TCPIP_Finger_Command_C2_Channel_and_Bypassing_Security_Software.txt"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:finger.exe OR process.executable:*\\\\finger.exe)`"}
