{"id":"96036718-71cc-4027-a538-d1587e0006a7","created_by":"vburov","name":"Windows Processes Suspicious Parent Directory","tags":["attack.defense_evasion","attack.t1036.003","attack.t1036.005"],"interval":"5m","description":"Detect suspicious parent processes of well-known Windows processes","risk_score":21,"enabled":true,"severity":"low","false_positives":["Some security products seem to spawn these"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ii][Ss][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/) AND (NOT ((process.parent.executable:(/.*\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ee][Nn]\\.[Ee][Xx][Ee]/) OR process.parent.executable:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/)) OR (process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\.*/) AND process.parent.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (NOT _exists_:process.parent.executable OR process.parent.executable:\\-))))","rule_id":"96036718-71cc-4027-a538-d1587e0006a7","timestamp_override":"event.ingested","references":["https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2","https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/","https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf","https://attack.mitre.org/techniques/T1036/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\svchost.exe OR *\\\\taskhost.exe OR *\\\\lsm.exe OR *\\\\lsass.exe OR *\\\\services.exe OR *\\\\lsaiso.exe OR *\\\\csrss.exe OR *\\\\wininit.exe OR *\\\\winlogon.exe) AND (NOT ((process.parent.executable:(*\\\\SavService.exe OR *\\\\ngen.exe) OR process.parent.executable:(*\\\\System32\\\\* OR *\\\\SysWOW64\\\\*)) OR (process.parent.executable:(*\\\\Windows\\ Defender\\\\* OR *\\\\Microsoft\\ Security\\ Client\\\\*) AND process.parent.executable:*\\\\MsMpEng.exe) OR (NOT _exists_:process.parent.executable OR process.parent.executable:\\-))))`"}
