{"id":"b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c","created_by":"Florian Roth","name":"Suspicious PowerShell Encoded Command Patterns","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects PowerShell command line patterns in combincation with encoded commands that often appear in malware infection chains","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other tools that work with encoded scripts in the command line instead of script files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\-[Ee]\\ .*/ OR /.*\\ \\-[Ee][Nn]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo].*/) AND process.command_line:(/.*\\ [Jj][Aa][Bb].*/ OR /.*\\ [Ss][Uu][Vv][Yy][Ii].*/ OR /.*\\ [Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa].*/ OR /.*\\ [Aa][Ww][Vv]4[Ii].*/ OR /.*\\ [Ii][Aa][Bb].*/ OR /.*\\ [Pp][Aa][Aa].*/ OR /.*\\ [Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa].*/))","rule_id":"b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\ \\-e\\ * OR *\\ \\-en\\ * OR *\\ \\-enc\\ * OR *\\ \\-enco*) AND process.command_line:(*\\ JAB* OR *\\ SUVYI* OR *\\ SQBFAFgA* OR *\\ aWV4I* OR *\\ IAB* OR *\\ PAA* OR *\\ aQBlAHgA*))`"}
