{"id":"b2815d0d-7481-4bf0-9b6c-a4c48a94b349","created_by":"Florian Roth","name":"PowerShell Get-Process LSASS","tags":["attack.credential_access","attack.t1552.004"],"interval":"5m","description":"Detects a Get-Process command on lsass process, which is in almost all cases a sign of malicious activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:/.*[Gg][Ee][Tt]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ll][Ss][Aa][Ss][Ss].*/","rule_id":"b2815d0d-7481-4bf0-9b6c-a4c48a94b349","timestamp_override":"event.ingested","references":["https://twitter.com/PythonResponder/status/1385064506049630211"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:*Get\\-Process\\ lsass*`"}
