{"id":"bd1c6866-65fc-44b2-be51-5588fcff82b9","created_by":"pH-T","name":"Renamed Msdt.exe","tags":["attack.defense_evasion","attack.t1036.003"],"interval":"5m","description":"Detects process creation with a renamed Msdt.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.pe.original_file_name:/[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/ AND (NOT ((process.executable:/.*\\\\[Mm][Ss][Dd][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"bd1c6866-65fc-44b2-be51-5588fcff82b9","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Msdt/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.pe.original_file_name:msdt.exe AND (NOT ((process.executable:*\\\\msdt.exe))))`"}
