{"id":"e96253b8-6b3b-4f90-9e59-3b24b99cf9b4","created_by":"Florian Roth","name":"KrbRelay Hack Tool","tags":["attack.credential_access","attack.t1558.003"],"interval":"5m","description":"Detects the use of KrbRelay, a Kerberos relaying tool","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Kk][Rr][Bb][Rr][Ee][Ll][Aa][Yy]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Kk][Rr][Bb][Rr][Ee][Ll][Aa][Yy]\\.[Ee][Xx][Ee]/ OR (process.command_line:/.*\\ \\-[Ss][Pp][Nn]\\ .*/ AND process.command_line:/.*\\ \\-[Cc][Ll][Ss][Ii][Dd]\\ .*/ AND process.command_line:/.*\\ \\-[Rr][Bb][Cc][Dd]\\ .*/) OR (process.command_line:/.*[Ss][Hh][Aa][Dd][Oo][Ww][Cc][Rr][Ee][Dd].*/ AND process.command_line:/.*[Cc][Ll][Ss][Ii][Dd].*/ AND process.command_line:/.*[Ss][Pp][Nn].*/) OR (process.command_line:/.*[Ss][Pp][Nn]\\ .*/ AND process.command_line:/.*[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ .*/ AND process.command_line:/.*[Cc][Ll][Ss][Ii][Dd]\\ .*/))","rule_id":"e96253b8-6b3b-4f90-9e59-3b24b99cf9b4","timestamp_override":"event.ingested","references":["https://github.com/cube0x0/KrbRelay"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\KrbRelay.exe OR process.pe.original_file_name:KrbRelay.exe OR (process.command_line:*\\ \\-spn\\ * AND process.command_line:*\\ \\-clsid\\ * AND process.command_line:*\\ \\-rbcd\\ *) OR (process.command_line:*shadowcred* AND process.command_line:*clsid* AND process.command_line:*spn*) OR (process.command_line:*spn\\ * AND process.command_line:*session\\ * AND process.command_line:*clsid\\ *))`"}
