{"id":"7b49c990-4a9a-4e65-ba95-47c9cc448f6e","created_by":"Florian Roth, wagga","name":"Lazarus Loaders","tags":["attack.g0032","attack.execution","attack.t1059"],"interval":"5m","description":"Detects different loaders as described in various threat reports on Lazarus group activity","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ .*/ AND process.command_line:/.*\\ \\-[Pp]\\ 0[Xx].*/ AND process.command_line:(/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*[Cc]\\:\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr]\\\\.*/)) OR (process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]\\ .*/ AND process.command_line:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ AND process.command_line:(/.*\\.[Bb][Ii][Nn],.*/ OR /.*\\.[Tt][Mm][Pp],.*/ OR /.*\\.[Dd][Aa][Tt],.*/ OR /.*\\.[Ii][Oo],.*/ OR /.*\\.[Ii][Nn][Ii],.*/ OR /.*\\.[Dd][Bb],.*/)))","rule_id":"7b49c990-4a9a-4e65-ba95-47c9cc448f6e","timestamp_override":"event.ingested","references":["https://www.hvs-consulting.de/lazarus-report/","https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*cmd.exe\\ \\/c\\ * AND process.command_line:*\\ \\-p\\ 0x* AND process.command_line:(*C\\:\\\\ProgramData\\\\* OR *C\\:\\\\RECYCLER\\\\*)) OR (process.command_line:*rundll32.exe\\ * AND process.command_line:*C\\:\\\\ProgramData\\\\* AND process.command_line:(*.bin,* OR *.tmp,* OR *.dat,* OR *.io,* OR *.ini,* OR *.db,*)))`"}
