{"id":"e5b33f7d-eb93-48b6-9851-09e1e610b6d7","created_by":"Florian Roth","name":"WerFault Accassing LSASS","tags":["attack.credential_access","attack.t1003.001","attack.s0002"],"interval":"5m","description":"Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Actual failures in lsass.exe that trigger a crash dump (unlikely)","Unknown cases in which WerFault accesses lsass.exe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]1[Ff][Ff][Ff][Ff][Ff]/)","rule_id":"e5b33f7d-eb93-48b6-9851-09e1e610b6d7","timestamp_override":"event.ingested","references":["https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\WerFault.exe AND winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:0x1FFFFF)`"}
