{"id":"f0ca6c24-3225-47d5-b1f5-352bf07ecfa7","created_by":"Florian Roth","name":"DefenderCheck Usage","tags":["attack.defense_evasion","attack.t1027.005"],"interval":"5m","description":"Detects the use of DefenderCheck, a tool to evaluate the signatures used in Microsoft Defender. It can be used to figure out the strings / byte chains used in Microsoft Defender to detect a tool and thus used for AV evasion.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr][Cc][Hh][Ee][Cc][Kk]\\.[Ee][Xx][Ee]/ OR process.pe.description:/[Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr][Cc][Hh][Ee][Cc][Kk]/)","rule_id":"f0ca6c24-3225-47d5-b1f5-352bf07ecfa7","timestamp_override":"event.ingested","references":["https://github.com/matterpreter/DefenderCheck"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\DefenderCheck.exe OR process.pe.description:DefenderCheck)`"}
