{"id":"89a9a0e0-f61a-42e5-8957-b1479565a658","created_by":"Christian Burkard","name":"UAC Bypass WSReset","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ww][Ss][Rr][Ee][Ss][Ee][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/))","rule_id":"89a9a0e0-f61a-42e5-8957-b1479565a658","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Wsreset/","https://github.com/hfiref0x/UACME","https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\wsreset.exe AND winlog.event_data.IntegrityLevel:(High OR System))`"}
