{"id":"1012f107-b8f1-4271-af30-5aed2de89b39","created_by":"Florian Roth","name":"Terminal Service Process Spawn","tags":["attack.initial_access","attack.t1190","attack.lateral_movement","attack.t1210","car.2013-07-002"],"interval":"5m","description":"Detects a process spawned by the terminal service server process (this could be an indicator for an exploitation of CVE-2019-0708)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.command_line:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ AND process.parent.command_line:/.*[Tt][Ee][Rr][Mm][Ss][Vv][Cc][Ss].*/) AND (NOT (process.executable:(/.*\\\\[Rr][Dd][Pp][Cc][Ll][Ii][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"1012f107-b8f1-4271-af30-5aed2de89b39","timestamp_override":"event.ingested","references":["https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.command_line:*\\\\svchost.exe* AND process.parent.command_line:*termsvcs*) AND (NOT (process.executable:(*\\\\rdpclip.exe OR *\\:\\\\Windows\\\\System32\\\\csrss.exe OR *\\:\\\\Windows\\\\System32\\\\wininit.exe))))`"}
