{"id":"23250293-eed5-4c39-b57a-841c8933a57d","created_by":"frack113","name":"Cscript Visual Basic Script Execution","tags":["attack.execution","attack.t1059.005"],"interval":"5m","description":"Adversaries may abuse Visual Basic (VB) for execution","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Vv][Bb][Ss].*/)","rule_id":"23250293-eed5-4c39-b57a-841c8933a57d","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.005/T1059.005.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\cscript.exe AND process.command_line:*.vbs*)`"}
