{"id":"9494479d-d994-40bf-a8b1-eea890237021","created_by":"Florian Roth","name":"Suspicious Add Scheduled Task Parent","tags":["attack.execution","attack.t1053.005"],"interval":"5m","description":"Detects suspicious scheduled task creations from a parent stored in a temporary folder","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Software installers that run from temporary folders and also install scheduled tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ AND process.parent.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/)) AND (NOT ((process.command_line:(/.*[Uu][Pp][Dd][Aa][Tt][Ee]_[Tt][Aa][Ss][Kk]\\.[Xx][Mm][Ll].*/ OR /.*[Uu][Nn][Aa][Tt][Tt][Ee][Nn][Dd][Ee][Dd]\\.[Ii][Nn][Ii].*/)))))","rule_id":"9494479d-d994-40bf-a8b1-eea890237021","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/649e7b46-9bec-4d05-98a5-dfa9a13eaae5/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create\\ * AND process.parent.executable:(*\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\Roaming\\\\* OR *\\\\Temporary\\ Internet* OR *\\\\Users\\\\Public\\\\*)) AND (NOT ((process.command_line:(*update_task.xml* OR *unattended.ini*)))))`"}
