{"id":"60f16a96-db70-42eb-8f76-16763e333590","created_by":"Beyu Denis, oscd.community, Nasreddine Bencherchali (update)","name":"Application Whitelisting Bypass via Dxcap.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects execution of of Dxcap.exe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate execution of dxcap.exe by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Xx][Cc][Aa][Pp]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Dd][Xx][Cc][Aa][Pp]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ \\-[Cc]\\ .*/)","rule_id":"60f16a96-db70-42eb-8f76-16763e333590","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dxcap/","https://twitter.com/harr0ey/status/992008180904419328"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\DXCap.exe OR process.pe.original_file_name:DXCap.exe) AND process.command_line:*\\ \\-c\\ *)`"}
