{"id":"50919691-7302-437f-8e10-1fe088afa145","created_by":"Florian Roth","name":"Regsvr32 Command Line Without DLL","tags":["attack.defense_evasion","attack.t1574","attack.execution"],"interval":"5m","description":"Detects a regsvr.exe execution that doesn't contain a DLL in the command line","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:(/.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Oo][Cc][Xx].*/ OR /.*\\.[Cc][Pp][Ll].*/ OR /.*\\.[Aa][Xx].*/ OR /.*\\.[Bb][Aa][Vv].*/ OR /.*\\.[Pp][Pp][Ll].*/)))) AND (NOT (NOT _exists_:process.command_line))) AND (NOT (process.command_line:\"\")))","rule_id":"50919691-7302-437f-8e10-1fe088afa145","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\regsvr32.exe AND (NOT (process.command_line:(*.dll* OR *.ocx* OR *.cpl* OR *.ax* OR *.bav* OR *.ppl*)))) AND (NOT (NOT _exists_:process.command_line))) AND (NOT (process.command_line:\"\")))`"}
