{"id":"193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1","created_by":"Christian Burkard","name":"Xwizard DLL Sideloading","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects the execution of Xwizard tool from the non-default directory which can be used to sideload a custom xwizards.dll","risk_score":73,"enabled":true,"severity":"high","false_positives":["Windows installed on non-C drive"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Xx][Ww][Ii][Zz][Aa][Rr][Dd]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/)))","rule_id":"193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Xwizard/","http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\xwizard.exe AND (NOT (process.executable:C\\:\\\\Windows\\\\System32\\\\*)))`"}
