{"id":"f376c8a7-a2d0-4ddc-aa0c-16c17236d962","created_by":"Florian Roth","name":"Bloodhound and Sharphound Hack Tool","tags":["attack.discovery","attack.t1087.001","attack.t1087.002","attack.t1482","attack.t1069.001","attack.t1069.002","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects command line parameters used by Bloodhound and Sharphound hack tools","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other programs that use these command line option and accepts an 'All' parameter"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Bb][Ll][Oo][Oo][Dd][Hh][Oo][Uu][Nn][Dd]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd]\\.[Ee][Xx][Ee].*/) OR process.command_line:(/.*\\ \\-[Cc][Oo][Ll][Ll][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Ee][Tt][Hh][Oo][Dd]\\ [Aa][Ll][Ll]\\ .*/ OR /.*\\ \\-\\-[Cc][Oo][Ll][Ll][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Ee][Tt][Hh][Oo][Dd][Ss]\\ [Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ .*/ OR /.*\\ \\-\\-[Ll][Oo][Oo][Pp]\\ \\-\\-[Ll][Oo][Oo][Pp][Dd][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\ .*/ OR /.*\\ \\-\\-[Pp][Oo][Rr][Tt][Ss][Cc][Aa][Nn][Tt][Ii][Mm][Ee][Oo][Uu][Tt]\\ .*/ OR /.*\\.[Ee][Xx][Ee]\\ \\-[Cc]\\ [Aa][Ll][Ll]\\ \\-[Dd]\\ .*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Bb][Ll][Oo][Oo][Dd][Hh][Oo][Uu][Nn][Dd].*/ OR /.*[Gg][Ee][Tt]\\-[Bb][Ll][Oo][Oo][Dd][Hh][Oo][Uu][Nn][Dd][Dd][Aa][Tt][Aa].*/) OR (process.command_line:/.*\\ \\-[Jj][Ss][Oo][Nn][Ff][Oo][Ll][Dd][Ee][Rr]\\ .*/ AND process.command_line:/.*\\ \\-[Zz][Ii][Pp][Ff][Ii][Ll][Ee][Nn][Aa][Mm][Ee]\\ .*/) OR (process.command_line:/.*\\ [Dd][Cc][Oo][Nn][Ll][Yy]\\ .*/ AND process.command_line:/.*\\ \\-\\-[Nn][Oo][Ss][Aa][Vv][Ee][Cc][Aa][Cc][Hh][Ee]\\ .*/) OR (process.pe.product:/.*[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd].*/ OR process.pe.description:/.*[Ss][Hh][Aa][Rr][Pp][Hh][Oo][Uu][Nn][Dd].*/ OR process.pe.company:(/.*[Ss][Pp][Ee][Cc][Tt][Ee][Rr][Oo][Pp][Ss].*/ OR /.*[Ee][Vv][Ii][Ll]\\ [Cc][Oo][Rr][Pp].*/)))","rule_id":"f376c8a7-a2d0-4ddc-aa0c-16c17236d962","timestamp_override":"event.ingested","references":["https://github.com/BloodHoundAD/BloodHound","https://github.com/BloodHoundAD/SharpHound"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\Bloodhound.exe* OR *\\\\SharpHound.exe*) OR process.command_line:(*\\ \\-CollectionMethod\\ All\\ * OR *\\ \\-\\-CollectionMethods\\ Session\\ * OR *\\ \\-\\-Loop\\ \\-\\-Loopduration\\ * OR *\\ \\-\\-PortScanTimeout\\ * OR *.exe\\ \\-c\\ All\\ \\-d\\ * OR *Invoke\\-Bloodhound* OR *Get\\-BloodHoundData*) OR (process.command_line:*\\ \\-JsonFolder\\ * AND process.command_line:*\\ \\-ZipFileName\\ *) OR (process.command_line:*\\ DCOnly\\ * AND process.command_line:*\\ \\-\\-NoSaveCache\\ *) OR (process.pe.product:*SharpHound* OR process.pe.description:*SharpHound* OR process.pe.company:(*SpecterOps* OR *evil\\ corp*)))`"}
