{"id":"a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2","created_by":"Florian Roth","name":"Renamed PsExec","tags":["car.2013-05-009","attack.defense_evasion","attack.t1036.003"],"interval":"5m","description":"Detects the execution of a renamed PsExec often used by attackers or malware","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software that illegaly integrates PsExec in a renamed form","Administrators that have renamed PsExec and no one knows why"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.description:/[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ee][Ss]\\ [Rr][Ee][Mm][Oo][Tt][Ee][Ll][Yy]/ AND process.pe.product:/[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss]\\ [Pp][Ss][Ee][Xx][Ee][Cc]/) AND (NOT (process.executable:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]64\\.[Ee][Xx][Ee]/))))","rule_id":"a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.description:Execute\\ processes\\ remotely AND process.pe.product:Sysinternals\\ PsExec) AND (NOT (process.executable:(*\\\\PsExec.exe OR *\\\\PsExec64.exe))))`"}
