{"id":"89f75308-5b1b-4390-b2d8-d6b2340efaf8","created_by":"frack113","name":"Wbadmin Delete Systemstatebackup","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Deletes the Windows systemstatebackup using wbadmin.exe.\nThis technique is used by numerous ransomware families.\nThis may only be successful on server platforms that have Windows Backup enabled.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ww][Bb][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR process.command_line:/.*[Ww][Bb][Aa][Dd][Mm][Ii][Nn].*/) AND (process.command_line:/.*[Dd][Ee][Ll][Ee][Tt][Ee]\\ .*/ AND process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Tt][Aa][Tt][Ee][Bb][Aa][Cc][Kk][Uu][Pp]\\ .*/ AND process.command_line:/.*\\-[Kk][Ee][Ee][Pp][Vv][Ee][Rr][Ss][Ii][Oo][Nn][Ss]\\:0.*/))","rule_id":"89f75308-5b1b-4390-b2d8-d6b2340efaf8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\wbadmin.exe OR process.command_line:*wbadmin*) AND (process.command_line:*delete\\ * AND process.command_line:*systemstatebackup\\ * AND process.command_line:*\\-keepVersions\\:0*))`"}
