{"id":"01c42d3c-242d-4655-85b2-34f1739632f7","created_by":"Nasreddine Bencherchali","name":"Abusing Permissions Using Dsacls","tags":["attack.execution","attack.t1218"],"interval":"5m","description":"Detects usage of Dsacls to grant over permissive permissions","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrators granting over permissive permissions to users"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Dd][Ss][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Dd][Ss][Aa][Cc][Ll][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ \\/[Gg]\\ .*/ AND process.command_line:(/.*[Gg][Rr].*/ OR /.*[Gg][Ee].*/ OR /.*[Gg][Ww].*/ OR /.*[Gg][Aa].*/ OR /.*[Ww][Pp].*/ OR /.*[Ww][Dd].*/))","rule_id":"01c42d3c-242d-4655-85b2-34f1739632f7","timestamp_override":"event.ingested","references":["https://ss64.com/nt/dsacls.html","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\dsacls.exe OR process.pe.original_file_name:DSACLS.EXE) AND process.command_line:*\\ \\/G\\ * AND process.command_line:(*GR* OR *GE* OR *GW* OR *GA* OR *WP* OR *WD*))`"}
