{"id":"242301bc-f92f-4476-8718-78004a6efd9f","created_by":"Austin Songer @austinsonger","name":"Suspicious Load DLL via CertOC.exe","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects when a user installs certificates by using CertOC.exe to loads the target DLL file.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Oo][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Cc][Ee][Rr][Tt][Oo][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\-[Ll][Oo][Aa][Dd][Dd][Ll][Ll].*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/))","rule_id":"242301bc-f92f-4476-8718-78004a6efd9f","timestamp_override":"event.ingested","references":["https://twitter.com/sblmsrsn/status/1445758411803480072?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\certoc.exe OR process.pe.original_file_name:CertOC.exe) AND (process.command_line:*\\-LoadDLL* AND process.command_line:*.dll*))`"}
