{"id":"a6a39bdb-935c-4f0a-ab77-35f4bbf44d33","created_by":"Florian Roth, Max Altgelt","name":"Suspicious Script Execution From Temp Folder","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects a suspicious script executions from temporary folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Tt][Ee][Mm][Pp].*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*%[Tt][Mm][Pp]%.*/ OR /.*%[Ll][Oo][Cc][Aa][Ll][Aa][Pp][Pp][Dd][Aa][Tt][Aa]%\\\\[Tt][Ee][Mm][Pp].*/)) AND (NOT (process.command_line:(/.*\\ \\>.*/ OR /.*[Oo][Uu][Tt]\\-[Ff][Ii][Ll][Ee].*/ OR /.*[Cc][Oo][Nn][Vv][Ee][Rr][Tt][Tt][Oo]\\-[Jj][Ss][Oo][Nn].*/ OR /.*\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ \\-[Vv][Ee][Rr][Bb]\\ [Rr][Uu][Nn][Aa][Ss].*/))))","rule_id":"a6a39bdb-935c-4f0a-ab77-35f4bbf44d33","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\mshta.exe OR *\\\\wscript.exe OR *\\\\cscript.exe) AND process.command_line:(*\\\\Windows\\\\Temp* OR *\\\\Temporary\\ Internet* OR *\\\\AppData\\\\Local\\\\Temp* OR *\\\\AppData\\\\Roaming\\\\Temp* OR *%TEMP%* OR *%TMP%* OR *%LocalAppData%\\\\Temp*)) AND (NOT (process.command_line:(*\\ >* OR *Out\\-File* OR *ConvertTo\\-Json* OR *\\-WindowStyle\\ hidden\\ \\-Verb\\ runAs*))))`"}
