{"id":"bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0","created_by":"Florian Roth, Tim Shelton","name":"BlueMashroom DLL Load","tags":["attack.defense_evasion","attack.t1218.010"],"interval":"5m","description":"Detects a suspicious DLL loading from AppData Local path as described in BlueMashroom report","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.command_line:/.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/) OR (process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ AND process.command_line:/.*,[Dd][Ll][Ll][Ee][Nn][Tt][Rr][Yy].*/)) AND (NOT ((process.command_line:/.*[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss][Mm][Ee][Ee][Tt][Ii][Nn][Gg][Aa][Dd][Dd][Ii][Nn]\\\\.*/ OR process.command_line:(/.*\\\\[Xx]86\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Tt][Ee][Aa][Mm][Ss]\\.[Aa][Dd][Dd][Ii][Nn][Ll][Oo][Aa][Dd][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx]86\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Tt][Ee][Aa][Mm][Ss]\\.[Aa][Dd][Dd][Ii][Nn][Ll][Oo][Aa][Dd][Ee][Rr]\\.[Dd][Ll][Ll]\\\"/ OR /.*\\\\[Xx]64\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Tt][Ee][Aa][Mm][Ss]\\.[Aa][Dd][Dd][Ii][Nn][Ll][Oo][Aa][Dd][Ee][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Xx]64\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Tt][Ee][Aa][Mm][Ss]\\.[Aa][Dd][Dd][Ii][Nn][Ll][Oo][Aa][Dd][Ee][Rr]\\.[Dd][Ll][Ll]\\\"/)) OR (process.command_line:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx]64\\\\[Mm][Ee][Ee][Tt][Ii][Nn][Gg][Ss]\\\\[Aa][Tt][Uu][Cc][Ff][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/))))","rule_id":"bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0","timestamp_override":"event.ingested","references":["https://www.virusbulletin.com/conference/vb2019/abstracts/apt-cases-exploiting-vulnerabilities-region-specific-software"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.command_line:*\\\\regsvr32* AND process.command_line:*\\\\AppData\\\\Local\\\\*) OR (process.command_line:*\\\\AppData\\\\Local\\\\* AND process.command_line:*,DllEntry*)) AND (NOT ((process.command_line:*AppData\\\\Local\\\\Microsoft\\\\TeamsMeetingAddin\\\\* OR process.command_line:(*\\\\x86\\\\Microsoft.Teams.AddinLoader.dll OR *\\\\x86\\\\Microsoft.Teams.AddinLoader.dll\\\" OR *\\\\x64\\\\Microsoft.Teams.AddinLoader.dll OR *\\\\x64\\\\Microsoft.Teams.AddinLoader.dll\\\")) OR (process.command_line:*\\\\AppData\\\\Local\\\\WebEx\\\\WebEx64\\\\Meetings\\\\atucfobj.dll))))`"}
