{"id":"0685b176-c816-4837-8e7b-1216f346636b","created_by":"Nasreddine Bencherchali","name":"Quarks PwDump Usage","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects usage of the Quarks PwDump tool via commandline arguments","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Qq][Uu][Aa][Rr][Kk][Ss][Pp][Ww][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR process.command_line:(/\\ \\-[Dd][Hh][Ll]/ OR /\\ \\-\\-[Dd][Uu][Mm][Pp]\\-[Hh][Aa][Ss][Hh]\\-[Ll][Oo][Cc][Aa][Ll]/ OR /\\ \\-[Dd][Hh][Dd][Cc]/ OR /\\ \\-\\-[Dd][Uu][Mm][Pp]\\-[Hh][Aa][Ss][Hh]\\-[Dd][Oo][Mm][Aa][Ii][Nn]\\-[Cc][Aa][Cc][Hh][Ee][Dd]/ OR /\\ \\-\\-[Dd][Uu][Mm][Pp]\\-[Bb][Ii][Tt][Ll][Oo][Cc][Kk][Ee][Rr]/ OR /\\ \\-[Dd][Hh][Dd]\\ / OR /\\ \\-\\-[Dd][Uu][Mm][Pp]\\-[Hh][Aa][Ss][Hh]\\-[Dd][Oo][Mm][Aa][Ii][Nn]\\ / OR /\\-\\-[Nn][Tt][Dd][Ss]\\-[Ff][Ii][Ll][Ee]/))","rule_id":"0685b176-c816-4837-8e7b-1216f346636b","timestamp_override":"event.ingested","references":["https://github.com/quarkslab/quarkspwdump","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\QuarksPwDump.exe OR process.command_line:(\\ \\-dhl OR \\ \\-\\-dump\\-hash\\-local OR \\ \\-dhdc OR \\ \\-\\-dump\\-hash\\-domain\\-cached OR \\ \\-\\-dump\\-bitlocker OR \\ \\-dhd\\  OR \\ \\-\\-dump\\-hash\\-domain\\  OR \\-\\-ntds\\-file))`"}
