{"id":"d9367cbb-c2e0-47ce-bdc0-128cb6da898d","created_by":"Florian Roth","name":"SharpLdapWhoami","tags":["attack.discovery","attack.t1033","car.2016-03-001"],"interval":"5m","description":"Detects SharpLdapWhoami, a whoami alternative by asking the LDAP service on a domain controller","risk_score":73,"enabled":true,"severity":"high","false_positives":["Programs that use the same command line flags"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Hh][Aa][Rr][Pp][Ll][Dd][Aa][Pp][Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/.*[Ss][Hh][Aa][Rr][Pp][Ll][Dd][Aa][Pp][Ww][Hh][Oo][Aa][Mm][Ii].*/ OR process.pe.product:/[Ss][Hh][Aa][Rr][Pp][Ll][Dd][Aa][Pp][Ww][Hh][Oo][Aa][Mm][Ii]/ OR process.command_line:(/.*\\ \\/[Mm][Ee][Tt][Hh][Oo][Dd]\\:[Nn][Tt][Ll][Mm]/ OR /.*\\ \\/[Mm][Ee][Tt][Hh][Oo][Dd]\\:[Kk][Ee][Rr][Bb]/ OR /.*\\ \\/[Mm][Ee][Tt][Hh][Oo][Dd]\\:[Nn][Ee][Gg][Oo]/ OR /.*\\ \\/[Mm]\\:[Nn][Ee][Gg][Oo]/ OR /.*\\ \\/[Mm]\\:[Nn][Tt][Ll][Mm]/ OR /.*\\ \\/[Mm]\\:[Kk][Ee][Rr][Bb]/))","rule_id":"d9367cbb-c2e0-47ce-bdc0-128cb6da898d","timestamp_override":"event.ingested","references":["https://github.com/bugch3ck/SharpLdapWhoami"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SharpLdapWhoami.exe OR process.pe.original_file_name:*SharpLdapWhoami* OR process.pe.product:SharpLdapWhoami OR process.command_line:(*\\ \\/method\\:ntlm OR *\\ \\/method\\:kerb OR *\\ \\/method\\:nego OR *\\ \\/m\\:nego OR *\\ \\/m\\:ntlm OR *\\ \\/m\\:kerb))`"}
