{"id":"cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6","created_by":"Beyu Denis, oscd.community (rule), @_felamos (idea)","name":"Devtoolslauncher.exe Executes Specified Binary","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"The Devtoolslauncher.exe executes other binary","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of devtoolslauncher.exe by legitimate user"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Ee][Vv][Tt][Oo][Oo][Ll][Ss][Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ll][Aa][Uu][Nn][Cc][Hh][Ff][Oo][Rr][Dd][Ee][Pp][Ll][Oo][Yy].*/)","rule_id":"cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devtoolslauncher/","https://twitter.com/_felamos/status/1179811992841797632"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\devtoolslauncher.exe AND process.command_line:*LaunchForDeploy*)`"}
