{"id":"45a594aa-1fbd-4972-a809-ff5a99dd81b8","created_by":"Sergey Soldatov, Kaspersky Lab, oscd.community","name":"Run PowerShell Script from ADS","tags":["attack.defense_evasion","attack.t1564.004"],"interval":"5m","description":"Detects PowerShell script execution from Alternate Data Stream (ADS)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Gg][Ee][Tt]\\-[Cc][Oo][Nn][Tt][Ee][Nn][Tt].*/ AND process.command_line:/.*\\-[Ss][Tt][Rr][Ee][Aa][Mm].*/)","rule_id":"45a594aa-1fbd-4972-a809-ff5a99dd81b8","timestamp_override":"event.ingested","references":["https://github.com/p0shkatz/Get-ADS/blob/1c3a3562e713c254edce1995a7d9879c687c7473/Get-ADS.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Get\\-Content* AND process.command_line:*\\-Stream*)`"}
