{"id":"1ec65a5f-9473-4f12-97da-622044d6df21","created_by":"Florian Roth","name":"Powershell Defender Disable Scan Feature","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects requests to disable Microsoft Defender features using PowerShell commands","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible Admin Activity","Other Cmdlets that may use the same parameters"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:(/.*[Aa][Dd][Dd]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee]\\ .*/ OR /.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee]\\ .*/) AND process.command_line:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ .*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ .*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ .*/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]\\ .*/) AND process.command_line:(/.*$[Tt][Rr][Uu][Ee].*/ OR /.*\\ 1\\ .*/)) OR (process.command_line:(/.*[Rr][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Vv][Jj][Ll][Yy][Ww][Xx]0[Aa][Ww]1[Ll][Tt][Ww]9[Uu][Aa][Xx][Rr][Vv][Cc][Mm][Ll][Uu][Zz][Yy].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Ss][Zz][Ww][Ff][Ss][Dd][Gg][Ll][Tt][Zz][Uu]1[Vv][Bb][Mm][Ll]0[Bb]3[Jj][Pp][Bb][Mm][Cc][Gg].*/ OR /.*[Ee][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Uu][Mm][Vv][Hh][Bb][Hh][Rr][Pp][Bb][Ww][Vv][Nn][Bb]25[Pp][Dd][Gg]9[Yy][Aa][Ww]5[Nn][Ii].*/ OR /.*[Rr][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Uu][Ll][Pp][Qq][Vv][Zz][Qq][Cc][Mm]90[Zz][Ww][Nn]0[Aa][Ww]9[Uu][Ii].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Jj][Tt]0[Ff][Ww][Uu][Hh][Jj][Vv][Dd][Gg][Vv][Jj][Dd][Gg][Ll][Vv][Bb][Ii].*/ OR /.*[Ee][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Ss][Uu]9[Bb][Vv][Ll][Bb][Yy][Bb]3[Rr][Ll][Yy]3[Rr][Pp][Bb]24[Gg].*/ OR /.*[Rr][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Uu][Jj][Ll][Aa][Gg][Ff]2[Aa][Ww]9[Yy][Tt][Ww]9[Uu][Aa][Xx][Rr][Vv][Cc][Mm][Ll][Uu][Zz][Yy].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Cc][Zz][Ww][Hh][Hh][Dd][Mm][Ll][Vv][Cc][Kk]1[Vv][Bb][Mm][Ll]0[Bb]3[Jj][Pp][Bb][Mm][Cc][Gg].*/ OR /.*[Ee][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Qq][Mm][Vv][Oo][Yy][Xx][Zz][Pp][Bb]3[Jj][Nn][Bb]25[Pp][Dd][Gg]9[Yy][Aa][Ww]5[Nn][Ii].*/ OR /.*[Rr][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Uu][Jj][Ss][Bb]2[Nn][Rr][Qq][Xx][Rr][Gg][Aa][Xx][Jj][Zz][Dd][Ff][Nn][Ll][Zz][Ww]4[Gg].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Cc][Bb][Gg]9[Jj][Aa]0[Ff]0[Rr][Mm][Ll][Yy][Cc]3[Rr][Tt][Zz][Ww][Vv][Uu][Ii].*/ OR /.*[Ee][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Qq][Mm][Xx][Vv][Yy]2[Tt][Bb][Dd][Ee][Zz][Pp][Cc][Nn][Nn]0[Uu]2[Vv][Ll][Bb][Ii].*/ OR /.*[Zz][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Xx][Jj][Ll][Yy][Ww][Xx]0[Aa][Ww]1[Ll][Bb][Ww]9[Uu][Aa][Xx][Rr][Vv][Cc][Mm][Ll][Uu][Zz][Yy].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Yy][Zz][Ww][Ff][Ss][Dd][Gg][Ll][Tt][Zz][Ww]1[Vv][Bb][Mm][Ll]0[Bb]3[Jj][Pp][Bb][Mm][Cc][Gg].*/ OR /.*[Kk][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Cc][Mm][Vv][Hh][Bb][Hh][Rr][Pp][Bb][Ww][Vv][Tt][Bb]25[Pp][Dd][Gg]9[Yy][Aa][Ww]5[Nn][Ii].*/ OR /.*[Zz][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Ww][Ll][Vv][Yy][Xx][Zz][Ww][Cc][Mm]90[Zz][Ww][Nn]0[Aa][Ww]9[Uu][Ii].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Pp][Bb]2[Ff]2[Cc][Hh][Jj][Vv][Dd][Gg][Vv][Jj][Dd][Gg][Ll][Vv][Bb][Ii].*/ OR /.*[Kk][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Aa][Ww]9[Hh][Dd][Nn][Bb][Yy][Bb]3[Rr][Ll][Yy]3[Rr][Pp][Bb]24[Gg].*/ OR /.*[Zz][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Ww][Jj][Ll][Aa][Gg][Ff]2[Aa][Ww]9[Yy][Bb][Ww]9[Uu][Aa][Xx][Rr][Vv][Cc][Mm][Ll][Uu][Zz][Yy].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Ii][Zz][Ww][Hh][Hh][Dd][Mm][Ll][Vv][Cc][Mm]1[Vv][Bb][Mm][Ll]0[Bb]3[Jj][Pp][Bb][Mm][Cc][Gg].*/ OR /.*[Kk][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Yy][Mm][Vv][Oo][Yy][Xx][Zz][Pp][Bb]3[Jj][Tt][Bb]25[Pp][Dd][Gg]9[Yy][Aa][Ww]5[Nn][Ii].*/ OR /.*[Zz][Gg][Ll][Zz][Yy][Ww][Jj][Ss][Zz][Ww][Jj][Ss][Bb]2[Nn][Rr][Yy][Xx][Rr][Mm][Aa][Xx][Jj][Zz][Dd][Hh][Nn][Ll][Zz][Ww]4[Gg].*/ OR /.*[Rr][Pp][Cc]2[Ff][Ii][Bb][Gg][Vv][Ii][Bb][Gg]9[Jj][Aa]2[Ff]0[Zz][Mm][Ll][Yy][Cc]3[Rr][Zz][Zz][Ww][Vv][Uu][Ii].*/ OR /.*[Kk][Aa][Xx][Nn][Hh][Yy][Mm][Xx][Ll][Yy][Mm][Xx][Vv][Yy]2[Tt][Hh][Dd][Gg][Zz][Pp][Cc][Nn][Nn]0[Cc]2[Vv][Ll][Bb][Ii].*/) AND process.command_line:(/.*[Rr][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Ss][Aa][Gg][Uu][Aa][Yy][Qq][Bb][Ss][Aa][Hh][Qq][Aa][Aa][Qq][Bb][Tt][Aa][Gg][Uu][Aa][Tt][Qq][Bb][Vv][Aa][Gg]4[Aa][Aa][Qq][Bb]0[Aa][Gg]8[Aa][Cc][Gg][Bb][Pp][Aa][Gg]4[Aa][Zz][Ww][Aa][Gg][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Uu][Gg][Bb][Ll][Aa][Gg][Ee][Aa][Bb][Aa][Bb]0[Aa][Gg][Kk][Aa][Bb][Qq][Bb][Ll][Aa][Ee]0[Aa][Bb][Ww][Bb][Uu][Aa][Gg][Kk][Aa][Dd][Aa][Bb][Vv][Aa][Hh][Ii][Aa][Aa][Qq][Bb][Uu][Aa][Gg][Cc][Aa][Ii][Aa].*/ OR /.*[Ee][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Ff][Ii][Aa][Zz][Qq][Bb][Hh][Aa][Gg][Ww][Aa][Dd][Aa][Bb][Pp][Aa][Gg]0[Aa][Zz][Qq][Bb][Nn][Aa][Gg]8[Aa][Bb][Gg][Bb][Pp][Aa][Hh][Qq][Aa][Bb][Ww][Bb][Yy][Aa][Gg][Kk][Aa][Bb][Gg][Bb][Nn][Aa][Cc][Aa][Aa].*/ OR /.*[Rr][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Jj][Aa][Ee]8[Aa][Qq][Qq][Bb][Ww][Aa][Ff][Aa][Aa][Cc][Gg][Bb][Vv][Aa][Hh][Qq][Aa][Zz][Qq][Bb][Jj][Aa][Hh][Qq][Aa][Aa][Qq][Bb][Vv][Aa][Gg]4[Aa][Ii][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Ss][Qq][Bb][Pp][Aa][Ee][Ee][Aa][Vv][Gg][Bb][Qq][Aa][Hh][Ii][Aa][Bb][Ww][Bb]0[Aa][Gg][Uu][Aa][Yy][Ww][Bb]0[Aa][Gg][Kk][Aa][Bb][Ww][Bb][Uu][Aa][Cc][Aa][Aa].*/ OR /.*[Ee][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Ee][Kk][Aa][Tt][Ww][Bb][Bb][Aa][Ff][Yy][Aa][Uu][Aa][Bb][Yy][Aa][Gg]8[Aa][Dd][Aa][Bb][Ll][Aa][Gg][Mm][Aa][Dd][Aa][Bb][Pp][Aa][Gg]8[Aa][Bb][Gg][Aa][Gg][Aa].*/ OR /.*[Rr][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Cc][Aa][Gg][Uu][Aa][Aa][Aa][Bb][Hh][Aa][Hh][Yy][Aa][Aa][Qq][Bb][Vv][Aa][Hh][Ii][Aa][Tt][Qq][Bb][Vv][Aa][Gg]4[Aa][Aa][Qq][Bb]0[Aa][Gg]8[Aa][Cc][Gg][Bb][Pp][Aa][Gg]4[Aa][Zz][Ww][Aa][Gg][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Qq][Gg][Bb][Ll][Aa][Gg][Gg][Aa][Yy][Qq][Bb]2[Aa][Gg][Kk][Aa][Bb][Ww][Bb][Yy][Aa][Ee]0[Aa][Bb][Ww][Bb][Uu][Aa][Gg][Kk][Aa][Dd][Aa][Bb][Vv][Aa][Hh][Ii][Aa][Aa][Qq][Bb][Uu][Aa][Gg][Cc][Aa][Ii][Aa].*/ OR /.*[Ee][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Ee][Ii][Aa][Zz][Qq][Bb][Oo][Aa][Gg][Ee][Aa][Dd][Gg][Bb][Pp][Aa][Gg]8[Aa][Cc][Gg][Bb][Nn][Aa][Gg]8[Aa][Bb][Gg][Bb][Pp][Aa][Hh][Qq][Aa][Bb][Ww][Bb][Yy][Aa][Gg][Kk][Aa][Bb][Gg][Bb][Nn][Aa][Cc][Aa][Aa].*/ OR /.*[Rr][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Cc][Aa][Gg][Ww][Aa][Bb][Ww][Bb][Jj][Aa][Gg][Ss][Aa][Qq][Qq][Bb]0[Aa][Ee][Yy][Aa][Aa][Qq][Bb][Yy][Aa][Hh][Mm][Aa][Dd][Aa][Bb][Tt][Aa][Gg][Uu][Aa][Zz][Qq][Bb][Uu][Aa][Cc][Aa][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Qq][Gg][Bb][Ss][Aa][Gg]8[Aa][Yy][Ww][Bb][Rr][Aa][Ee][Ee][Aa][Dd][Aa][Bb][Gg][Aa][Gg][Kk][Aa][Cc][Gg][Bb][Zz][Aa][Hh][Qq][Aa][Uu][Ww][Bb][Ll][Aa][Gg][Uu][Aa][Bb][Gg][Aa][Gg][Aa].*/ OR /.*[Ee][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Ee][Ii][Aa][Bb][Aa][Bb][Vv][Aa][Gg][Mm][Aa][Aa][Ww][Bb][Bb][Aa][Hh][Qq][Aa][Rr][Gg][Bb][Pp][Aa][Hh][Ii][Aa][Cc][Ww][Bb]0[Aa][Ff][Mm][Aa][Zz][Qq][Bb][Ll][Aa][Gg]4[Aa][Ii][Aa].*/ OR /.*[Zz][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Yy][Aa][Gg][Uu][Aa][Yy][Qq][Bb][Ss][Aa][Hh][Qq][Aa][Aa][Qq][Bb][Tt][Aa][Gg][Uu][Aa][Bb][Qq][Bb][Vv][Aa][Gg]4[Aa][Aa][Qq][Bb]0[Aa][Gg]8[Aa][Cc][Gg][Bb][Pp][Aa][Gg]4[Aa][Zz][Ww][Aa][Gg][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Cc][Gg][Bb][Ll][Aa][Gg][Ee][Aa][Bb][Aa][Bb]0[Aa][Gg][Kk][Aa][Bb][Qq][Bb][Ll][Aa][Gg]0[Aa][Bb][Ww][Bb][Uu][Aa][Gg][Kk][Aa][Dd][Aa][Bb][Vv][Aa][Hh][Ii][Aa][Aa][Qq][Bb][Uu][Aa][Gg][Cc][Aa][Ii][Aa].*/ OR /.*[Kk][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Hh][Ii][Aa][Zz][Qq][Bb][Hh][Aa][Gg][Ww][Aa][Dd][Aa][Bb][Pp][Aa][Gg]0[Aa][Zz][Qq][Bb][Tt][Aa][Gg]8[Aa][Bb][Gg][Bb][Pp][Aa][Hh][Qq][Aa][Bb][Ww][Bb][Yy][Aa][Gg][Kk][Aa][Bb][Gg][Bb][Nn][Aa][Cc][Aa][Aa].*/ OR /.*[Zz][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Pp][Aa][Gg]8[Aa][Yy][Qq][Bb]2[Aa][Hh][Aa][Aa][Cc][Gg][Bb][Vv][Aa][Hh][Qq][Aa][Zz][Qq][Bb][Jj][Aa][Hh][Qq][Aa][Aa][Qq][Bb][Vv][Aa][Gg]4[Aa][Ii][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Aa][Qq][Bb][Vv][Aa][Gg][Ee][Aa][Dd][Gg][Bb][Ww][Aa][Hh][Ii][Aa][Bb][Ww][Bb]0[Aa][Gg][Uu][Aa][Yy][Ww][Bb]0[Aa][Gg][Kk][Aa][Bb][Ww][Bb][Uu][Aa][Cc][Aa][Aa].*/ OR /.*[Kk][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Gg][Kk][Aa][Bb][Ww][Bb][Hh][Aa][Hh][Yy][Aa][Cc][Aa][Bb][Yy][Aa][Gg]8[Aa][Dd][Aa][Bb][Ll][Aa][Gg][Mm][Aa][Dd][Aa][Bb][Pp][Aa][Gg]8[Aa][Bb][Gg][Aa][Gg][Aa].*/ OR /.*[Zz][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Ii][Aa][Gg][Uu][Aa][Aa][Aa][Bb][Hh][Aa][Hh][Yy][Aa][Aa][Qq][Bb][Vv][Aa][Hh][Ii][Aa][Bb][Qq][Bb][Vv][Aa][Gg]4[Aa][Aa][Qq][Bb]0[Aa][Gg]8[Aa][Cc][Gg][Bb][Pp][Aa][Gg]4[Aa][Zz][Ww][Aa][Gg][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Yy][Gg][Bb][Ll][Aa][Gg][Gg][Aa][Yy][Qq][Bb]2[Aa][Gg][Kk][Aa][Bb][Ww][Bb][Yy][Aa][Gg]0[Aa][Bb][Ww][Bb][Uu][Aa][Gg][Kk][Aa][Dd][Aa][Bb][Vv][Aa][Hh][Ii][Aa][Aa][Qq][Bb][Uu][Aa][Gg][Cc][Aa][Ii][Aa].*/ OR /.*[Kk][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Gg][Ii][Aa][Zz][Qq][Bb][Oo][Aa][Gg][Ee][Aa][Dd][Gg][Bb][Pp][Aa][Gg]8[Aa][Cc][Gg][Bb][Tt][Aa][Gg]8[Aa][Bb][Gg][Bb][Pp][Aa][Hh][Qq][Aa][Bb][Ww][Bb][Yy][Aa][Gg][Kk][Aa][Bb][Gg][Bb][Nn][Aa][Cc][Aa][Aa].*/ OR /.*[Zz][Aa][Bb][Pp][Aa][Hh][Mm][Aa][Yy][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Zz][Qq][Bb][Ii][Aa][Gg][Ww][Aa][Bb][Ww][Bb][Jj][Aa][Gg][Ss][Aa][Yy][Qq][Bb]0[Aa][Gg][Yy][Aa][Aa][Qq][Bb][Yy][Aa][Hh][Mm][Aa][Dd][Aa][Bb][Zz][Aa][Gg][Uu][Aa][Zz][Qq][Bb][Uu][Aa][Cc][Aa][Aa].*/ OR /.*[Qq][Aa][Aa][Qq][Bb][Zz][Aa][Gg][Ee][Aa][Yy][Gg][Bb][Ss][Aa][Gg][Uu][Aa][Yy][Gg][Bb][Ss][Aa][Gg]8[Aa][Yy][Ww][Bb][Rr][Aa][Gg][Ee][Aa][Dd][Aa][Bb][Mm][Aa][Gg][Kk][Aa][Cc][Gg][Bb][Zz][Aa][Hh][Qq][Aa][Cc][Ww][Bb][Ll][Aa][Gg][Uu][Aa][Bb][Gg][Aa][Gg][Aa].*/ OR /.*[Kk][Aa][Gg][Kk][Aa][Cc][Ww][Bb][Hh][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Ll][Aa][Gg][Ii][Aa][Bb][Aa][Bb][Vv][Aa][Gg][Mm][Aa][Aa][Ww][Bb][Hh][Aa][Hh][Qq][Aa][Zz][Gg][Bb][Pp][Aa][Hh][Ii][Aa][Cc][Ww][Bb]0[Aa][Hh][Mm][Aa][Zz][Qq][Bb][Ll][Aa][Gg]4[Aa][Ii][Aa].*/)))","rule_id":"1ec65a5f-9473-4f12-97da-622044d6df21","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps","https://www.virustotal.com/gui/file/d609799091731d83d75ec5d1f030571af20c45efeeb94840b67ea09a3283ab65/behavior/C2AE","https://www.virustotal.com/gui/search/content%253A%2522Set-MpPreference%2520-Disable%2522/files"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:(*Add\\-MpPreference\\ * OR *Set\\-MpPreference\\ *) AND process.command_line:(*DisableRealtimeMonitoring\\ * OR *DisableIOAVProtection\\ * OR *DisableBehaviorMonitoring\\ * OR *DisableBlockAtFirstSeen\\ *) AND process.command_line:(*$true* OR *\\ 1\\ *)) OR (process.command_line:(*RGlzYWJsZVJlYWx0aW1lTW9uaXRvcmluZy* OR *Rpc2FibGVSZWFsdGltZU1vbml0b3Jpbmcg* OR *EaXNhYmxlUmVhbHRpbWVNb25pdG9yaW5nI* OR *RGlzYWJsZUlPQVZQcm90ZWN0aW9uI* OR *Rpc2FibGVJT0FWUHJvdGVjdGlvbi* OR *EaXNhYmxlSU9BVlByb3RlY3Rpb24g* OR *RGlzYWJsZUJlaGF2aW9yTW9uaXRvcmluZy* OR *Rpc2FibGVCZWhhdmlvck1vbml0b3Jpbmcg* OR *EaXNhYmxlQmVoYXZpb3JNb25pdG9yaW5nI* OR *RGlzYWJsZUJsb2NrQXRGaXJzdFNlZW4g* OR *Rpc2FibGVCbG9ja0F0Rmlyc3RTZWVuI* OR *EaXNhYmxlQmxvY2tBdEZpcnN0U2Vlbi* OR *ZGlzYWJsZXJlYWx0aW1lbW9uaXRvcmluZy* OR *Rpc2FibGVyZWFsdGltZW1vbml0b3Jpbmcg* OR *kaXNhYmxlcmVhbHRpbWVtb25pdG9yaW5nI* OR *ZGlzYWJsZWlvYXZwcm90ZWN0aW9uI* OR *Rpc2FibGVpb2F2cHJvdGVjdGlvbi* OR *kaXNhYmxlaW9hdnByb3RlY3Rpb24g* OR *ZGlzYWJsZWJlaGF2aW9ybW9uaXRvcmluZy* OR *Rpc2FibGViZWhhdmlvcm1vbml0b3Jpbmcg* OR *kaXNhYmxlYmVoYXZpb3Jtb25pdG9yaW5nI* OR *ZGlzYWJsZWJsb2NrYXRmaXJzdHNlZW4g* OR *Rpc2FibGVibG9ja2F0Zmlyc3RzZWVuI* OR *kaXNhYmxlYmxvY2thdGZpcnN0c2Vlbi*) AND process.command_line:(*RABpAHMAYQBiAGwAZQBSAGUAYQBsAHQAaQBtAGUATQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAUgBlAGEAbAB0AGkAbQBlAE0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *EAGkAcwBhAGIAbABlAFIAZQBhAGwAdABpAG0AZQBNAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *RABpAHMAYQBiAGwAZQBJAE8AQQBWAFAAcgBvAHQAZQBjAHQAaQBvAG4AIA* OR *QAaQBzAGEAYgBsAGUASQBPAEEAVgBQAHIAbwB0AGUAYwB0AGkAbwBuACAA* OR *EAGkAcwBhAGIAbABlAEkATwBBAFYAUAByAG8AdABlAGMAdABpAG8AbgAgA* OR *RABpAHMAYQBiAGwAZQBCAGUAaABhAHYAaQBvAHIATQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAQgBlAGgAYQB2AGkAbwByAE0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *EAGkAcwBhAGIAbABlAEIAZQBoAGEAdgBpAG8AcgBNAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *RABpAHMAYQBiAGwAZQBCAGwAbwBjAGsAQQB0AEYAaQByAHMAdABTAGUAZQBuACAA* OR *QAaQBzAGEAYgBsAGUAQgBsAG8AYwBrAEEAdABGAGkAcgBzAHQAUwBlAGUAbgAgA* OR *EAGkAcwBhAGIAbABlAEIAbABvAGMAawBBAHQARgBpAHIAcwB0AFMAZQBlAG4AIA* OR *ZABpAHMAYQBiAGwAZQByAGUAYQBsAHQAaQBtAGUAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAcgBlAGEAbAB0AGkAbQBlAG0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *kAGkAcwBhAGIAbABlAHIAZQBhAGwAdABpAG0AZQBtAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *ZABpAHMAYQBiAGwAZQBpAG8AYQB2AHAAcgBvAHQAZQBjAHQAaQBvAG4AIA* OR *QAaQBzAGEAYgBsAGUAaQBvAGEAdgBwAHIAbwB0AGUAYwB0AGkAbwBuACAA* OR *kAGkAcwBhAGIAbABlAGkAbwBhAHYAcAByAG8AdABlAGMAdABpAG8AbgAgA* OR *ZABpAHMAYQBiAGwAZQBiAGUAaABhAHYAaQBvAHIAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAYgBlAGgAYQB2AGkAbwByAG0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *kAGkAcwBhAGIAbABlAGIAZQBoAGEAdgBpAG8AcgBtAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *ZABpAHMAYQBiAGwAZQBiAGwAbwBjAGsAYQB0AGYAaQByAHMAdABzAGUAZQBuACAA* OR *QAaQBzAGEAYgBsAGUAYgBsAG8AYwBrAGEAdABmAGkAcgBzAHQAcwBlAGUAbgAgA* OR *kAGkAcwBhAGIAbABlAGIAbABvAGMAawBhAHQAZgBpAHIAcwB0AHMAZQBlAG4AIA*)))`"}
