{"id":"84b14121-9d14-416e-800b-f3b829c5a14d","created_by":"Nasreddine Bencherchali","name":"Suspicious CustomShellHost Execution","tags":["attack.defense_evasion","attack.t1216"],"interval":"5m","description":"Detects the execution of CustomShellHost binary where the child isn't located in 'C:\\Windows\\explorer.exe'","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Cc][Uu][Ss][Tt][Oo][Mm][Ss][Hh][Ee][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)))","rule_id":"84b14121-9d14-416e-800b-f3b829c5a14d","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/pull/180"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\CustomShellHost.exe AND (NOT (process.executable:C\\:\\\\Windows\\\\explorer.exe)))`"}
