{"id":"1327381e-6ab0-4f38-b583-4c1b8346a56b","created_by":"Christian Burkard","name":"Command Line Path Traversal Evasion","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"Detects the attempt to evade or obfuscate the executed command on the CommandLine using bogus path traversal","risk_score":73,"enabled":true,"severity":"high","false_positives":["Google Drive"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ AND process.command_line:(/.*\\\\\\.\\.\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ OR /.*\\\\\\.\\.\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\\\\\.\\.\\\\\\.\\.\\\\.*/)) OR process.command_line:/.*\\.[Ee][Xx][Ee]\\\\\\.\\.\\\\.*/) AND (NOT (process.command_line:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Dd][Rr][Ii][Vv][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Yy][Nn][Cc]\\.[Ee][Xx][Ee]\\\\\\.\\.\\\\.*/)))","rule_id":"1327381e-6ab0-4f38-b583-4c1b8346a56b","timestamp_override":"event.ingested","references":["https://twitter.com/hexacorn/status/1448037865435320323","https://twitter.com/Gal_B1t/status/1062971006078345217"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\Windows\\\\* AND process.command_line:(*\\\\..\\\\Windows\\\\* OR *\\\\..\\\\System32\\\\* OR *\\\\..\\\\..\\\\*)) OR process.command_line:*.exe\\\\..\\\\*) AND (NOT (process.command_line:*\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\*)))`"}
