{"id":"452bce90-6fb0-43cc-97a5-affc283139b3","created_by":"Florian Roth","name":"Registry Defender Tampering","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects reg command lines that disable certain important features of Microsoft Defender","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/) AND process.command_line:/.*\\ [Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*\\ \\/[Dd]\\ 0.*/ AND process.command_line:(/.*[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/))","rule_id":"452bce90-6fb0-43cc-97a5-affc283139b3","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:(*SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\* OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\*) AND process.command_line:*\\ add\\ * AND process.command_line:*\\ \\/d\\ 0* AND process.command_line:(*Real\\-Time\\ Protection* OR *TamperProtection*))`"}
