{"id":"9b0b7ac3-6223-47aa-a3fd-e8f211e637db","created_by":"frack113","name":"Service ImagePath Change with Reg.exe","tags":["attack.persistence","attack.t1574.011"],"interval":"5m","description":"Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.\nAdversaries may use flaws in the permissions for registry to redirect from the originally specified executable to one that they control, in order to launch their own code at Service start.\nWindows stores local service configuration information in the Registry under HKLM\\SYSTEM\\CurrentControlSet\\Services\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Aa][Dd][Dd]\\ .*/ AND process.command_line:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND process.command_line:/.*\\ [Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]\\ .*/ AND process.command_line:(/.*\\ \\/[Dd]\\ .*/ OR /.*\\ \\-[Dd]\\ .*/))","rule_id":"9b0b7ac3-6223-47aa-a3fd-e8f211e637db","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\reg.exe AND process.command_line:*add\\ * AND process.command_line:*SYSTEM\\\\CurrentControlSet\\\\Services\\\\* AND process.command_line:*\\ ImagePath\\ * AND process.command_line:(*\\ \\/d\\ * OR *\\ \\-d\\ *))`"}
