{"id":"f548a603-c9f2-4c89-b511-b089f7e94549","created_by":"Sreeman","name":"Abusing Windows Telemetry For Persistence","tags":["attack.defense_evasion","attack.persistence","attack.t1112","attack.t1053"],"interval":"5m","description":"Windows telemetry makes use of the binary CompatTelRunner.exe to run a variety of commands and perform the actual telemetry collections. This binary was created to be easily extensible, and to that end, it relies on the registry to instruct on which commands to run. The problem is, it will run any arbitrary command without restriction of location or type.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss].*/ AND process.command_line:/.*\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\ [Ee][Xx][Pp][Ee][Rr][Ii][Ee][Nn][Cc][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Cc][Oo][Mm][Pp][Aa][Tt][Ii][Bb][Ii][Ll][Ii][Tt][Yy]\\ [Aa][Pp][Pp][Rr][Aa][Ii][Ss][Ee][Rr].*/)","rule_id":"f548a603-c9f2-4c89-b511-b089f7e94549","timestamp_override":"event.ingested","references":["https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*schtasks* AND process.command_line:*\\\\Application\\ Experience\\\\Microsoft\\ Compatibility\\ Appraiser*)`"}
