{"id":"1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc","created_by":"Florian Roth","name":"Winrar Compressing Dump Files","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"Detects a suspicious winrar execution that involves a file with a .dmp extension, which could be a step in a process of dump file exfiltration","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of WinRAR with a command line in which .dmp appears incidentally"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Rr][Aa][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Aa][Rr]\\.[Ee][Xx][Ee]/) OR process.pe.description:/[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Ll][Ii][Nn][Ee]\\ [Rr][Aa][Rr]/) AND process.command_line:/.*\\.[Dd][Mm][Pp].*/)","rule_id":"1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc","timestamp_override":"event.ingested","references":["https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\rar.exe OR *\\\\winrar.exe) OR process.pe.description:Command\\ line\\ RAR) AND process.command_line:*.dmp*)`"}
