{"id":"797011dc-44f4-4e6f-9f10-a8ceefbe566b","created_by":"Florian Roth","name":"WMI Backdoor Exchange Transport Agent","tags":["attack.persistence","attack.t1546.003"],"interval":"5m","description":"Detects a WMI backdoor in Exchange Transport Agents via WMI event filters","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:/.*\\\\[Ee][Dd][Gg][Ee][Tt][Rr][Aa][Nn][Ss][Pp][Oo][Rr][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)))","rule_id":"797011dc-44f4-4e6f-9f10-a8ceefbe566b","timestamp_override":"event.ingested","references":["https://twitter.com/cglyer/status/1182389676876980224","https://twitter.com/cglyer/status/1182391019633029120"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:*\\\\EdgeTransport.exe AND (NOT (process.executable:C\\:\\\\Windows\\\\System32\\\\conhost.exe)))`"}
