{"id":"1e59c230-6670-45bf-83b0-98903780607e","created_by":"frack113","name":"Gpscript Execution","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"Detects the execution of the LOLBIN gpscript, which executes logon or startup scripts configured in Group Policy","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate uses of logon scripts distributed via group policy"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Gg][Pp][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Gg][Pp][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\ \\/[Ll][Oo][Gg][Oo][Nn].*/ OR /.*\\ \\/[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/))","rule_id":"1e59c230-6670-45bf-83b0-98903780607e","timestamp_override":"event.ingested","references":["https://oddvar.moe/2018/04/27/gpscript-exe-another-lolbin-to-the-list/","https://lolbas-project.github.io/lolbas/Binaries/Gpscript/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\gpscript.exe OR process.pe.original_file_name:GPSCRIPT.EXE) AND process.command_line:(*\\ \\/logon* OR *\\ \\/startup*))`"}
