{"id":"526be59f-a573-4eea-b5f7-f0973207634d","created_by":"Michael Haag, Florian Roth, juju4, oscd.community","name":"Suspicious WMIC Execution","tags":["attack.execution","attack.t1047","car.2016-03-002"],"interval":"5m","description":"Detects WMIC executing suspicious or recon commands","risk_score":47,"enabled":true,"severity":"medium","false_positives":["If using Splunk, we recommend | stats count by Computer,CommandLine following for easy hunting by Computer/CommandLine"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/ AND process.command_line:/.*[Cc][Aa][Ll][Ll].*/ AND process.command_line:/.*[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/)) OR ((process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ [Pp][Aa][Tt][Hh]\\ .*/ AND process.command_line:(/.*[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR /.*[Ff][Ii][Rr][Ee][Ww][Aa][Ll][Ll].*/) AND process.command_line:/.*[Pp][Rr][Oo][Dd][Uu][Cc][Tt].*/ AND process.command_line:/.*\\ [Gg][Ee][Tt]\\ .*/ AND process.command_line:/.*[Ww][Mm][Ii][Cc]\\ [Cc][Ss][Pp][Rr][Oo][Dd][Uu][Cc][Tt]\\ [Gg][Ee][Tt]\\ [Nn][Aa][Mm][Ee].*/)))","rule_id":"526be59f-a573-4eea-b5f7-f0973207634d","timestamp_override":"event.ingested","references":["https://digital-forensics.sans.org/blog/2010/06/04/wmic-draft/","https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1","https://blog.malwarebytes.com/threat-analysis/2016/04/rokku-ransomware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((process.executable:*\\\\wmic.exe OR process.pe.original_file_name:wmic.exe) AND (process.command_line:*process* AND process.command_line:*call* AND process.command_line:*create\\ *)) OR ((process.executable:*\\\\wmic.exe OR process.pe.original_file_name:wmic.exe) AND (process.command_line:*\\ path\\ * AND process.command_line:(*AntiVirus* OR *Firewall*) AND process.command_line:*Product* AND process.command_line:*\\ get\\ * AND process.command_line:*wmic\\ csproduct\\ get\\ name*)))`"}
