{"id":"868955d9-697e-45d4-a3da-360cefd7c216","created_by":"@SBousseaden (idea), Christian Burkard (rule)","name":"Office Directory Traversal CommandLine","tags":["attack.execution","attack.defense_evasion"],"interval":"5m","description":"Detects Office Applications executing a Windows child process including directory traversal patterns","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Aa][Cc][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Qq][Nn][Ee][Dd][Tt]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ii][Ss][Ii][Oo]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/) AND process.command_line:(..\\/..\\/..\\/.. OR ..\\\\..\\\\..\\\\.. OR ..\\/\\/..\\/\\/..\\/\\/..))","rule_id":"868955d9-697e-45d4-a3da-360cefd7c216","timestamp_override":"event.ingested","references":["https://twitter.com/sbousseaden/status/1531653369546301440"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.parent.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\eqnedt32.exe OR *\\\\visio.exe) AND process.executable:(*\\\\Windows\\\\System32\\\\* OR *\\\\Windows\\\\SysWOW64\\\\*) AND process.command_line:(..\\/..\\/..\\/.. OR ..\\\\..\\\\..\\\\.. OR ..\\/\\/..\\/\\/..\\/\\/..))`"}
