{"id":"5b768e71-86f2-4879-b448-81061cbae951","created_by":"Nasreddine Bencherchali","name":"Suspicious Manipulation Of Default Accounts","tags":["attack.collection","attack.t1560.001"],"interval":"5m","description":"Detects suspicious manipulations of default accounts such as 'administrator' and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc","risk_score":73,"enabled":true,"severity":"high","false_positives":["Some fasle positives could occure with the admin or guest account. It depends on the scripts being used by the admins in your env. If you experience a lot of FP you could reduce the level to medium"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/) AND process.command_line:/.*\\ [Uu][Ss][Ee][Rr]\\ .*/ AND process.command_line:(/.*\\ [Jj]ä[Rr][Jj][Ee][Ss][Tt][Ee][Ll][Mm]ä[Nn][Vv][Aa][Ll][Vv][Oo][Jj][Aa]\\ .*/ OR /.*\\ [Rr][Ee][Nn][Dd][Ss][Zz][Ee][Rr][Gg][Aa][Zz][Dd][Aa]\\ .*/ OR /.*\\ Администратор\\ .*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ee][Uu][Rr]\\ .*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Dd][Oo][Rr]\\ .*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt]ö[Rr]\\ .*/ OR /.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr]\\ .*/ OR /.*\\ [Gg][Uu][Ee][Ss][Tt]\\ .*/ OR /.*\\ [Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Cc][Oo][Uu][Nn][Tt]\\ .*/ OR /.*\\ \\\"[Jj]ä[Rr][Jj][Ee][Ss][Tt][Ee][Ll][Mm]ä[Nn][Vv][Aa][Ll][Vv][Oo][Jj][Aa]\\\"\\ .*/ OR /.*\\ \\\"[Rr][Ee][Nn][Dd][Ss][Zz][Ee][Rr][Gg][Aa][Zz][Dd][Aa]\\\"\\ .*/ OR /.*\\ \\\"Администратор\\\"\\ .*/ OR /.*\\ \\\"[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ee][Uu][Rr]\\\"\\ .*/ OR /.*\\ \\\"[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Dd][Oo][Rr]\\\"\\ .*/ OR /.*\\ \\\"[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt]ö[Rr]\\\"\\ .*/ OR /.*\\ \\\"[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr]\\\"\\ .*/ OR /.*\\ \\\"[Gg][Uu][Ee][Ss][Tt]\\\"\\ .*/ OR /.*\\ \\\"[Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Cc][Oo][Uu][Nn][Tt]\\\"\\ .*/ OR /.*\\ '[Jj]ä[Rr][Jj][Ee][Ss][Tt][Ee][Ll][Mm]ä[Nn][Vv][Aa][Ll][Vv][Oo][Jj][Aa]'\\ .*/ OR /.*\\ '[Rr][Ee][Nn][Dd][Ss][Zz][Ee][Rr][Gg][Aa][Zz][Dd][Aa]'\\ .*/ OR /.*\\ 'Администратор'\\ .*/ OR /.*\\ '[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Ee][Uu][Rr]'\\ .*/ OR /.*\\ '[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Dd][Oo][Rr]'\\ .*/ OR /.*\\ '[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt]ö[Rr]'\\ .*/ OR /.*\\ '[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr]'\\ .*/ OR /.*\\ '[Gg][Uu][Ee][Ss][Tt]'\\ .*/ OR /.*\\ '[Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Cc][Oo][Uu][Nn][Tt]'\\ .*/)) AND (NOT (process.command_line:/.*[Gg][Uu][Ee][Ss][Tt].*/ AND process.command_line:/.*\\/[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Nn][Oo].*/)))","rule_id":"5b768e71-86f2-4879-b448-81061cbae951","timestamp_override":"event.ingested","references":["https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html","https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/","https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*\\ user\\ * AND process.command_line:(*\\ Järjestelmänvalvoja\\ * OR *\\ Rendszergazda\\ * OR *\\ Администратор\\ * OR *\\ Administrateur\\ * OR *\\ Administrador\\ * OR *\\ Administratör\\ * OR *\\ Administrator\\ * OR *\\ guest\\ * OR *\\ DefaultAccount\\ * OR *\\ \\\"Järjestelmänvalvoja\\\"\\ * OR *\\ \\\"Rendszergazda\\\"\\ * OR *\\ \\\"Администратор\\\"\\ * OR *\\ \\\"Administrateur\\\"\\ * OR *\\ \\\"Administrador\\\"\\ * OR *\\ \\\"Administratör\\\"\\ * OR *\\ \\\"Administrator\\\"\\ * OR *\\ \\\"guest\\\"\\ * OR *\\ \\\"DefaultAccount\\\"\\ * OR *\\ 'Järjestelmänvalvoja'\\ * OR *\\ 'Rendszergazda'\\ * OR *\\ 'Администратор'\\ * OR *\\ 'Administrateur'\\ * OR *\\ 'Administrador'\\ * OR *\\ 'Administratör'\\ * OR *\\ 'Administrator'\\ * OR *\\ 'guest'\\ * OR *\\ 'DefaultAccount'\\ *)) AND (NOT (process.command_line:*guest* AND process.command_line:*\\/active\\ no*)))`"}
