{"id":"894397c6-da03-425c-a589-3d09e7d1f750","created_by":"@neonprimetime, Florian Roth","name":"CVE-2021-40444 Process Pattern","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects a suspicious process pattern found in CVE-2021-40444 exploitation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/)) AND (NOT (process.command_line:(/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]\\ [Ii][Nn][Pp][Uu][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Ee][Xx][Ee]\\\"\\ [Ii][Nn][Pp][Uu][Tt]\\.[Dd][Ll][Ll]/))))","rule_id":"894397c6-da03-425c-a589-3d09e7d1f750","timestamp_override":"event.ingested","references":["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444","https://twitter.com/neonprimetime/status/1435584010202255375","https://www.joesandbox.com/analysis/476188/1/iochtml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\control.exe AND process.parent.executable:(*\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe)) AND (NOT (process.command_line:(*\\\\control.exe\\ input.dll OR *\\\\control.exe\\\"\\ input.dll))))`"}
