{"id":"e37db05d-d1f9-49c8-b464-cee1a4b11638","created_by":"Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group","name":"Rclone Execution via Command Line or PowerShell","tags":["attack.exfiltration","attack.t1567.002"],"interval":"5m","description":"Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate RClone use"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*\\-\\-[Cc][Oo][Nn][Ff][Ii][Gg]\\ .*/ AND process.command_line:/.*\\-\\-[Nn][Oo]\\-[Cc][Hh][Ee][Cc][Kk]\\-[Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee]\\ .*/ AND process.command_line:/.*\\ [Cc][Oo][Pp][Yy]\\ .*/) OR (process.command_line:(/.*[Pp][Aa][Ss][Ss].*/ OR /.*[Uu][Ss][Ee][Rr].*/ OR /.*[Cc][Oo][Pp][Yy].*/ OR /.*[Ss][Yy][Nn][Cc].*/ OR /.*[Cc][Oo][Nn][Ff][Ii][Gg].*/ OR /.*[Ll][Ss][Dd].*/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee].*/ OR /.*[Ll][Ss].*/ OR /.*[Mm][Ee][Gg][Aa].*/ OR /.*[Pp][Cc][Ll][Oo][Uu][Dd].*/ OR /.*[Ff][Tt][Pp].*/ OR /.*[Ii][Gg][Nn][Oo][Rr][Ee]\\-[Ee][Xx][Ii][Ss][Tt][Ii][Nn][Gg].*/ OR /.*[Aa][Uu][Tt][Oo]\\-[Cc][Oo][Nn][Ff][Ii][Rr][Mm].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr][Ss].*/ OR /.*[Mm][Uu][Ll][Tt][Ii]\\-[Tt][Hh][Rr][Ee][Aa][Dd]\\-[Ss][Tt][Rr][Ee][Aa][Mm][Ss].*/ OR /.*[Nn][Oo]\\-[Cc][Hh][Ee][Cc][Kk]\\-[Cc][Ee][Rr][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ee]\\ .*/) AND (process.pe.description:/[Rr][Ss][Yy][Nn][Cc]\\ [Ff][Oo][Rr]\\ [Cc][Ll][Oo][Uu][Dd]\\ [Ss][Tt][Oo][Rr][Aa][Gg][Ee]/ OR (process.executable:/.*\\\\[Rr][Cc][Ll][Oo][Nn][Ee]\\.[Ee][Xx][Ee]/ AND process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)))))","rule_id":"e37db05d-d1f9-49c8-b464-cee1a4b11638","timestamp_override":"event.ingested","references":["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/","https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware","https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a","https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone","https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*\\-\\-config\\ * AND process.command_line:*\\-\\-no\\-check\\-certificate\\ * AND process.command_line:*\\ copy\\ *) OR (process.command_line:(*pass* OR *user* OR *copy* OR *sync* OR *config* OR *lsd* OR *remote* OR *ls* OR *mega* OR *pcloud* OR *ftp* OR *ignore\\-existing* OR *auto\\-confirm* OR *transfers* OR *multi\\-thread\\-streams* OR *no\\-check\\-certificate\\ *) AND (process.pe.description:Rsync\\ for\\ cloud\\ storage OR (process.executable:*\\\\rclone.exe AND process.parent.executable:(*\\\\PowerShell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe)))))`"}
