{"id":"5589ab4f-a767-433c-961d-c91f3f704db1","created_by":"Florian Roth","name":"SMB Relay Attack Tools","tags":["attack.execution","attack.t1557.001"],"interval":"5m","description":"Detects different hacktools used for relay attacks on Windows for privilege escalation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Legitimate files with these rare hacktool names"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*[Pp][Ee][Tt][Ii][Tt][Pp][Oo][Tt][Aa][Mm].*/ OR /.*[Rr][Oo][Tt][Tt][Ee][Nn][Pp][Oo][Tt][Aa][Tt][Oo].*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo].*/ OR /.*[Jj][Uu][Ii][Cc][Yy][Pp][Oo][Tt][Aa][Tt][Oo].*/ OR /.*\\\\[Jj][Uu][Ss][Tt]_[Dd][Cc][Ee]_.*/ OR /.*[Jj][Uu][Ii][Cc][Yy]\\ [Pp][Oo][Tt][Aa][Tt][Oo].*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\[Rr][Oo][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Pp][Oo][Tt][Aa][Tt][Oo]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Aa][Mm][Pp][Ll][Ee]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Rr][Ee][Ss][Pp][Oo][Nn][Dd][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ss][Mm][Bb][Rr][Ee][Ll][Aa][Yy][Xx].*/ OR /.*\\\\[Nn][Tt][Ll][Mm][Rr][Ee][Ll][Aa][Yy][Xx].*/) OR process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Tt][Aa][Tt][Ee][Rr].*/ OR /.*\\ [Ss][Mm][Bb][Rr][Ee][Ll][Aa][Yy].*/ OR /.*\\ [Nn][Tt][Ll][Mm][Rr][Ee][Ll][Aa][Yy].*/ OR /.*[Cc][Mm][Ee]\\ [Ss][Mm][Bb]\\ .*/ OR /.*\\ \\/[Nn][Tt][Ll][Mm]\\:[Nn][Tt][Ll][Mm][Hh][Aa][Ss][Hh]\\ .*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Pp][Ee][Tt][Ii][Tt][Pp][Oo][Tt][Aa][Mm].*/)) AND (NOT ((process.executable:(/.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]6.*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]\\ 6.*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]7.*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]\\ 7.*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]\\ [Hh][Ee][Ll][Pp].*/ OR /.*[Hh][Oo][Tt][Pp][Oo][Tt][Aa][Tt][Oo][Ee][Ss]\\ [Tt][Uu][Tt][Oo][Rr][Ii][Aa][Ll].*/)))))","rule_id":"5589ab4f-a767-433c-961d-c91f3f704db1","timestamp_override":"event.ingested","references":["https://attack.mitre.org/techniques/T1557/001/","https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/","https://pentestlab.blog/2017/04/13/hot-potato/","https://github.com/ohpe/juicy-potato","https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes","https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*PetitPotam* OR *RottenPotato* OR *HotPotato* OR *JuicyPotato* OR *\\\\just_dce_* OR *Juicy\\ Potato* OR *\\\\temp\\\\rot.exe* OR *\\\\Potato.exe* OR *\\\\SpoolSample.exe* OR *\\\\Responder.exe* OR *\\\\smbrelayx* OR *\\\\ntlmrelayx*) OR process.command_line:(*Invoke\\-Tater* OR *\\ smbrelay* OR *\\ ntlmrelay* OR *cme\\ smb\\ * OR *\\ \\/ntlm\\:NTLMhash\\ * OR *Invoke\\-PetitPotam*)) AND (NOT ((process.executable:(*HotPotatoes6* OR *HotPotatoes\\ 6* OR *HotPotatoes7* OR *HotPotatoes\\ 7* OR *HotPotatoes\\ Help* OR *HotPotatoes\\ Tutorial*)))))`"}
