{"id":"5687f942-867b-4578-ade7-1e341c46e99a","created_by":"behops, Bhabesh Raj","name":"VMToolsd Suspicious Child Process","tags":["attack.execution","attack.persistence","attack.t1059"],"interval":"5m","description":"Detects suspicious child process creations of VMware Tools process which may indicate persistence setup","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use by administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/ AND (process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) OR process.pe.original_file_name:(/[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/))) AND (NOT (process.command_line:(/.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Oo][Nn]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Oo][Ff][Ff]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\[Rr][Ee][Ss][Uu][Mm][Ee]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\[Ss][Uu][Ss][Pp][Ee][Nn][Dd]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/))))","rule_id":"5687f942-867b-4578-ade7-1e341c46e99a","timestamp_override":"event.ingested","references":["https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\vmtoolsd.exe AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\wscript.exe OR *\\\\cscript.exe) OR process.pe.original_file_name:(Cmd.Exe OR PowerShell.EXE OR pwsh.dll OR RUNDLL32.EXE OR REGSVR32.EXE OR wscript.exe OR cscript.exe))) AND (NOT (process.command_line:(*\\\\VMware\\\\VMware\\ Tools\\\\poweron\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\poweroff\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\resume\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\suspend\\-vm\\-default.bat*))))`"}
