{"id":"d937b75f-a665-4480-88a5-2f20e9f9b22a","created_by":"Teymur Kheirkhabarov","name":"Possible Privilege Escalation via Weak Service Permissions","tags":["attack.persistence","attack.defense_evasion","attack.privilege_escalation","attack.t1574.011"],"interval":"5m","description":"Detection of sc.exe utility spawning by user with Medium integrity level to change service ImagePath or FailureCommand","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:/[Mm][Ee][Dd][Ii][Uu][Mm]/) AND ((process.command_line:/.*[Cc][Oo][Nn][Ff][Ii][Gg].*/ AND process.command_line:/.*[Bb][Ii][Nn][Pp][Aa][Tt][Hh].*/) OR (process.command_line:/.*[Ff][Aa][Ii][Ll][Uu][Rr][Ee].*/ AND process.command_line:/.*[Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/)))","rule_id":"d937b75f-a665-4480-88a5-2f20e9f9b22a","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://pentestlab.blog/2017/03/30/weak-service-permissions/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\sc.exe AND winlog.event_data.IntegrityLevel:Medium) AND ((process.command_line:*config* AND process.command_line:*binPath*) OR (process.command_line:*failure* AND process.command_line:*command*)))`"}
