{"id":"aa35a627-33fb-4d04-a165-d33b4afca3e8","created_by":"Patryk Prauze - ING Tech","name":"Mimikatz through Windows Remote Management","tags":["attack.credential_access","attack.execution","attack.t1003.001","attack.t1059.001","attack.lateral_movement","attack.t1021.006","attack.s0002"],"interval":"5m","description":"Detects usage of mimikatz through WinRM protocol by monitoring access to lsass process by wsmprovhost.exe.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) AND (NOT (winlog.event_data.GrantedAccess:/0[Xx]80000000/)))","rule_id":"aa35a627-33fb-4d04-a165-d33b4afca3e8","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2018/05/15/lateral-movement-winrm/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:C\\:\\\\Windows\\\\system32\\\\wsmprovhost.exe) AND (NOT (winlog.event_data.GrantedAccess:0x80000000)))`"}
