{"id":"e212d415-0e93-435f-9e1a-f29005bb4723","created_by":"Markus Neis","name":"Suspicious Execution from Outlook","tags":["attack.execution","attack.t1059","attack.t1202"],"interval":"5m","description":"Detects EnableUnsafeClientMailRules used for Script Execution from Outlook","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*[Ee][Nn][Aa][Bb][Ll][Ee][Uu][Nn][Ss][Aa][Ff][Ee][Cc][Ll][Ii][Ee][Nn][Tt][Mm][Aa][Ii][Ll][Rr][Uu][Ll][Ee][Ss].*/ OR (process.parent.executable:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\\\\\\\\\*/ AND process.command_line:/.*\\\\\\*/ AND process.command_line:/.*\\.[Ee][Xx][Ee].*/))","rule_id":"e212d415-0e93-435f-9e1a-f29005bb4723","timestamp_override":"event.ingested","references":["https://github.com/sensepost/ruler","https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*EnableUnsafeClientMailRules* OR (process.parent.executable:*\\\\outlook.exe AND process.command_line:*\\\\\\\\\\* AND process.command_line:*\\\\\\* AND process.command_line:*.exe*))`"}
