{"id":"ba778144-5e3d-40cf-8af9-e28fb1df1e20","created_by":"Florian Roth, Jonhnathan Ribeiro, oscd.community","name":"Sofacy Trojan Loader Activity","tags":["attack.g0007","attack.execution","attack.t1059.003","attack.defense_evasion","car.2013-10-002","attack.t1218.011"],"interval":"5m","description":"Detects Trojan loader activity as used by APT28","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]%\\\\.*/) AND (process.command_line:/.*\\.[Dd][Aa][Tt]\\\",.*/ OR process.command_line:(/.*\\.[Dd][Ll][Ll]\\\",#1/ OR /.*\\.[Dd][Ll][Ll]\\ #1/ OR /.*\\.[Dd][Ll][Ll]\\\"\\ #1/)))","rule_id":"ba778144-5e3d-40cf-8af9-e28fb1df1e20","timestamp_override":"event.ingested","references":["https://researchcenter.paloaltonetworks.com/2018/02/unit42-sofacy-attacks-multiple-government-entities/","https://www.reverse.it/sample/e3399d4802f9e6d6d539e3ae57e7ea9a54610a7c4155a6541df8e94d67af086e?environmentId=100","https://twitter.com/ClearskySec/status/960924755355369472"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*rundll32.exe* AND process.command_line:*%APPDATA%\\\\*) AND (process.command_line:*.dat\\\",* OR process.command_line:(*.dll\\\",#1 OR *.dll\\ #1 OR *.dll\\\"\\ #1)))`"}
