{"id":"e4b6d2a7-d8a4-4f19-acbd-943c16d90647","created_by":"Florian Roth, Tim Shelton","name":"Suspicious PowerShell Sub Processes","tags":null,"interval":"5m","description":"Detects suspicious sub processes spawned by PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/) AND process.executable:(/.*\\\\[Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/)) AND (NOT (process.parent.command_line:/.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\.*/ AND process.command_line:/.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ww][Oo][Rr][Kk][Ss][Pp][Aa][Cc][Ee][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\.*/)))","rule_id":"e4b6d2a7-d8a4-4f19-acbd-943c16d90647","timestamp_override":"event.ingested","references":["https://twitter.com/ankit_anubhav/status/1518835408502620162"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe) AND process.executable:(*\\\\sh.exe OR *\\\\bash.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe)) AND (NOT (process.parent.command_line:*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\* AND process.command_line:*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\*)))`"}
