{"id":"e173ad47-4388-4012-ae62-bd13f71c18a8","created_by":"@gott_cyber","name":"DLL Sideloading via DeviceEnroller.exe","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects the use of the PhoneDeepLink parameter to potentially sideload a DLL file that doesnt exist. This non-existent DLL file is named \"ShellChromeAPI.dll\". \nAdversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe using this parameter\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Ee][Nn][Rr][Oo][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Pp][Hh][Oo][Nn][Ee][Dd][Ee][Ee][Pp][Ll][Ii][Nn][Kk].*/)","rule_id":"e173ad47-4388-4012-ae62-bd13f71c18a8","timestamp_override":"event.ingested","references":["https://mobile.twitter.com/0gtweet/status/1564131230941122561","https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\deviceenroller.exe AND process.command_line:*\\/PhoneDeepLink*)`"}
