{"id":"60fc936d-2eb0-4543-8a13-911c750a1dfc","created_by":"E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community","name":"Interactive AT Job","tags":["attack.privilege_escalation","attack.t1053.002"],"interval":"5m","description":"Detect an interactive AT job, which may be used as a form of privilege escalation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely (at.exe deprecated as of Windows 8)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Aa][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee].*/)","rule_id":"60fc936d-2eb0-4543-8a13-911c750a1dfc","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.002/T1053.002.md","https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\at.exe AND process.command_line:*interactive*)`"}
