{"id":"b3d34dc5-2efd-4ae3-845f-8ec14921f449","created_by":"pH-T","name":"Browser Started with Remote Debugging","tags":["attack.credential_access","attack.t1185"],"interval":"5m","description":"Detects browsers starting with the '--remote-debugging' flag. Which is a technique often used to perform browser injection attacks","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*\\ \\-\\-[Rr][Ee][Mm][Oo][Tt][Ee]\\-[Dd][Ee][Bb][Uu][Gg][Gg][Ii][Nn][Gg]\\-[Aa][Dd][Dd][Rr][Ee][Ss][Ss]\\=.*/ OR /.*\\ \\-\\-[Rr][Ee][Mm][Oo][Tt][Ee]\\-[Dd][Ee][Bb][Uu][Gg][Gg][Ii][Nn][Gg]\\-[Pp][Oo][Rr][Tt]\\=.*/) OR (process.executable:/.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Ss][Tt][Aa][Rr][Tt]\\-[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\-[Ss][Ee][Rr][Vv][Ee][Rr]\\ .*/))","rule_id":"b3d34dc5-2efd-4ae3-845f-8ec14921f449","timestamp_override":"event.ingested","references":["https://yoroi.company/wp-content/uploads/2022/05/EternityGroup_report_compressed.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*\\ \\-\\-remote\\-debugging\\-address\\=* OR *\\ \\-\\-remote\\-debugging\\-port\\=*) OR (process.executable:*\\\\firefox.exe AND process.command_line:*\\ \\-start\\-debugger\\-server\\ *))`"}
