{"id":"472159c5-31b9-4f56-b794-b766faa8b0a7","created_by":"Samir Bousseaden (original elastic rule), Nasreddine Bencherchali (sigma)","name":"Suspicious LSASS Access Via MalSecLogon","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects suspicious access to Lsass handle via a call trace to \"seclogon.dll\"","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:/0[Xx]14[Cc]0/ AND winlog.event_data.CallTrace:/.*[Ss][Ee][Cc][Ll][Oo][Gg][Oo][Nn]\\.[Dd][Ll][Ll].*/)","rule_id":"472159c5-31b9-4f56-b794-b766faa8b0a7","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1541920424635912196","https://github.com/elastic/detection-rules/blob/2bc1795f3d7bcc3946452eb4f07ae799a756d94e/rules/windows/credential_access_lsass_handle_via_malseclogon.toml","https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:*\\\\svchost.exe AND winlog.event_data.GrantedAccess:0x14c0 AND winlog.event_data.CallTrace:*seclogon.dll*)`"}
