{"id":"3dfd06d2-eaf4-4532-9555-68aca59f57c4","created_by":"Florian Roth, Tim Shelton","name":"Execution from Suspicious Folder","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"Detects a suspicious execution from an uncommon folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:(/.*\\\\$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]\\\\.*/ OR /.*\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\.*/ OR /.*\\\\[Ii][Nn][Tt][Ee][Ll]\\\\[Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Rr][Ss][Aa]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee][Kk][Ee][Yy][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Aa][Ll][Ll]\\ [Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Dd][Ee][Bb][Uu][Gg]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Oo][Nn][Tt][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Hh][Ee][Ll][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Mm][Ee]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ee][Dd][Ii][Aa]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Rr][Ee][Pp][Aa][Ii][Rr]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Aa][Ss][Kk][Ss]\\\\.*/) OR process.executable:/[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/) AND (NOT (process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\[Ii][Bb][Mm]\\\\[Cc][Ll][Ii][Ee][Nn][Tt][Ss][Oo][Ll][Uu][Tt][Ii][Oo][Nn][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]_[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\.*/)))","rule_id":"3dfd06d2-eaf4-4532-9555-68aca59f57c4","timestamp_override":"event.ingested","references":["https://github.com/mbevilacqua/appcompatprocessor/blob/6c847937c5a836e2ce2fe2b915f213c345a3c389/AppCompatSearch.txt","https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses","https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/","https://github.com/ThreatHuntingProject/ThreatHunting/blob/cb22598bb70651f88e0285abc8d835757d2cb596/hunts/suspicious_process_creation_via_windows_event_logs.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:(*\\\\$Recycle.bin\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Intel\\\\Logs\\\\* OR *\\\\RSA\\\\MachineKeys\\\\* OR *\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\NetworkService\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\addins\\\\* OR *\\\\Windows\\\\debug\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\Help\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\Media\\\\* OR *\\\\Windows\\\\repair\\\\* OR *\\\\Windows\\\\security\\\\* OR *\\\\Windows\\\\System32\\\\Tasks\\\\* OR *\\\\Windows\\\\Tasks\\\\*) OR process.executable:C\\:\\\\Perflogs\\\\*) AND (NOT (process.executable:C\\:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\*)))`"}
