{"id":"f7b5f842-a6af-4da5-9e95-e32478f3cd2f","created_by":"Florian Roth","name":"MsiExec Web Install","tags":["attack.defense_evasion","attack.t1218.007","attack.command_and_control","attack.t1105"],"interval":"5m","description":"Detects suspicious msiexec process starts with web addresses as parameter","risk_score":47,"enabled":true,"severity":"medium","false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:/.*\\ [Mm][Ss][Ii][Ee][Xx][Ee][Cc].*/ AND process.command_line:/.*\\:\\/\\/.*/)","rule_id":"f7b5f842-a6af-4da5-9e95-e32478f3cd2f","timestamp_override":"event.ingested","references":["https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:*\\ msiexec* AND process.command_line:*\\:\\/\\/*)`"}
