{"id":"9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d","created_by":"James Pemberton / @4A616D6573","name":"Windows Suspicious Use Of Web Request in CommandLine","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects the use of various web request with commandline tools or Windows PowerShell command,methods (including aliases)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*[Ww][Gg][Ee][Tt]\\ .*/ OR /.*[Cc][Uu][Rr][Ll]\\ .*/ OR /.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ OR /.*[Ss][Tt][Aa][Rr][Tt]\\-[Bb][Ii][Tt][Ss][Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr].*/)","rule_id":"9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d","timestamp_override":"event.ingested","references":["https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/","https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ * OR *Net.WebClient* OR *Start\\-BitsTransfer*)`"}
