{"id":"503d581c-7df0-4bbe-b9be-5840c0ecc1fc","created_by":"Christian Burkard","name":"UAC Bypass Using ChangePK and SLUI","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects an UAC bypass that uses changepk.exe and slui.exe (UACMe 61)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Cc][Hh][Aa][Nn][Gg][Ee][Pp][Kk]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\[Ss][Ll][Uu][Ii]\\.[Ee][Xx][Ee]/ AND winlog.event_data.IntegrityLevel:(/[Hh][Ii][Gg][Hh]/ OR /[Ss][Yy][Ss][Tt][Ee][Mm]/))","rule_id":"503d581c-7df0-4bbe-b9be-5840c0ecc1fc","timestamp_override":"event.ingested","references":["https://mattharr0ey.medium.com/privilege-escalation-uac-bypass-in-changepk-c40b92818d1b","https://github.com/hfiref0x/UACME","https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\changepk.exe AND process.parent.executable:*\\\\slui.exe AND winlog.event_data.IntegrityLevel:(High OR System))`"}
