{"id":"f67dbfce-93bc-440d-86ad-a95ae8858c90","created_by":"Endgame, JHasenbusch (ported to sigma for oscd.community)","name":"Suspicious Bitsadmin Job via PowerShell","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Detect download by BITS jobs via PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ss][Tt][Aa][Rr][Tt]\\-[Bb][Ii][Tt][Ss][Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr].*/)","rule_id":"f67dbfce-93bc-440d-86ad-a95ae8858c90","timestamp_override":"event.ingested","references":["https://eqllib.readthedocs.io/en/latest/analytics/ec5180c9-721a-460f-bddc-27539a284273.html","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Start\\-BitsTransfer*)`"}
