{"id":"a29808fd-ef50-49ff-9c7a-59a9b040b404","created_by":"frack113","name":"Registry Parse with Pypykatz","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Adversaries may attempt to extract credential material from the Security Account Manager (SAM) database either through Windows Registry where the SAM database is stored","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Yy][Pp][Yy][Kk][Aa][Tt][Zz]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Yy][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/) AND process.command_line:/.*[Ll][Ii][Vv][Ee].*/ AND process.command_line:/.*[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy].*/)","rule_id":"a29808fd-ef50-49ff-9c7a-59a9b040b404","timestamp_override":"event.ingested","references":["https://github.com/skelsec/pypykatz","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-2---registry-parse-with-pypykatz"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\pypykatz.exe OR *\\\\python.exe) AND process.command_line:*live* AND process.command_line:*registry*)`"}
