{"id":"9a4ccd1a-3526-4d99-b980-9f9c5d3a6ee3","created_by":"frack113","name":"Suspicious 7zip Subprocess","tags":["cve.2022.29072"],"interval":"5m","description":"7-Zip through 21.07 on Windows allows privilege escalation (CVE-2022-29072) and command execution when a file with the .7z extension is dragged to the Help>Contents area. This is caused by misconfiguration of 7z.dll and a heap overflow. The command runs in a child process under the 7zFM.exe process.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.parent.executable:/.*\\\\7[Zz][Ff][Mm]\\.[Ee][Xx][Ee]/) AND (NOT ((process.command_line:/.*\\ \\/[Cc]\\ .*/) OR (NOT _exists_:process.command_line))))","rule_id":"9a4ccd1a-3526-4d99-b980-9f9c5d3a6ee3","timestamp_override":"event.ingested","references":["https://github.com/kagancapar/CVE-2022-29072","https://twitter.com/kagancapar/status/1515219358234161153"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\cmd.exe AND process.parent.executable:*\\\\7zFM.exe) AND (NOT ((process.command_line:*\\ \\/c\\ *) OR (NOT _exists_:process.command_line))))`"}
