{"id":"0f6da907-5854-4be6-859a-e9958747b0aa","created_by":"Florian Roth","name":"Suspicious LOLBIN AccCheckConsole","tags":["attack.execution"],"interval":"5m","description":"Detects suspicious LOLBIN AccCheckConsole execution with parameters as used to load an arbitrary DLL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of the UI Accessibility Checker"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*\\\\[Aa][Cc][Cc][Cc][Hh][Ee][Cc][Kk][Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\.[Ee][Xx][Ee]/ OR process.pe.original_file_name:/[Aa][Cc][Cc][Cc][Hh][Ee][Cc][Kk][Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ \\-[Ww][Ii][Nn][Dd][Oo][Ww]\\ .*/ AND process.command_line:/.*\\.[Dd][Ll][Ll].*/))","rule_id":"0f6da907-5854-4be6-859a-e9958747b0aa","timestamp_override":"event.ingested","references":["https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340","https://twitter.com/bohops/status/1477717351017680899?s=12","https://lolbas-project.github.io/lolbas/OtherMSBinaries/AccCheckConsole/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*\\\\AccCheckConsole.exe OR process.pe.original_file_name:AccCheckConsole.exe) AND (process.command_line:*\\ \\-window\\ * AND process.command_line:*.dll*))`"}
