{"id":"4ebc877f-4612-45cb-b3a5-8e3834db36c9","created_by":"Florian Roth","name":"Webshell Hacking Activity Patterns","tags":["attack.persistence","attack.t1505.003","attack.t1018","attack.t1033","attack.t1087"],"interval":"5m","description":"Detects certain parent child patterns found in cases in which a webshell is used to perform certain credential dumping or exfiltration activities on a compromised system","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:(/.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Hh][Pp]\\-[Cc][Gg][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Gg][Ii][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Tt][Tt][Pp][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Aa][Dd][Dd][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss]_[Tt][Oo][Mm][Cc][Aa][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.parent.executable:(/.*\\-[Tt][Oo][Mm][Cc][Aa][Tt]\\-.*/ OR /.*\\\\[Tt][Oo][Mm][Cc][Aa][Tt].*/)) OR (process.parent.executable:(/.*\\\\[Jj][Aa][Vv][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Jj][Aa][Vv][Aa][Ww]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]\\.[Jj][Aa][Rr].*/ OR /.*[Cc][Aa][Tt][Aa][Ll][Ii][Nn][Aa]_[Hh][Oo][Mm][Ee].*/))) AND ((process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Cc][Oo][Mm][Ss][Vv][Cc][Ss].*/) OR (process.command_line:/.*\\ \\-[Hh][Pp].*/ AND process.command_line:/.*\\ [Aa]\\ .*/ AND process.command_line:/.*\\ \\-[Mm].*/) OR (process.command_line:/.*[Nn][Ee][Tt].*/ AND process.command_line:/.*\\ [Uu][Ss][Ee][Rr]\\ .*/ AND process.command_line:/.*\\ \\/[Aa][Dd][Dd].*/) OR (process.command_line:/.*[Nn][Ee][Tt].*/ AND process.command_line:/.*\\ [Ll][Oo][Cc][Aa][Ll][Gg][Rr][Oo][Uu][Pp]\\ .*/ AND process.command_line:/.*\\ [Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr][Aa][Tt][Oo][Rr][Ss]\\ .*/ AND process.command_line:/.*\\/[Aa][Dd][Dd].*/) OR process.executable:(/.*\\\\[Nn][Tt][Dd][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Dd][Ii][Ff][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ff][Ii][Nn][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Aa][Nn][Oo][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ss][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) OR process.command_line:(/.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\/[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*[Rr][Ee][Gg]\\ [Ss][Aa][Vv][Ee]\\ .*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\ \\/[Tt][Ii][Cc][Kk][Ee][Tt]\\:.*/ OR /.*\\ [Ss][Ee][Kk][Uu][Rr][Ll][Ss][Aa].*/ OR /.*\\.[Dd][Mm][Pp]\\ [Ff][Uu][Ll][Ll].*/ OR /.*[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Cc][Aa][Ll][Ll]\\ [Cc][Rr][Ee][Aa][Tt][Ee].*/ OR /.*[Ww][Hh][Oo][Aa][Mm][Ii]\\ \\/[Pp][Rr][Ii][Vv].*/)))","rule_id":"4ebc877f-4612-45cb-b3a5-8e3834db36c9","timestamp_override":"event.ingested","references":["https://youtu.be/7aemGhaE9ds?t=641"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:(*\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe OR *\\\\caddy.exe OR *\\\\ws_tomcatservice.exe) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.executable:(*\\-tomcat\\-* OR *\\\\tomcat*)) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.command_line:(*catalina.jar* OR *CATALINA_HOME*))) AND ((process.command_line:*rundll32* AND process.command_line:*comsvcs*) OR (process.command_line:*\\ \\-hp* AND process.command_line:*\\ a\\ * AND process.command_line:*\\ \\-m*) OR (process.command_line:*net* AND process.command_line:*\\ user\\ * AND process.command_line:*\\ \\/add*) OR (process.command_line:*net* AND process.command_line:*\\ localgroup\\ * AND process.command_line:*\\ administrators\\ * AND process.command_line:*\\/add*) OR process.executable:(*\\\\ntdsutil.exe OR *\\\\ldifde.exe OR *\\\\adfind.exe OR *\\\\procdump.exe OR *\\\\Nanodump.exe OR *\\\\vssadmin.exe OR *\\\\fsutil.exe) OR process.command_line:(*\\ \\-NoP\\ * OR *\\ \\-W\\ Hidden\\ * OR *\\ \\-decode\\ * OR *\\ \\/decode\\ * OR *reg\\ save\\ * OR *.downloadstring\\(* OR *.downloadfile\\(* OR *FromBase64String* OR *\\ \\/ticket\\:* OR *\\ sekurlsa* OR *.dmp\\ full* OR *process\\ call\\ create* OR *whoami\\ \\/priv*)))`"}
