{"id":"4b9a8556-99c4-470b-a40c-9c8d02c77ed0","created_by":"Bhabesh Raj, Jonhnathan Ribeiro","name":"Credential Dumping by LaZagne","tags":["attack.credential_access","attack.t1003.001","attack.s0349"],"interval":"5m","description":"Detects LSASS process access by LaZagne for credential dumping.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.CallTrace:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll]\\+.*/ AND winlog.event_data.CallTrace:/.*|[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Kk][Ee][Rr][Nn][Ee][Ll][Bb][Aa][Ss][Ee]\\.[Dd][Ll][Ll]\\+.*/ AND winlog.event_data.CallTrace:/.*_[Cc][Tt][Yy][Pp][Ee][Ss]\\.[Pp][Yy][Dd]\\+.*/ AND winlog.event_data.CallTrace:/.*[Pp][Yy][Tt][Hh][Oo][Nn]27\\.[Dd][Ll][Ll]\\+.*/ AND winlog.event_data.GrantedAccess:/0[Xx]1[Ff][Ff][Ff][Ff][Ff]/)","rule_id":"4b9a8556-99c4-470b-a40c-9c8d02c77ed0","timestamp_override":"event.ingested","references":["https://twitter.com/bh4b3sh/status/1303674603819081728"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.CallTrace:*C\\:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll\\+* AND winlog.event_data.CallTrace:*|C\\:\\\\Windows\\\\System32\\\\KERNELBASE.dll\\+* AND winlog.event_data.CallTrace:*_ctypes.pyd\\+* AND winlog.event_data.CallTrace:*python27.dll\\+* AND winlog.event_data.GrantedAccess:0x1FFFFF)`"}
