{"id":"b655a06a-31c0-477a-95c2-3726b83d649d","created_by":"Florian Roth (rule), Samir Bousseaden (idea)","name":"Suspicious Userinit Child Process","tags":["attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Detects a suspicious child process of userinit","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.executable:/.*\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ AND (NOT (process.command_line:/.*\\\\[Nn][Ee][Tt][Ll][Oo][Gg][Oo][Nn]\\\\.*/))) AND (NOT (process.executable:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR ImageFileName:/[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)))","rule_id":"b655a06a-31c0-477a-95c2-3726b83d649d","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1139811587760562176"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.executable:*\\\\userinit.exe AND (NOT (process.command_line:*\\\\netlogon\\\\*))) AND (NOT (process.executable:*\\\\explorer.exe OR ImageFileName:explorer.exe)))`"}
