{"id":"52ff7941-8211-46f9-84f8-9903efb7077d","created_by":"Florian Roth","name":"PPID Spoofing Tool Usage","tags":["attack.defense_evasion","attack.t1134.004"],"interval":"5m","description":"Detects the use of parent process ID spoofing tools like Didier Stevens tool SelectMyParent","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Ss][Ee][Ll][Ee][Cc][Tt][Mm][Yy][Pp][Aa][Rr][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR process.command_line:(/.*[Pp][Pp][Ii][Dd]\\-[Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Pp][Pp][Ii][Dd]_[Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Ss][Pp][Oo][Oo][Ff]\\-[Pp][Pp][Ii][Dd].*/ OR /.*[Ss][Pp][Oo][Oo][Ff]_[Pp][Pp][Ii][Dd].*/ OR /.*[Pp][Pp][Ii][Dd][Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Ss][Pp][Oo][Oo][Ff][Pp][Pp][Ii][Dd].*/ OR /.*[Ss][Pp][Oo][Oo][Ff][Ee][Dd][Pp][Pp][Ii][Dd].*/ OR /.*\\ \\-[Ss][Pp][Aa][Ww][Nn][Tt][Oo]\\ .*/) OR process.pe.original_file_name:(/.*[Pp][Pp][Ii][Dd]\\-[Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Pp][Pp][Ii][Dd]_[Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Ss][Pp][Oo][Oo][Ff]\\-[Pp][Pp][Ii][Dd].*/ OR /.*[Ss][Pp][Oo][Oo][Ff]_[Pp][Pp][Ii][Dd].*/ OR /.*[Pp][Pp][Ii][Dd][Ss][Pp][Oo][Oo][Ff].*/ OR /.*[Ss][Pp][Oo][Oo][Ff][Pp][Pp][Ii][Dd].*/ OR /.*[Ss][Pp][Oo][Oo][Ff][Ee][Dd][Pp][Pp][Ii][Dd].*/) OR process.pe.description:/[Ss][Ee][Ll][Ee][Cc][Tt][Mm][Yy][Pp][Aa][Rr][Ee][Nn][Tt]/ OR process.pe.imphash:(/04[Dd]974875[Bb][Dd]225[Ff]00902[Bb]4[Cc][Aa][Dd]9[Aa][Ff]3[Ff][Bb][Cc]/ OR /[Aa]782[Aa][Ff]154[Cc]9[Ee]743[Dd][Dd][Ff]3[Ff]3[Ee][Bb]2[Bb]8[Ff]3[Dd]16[Ee]/ OR /89059503[Dd]7[Ff][Bb][Ff]470[Ee]68[Ff]7[Ee]63313[Dd][Aa]3[Aa][Dd]/ OR /[Cc][Aa]28337632625[Cc]8281[Aa][Bb]8[Aa]130[Bb]3[Dd]6[Bb][Aa][Dd]/) OR related.hash:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=04[Dd]974875[Bb][Dd]225[Ff]00902[Bb]4[Cc][Aa][Dd]9[Aa][Ff]3[Ff][Bb][Cc].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Aa]782[Aa][Ff]154[Cc]9[Ee]743[Dd][Dd][Ff]3[Ff]3[Ee][Bb]2[Bb]8[Ff]3[Dd]16[Ee].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=89059503[Dd]7[Ff][Bb][Ff]470[Ee]68[Ff]7[Ee]63313[Dd][Aa]3[Aa][Dd].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Cc][Aa]28337632625[Cc]8281[Aa][Bb]8[Aa]130[Bb]3[Dd]6[Bb][Aa][Dd].*/))","rule_id":"52ff7941-8211-46f9-84f8-9903efb7077d","timestamp_override":"event.ingested","references":["https://pentestlab.blog/2020/02/24/parent-pid-spoofing/","https://www.picussecurity.com/resource/blog/how-to-detect-parent-pid-ppid-spoofing-attacks","https://www.ired.team/offensive-security/defense-evasion/parent-process-id-ppid-spoofing","https://www.virustotal.com/gui/search/filename%253A*spoof*%2520filename%253A*ppid*/files"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\SelectMyParent.exe OR process.command_line:(*PPID\\-spoof* OR *ppid_spoof* OR *spoof\\-ppid* OR *spoof_ppid* OR *ppidspoof* OR *spoofppid* OR *spoofedppid* OR *\\ \\-spawnto\\ *) OR process.pe.original_file_name:(*PPID\\-spoof* OR *ppid_spoof* OR *spoof\\-ppid* OR *spoof_ppid* OR *ppidspoof* OR *spoofppid* OR *spoofedppid*) OR process.pe.description:SelectMyParent OR process.pe.imphash:(04d974875bd225f00902b4cad9af3fbc OR a782af154c9e743ddf3f3eb2b8f3d16e OR 89059503d7fbf470e68f7e63313da3ad OR ca28337632625c8281ab8a130b3d6bad) OR related.hash:(*IMPHASH\\=04D974875BD225F00902B4CAD9AF3FBC* OR *IMPHASH\\=A782AF154C9E743DDF3F3EB2B8F3D16E* OR *IMPHASH\\=89059503D7FBF470E68F7E63313DA3AD* OR *IMPHASH\\=CA28337632625C8281AB8A130B3D6BAD*))`"}
