{"id":"a018fdc3-46a3-44e5-9afb-2cd4af1d4b39","created_by":"Florian Roth","name":"Execution in Outlook Temp Folder","tags":["attack.initial_access","attack.t1566.001"],"interval":"5m","description":"Detects a suspicious program execution in Outlook temp folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:/.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\.*/","rule_id":"a018fdc3-46a3-44e5-9afb-2cd4af1d4b39","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:*\\\\Temporary\\ Internet\\ Files\\\\Content.Outlook\\\\*`"}
