{"id":"cb5a2333-56cf-4562-8fcb-22ba1bca728d","created_by":"Florian Roth","name":"Obfuscated IP Download","tags":["attack.discovery"],"interval":"5m","description":"Detects use of an encoded/obfuscated version of an IP address (hex, octal...) in an URL combined with a download command","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*[Ww][Gg][Ee][Tt]\\ .*/ OR /.*[Cc][Uu][Rr][Ll]\\ .*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/) AND (process.command_line:(/.*\\/\\/0[Xx].*/ OR /.*\\.0[Xx].*/ OR /.*\\.00[Xx].*/) OR (process.command_line:/.*[Hh][Tt][Tt][Pp]\\:\\/\\/%.*/ AND process.command_line:/.*%2[Ee].*/)))","rule_id":"cb5a2333-56cf-4562-8fcb-22ba1bca728d","timestamp_override":"event.ingested","references":["https://h.43z.one/ipconverter/","https://twitter.com/Yasser_Elsnbary/status/1553804135354564608"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ * OR *DownloadFile* OR *DownloadString*) AND (process.command_line:(*\\/\\/0x* OR *.0x* OR *.00x*) OR (process.command_line:*http\\:\\/\\/%* AND process.command_line:*%2e*)))`"}
