{"id":"9f06447a-a33a-4cbe-a94f-a3f43184a7a3","created_by":"Florian Roth","name":"Rundll32 JS RunHTMLApplication Pattern","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects suspicious command line patterns used when rundll32 is used to run JavaScript code","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.command_line:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND process.command_line:/.*[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt].*/ AND process.command_line:/.*\\.\\.\\\\\\.\\.\\\\[Mm][Ss][Hh][Tt][Mm][Ll],[Rr][Uu][Nn][Hh][Tt][Mm][Ll][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/) OR process.command_line:/.*;[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt]\\.[Ww][Rr][Ii][Tt][Ee]\\(\\);[Gg][Ee][Tt][Oo][Bb][Jj][Ee][Cc][Tt]\\(\\\"[Ss][Cc][Rr][Ii][Pp][Tt].*/)","rule_id":"9f06447a-a33a-4cbe-a94f-a3f43184a7a3","timestamp_override":"event.ingested","references":["http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.command_line:*rundll32* AND process.command_line:*javascript* AND process.command_line:*..\\\\..\\\\mshtml,RunHTMLApplication*) OR process.command_line:*;document.write\\(\\);GetObject\\(\\\"script*)`"}
