{"id":"52788a70-f1da-40dd-8fbd-73b5865d6568","created_by":"frack113","name":"JSC Convert Javascript To Executable","tags":["attack.defense_evasion","attack.t1127"],"interval":"5m","description":"Detects the execution of the LOLBIN jsc.exe used by .NET to compile javascript code to .exe or .dll format","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:/.*\\\\[Jj][Ss][Cc]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Jj][Ss].*/)","rule_id":"52788a70-f1da-40dd-8fbd-73b5865d6568","timestamp_override":"event.ingested","references":["https://lolbas-project.github.io/lolbas/Binaries/Jsc/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:*\\\\jsc.exe AND process.command_line:*.js*)`"}
