{"id":"087790e3-3287-436c-bccf-cbd0184a7db1","created_by":"xknow @xknow_infosec, Tim Shelton","name":"Cmd.exe CommandLine Path Traversal","tags":["attack.execution","attack.t1059.003"],"interval":"5m","description":"detects the usage of path traversal in cmd.exe indicating possible command/argument confusion/hijacking","risk_score":73,"enabled":true,"severity":"high","false_positives":["(not much) some benign Java tools may product false-positive commandlines for loading libraries"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.parent.command_line:/.*[Cc][Mm][Dd].*/ AND process.parent.command_line:/.*\\/[Cc].*/ AND process.command_line:/.*\\/\\.\\.\\/\\.\\.\\/.*/) AND (NOT ((process.command_line:/.*\\\\[Tt][Aa][Ss][Kk][Tt][Oo][Pp]\\\\[Kk][Ee][Yy][Cc][Ll][Oo][Aa][Kk]\\\\[Bb][Ii][Nn]\\\\\\/\\.\\.\\/\\.\\.\\/[Jj][Rr][Ee]\\\\[Bb][Ii][Nn]\\\\[Jj][Aa][Vv][Aa].*/))))","rule_id":"087790e3-3287-436c-bccf-cbd0184a7db1","timestamp_override":"event.ingested","references":["https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/","https://twitter.com/Oddvarmoe/status/1270633613449723905"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.parent.command_line:*cmd* AND process.parent.command_line:*\\/c* AND process.command_line:*\\/..\\/..\\/*) AND (NOT ((process.command_line:*\\\\Tasktop\\\\keycloak\\\\bin\\\\\\/..\\/..\\/jre\\\\bin\\\\java*))))`"}
