{"id":"68bcd73b-37ef-49cb-95fc-edc809730be6","created_by":"Nasreddine Bencherchali","name":"WMIC Unquoted Services Path Lookup","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Detects wmic known recon method to look for unquoted service paths, often used by pentest and attackers enum scripts","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.pe.original_file_name:/[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR process.executable:/.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/) AND (process.command_line:/.*\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/ AND process.command_line:/.*\\ [Gg][Ee][Tt]\\ .*/ AND process.command_line:(/.*[Nn][Aa][Mm][Ee].*/ OR /.*[Dd][Ii][Ss][Pp][Ll][Aa][Yy][Nn][Aa][Mm][Ee].*/ OR /.*[Pp][Aa][Tt][Hh][Nn][Aa][Mm][Ee].*/ OR /.*[Ss][Tt][Aa][Rr][Tt][Mm][Oo][Dd][Ee].*/)))","rule_id":"68bcd73b-37ef-49cb-95fc-edc809730be6","timestamp_override":"event.ingested","references":["https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py","https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.pe.original_file_name:wmic.exe OR process.executable:*\\\\WMIC.exe) AND (process.command_line:*\\ service\\ * AND process.command_line:*\\ get\\ * AND process.command_line:(*name* OR *displayname* OR *pathname* OR *startmode*)))`"}
