{"id":"5a5152f1-463f-436b-b2f5-8eceb3964b42","created_by":"frack113","name":"Modification of Explorer Hidden Keys","tags":["attack.defense_evasion","attack.t1564.001"],"interval":"5m","description":"Detects modifications to the hidden files keys in registry. This technique is abused by several malware families to hide their files from normal users.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Ss][Hh][Oo][Ww][Ss][Uu][Pp][Ee][Rr][Hh][Ii][Dd][Dd][Ee][Nn]/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Hh][Ii][Dd][Dd][Ee][Nn]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"5a5152f1-463f-436b-b2f5-8eceb3964b42","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md#atomic-test-8---hide-files-through-registry"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:(HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\ShowSuperHidden OR HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\Hidden) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
