{"id":"fcddca7c-b9c0-4ddf-98da-e1e2d18b0157","created_by":"Florian Roth","name":"Disabled Windows Defender Eventlog","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the disabling of the Windows Defender eventlog as seen in relation to Lockbit 3.0 infections","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other Antivirus software installations could cause Windows to disable that eventlog (unknown)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Cc][Hh][Aa][Nn][Nn][Ee][Ll][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"fcddca7c-b9c0-4ddf-98da-e1e2d18b0157","timestamp_override":"event.ingested","references":["https://twitter.com/WhichbufferArda/status/1543900539280293889/photo/2"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\WINEVT\\\\Channels\\\\Microsoft\\-Windows\\-Windows\\ Defender\\/Operational\\\\Enabled* AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
