{"id":"55e29995-75e7-451a-bef0-6225e2f13597","created_by":"Florian Roth","name":"SilentProcessExit Monitor Registration for LSASS","tags":["attack.credential_access","attack.t1003.007"],"interval":"5m","description":"Detects changes to the Registry in which a monitor program gets registered to dump the memory of the lsass.exe process","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Ii][Ll][Ee][Nn][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ee][Xx][Ii][Tt]\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee].*/","rule_id":"55e29995-75e7-451a-bef0-6225e2f13597","timestamp_override":"event.ingested","references":["https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/","https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit\\\\lsass.exe*`"}
