{"id":"41d1058a-aea7-4952-9293-29eaaf516465","created_by":"frack113","name":"Removal Of Amsi Provider Reg Key","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Remove the AMSI Provider registry key in HKLM\\Software\\Microsoft\\AMSI to disable AMSI inspection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:(/.*\\{2781761[Ee]\\-28[Ee]0\\-4109\\-99[Ff][Ee]\\-[Bb]9[Dd]127[Cc]57[Aa][Ff][Ee]\\}/ OR /.*\\{[Aa]7[Cc]452[Ee][Ff]\\-8[Ee]9[Ff]\\-42[Ee][Bb]\\-9[Ff]2[Bb]\\-245613[Cc][Aa]0[Dd][Cc]9\\}/))","rule_id":"41d1058a-aea7-4952-9293-29eaaf516465","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://seclists.org/fulldisclosure/2020/Mar/45"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:DeleteKey AND registry.path:(*\\{2781761E\\-28E0\\-4109\\-99FE\\-B9D127C57AFE\\} OR *\\{A7C452EF\\-8E9F\\-42EB\\-9F2B\\-245613CA0DC9\\}))`"}
