{"id":"5aad0995-46ab-41bd-a9ff-724f41114971","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Esentutl Volume Shadow Copy Service Keys","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects the volume shadow copy service initialization and processing via esentutl. Registry keys such as HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\VSS\\\\Diag\\\\VolSnap\\\\Volume are captured.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Vv][Ss][Ss].*/ AND process.executable:/.*[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/) AND (NOT (registry.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Vv][Ss][Ss]\\\\[Ss][Tt][Aa][Rr][Tt].*/)))","rule_id":"5aad0995-46ab-41bd-a9ff-724f41114971","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:*System\\\\CurrentControlSet\\\\Services\\\\VSS* AND process.executable:*esentutl.exe) AND (NOT (registry.path:*System\\\\CurrentControlSet\\\\Services\\\\VSS\\\\Start*)))`"}
