{"id":"c7dcacd0-cc59-4004-b0a4-1d6cdebe6f3e","created_by":"frack113","name":"Disable Administrative Share Creation at Startup","tags":["attack.defense_evasion","attack.t1070.005"],"interval":"5m","description":"Administrative shares are hidden network shares created by Microsoft Windows NT operating systems that grant system administrators remote access to every disk volume on a network-connected system","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ll][Aa][Nn][Mm][Aa][Nn][Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\.*/ AND registry.path:(/.*[Aa][Uu][Tt][Oo][Ss][Hh][Aa][Rr][Ee][Ww][Kk][Ss]/ OR /.*[Aa][Uu][Tt][Oo][Ss][Hh][Aa][Rr][Ee][Ss][Ee][Rr][Vv][Ee][Rr]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"c7dcacd0-cc59-4004-b0a4-1d6cdebe6f3e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md#atomic-test-4---disable-administrative-share-creation-at-startup"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\LanmanServer\\\\Parameters\\\\* AND registry.path:(*AutoShareWks OR *AutoShareServer) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
