{"id":"04b45a8a-d11d-49e4-9acc-4a1b524407a5","created_by":"Austin Songer","name":"DNS-over-HTTPS Enabled by Registry","tags":["attack.defense_evasion","attack.t1140","attack.t1112"],"interval":"5m","description":"Detects when a user enables DNS-over-HTTPS. This can be used to hide internet activity or be used to hide the process of exfiltrating data. With this enabled organization will lose visibility into data such as query type, response and originating IP that are used to determine bad actors.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Bb][Uu][Ii][Ll][Tt][Ii][Nn][Dd][Nn][Ss][Cc][Ll][Ii][Ee][Nn][Tt][Ee][Nn][Aa][Bb][Ll][Ee][Dd]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Dd][Nn][Ss][Oo][Vv][Ee][Rr][Hh][Tt][Tt][Pp][Ss][Mm][Oo][Dd][Ee]/ AND winlog.event_data.Details:/[Ss][Ee][Cc][Uu][Rr][Ee]/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Dd][Nn][Ss][Oo][Vv][Ee][Rr][Hh][Tt][Tt][Pp][Ss]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/))","rule_id":"04b45a8a-d11d-49e4-9acc-4a1b524407a5","timestamp_override":"event.ingested","references":["https://www.tenforums.com/tutorials/151318-how-enable-disable-dns-over-https-doh-microsoft-edge.html","https://github.com/elastic/detection-rules/issues/1371","https://chromeenterprise.google/policies/?policy=DnsOverHttpsMode","https://admx.help/HKLM/Software/Policies/Mozilla/Firefox/DNSOverHTTPS"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Edge\\\\BuiltInDnsClientEnabled AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR (winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Google\\\\Chrome\\\\DnsOverHttpsMode AND winlog.event_data.Details:secure) OR (winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Policies\\\\Mozilla\\\\Firefox\\\\DNSOverHTTPS\\\\Enabled AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)))`"}
