{"id":"0c93308a-3f1b-40a9-b649-57ea1a1c1d63","created_by":"frack113","name":"Disable Windows Security Center Notifications","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect set UseActionCenterExperience to 0 to disable the windows security center notification","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Uu][Xx]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn]_[Ss][Uu][Pp][Pp][Rr][Ee][Ss][Ss]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"0c93308a-3f1b-40a9-b649-57ea1a1c1d63","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\UX\\ Configuration\\\\Notification_Suppress AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
