{"id":"25ffa65d-76d8-4da5-a832-3f2b0136e133","created_by":"Markus Neis","name":"Usage of Sysinternals Tools","tags":["attack.resource_development","attack.t1588.002"],"interval":"5m","description":"Detects the usage of Sysinternals Tools due to accepteula key being added to Registry","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate use of SysInternals tools","Programs that use the same Registry Key"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*\\\\[Ee][Uu][Ll][Aa][Aa][Cc][Cc][Ee][Pp][Tt][Ee][Dd]/)","rule_id":"25ffa65d-76d8-4da5-a832-3f2b0136e133","timestamp_override":"event.ingested","references":["https://twitter.com/Moti_B/status/1008587936735035392"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:CreateKey AND registry.path:*\\\\EulaAccepted)`"}
