{"id":"9577edbb-851f-4243-8c91-1d5b50c1a39b","created_by":"Mateusz Wydra, oscd.community","name":"Atbroker Registry Change","tags":["attack.defense_evasion","attack.t1218","attack.persistence","attack.t1547"],"interval":"5m","description":"Detects creation/modification of Assisitive Technology applications and persistence with usage of ATs","risk_score":73,"enabled":true,"severity":"high","false_positives":["Creation of non-default, legitimate AT."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Ii][Bb][Ii][Ll][Ii][Tt][Yy]\\\\[Aa][Tt][Ss].*/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Ii][Bb][Ii][Ll][Ii][Tt][Yy]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn].*/)","rule_id":"9577edbb-851f-4243-8c91-1d5b50c1a39b","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/","https://lolbas-project.github.io/lolbas/Binaries/Atbroker/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:(*Software\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Accessibility\\\\ATs* OR *Software\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Accessibility\\\\Configuration*)`"}
