{"id":"46dd5308-4572-4d12-aa43-8938f0184d4f","created_by":"frack113","name":"Bypass UAC Using DelegateExecute","tags":["attack.privilege_escalation","attack.defense_evasion","attack.t1548.002"],"interval":"5m","description":"Bypasses User Account Control using a fileless method","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Ee][Xx][Ee][Cc][Uu][Tt][Ee]/ AND winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/)","rule_id":"46dd5308-4572-4d12-aa43-8938f0184d4f","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand","https://devblogs.microsoft.com/oldnewthing/20100312-01/?p=14623","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-7---bypass-uac-using-sdclt-delegateexecute"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\open\\\\command\\\\DelegateExecute AND winlog.event_data.Details:\\(Empty\\))`"}
