{"id":"1a2d6c47-75b0-45bd-b133-2c0be75349fd","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Wdigest CredGuard Registry Modification","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects potential malicious modification of the property value of IsCredGuardEnabled from HKLM:\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest to disable Cred Guard on a system. This is usually used with UseLogonCredential to manipulate the caching credentials.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*\\\\[Ii][Ss][Cc][Rr][Ee][Dd][Gg][Uu][Aa][Rr][Dd][Ee][Nn][Aa][Bb][Ll][Ee][Dd]/","rule_id":"1a2d6c47-75b0-45bd-b133-2c0be75349fd","timestamp_override":"event.ingested","references":["https://teamhydra.blog/2020/08/25/bypassing-credential-guard/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*\\\\IsCredGuardEnabled`"}
