{"id":"f37b4bce-49d0-4087-9f5b-58bffda77316","created_by":"Nasreddine Bencherchali","name":"AutoLogger Sessions Tamper","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects tampering of autologger trace sessions which is a technique used by attackers to disable logging","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ww][Mm][Ii]\\\\[Aa][Uu][Tt][Oo][Ll][Oo][Gg][Gg][Ee][Rr]\\\\.*/ AND winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]\\-.*/ OR /.*\\\\[Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*/) AND registry.path:(/.*\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd]/ OR /.*\\\\[Ss][Tt][Aa][Rr][Tt]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"f37b4bce-49d0-4087-9f5b-58bffda77316","timestamp_override":"event.ingested","references":["https://twitter.com/MichalKoczwara/status/1553634816016498688","https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\System\\\\CurrentControlSet\\\\Control\\\\WMI\\\\Autologger\\\\* AND winlog.event_data.EventType:SetValue AND registry.path:(*\\\\EventLog\\-* OR *\\\\Defender*) AND registry.path:(*\\\\Enabled OR *\\\\Start) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
