{"id":"a07f0359-4c90-4dc4-a681-8ffea40b4f47","created_by":"Florian Roth, frack113","name":"Service Binary in Suspicious Folder","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect the creation of a service with a service binary located in a suspicious directory","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND registry.path:/.*\\\\[Ss][Tt][Aa][Rr][Tt]/ AND process.executable:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/) AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/)) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND registry.path:/.*\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]/ AND winlog.event_data.Details:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp]\\\\.*/)))","rule_id":"a07f0359-4c90-4dc4-a681-8ffea40b4f47","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND registry.path:*\\\\Start AND process.executable:(*\\\\Users\\\\Public\\\\* OR *\\\\Perflogs\\\\* OR *\\\\ADMIN$\\\\* OR *\\\\Temp\\\\*) AND winlog.event_data.Details:(DWORD\\ \\(0x00000000\\) OR DWORD\\ \\(0x00000001\\) OR DWORD\\ \\(0x00000002\\))) OR (winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND registry.path:*\\\\ImagePath AND winlog.event_data.Details:(*\\\\Users\\\\Public\\\\* OR *\\\\Perflogs\\\\* OR *\\\\ADMIN$\\\\* OR *\\\\Temp\\\\*)))`"}
