{"id":"eeb30123-9fbd-4ee8-aaa0-2e545bbed6dc","created_by":"iwillkeepwatch","name":"Security Support Provider (SSP) Added to LSA Configuration","tags":["attack.persistence","attack.t1547.005"],"interval":"5m","description":"Detects the addition of a SSP to the registry. Upon a reboot or API call, SSP DLLs gain access to encrypted and plaintext passwords stored in Windows.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss]/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa]\\\\[Oo][Ss][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss]/) AND (NOT (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/))))","rule_id":"eeb30123-9fbd-4ee8-aaa0-2e545bbed6dc","timestamp_override":"event.ingested","references":["https://powersploit.readthedocs.io/en/latest/Persistence/Install-SSP/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:(HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\Lsa\\\\Security\\ Packages OR HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\Lsa\\\\OSConfig\\\\Security\\ Packages) AND (NOT (process.executable:(C\\:\\\\Windows\\\\system32\\\\msiexec.exe OR C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe))))`"}
