{"id":"c81fe886-cac0-4913-a511-2822d72ff505","created_by":"Florian Roth","name":"SilentProcessExit Monitor Registration","tags":["attack.persistence","attack.t1546.012"],"interval":"5m","description":"Detects changes to the Registry in which a monitor program gets registered to monitor the exit of another process","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Ii][Ll][Ee][Nn][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ee][Xx][Ii][Tt].*/ AND winlog.event_data.Details:/.*[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/)","rule_id":"c81fe886-cac0-4913-a511-2822d72ff505","timestamp_override":"event.ingested","references":["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/","https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit* AND winlog.event_data.Details:*MonitorProcess*)`"}
