{"id":"07bdd2f5-9c58-4f38-aec8-e101bb79ef8d","created_by":"Christian Burkard","name":"Terminal Server Client Connection History Cleared","tags":["attack.defense_evasion","attack.t1070","attack.t1112"],"interval":"5m","description":"Detects the deletion of registry keys containing the MSTSC connection history","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Mm][Rr][Uu].*/) OR (winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Ss]\\\\.*/))","rule_id":"07bdd2f5-9c58-4f38-aec8-e101bb79ef8d","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/troubleshoot/windows-server/remote/remove-entries-from-remote-desktop-connection-computer","http://woshub.com/how-to-clear-rdp-connections-history/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:DeleteValue AND registry.path:*\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Default\\\\MRU*) OR (winlog.event_data.EventType:DeleteKey AND registry.path:*\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Servers\\\\*))`"}
