{"id":"46490193-1b22-4c29-bdd6-5bf63907216f","created_by":"Florian Roth","name":"VBScript Payload Stored in Registry","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects VBScript content stored into registry keys as seen being used by UNC2452 group","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/ AND winlog.event_data.Details:(/.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Jj][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Mm][Ss][Hh][Tt][Mm][Ll].*/ OR /.*[Rr][Uu][Nn][Hh][Tt][Mm][Ll][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\(.*/ OR /.*[Cc][Rr][Ee][Aa][Tt][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/ OR /.*[Rr][Ee][Gg][Rr][Ee][Aa][Dd].*/ OR /.*[Ww][Ii][Nn][Dd][Oo][Ww]\\.[Cc][Ll][Oo][Ss][Ee].*/)) AND (NOT ((registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/) OR (process.executable:/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Uu][Ss][Ee][Rr][Dd][Aa][Tt][Aa]\\\\.*/ AND winlog.event_data.Details:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Pp][Rr][Ii][Mm][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Oo][Pp]\\ [Aa][Ss][Ss][Ee][Mm][Bb][Ll][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Mm][Ss][Hh][Tt][Mm][Ll]\\.[Dd][Ll][Ll].*/ OR /.*\\<\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Mm][Ss][Hh][Tt][Mm][Ll],[Ff][Ii][Ll][Ee][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=.*/ OR /.*[Ff][Ll]_[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]_[Mm][Ss][Hh][Tt][Mm][Ll]_[Dd][Ll][Ll]_____[Xx]86\\..*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]_[Mm][Ss][Hh][Tt][Mm][Ll]_[Dd][Ll][Ll]_1_____[Xx]86\\..*/ OR /.*\\<\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Mm][Ss][Hh][Tt][Mm][Ll],[Cc][Uu][Ll][Tt][Uu][Rr][Ee]\\=.*/)))))","rule_id":"46490193-1b22-4c29-bdd6-5bf63907216f","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*Software\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.Details:(*vbscript* OR *jscript* OR *mshtml* OR *RunHTMLApplication* OR *Execute\\(* OR *CreateObject* OR *RegRead* OR *window.close*)) AND (NOT ((registry.path:*Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run*) OR (process.executable:*\\\\msiexec.exe AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Installer\\\\UserData\\\\* AND winlog.event_data.Details:(*\\\\Microsoft.NET\\\\Primary\\ Interop\\ Assemblies\\\\Microsoft.mshtml.dll* OR *<\\\\Microsoft.mshtml,fileVersion\\=* OR *FL_Microsoft_mshtml_dll_____X86.* OR *Microsoft_mshtml_dll_1_____X86.* OR *<\\\\Microsoft.mshtml,culture\\=*)))))`"}
