{"id":"c7da8edc-49ae-45a2-9e61-9fd860e4e73d","created_by":"Nasreddine Bencherchali","name":"Usage of Suspicious Sysinternals Tools","tags":["attack.resource_development","attack.t1588.002"],"interval":"5m","description":"Detects the usage of Suspicious Sysinternals Tools such as PsExec, Procdump...etc via the \"accepteula\" key being added to Registry","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of SysInternals tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt].*/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd].*/ OR /.*\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Ss][Yy][Ss][Ii][Nn][Tt][Ee][Rr][Nn][Aa][Ll][Ss].*/) AND registry.path:/.*\\\\[Ee][Uu][Ll][Aa][Aa][Cc][Cc][Ee][Pp][Tt][Ee][Dd]/)","rule_id":"c7da8edc-49ae-45a2-9e61-9fd860e4e73d","timestamp_override":"event.ingested","references":["https://twitter.com/Moti_B/status/1008587936735035392"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:CreateKey AND registry.path:(*\\\\PsExec* OR *\\\\ProcDump* OR *\\\\Handle* OR *\\\\LiveKd* OR *\\\\Process\\ Explorer* OR *\\\\PsLoglist* OR *\\\\PsPasswd* OR *\\\\Active\\ Directory\\ Explorer* OR *\\\\Sysinternals*) AND registry.path:*\\\\EulaAccepted)`"}
