{"id":"2d9403d5-7927-46b7-8216-37ab7c9ec5e3","created_by":"Sittikorn S","name":"Suspicious Set Value of MSDT in Registry (CVE-2022-30190)","tags":["attack.defense_evasion","attack.t1221"],"interval":"5m","description":"Detects set value ms-msdt MSProtocol URI scheme in Registry that could be an attempt to exploit CVE-2022-30190.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Cc][Rr]\\\\[Mm][Ss]\\-[Mm][Ss][Dd][Tt]\\\\.*/)","rule_id":"2d9403d5-7927-46b7-8216-37ab7c9ec5e3","timestamp_override":"event.ingested","references":["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-30190","https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKCR\\\\ms\\-msdt\\\\*)`"}
