{"id":"0eb46774-f1ab-4a74-8238-1155855f2263","created_by":"AlertIQ, Ján Trenčanský, frack113, Nasreddine Bencherchali","name":"Disable Windows Defender Functionalities Via Registry Keys","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects when attackers or tools disable Windows Defender functionalities via the windows registry","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/) AND ((registry.path:(/.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Oo][Nn][Aa][Cc][Cc][Ee][Ss][Ss][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Oo][Nn][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Ee][Nn][Aa][Bb][Ll][Ee]/ OR /.*\\\\[Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ee][Nn][Hh][Aa][Nn][Cc][Ee][Dd][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss]/ OR /.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]/ OR /.*\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Ss][Pp][Yy][Ww][Aa][Rr][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR (registry.path:(/.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Ss][Pp][Yy][Nn][Ee][Tt][Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]/ OR /.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Ss][Uu][Bb][Mm][Ii][Tt][Ss][Aa][Mm][Pp][Ll][Ee][Ss][Cc][Oo][Nn][Ss][Ee][Nn][Tt]/ OR /.*\\\\[Mm][Pp][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Mm][Pp][Ee][Nn][Aa][Bb][Ll][Ee][Pp][Uu][Ss]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)))","rule_id":"0eb46774-f1ab-4a74-8238-1155855f2263","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/","https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105","https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\*) AND ((registry.path:(*\\\\Real\\-Time\\ Protection\\\\DisableBehaviorMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableIOAVProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableOnAccessProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableScanOnRealtimeEnable OR *\\\\Reporting\\\\DisableEnhancedNotifications OR *\\\\SpyNet\\\\DisableBlockAtFirstSeen OR *\\\\DisableAntiSpyware OR *\\\\DisableAntiVirus) AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR (registry.path:(*\\\\SpyNet\\\\SpynetReporting OR *\\\\SpyNet\\\\SubmitSamplesConsent OR *\\\\MpEngine\\\\MpEnablePus) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))))`"}
