{"id":"b3503044-60ce-4bf4-bbcb-e3db98788823","created_by":"Florian Roth","name":"DLL Load via LSASS","tags":["attack.execution","attack.persistence","attack.t1547.008"],"interval":"5m","description":"Detects a method to load DLL via LSASS process using an undocumented Registry key","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:(/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ee][Xx][Tt][Pp][Tt].*/ OR /.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Ll][Ss][Aa][Dd][Bb][Ee][Xx][Tt][Pp][Tt].*/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:(/%%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ss][Aa]\\.[Dd][Ll][Ll]/ OR /%%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Dd][Bb]\\.[Dd][Ll][Ll]/)))))","rule_id":"b3503044-60ce-4bf4-bbcb-e3db98788823","timestamp_override":"event.ingested","references":["https://blog.xpnsec.com/exploring-mimikatz-part-1/","https://twitter.com/SBousseaden/status/1183745981189427200"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:(*\\\\CurrentControlSet\\\\Services\\\\NTDS\\\\DirectoryServiceExtPt* OR *\\\\CurrentControlSet\\\\Services\\\\NTDS\\\\LsaDbExtPt*) AND (NOT ((process.executable:C\\:\\\\Windows\\\\system32\\\\lsass.exe AND winlog.event_data.Details:(%%systemroot%%\\\\system32\\\\ntdsa.dll OR %%systemroot%%\\\\system32\\\\lsadb.dll)))))`"}
