{"id":"73a883d0-0348-4be4-a8d8-51031c2564f8","created_by":"Lednyov Alexey, oscd.community","name":"Registry Persistence Mechanism via Windows Telemetry","tags":["attack.persistence","attack.t1053.005"],"interval":"5m","description":"Detects persistence method using windows telemetry","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr]\\\\.*/ AND registry.path:/.*\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ AND winlog.event_data.Details:/.*\\.[Ee][Xx][Ee].*/) AND (NOT (winlog.event_data.Details:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Ee][Nn][Ss][Uu][Ss]\\.[Ee][Xx][Ee].*/))))","rule_id":"73a883d0-0348-4be4-a8d8-51031c2564f8","timestamp_override":"event.ingested","references":["https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AppCompatFlags\\\\TelemetryController\\\\* AND registry.path:*\\\\Command* AND winlog.event_data.Details:*.exe*) AND (NOT (winlog.event_data.Details:(*\\\\system32\\\\CompatTelRunner.exe* OR *\\\\system32\\\\DeviceCensus.exe*))))`"}
