{"id":"9c5037d1-c568-49b3-88c7-9846a5bdc2be","created_by":"Florian Roth","name":"Suspicious Run Key from Download","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects the suspicious RUN keys created by software located in Download or temporary Outlook/Internet Explorer directories","risk_score":73,"enabled":true,"severity":"high","false_positives":["Software installers downloaded and used by users"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\.*/ OR /.*\\\\[Ll][Oo][Cc][Aa][Ll]\\ [Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/) AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\.*/)","rule_id":"9c5037d1-c568-49b3-88c7-9846a5bdc2be","timestamp_override":"event.ingested","references":["https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\Downloads\\\\* OR *\\\\Temporary\\ Internet\\ Files\\\\Content.Outlook\\\\* OR *\\\\Local\\ Settings\\\\Temporary\\ Internet\\ Files\\\\*) AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*)`"}
