{"id":"5de03871-5d46-4539-a82d-3aa992a69a83","created_by":"frack113","name":"Registry Disable System Restore","tags":["attack.impact","attack.t1490"],"interval":"5m","description":"Detects the modification of the registry to disable a system restore on the computer","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Tt][Oo][Rr][Ee].*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Tt][Oo][Rr][Ee].*/) AND registry.path:(/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Cc][Oo][Nn][Ff][Ii][Gg]/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Rr]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"5de03871-5d46-4539-a82d-3aa992a69a83","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:(*\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\SystemRestore* OR *\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SystemRestore*) AND registry.path:(*DisableConfig OR *DisableSR) AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
