{"id":"f7997770-92c3-4ec9-b112-774c4ef96f96","created_by":"Nasreddine Bencherchali","name":"Winlogon AllowMultipleTSSessions Enable","tags":["attack.persistence"],"interval":"5m","description":"Detects when the 'AllowMultipleTSSessions' value is enabled. Which allows for multiple Remote Desktop connection sessions to be opened at once. This is often used by attacker as a way to connect to an RDP session without disconnecting the other users","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitmate use of the multi session functionality"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Aa][Ll][Ll][Oo][Ww][Mm][Uu][Ll][Tt][Ii][Pp][Ll][Ee][Tt][Ss][Ss][Ee][Ss][Ss][Ii][Oo][Nn][Ss]/ AND winlog.event_data.Details:/.*[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"f7997770-92c3-4ec9-b112-774c4ef96f96","timestamp_override":"event.ingested","references":["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon\\\\AllowMultipleTSSessions AND winlog.event_data.Details:*DWORD\\ \\(0x00000001\\))`"}
