{"id":"41f6531d-af6e-4c6e-918f-b946f2b85a36","created_by":"Nasreddine Bencherchali","name":"Persistence Via LSA Extensions","tags":["attack.persistence"],"interval":"5m","description":"Detects when an attacker modifies the \"REG_MULTI_SZ\" value named \"Extensions\" to include a custom DLL to achieve persistence via lsass.\nThe \"Extensions\" list contains filenames of DLLs being automatically loaded by lsass.exe. Each DLL has its InitializeLsaExtension() method called after loading.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa][Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ll][Ss][Aa][Ss][Rr][Vv]\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/)","rule_id":"41f6531d-af6e-4c6e-918f-b946f2b85a36","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/lsaaextension.html","https://twitter.com/0gtweet/status/1476286368385019906"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\LsaExtensionConfig\\\\LsaSrv\\\\Extensions*)`"}
