{"id":"487bb375-12ef-41f6-baae-c6a1572b4dd1","created_by":"Tobias Michalski","name":"Persistent Outlook Landing Pages","tags":["attack.persistence","attack.t1112"],"interval":"5m","description":"Detects the manipulation of persistent URLs which could execute malicious code","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Tt][Oo][Dd][Aa][Yy]\\\\.*/)) AND ((registry.path:/.*[Ss][Tt][Aa][Mm][Pp]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR registry.path:/.*[Uu][Ss][Ee][Rr][Dd][Ee][Ff][Ii][Nn][Ee][Dd][Uu][Rr][Ll]/)) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/))))","rule_id":"487bb375-12ef-41f6-baae-c6a1572b4dd1","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((winlog.event_data.EventType:SetValue AND registry.path:(*Software\\\\Microsoft\\\\Office\\\\* OR *\\\\Outlook\\\\Today\\\\*)) AND ((registry.path:*Stamp AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR registry.path:*UserDefinedUrl)) AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe))))`"}
