{"id":"707e097c-e20f-4f67-8807-1f72ff4500d6","created_by":"Nasreddine Bencherchali","name":"Suspicious Values In App Paths Default Property","tags":["attack.persistence","attack.t1546.012"],"interval":"5m","description":"Detects changes to the \"Default\" property for keys located in the \\Software\\Microsoft\\Windows\\CurrentVersion\\App Paths\\ registry. Which might be used as a method of persistence\nThe entries found under App Paths are used primarily for the following purposes.\nFirst, to map an application's executable file name to that file's fully qualified path.\nSecond, to pre-pend information to the PATH environment variable on a per-application, per-process basis.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate applications registering their binary from on of the suspicious locations mentioned above (tune it)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp]\\ [Pp][Aa][Tt][Hh][Ss].*/ AND registry.path:(/.*\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ OR /.*[Pp][Aa][Tt][Hh]/) AND winlog.event_data.Details:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*%[Tt][Ee][Mm][Pp]%.*/ OR /.*[Ii][Ee][Xx].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-.*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Rr][Ee][Gg][Ss][Vv][Rr]32.*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Hh][Tt][Aa].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Pp][Ss]1.*/))","rule_id":"707e097c-e20f-4f67-8807-1f72ff4500d6","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/","https://docs.microsoft.com/en-us/windows/win32/shell/app-registration?redirectedfrom=MSDN"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\App\\ Paths* AND registry.path:(*\\(Default\\) OR *Path) AND winlog.event_data.Details:(*\\\\Users\\\\Public* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *%temp%* OR *iex* OR *Invoke\\-* OR *rundll32* OR *regsvr32* OR *mshta* OR *cscript* OR *wscript* OR *.bat* OR *.hta* OR *.dll* OR *.ps1*))`"}
