{"id":"277efb8f-60be-4f10-b4d3-037802f37167","created_by":"frack113","name":"Registry Persistence Mechanisms in Recycle Bin","tags":["attack.persistence","attack.t1547"],"interval":"5m","description":"Detects persistence registry keys for Recycle Bin","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Rr][Ee][Nn][Aa][Mm][Ee][Kk][Ee][Yy]/ AND winlog.event_data.NewName:/[Hh][Kk][Cc][Rr]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{645[Ff][Ff]040\\-5081\\-101[Bb]\\-9[Ff]08\\-00[Aa][Aa]002[Ff]954[Ee]\\}\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Cc][Rr]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{645[Ff][Ff]040\\-5081\\-101[Bb]\\-9[Ff]08\\-00[Aa][Aa]002[Ff]954[Ee]\\}\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/))","rule_id":"277efb8f-60be-4f10-b4d3-037802f37167","timestamp_override":"event.ingested","references":["https://github.com/vxunderground/VXUG-Papers/blob/751edb8d50f95bd7baa730adf2c6c3bb1b034276/The%20Persistence%20Series/Persistence%20via%20Recycle%20Bin/Persistence_via_Recycle_Bin.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:RenameKey AND winlog.event_data.NewName:HKCR\\\\CLSID\\\\\\{645FF040\\-5081\\-101B\\-9F08\\-00AA002F954E\\}\\\\shell\\\\open) OR (winlog.event_data.EventType:SetValue AND registry.path:HKCR\\\\CLSID\\\\\\{645FF040\\-5081\\-101B\\-9F08\\-00AA002F954E\\}\\\\shell\\\\open\\\\command\\\\\\(Default\\)))`"}
