{"id":"d6c2ce7e-afb5-4337-9ca4-4b5254ed0565","created_by":"Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)","name":"WinSock2 Autorun Keys Modification","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects modification of autostart extensibility point (ASEP) in registry.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ii][Nn][Ss][Oo][Cc][Kk]2\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss].*/ AND registry.path:(/.*\\\\[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll]_[Cc][Aa][Tt][Aa][Ll][Oo][Gg]9\\\\[Cc][Aa][Tt][Aa][Ll][Oo][Gg]_[Ee][Nn][Tt][Rr][Ii][Ee][Ss].*/ OR /.*\\\\[Nn][Aa][Mm][Ee][Ss][Pp][Aa][Cc][Ee]_[Cc][Aa][Tt][Aa][Ll][Oo][Gg]5\\\\[Cc][Aa][Tt][Aa][Ll][Oo][Gg]_[Ee][Nn][Tt][Rr][Ii][Ee][Ss].*/)) AND (NOT (winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/ OR process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/)))","rule_id":"d6c2ce7e-afb5-4337-9ca4-4b5254ed0565","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md","https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns","https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\System\\\\CurrentControlSet\\\\Services\\\\WinSock2\\\\Parameters* AND registry.path:(*\\\\Protocol_Catalog9\\\\Catalog_Entries* OR *\\\\NameSpace_Catalog5\\\\Catalog_Entries*)) AND (NOT (winlog.event_data.Details:\\(Empty\\) OR process.executable:C\\:\\\\Windows\\\\System32\\\\MsiExec.exe OR process.executable:C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe)))`"}
