{"id":"70d43542-cd2d-483c-8f30-f16b436fd7db","created_by":"Aidan Bracher","name":"Leviathan Registry Key Activity","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects registry key used by Leviathan APT in Malaysian focused campaign","risk_score":99,"enabled":true,"severity":"critical","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Nn][Tt][Kk][Dd]/","rule_id":"70d43542-cd2d-483c-8f30-f16b436fd7db","timestamp_override":"event.ingested","references":["https://www.elastic.co/blog/advanced-techniques-used-in-malaysian-focused-apt-campaign"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\ntkd`"}
