{"id":"92b0b372-a939-44ed-a11b-5136cf680e27","created_by":"Trent Liffick (@tliffick)","name":"Blue Mockingbird","tags":["attack.execution","attack.t1112","attack.t1047"],"interval":"5m","description":"Attempts to detect system changes made by Blue Mockingbird","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ee][Rr][Cc][Pp][Ll][Ss][Uu][Pp][Pp][Oo][Rr][Tt]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll]/)","rule_id":"92b0b372-a939-44ed-a11b-5136cf680e27","timestamp_override":"event.ingested","references":["https://redcanary.com/blog/blue-mockingbird-cryptominer/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:*\\\\CurrentControlSet\\\\Services\\\\wercplsupport\\\\Parameters\\\\ServiceDll)`"}
