{"id":"7d995e63-ec83-4aa3-89d5-8a17b5c87c86","created_by":"Christopher Peacock @securepeacock, SCYTHE @scythe_io","name":"Scripted Diagnostics Turn Off Check Enabled - Registry","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects enabling TurnOffCheck which can be used to bypass defense of MSDT Follina vulnerability","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ee][Dd][Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss]\\\\[Tt][Uu][Rr][Nn][Oo][Ff][Ff][Cc][Hh][Ee][Cc][Kk]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"7d995e63-ec83-4aa3-89d5-8a17b5c87c86","timestamp_override":"event.ingested","references":["https://twitter.com/wdormann/status/1537075968568877057?s=20&t=0lr18OAnmAGoGpma6grLUw"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Policies\\\\Microsoft\\\\Windows\\\\ScriptedDiagnostics\\\\TurnOffCheck AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
