{"id":"8d85cf08-bf97-4260-ba49-986a2a65129c","created_by":"frack113, Florian Roth","name":"Powershell in Windows Run Keys","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Adds a RUN key that contains a powershell keyword","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate admin script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee].*/) AND winlog.event_data.Details:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ .*/))","rule_id":"8d85cf08-bf97-4260-ba49-986a2a65129c","timestamp_override":"event.ingested","references":["https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run* OR *\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce*) AND winlog.event_data.Details:(*powershell* OR *FromBase64String* OR *.DownloadFile\\(* OR *.DownloadString\\(* OR *\\ \\-w\\ hidden\\ * OR *\\ \\-nop\\ * OR *\\ \\-encodedcommand\\ *))`"}
