{"id":"5a93eb65-dffa-4543-b761-94aa60098fb6","created_by":"frack113","name":"Registry Hide Function from User","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects registry modifications that hide internal tools or functions from the user (malware like Agent Tesla, Hermetic Wiper uses this technique)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate admin script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Hh][Ii][Dd][Ee][Cc][Ll][Oo][Cc][Kk]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Hh][Ii][Dd][Ee][Ss][Cc][Aa][Hh][Ee][Aa][Ll][Tt][Hh]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Hh][Ii][Dd][Ee][Ss][Cc][Aa][Nn][Ee][Tt][Ww][Oo][Rr][Kk]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Hh][Ii][Dd][Ee][Ss][Cc][Aa][Pp][Oo][Ww][Ee][Rr]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Hh][Ii][Dd][Ee][Ss][Cc][Aa][Vv][Oo][Ll][Uu][Mm][Ee]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Ss][Hh][Oo][Ww][Ii][Nn][Ff][Oo][Tt][Ii][Pp]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Ss][Hh][Oo][Ww][Cc][Oo][Mm][Pp][Cc][Oo][Ll][Oo][Rr]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/))","rule_id":"5a93eb65-dffa-4543-b761-94aa60098fb6","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:(*SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\HideClock OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\HideSCAHealth OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\HideSCANetwork OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\HideSCAPower OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\HideSCAVolume) AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR (winlog.event_data.EventType:SetValue AND registry.path:(*SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\ShowInfoTip OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\ShowCompColor) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\)))`"}
