{"id":"20f0ee37-5942-4e45-b7d5-c5b5db9df5cd","created_by":"Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)","name":"CurrentVersion Autorun Keys Modification","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects modification of autostart extensibility point (ASEP) in registry.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/ AND registry.path:(/.*\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Dd][Ee][Ll][Aa][Yy][Ll][Oo][Aa][Dd].*/ OR /.*\\\\[Rr][Uu][Nn]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee][Ee][Xx]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Rr][Uu][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ll][Oo][Gg][Oo][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ll][Oo][Gg][Oo][Ff][Ff].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ii][Cc][Oo][Nn][Oo][Vv][Ee][Rr][Ll][Aa][Yy][Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc][Uu][Tt][Ee][Hh][Oo][Oo][Kk][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Aa][Rr][Ee][Dd][Tt][Aa][Ss][Kk][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Hh][Ee][Ll][Pp][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Pp][Ll][Aa][Pp]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\ [Ff][Ii][Ll][Tt][Ee][Rr][Ss].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/ OR registry.path:/.*\\\\[Nn][Gg][Cc][Ff][Ii][Rr][Ss][Tt]\\\\[Cc][Oo][Nn][Ss][Ee][Cc][Uu][Tt][Ii][Vv][Ee][Ss][Ww][Ii][Tt][Cc][Hh][Cc][Oo][Uu][Nn][Tt]/ OR process.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Ee][Nn][Ss][Uu][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Ss][Tt][Aa][Nn][Dd][Aa][Ll][Oo][Nn][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Rr]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Kk][Ee][Ee][Pp][Aa][Ss][Ss]\\ [Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]\\ [Ss][Aa][Ff][Ee]\\ 2\\\\[Ss][Hh][Ii][Nn][Ss][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Oo][Gg][Oo][Nn][Uu][Ii]\\.[Ee][Xx][Ee]/ AND registry.path:(/.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{[Dd]6886603\\-9[Dd]2[Ff]\\-4[Ee][Bb]2\\-[Bb]667\\-1971041[Ff][Aa]96[Bb]\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{[Bb][Ee][Cc]09223\\-[Bb]018\\-416[Dd]\\-[Aa]0[Aa][Cc]\\-523971[Bb]639[Ff]5\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{8[Aa][Ff]662[Bb][Ff]\\-65[Aa]0\\-4[Dd]0[Aa]\\-[Aa]540\\-[Aa]338[Aa]999[Dd]36[Ff]\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{27[Ff][Bb][Dd][Bb]57\\-[Bb]613\\-4[Aa][Ff]2\\-9[Dd]7[Ee]\\-4[Ff][Aa]7[Aa]66[Cc]21[Aa][Dd]\\}\\\\.*/)) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee].*/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND registry.path:/.*[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Ee][Xx][Tt].*/ AND winlog.event_data.Details:/.*[Aa]251\\-47[Bb]7\\-93[Ee]1\\-[Cc][Dd][Dd]82[Ee]34[Aa][Ff]8[Bb]\\}/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Oo][Pp][Ee][Rr][Aa]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Oo][Pp][Ee][Rr][Aa]\\\\[Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]_[Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\.[Ee][Xx][Ee]/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Ii][Tt][Uu][Nn][Ee][Ss][Hh][Ee][Ll][Pp][Ee][Rr]/ AND winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ii][Tt][Uu][Nn][Ee][Ss]\\\\[Ii][Tt][Uu][Nn][Ee][Ss][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]\\\"/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\[Zz][Oo][Oo][Mm][Mm][Ss][Ii][Rr][Ee][Pp][Aa][Ii][Rr]/ AND winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Zz][Oo][Oo][Mm]\\\\[Bb][Ii][Nn]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ \\/[Rr][Ee][Pp][Aa][Ii][Rr]/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]\\.[Ee][Xx][Ee]/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]\\.[Ee][Xx][Ee].*/) OR (registry.path:/.*[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee].*/ AND winlog.event_data.Details:(/\\{[Cc][Ff][Ee]8[Bb]367\\-77[Aa]7\\-41[Dd]7\\-9[Cc]90\\-75[Dd]16[Dd]7[Dd][Cc]6[Bb]6\\}/ OR /\\{[Aa]8[Ee]52322\\-8734\\-481[Dd]\\-[Aa]7[Ee]2\\-27[Bb]309[Ee][Ff]8[Dd]56\\}/ OR /\\{[Cc]973[Dd][Aa]94\\-[Cc][Bb][Dd][Ff]\\-4[Ee]77\\-81[Dd]1\\-[Ee]5[Bb]794[Ff][Bb][Dd]146\\}/ OR /\\{51[Ee][Ff]1569\\-67[Ee][Ee]\\-4[Aa][Dd]6\\-9646\\-[Ee]726[Cc]3[Ff][Ff][Cc]8[Aa]2\\}/)) OR (winlog.event_data.Details:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Qq]\\ \\/[Cc]\\ [Rr][Mm][Dd][Ii][Rr]\\ \\/[Ss]\\ \\/[Qq]\\ \\\"[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Qq]\\ \\/[Cc]\\ [Dd][Ee][Ll]\\ \\/[Qq]\\ \\\"[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/) AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\.*/) OR (registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\\\{[Cc]60[Ff][Dd]5[Aa][Cc]\\-367[Dd]\\-4[Ee]3[Aa]\\-[Aa]975\\-[Ff]157502[Aa][Cc]30[Aa]\\}/ AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ [Cc][Aa][Cc][Hh][Ee]\\\\\\{[Cc]60[Ff][Dd]5[Aa][Cc]\\-367[Dd]\\-4[Ee]3[Aa]\\-[Aa]975\\-[Ff]157502[Aa][Cc]30[Aa]\\}\\\\[Pp][Yy][Tt][Hh][Oo][Nn].*/ AND winlog.event_data.Details:/.*\\.[Ee][Xx][Ee]\\\"\\ \\/[Bb][Uu][Rr][Nn]\\.[Rr][Uu][Nn][Oo][Nn][Cc][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]\\ \\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt]\\ .*/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/[Cc][Tt][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]\\ \\/[Nn]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\.*/ AND winlog.event_data.Details:(/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Aa][Vv][Ll][Aa][Uu][Nn][Cc][Hh]\\.[Ee][Xx][Ee]\\\"\\ \\/[Gg][Uu][Ii]/ OR /\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Aa][Vv][Ll][Aa][Uu][Nn][Cc][Hh]\\.[Ee][Xx][Ee]\\\"\\ \\/[Gg][Uu][Ii]/ OR /\\{472083[Bb]0\\-[Cc]522\\-11[Cc][Ff]\\-8763\\-00608[Cc][Cc]02[Ff]24\\}/)))))","rule_id":"20f0ee37-5942-4e45-b7d5-c5b5db9df5cd","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md","https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns","https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d","https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND registry.path:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run\\\\* OR *\\\\RunOnce\\\\* OR *\\\\RunOnceEx\\\\* OR *\\\\RunServices\\\\* OR *\\\\RunServicesOnce\\\\* OR *\\\\Policies\\\\System\\\\Shell* OR *\\\\Policies\\\\Explorer\\\\Run* OR *\\\\Group\\ Policy\\\\Scripts\\\\Startup* OR *\\\\Group\\ Policy\\\\Scripts\\\\Shutdown* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logon* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logoff* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects* OR *\\\\Authentication\\\\PLAP\\ Providers* OR *\\\\Authentication\\\\Credential\\ Providers* OR *\\\\Authentication\\\\Credential\\ Provider\\ Filters*)) AND (NOT ((winlog.event_data.Details:\\(Empty\\) OR registry.path:*\\\\NgcFirst\\\\ConsecutiveSwitchCount OR process.executable:(*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe OR *\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe OR *\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe) OR process.executable:(C\\:\\\\WINDOWS\\\\system32\\\\devicecensus.exe OR C\\:\\\\Windows\\\\system32\\\\winsat.exe OR C\\:\\\\Program\\ Files\\\\Microsoft\\ OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe OR C\\:\\\\Program\\ Files\\\\Microsoft\\ OneDrive\\\\Update\\\\OneDriveSetup.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ OneDrive\\\\Update\\\\OneDriveSetup.exe OR C\\:\\\\Program\\ Files\\\\KeePass\\ Password\\ Safe\\ 2\\\\ShInstUtil.exe OR C\\:\\\\Program\\ Files\\\\Everything\\\\Everything.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe)) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\LogonUI.exe AND registry.path:(*\\\\Authentication\\\\Credential\\ Providers\\\\\\{D6886603\\-9D2F\\-4EB2\\-B667\\-1971041FA96B\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{BEC09223\\-B018\\-416D\\-A0AC\\-523971B639F5\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{8AF662BF\\-65A0\\-4D0A\\-A540\\-A338A999D36F\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{27FBDB57\\-B613\\-4AF2\\-9D7E\\-4FA7A66C21AD\\}\\\\*)) OR (process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe*)) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\regsvr32.exe AND registry.path:*DropboxExt* AND winlog.event_data.Details:*A251\\-47B7\\-93E1\\-CDD82E34AF8B\\}) OR (registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera\\ Browser\\ Assistant AND winlog.event_data.Details:C\\:\\\\Program\\ Files\\\\Opera\\\\assistant\\\\browser_assistant.exe) OR (registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\iTunesHelper AND winlog.event_data.Details:\\\"C\\:\\\\Program\\ Files\\\\iTunes\\\\iTunesHelper.exe\\\") OR (registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\zoommsirepair AND winlog.event_data.Details:\\\"C\\:\\\\Program\\ Files\\\\Zoom\\\\bin\\\\installer.exe\\\"\\ \\/repair) OR (registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Greenshot AND winlog.event_data.Details:C\\:\\\\Program\\ Files\\\\Greenshot\\\\Greenshot.exe) OR (registry.path:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\GoogleDriveFS AND winlog.event_data.Details:C\\:\\\\Program\\ Files\\\\Google\\\\Drive\\ File\\ Stream\\\\* AND winlog.event_data.Details:*\\\\GoogleDriveFS.exe*) OR (registry.path:*GoogleDrive* AND winlog.event_data.Details:(\\{CFE8B367\\-77A7\\-41D7\\-9C90\\-75D16D7DC6B6\\} OR \\{A8E52322\\-8734\\-481D\\-A7E2\\-27B309EF8D56\\} OR \\{C973DA94\\-CBDF\\-4E77\\-81D1\\-E5B794FBD146\\} OR \\{51EF1569\\-67EE\\-4AD6\\-9646\\-E726C3FFC8A2\\})) OR (winlog.event_data.Details:(C\\:\\\\Windows\\\\system32\\\\cmd.exe\\ \\/q\\ \\/c\\ rmdir\\ \\/s\\ \\/q\\ \\\"C\\:\\\\Users\\\\* OR C\\:\\\\Windows\\\\system32\\\\cmd.exe\\ \\/q\\ \\/c\\ del\\ \\/q\\ \\\"C\\:\\\\Users\\\\*) AND winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*) OR (registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{c60fd5ac\\-367d\\-4e3a\\-a975\\-f157502ac30a\\} AND winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Package\\ Cache\\\\\\{c60fd5ac\\-367d\\-4e3a\\-a975\\-f157502ac30a\\}\\\\python* AND winlog.event_data.Details:*.exe\\\"\\ \\/burn.runonce) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe) OR (process.executable:C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe) OR (process.executable:*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe AND winlog.event_data.Details:*\\\\Microsoft\\\\Teams\\\\Update.exe\\ \\-\\-processStart\\ *) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\userinit.exe AND winlog.event_data.Details:ctfmon.exe\\ \\/n) OR (process.executable:C\\:\\\\Program\\ Files\\\\AVG\\\\Antivirus\\\\Setup\\\\* AND winlog.event_data.Details:(\\\"C\\:\\\\Program\\ Files\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\"\\ \\/gui OR \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\"\\ \\/gui OR \\{472083B0\\-C522\\-11CF\\-8763\\-00608CC02F24\\})))))`"}
