{"id":"5118765f-6657-4ddb-a487-d7bd673abbf1","created_by":"NVISO","name":"FlowCloud Malware","tags":["attack.persistence","attack.t1112"],"interval":"5m","description":"Detects FlowCloud malware from threat group TA410.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Hh][Aa][Rr][Dd][Ww][Aa][Rr][Ee]\\\\\\{804423[Cc]2\\-[Ff]490\\-4[Aa][Cc]3\\-[Bb][Ff][Aa]5\\-13[Dd][Ee][Dd][Ee]63[Aa]71[Aa]\\}/ OR /[Hh][Kk][Ll][Mm]\\\\[Hh][Aa][Rr][Dd][Ww][Aa][Rr][Ee]\\\\\\{[Aa]5124[Aa][Ff]5\\-[Dd][Ff]23\\-49[Bb][Ff]\\-[Bb]0[Ee][Dd]\\-[Aa]18[Ee][Dd]3[Dd][Ee][Aa]027\\}/ OR /[Hh][Kk][Ll][Mm]\\\\[Hh][Aa][Rr][Dd][Ww][Aa][Rr][Ee]\\\\\\{2[Dd][Bb]80286\\-1784\\-48[Bb]5\\-[Aa]751\\-[Bb]6[Ee][Dd]1[Ff]490303\\}/) OR registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\[Pp][Rr][Ii][Nn][Tt][Rr][Ee][Ss][Pp][Oo][Nn][Ss][Oo][Rr]\\\\.*/)","rule_id":"5118765f-6657-4ddb-a487-d7bd673abbf1","timestamp_override":"event.ingested","references":["https://www.proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:(HKLM\\\\HARDWARE\\\\\\{804423C2\\-F490\\-4ac3\\-BFA5\\-13DEDE63A71A\\} OR HKLM\\\\HARDWARE\\\\\\{A5124AF5\\-DF23\\-49bf\\-B0ED\\-A18ED3DEA027\\} OR HKLM\\\\HARDWARE\\\\\\{2DB80286\\-1784\\-48b5\\-A751\\-B6ED1F490303\\}) OR registry.path:HKLM\\\\SYSTEM\\\\Setup\\\\PrintResponsor\\\\*)`"}
