{"id":"7c637634-c95d-4bbf-b26c-a82510874b34","created_by":"frack113","name":"Disable Microsoft Office Security Features","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Disable Microsoft Office Security Features by registry","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\.*/ AND registry.path:(/.*[Vv][Bb][Aa][Ww][Aa][Rr][Nn][Ii][Nn][Gg][Ss]/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt][Ff][Ii][Ll][Ee][Ss][Ii][Nn][Pp][Vv]/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Uu][Nn][Ss][Aa][Ff][Ee][Ll][Oo][Cc][Aa][Tt][Ii][Oo][Nn][Ss][Ii][Nn][Pp][Vv]/ OR /.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Tt][Tt][Aa][Cc][Hh][Ee][Mm][Ee][Nn][Tt][Ss][Ii][Nn][Pp][Vv]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"7c637634-c95d-4bbf-b26c-a82510874b34","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/","https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Office\\\\* AND registry.path:(*VBAWarnings OR *DisableInternetFilesInPV OR *DisableUnsafeLocationsInPV OR *DisableAttachementsInPV) AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
