{"id":"fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7","created_by":"frack113","name":"PowerShell Logging Disabled","tags":["attack.defense_evasion","attack.t1564.001"],"interval":"5m","description":"Detects the modification of the registry of the currently logged in user to disable PowerShell module logging, script block logging or transcription and script execution logging","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Mm][Oo][Dd][Uu][Ll][Ee][Ll][Oo][Gg][Gg][Ii][Nn][Gg]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Mm][Oo][Dd][Uu][Ll][Ee][Ll][Oo][Gg][Gg][Ii][Nn][Gg]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Bb][Ll][Oo][Cc][Kk][Ll][Oo][Gg][Gg][Ii][Nn][Gg]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Bb][Ll][Oo][Cc][Kk][Ll][Oo][Gg][Gg][Ii][Nn][Gg]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Tt][Rr][Aa][Nn][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Oo][Nn]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Tt][Rr][Aa][Nn][Ss][Cc][Rr][Ii][Pp][Tt][Ii][Nn][Gg]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:(*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ModuleLogging\\\\EnableModuleLogging OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ScriptBlockLogging\\\\EnableScriptBlockLogging OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\Transcription\\\\EnableTranscripting OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\EnableScripts) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
