{"id":"f663a6d9-9d1b-49b8-b2b1-0637914d199a","created_by":"Dmitriy Lifanov, oscd.community","name":"Narrator's Feedback-Hub Persistence","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects abusing Windows 10 Narrator's Feedback-Hub","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Aa][Pp][Pp][Xx][Yy][Pp][Ss][Aa][Ff]9[Ff]1[Qq][Ss][Ee][Rr][Qq][Ee][Vv][Ff]0[Ss][Ww][Ss]76[Dd][Xx]4[Kk]9[Aa]5206\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Ee][Xx][Ee][Cc][Uu][Tt][Ee]/) OR registry.path:/.*\\\\[Aa][Pp][Pp][Xx][Yy][Pp][Ss][Aa][Ff]9[Ff]1[Qq][Ss][Ee][Rr][Qq][Ee][Vv][Ff]0[Ss][Ww][Ss]76[Dd][Xx]4[Kk]9[Aa]5206\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/)","rule_id":"f663a6d9-9d1b-49b8-b2b1-0637914d199a","timestamp_override":"event.ingested","references":["https://giuliocomi.blogspot.com/2019/10/abusing-windows-10-narrators-feedback.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:DeleteValue AND registry.path:*\\\\AppXypsaf9f1qserqevf0sws76dx4k9a5206\\\\Shell\\\\open\\\\command\\\\DelegateExecute) OR registry.path:*\\\\AppXypsaf9f1qserqevf0sws76dx4k9a5206\\\\Shell\\\\open\\\\command\\\\\\(Default\\))`"}
