{"id":"b64a026b-8deb-4c1d-92fd-98893209dff1","created_by":"frack113","name":"Running Chrome VPN Extensions via the Registry 2 VPN Extension","tags":["attack.persistence","attack.t1133"],"interval":"5m","description":"Running Chrome VPN Extensions via the Registry install 2 vpn extension","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/ AND registry.path:/.*[Uu][Pp][Dd][Aa][Tt][Ee]_[Uu][Rr][Ll]/ AND winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ff][Dd][Cc][Gg][Dd][Nn][Kk][Ii][Dd][Jj][Aa][Aa][Dd][Aa][Ff][Nn][Ii][Cc][Hh][Ff][Pp][Aa][Bb][Hh][Ff][Oo][Mm][Cc][Ee][Bb][Mm][Ee].*/ OR /.*[Ff][Cc][Ff][Hh][Pp][Ll][Pp][Ll][Oo][Cc][Cc][Aa][Cc][Kk][Oo][Nn][Ee][Aa][Ee][Ff][Oo][Kk][Cc][Mm][Bb][Jj][Ff][Bb][Kk][Ee][Nn][Jj].*/ OR /.*[Bb][Ii][Hh][Mm][Pp][Ll][Hh][Oo][Bb][Cc][Hh][Oo][Aa][Gg][Ee][Ee][Oo][Kk][Mm][Gg][Bb][Dd][Ii][Hh][Kk][Nn][Kk][Jj][Bb][Kk][Nn][Dd].*/ OR /.*[Gg][Kk][Oo][Jj][Ff][Kk][Hh][Ll][Ee][Kk][Ii][Gg][Hh][Ii][Kk][Aa][Ff][Cc][Pp][Jj][Kk][Ii][Kk][Ll][Ff][Bb][Nn][Ll][Mm][Ee][Ii][Oo].*/ OR /.*[Jj][Aa][Jj][Ii][Ll][Bb][Jj][Jj][Ii][Nn][Jj][Mm][Gg][Cc][Ii][Bb][Aa][Ll][Aa][Aa][Kk][Nn][Gg][Mm][Kk][Ii][Ll][Bb][Oo][Oo][Bb][Hh].*/ OR /.*[Gg][Jj][Kk][Nn][Jj][Jj][Oo][Mm][Cc][Kk][Kk][Nn][Oo][Ff][Jj][Ii][Dd][Pp][Pp][Ii][Pp][Ff][Ff][Bb][Pp][Oo][Ee][Kk][Ii][Ii][Pp][Mm].*/ OR /.*[Nn][Aa][Bb][Bb][Mm][Pp][Ee][Kk][Ee][Kk][Jj][Kk][Nn][Ll][Bb][Kk][Gg][Pp][Oo][Dd][Ff][Nn][Dd][Bb][Oo][Dd][Hh][Ii][Jj][Jj][Ee][Mm].*/ OR /.*[Kk][Pp][Ii][Ee][Cc][Bb][Cc][Cc][Kk][Bb][Oo][Ff][Pp][Mm][Kk][Kk][Kk][Dd][Ii][Bb][Bb][Ll][Ll][Pp][Ii][Nn][Cc][Ee][Ii][Ii][Hh][Kk].*/ OR /.*[Nn][Ll][Bb][Ee][Jj][Mm][Cc][Cc][Bb][Hh][Kk][Nn][Cc][Gg][Oo][Kk][Jj][Cc][Mm][Gg][Hh][Pp][Ff][Ll][Oo][Aa][Aa][Jj][Cc][Ff][Ff][Jj].*/ OR /.*[Oo][Mm][Gg][Hh][Ff][Jj][Ll][Pp][Gg][Gg][Mm][Jj][Jj][Aa][Aa][Gg][Oo][Cc][Ll][Mm][Mm][Oo][Bb][Gg][Dd][Oo][Dd][Cc][Jj][Bb][Oo][Hh].*/ OR /.*[Bb][Ii][Bb][Jj][Cc][Jj][Ff][Mm][Gg][Aa][Pp][Bb][Ff][Oo][Ll][Jj][Ii][Oo][Jj][Pp][Ii][Pp][Aa][Oo][Oo][Dd][Dd][Pp][Kk][Pp][Aa][Ii].*/ OR /.*[Mm][Pp][Cc][Aa][Aa][Ii][Nn][Mm][Ff][Jj][Jj][Ii][Gg][Ee][Ii][Cc][Jj][Nn][Ll][Kk][Dd][Ff][Aa][Jj][Bb][Ii][Oo][Oo][Pp][Jj][Kk][Oo].*/ OR /.*[Jj][Ll][Jj][Oo][Pp][Mm][Gg][Dd][Oo][Bb][Ll][Oo][Aa][Gg][Ee][Jj][Pp][Oo][Hh][Pp][Ll][Dd][Gg][Kk][Ii][Ee][Ll][Ll][Mm][Ff][Nn][Cc].*/ OR /.*[Ll][Oo][Cc][Hh][Ii][Cc][Cc][Bb][Gg][Ee][Oo][Hh][Ii][Mm][Ll][Dd][Jj][Oo][Oo][Aa][Aa][Kk][Jj][Ll][Ll][Nn][Aa][Ff][Hh][Aa][Ii][Dd].*/ OR /.*[Nn][Hh][Nn][Ff][Cc][Gg][Pp][Cc][Bb][Ff][Cc][Ll][Hh][Ff][Aa][Ff][Jj][Ll][Oo][Oo][Ii][Hh][Dd][Ff][Gg][Hh][Aa][Ee][Ii][Nn][Ff][Cc].*/ OR /.*[Oo][Oo][Kk][Hh][Nn][Hh][Pp][Kk][Pp][Hh][Aa][Gg][Ee][Ff][Gg][Dd][Ii][Ee][Mm][Ll][Ll][Ff][Aa][Jj][Mm][Kk][Dd][Kk][Cc][Aa][Ii][Mm].*/ OR /.*[Nn][Aa][Mm][Ff][Bb][Ll][Ll][Ii][Aa][Mm][Kk][Ll][Mm][Ee][Oo][Dd][Pp][Cc][Ee][Ll][Kk][Oo][Kk][Jj][Bb][Ff][Ff][Gg][Mm][Ee][Oo][Oo].*/ OR /.*[Nn][Bb][Cc][Oo][Jj][Ee][Ff][Nn][Cc][Cc][Bb][Aa][Nn][Pp][Ll][Pp][Oo][Ff][Ff][Oo][Pp][Kk][Oo][Ee][Pp][Jj][Mm][Hh][Gg][Dd][Gg][Hh].*/ OR /.*[Mm][Aa][Jj][Dd][Ff][Hh][Pp][Aa][Ii][Hh][Oo][Nn][Cc][Oo][Aa][Kk][Bb][Jj][Gg][Bb][Dd][Hh][Gg][Ll][Oo][Cc][Kk][Ll][Cc][Gg][Nn][Oo].*/ OR /.*[Ll][Nn][Ff][Dd][Mm][Dd][Hh][Mm][Ff][Bb][Ii][Mm][Hh][Hh][Pp][Aa][Ee][Oo][Cc][Nn][Cc][Dd][Ll][Hh][Ii][Oo][Dd][Oo][Bb][Ll][Bb][Dd].*/ OR /.*[Ee][Pp][Pp][Ii][Oo][Cc][Ee][Mm][Hh][Mm][Nn][Ll][Bb][Hh][Jj][Pp][Ll][Cc][Gg][Kk][Oo][Ff][Cc][Ii][Ii][Ee][Gg][Oo][Mm][Cc][Oo][Nn].*/ OR /.*[Cc][Oo][Cc][Ff][Oo][Jj][Pp][Pp][Ff][Ii][Gg][Jj][Ee][Ee][Ff][Ee][Jj][Bb][Pp][Ff][Mm][Ee][Dd][Gg][Jj][Bb][Pp][Cc][Hh][Cc][Nn][Gg].*/ OR /.*[Ff][Oo][Ii][Oo][Pp][Ee][Cc][Kk][Nn][Aa][Cc][Mm][Ii][Ii][Hh][Ii][Oo][Cc][Gg][Dd][Jj][Gg][Bb][Jj][Oo][Kk][Kk][Pp][Kk][Oo][Hh][Cc].*/ OR /.*[Hh][Hh][Dd][Oo][Bb][Jj][Gg][Oo][Pp][Ff][Pp][Hh][Ll][Mm][Jj][Bb][Mm][Nn][Pp][Gg][Ll][Hh][Ff][Cc][Gg][Pp][Pp][Cc][Hh][Gg][Jj][Ee].*/ OR /.*[Jj][Gg][Bb][Aa][Gg][Hh][Oo][Hh][Ii][Gg][Dd][Bb][Gg][Bb][Oo][Ll][Nn][Cc][Oo][Dd][Kk][Dd][Ll][Pp][Ee][Nn][Hh][Cc][Mm][Cc][Gg][Ee].*/ OR /.*[Ii][Nn][Ll][Ii][Gg][Pp][Kk][Jj][Kk][Hh][Bb][Pp][Ii][Ff][Ee][Cc][Bb][Dd][Jj][Hh][Mm][Dd][Pp][Cc][Ff][Hh][Nn][Ll][Ee][Ll][Jj][Aa].*/ OR /.*[Hh][Ii][Gg][Ii][Oo][Ee][Mm][Oo][Jj][Dd][Aa][Dd][Gg][Dd][Bb][Hh][Bb][Bb][Bb][Kk][Ff][Bb][Ee][Bb][Bb][Dd][Ll][Ff][Jj][Bb][Ii][Pp].*/ OR /.*[Hh][Ii][Pp][Nn][Cc][Nn][Dd][Jj][Aa][Mm][Dd][Cc][Mm][Pp][Hh][Kk][Gg][Nn][Gg][Oo][Jj][Ee][Gg][Jj][Bb][Ll][Ii][Bb][Aa][Dd][Bb][Ee].*/ OR /.*[Ii][Oo][Ll][Oo][Nn][Oo][Pp][Oo][Oo][Aa][Pp][Dd][Aa][Gg][Dd][Ee][Mm][Dd][Oo][Aa][Ii][Hh][Aa][Hh][Ll][Ff][Kk][Nn][Cc][Ff][Gg][Gg].*/ OR /.*[Nn][Hh][Ff][Jj][Kk][Aa][Kk][Gg][Ll][Bb][Nn][Nn][Pp][Kk][Pp][Ll][Dd][Hh][Jj][Mm][Pp][Mm][Mm][Ff][Ee][Ff][Ii][Ff][Ee][Dd][Cc][Jj].*/ OR /.*[Jj][Pp][Gg][Ll][Jj][Ff][Pp][Mm][Oo][Oo][Ff][Bb][Mm][Ll][Ii][Ee][Ee][Jj][Gg][Ll][Hh][Oo][Nn][Ff][Oo][Ff][Mm][Aa][Hh][Ii][Nn][Ii].*/ OR /.*[Ff][Gg][Dd][Dd][Mm][Ll][Ll][Nn][Ll][Ll][Kk][Aa][Ll][Aa][Aa][Gg][Kk][Gg][Hh][Cc][Kk][Oo][Ii][Nn][Aa][Ee][Mm][Mm][Oo][Gg][Pp][Ee].*/ OR /.*[Ee][Jj][Kk][Aa][Oo][Cc][Pp][Hh][Oo][Ff][Nn][Oo][Bb][Jj][Dd][Ee][Dd][Nn][Ee][Oo][Hh][Bb][Bb][Ii][Ii][Ll][Gg][Gg][Dd][Ll][Bb][Ii].*/ OR /.*[Kk][Ee][Oo][Dd][Bb][Ii][Aa][Nn][Oo][Ll][Ii][Aa][Dd][Kk][Oo][Ee][Ll][Ll][Oo][Ee][Cc][Bb][Hh][Ll][Ll][Nn][Pp][Ii][Oo][Cc][Oo][Ii].*/ OR /.*[Hh][Oo][Aa][Pp][Mm][Ll][Pp][Nn][Mm][Pp][Aa][Ee][Hh][Ii][Ll][Ee][Hh][Gg][Gg][Gg][Ll][Ee][Hh][Ff][Dd][Ll][Nn][Oo][Ee][Gg][Cc][Kk].*/ OR /.*[Pp][Oo][Ee][Oo][Jj][Cc][Ll][Ii][Cc][Oo][Dd][Aa][Mm][Oo][Nn][Aa][Bb][Cc][Aa][Bb][Mm][Aa][Pp][Aa][Mm][Jj][Kk][Kk][Mm][Nn][Nn][Kk].*/ OR /.*[Dd][Ff][Kk][Dd][Ff][Ll][Ff][Gg][Jj][Dd][Aa][Jj][Bb][Hh][Oo][Cc][Mm][Ff][Jj][Oo][Ll][Pp][Jj][Bb][Ee][Bb][Dd][Kk][Cc][Jj][Oo][Gg].*/ OR /.*[Kk][Cc][Dd][Aa][Hh][Mm][Gg][Mm][Aa][Aa][Gg][Jj][Hh][Oo][Cc][Pp][Ii][Pp][Bb][Oo][Dd][Aa][Oo][Kk][Ii][Kk][Jj][Kk][Aa][Mm][Pp][Ii].*/ OR /.*[Kk][Ll][Nn][Kk][Ii][Aa][Jj][Pp][Mm][Pp][Kk][Kk][Kk][Gg][Pp][Gg][Bb][Oo][Gg][Mm][Cc][Gg][Ff][Jj][Hh][Dd][Oo][Ll][Jj][Aa][Cc][Gg].*/ OR /.*[Ll][Nn][Ee][Aa][Oo][Cc][Aa][Gg][Cc][Ii][Jj][Jj][Dd][Pp][Kk][Cc][Aa][Bb][Ee][Aa][Nn][Ff][Pp][Dd][Bb][Mm][Aa][Pp][Cc][Jj][Jj][Gg].*/ OR /.*[Pp][Gg][Ff][Pp][Ii][Gg][Nn][Ff][Cc][Kk][Bb][Ll][Oo][Aa][Gg][Kk][Ff][Nn][Aa][Mm][Nn][Oo][Ll][Kk][Ee][Aa][Ee][Cc][Ff][Gg][Ff][Hh].*/ OR /.*[Jj][Pp][Ll][Nn][Ll][Ii][Ff][Ee][Pp][Ff][Ll][Hh][Kk][Bb][Kk][Gg][Oo][Nn][Ii][Dd][Nn][Oo][Bb][Kk][Aa][Kk][Hh][Mm][Pp][Nn][Mm][Hh].*/ OR /.*[Jj][Ll][Ii][Oo][Dd][Mm][Nn][Oo][Jj][Cc][Cc][Aa][Ll][Oo][Aa][Jj][Pp][Hh][Kk][Ii][Nn][Gg][Dd][Nn][Pp][Ll][Jj][Dd][Hh][Dd][Oo][Kk].*/ OR /.*[Hh][Nn][Mm][Pp][Cc][Aa][Gg][Pp][Pp][Ll][Mm][Pp][Ff][Oo][Jj][Mm][Gg][Mm][Nn][Nn][Gg][Ii][Ll][Cc][Nn][Aa][Nn][Dd][Dd][Ll][Hh][Bb].*/ OR /.*[Ff][Ff][Bb][Kk][Gg][Ll][Ff][Ii][Jj][Bb][Cc][Bb][Gg][Bb][Ll][Gg][Ff][Ll][Cc][Hh][Nn][Bb][Pp][Hh][Jj][Dd][Ll][Ll][Aa][Oo][Gg][Bb].*/ OR /.*[Kk][Cc][Nn][Dd][Mm][Bb][Bb][Ee][Ll][Ll][Ll][Kk][Mm][Ii][Oo][Ee][Kk][Dd][Aa][Gg][Aa][Hh][Ee][Kk][Gg][Ii][Mm][Ee][Mm][Ee][Jj][Oo].*/ OR /.*[Jj][Dd][Gg][Ii][Ll][Gg][Gg][Pp][Ff][Mm][Jj][Pp][Bb][Oo][Dd][Mm][Hh][Nn][Dd][Mm][Hh][Oo][Jj][Kk][Ll][Gg][Ff][Dd][Ll][Hh][Oo][Bb].*/ OR /.*[Bb][Ii][Hh][Hh][Ff][Ll][Ii][Mm][Oo][Nn][Bb][Pp][Cc][Ff][Aa][Gg][Ff][Aa][Dd][Cc][Nn][Bb][Bb][Dd][Nn][Gg][Pp][Oo][Pp][Nn][Jj][Bb].*/ OR /.*[Pp][Pp][Aa][Jj][Ii][Nn][Aa][Kk][Bb][Ff][Oo][Cc][Jj][Ff][Nn][Ii][Jj][Gg][Gg][Ff][Nn][Dd][Bb][Dd][Mm][Jj][Gg][Gg][Cc][Mm][Dd][Ee].*/ OR /.*[Oo][Oo][Ff][Gg][Bb][Pp][Oo][Aa][Bb][Ii][Pp][Ff][Cc][Ff][Jj][Aa][Pp][Gg][Nn][Bb][Bb][Jj][Jj][Aa][Ee][Nn][Oo][Cc][Kk][Bb][Dd][Pp].*/ OR /.*[Bb][Hh][Nn][Hh][Kk][Dd][Gg][Oo][Ee][Ff][Pp][Mm][Ee][Kk][Cc][Gg][Nn][Cc][Cc][Pp][Nn][Hh][Jj][Ff][Dd][Gg][Ii][Cc][Ff][Ee][Bb][Mm].*/ OR /.*[Kk][Nn][Mm][Mm][Pp][Cc][Ii][Ee][Bb][Aa][Oo][Oo][Jj][Cc][Pp][Jj][Jj][Oo][Ee][Oo][Nn][Ll][Cc][Jj][Aa][Cc][Jj][Oo][Pp][Cc][Pp][Ff].*/ OR /.*[Dd][Hh][Aa][Dd][Ii][Ll][Bb][Mm][Mm][Jj][Ii][Oo][Oo][Cc][Ee][Ii][Oo][Ll][Aa][Dd][Dd][Pp][Hh][Ee][Mm][Aa][Ll][Ii][Ii][Oo][Bb][Oo].*/ OR /.*[Jj][Ee][Dd][Ii][Ee][Ii][Aa][Mm][Jj][Mm][Oo][Ff][Ll][Cc][Kk][Nn][Jj][Dd][Jj][Hh][Pp][Ii][Ee][Kk][Ll][Ee][Pp][Ff][Gg][Ll][Ii][Nn].*/ OR /.*[Mm][Hh][Nn][Gg][Pp][Dd][Ll][Hh][Oo][Jj][Ll][Ii][Ii][Kk][Ff][Kk][Nn][Hh][Ff][Aa][Gg][Ll][Pp][Nn][Dd][Dd][Nn][Ii][Ii][Jj][Ff][Hh].*/ OR /.*[Oo][Mm][Dd][Aa][Kk][Jj][Cc][Mm][Kk][Gg][Ll][Ee][Nn][Bb][Hh][Jj][Aa][Dd][Bb][Cc][Cc][Aa][Oo][Oo][Kk][Pp][Ff][Jj][Ii][Hh][Pp][Aa].*/ OR /.*[Nn][Pp][Gg][Ii][Mm][Kk][Aa][Pp][Cc][Cc][Ff][Ii][Dd][Ff][Kk][Ff][Oo][Kk][Ll][Hh][Pp][Kk][Gg][Mm][Hh][Gg][Ff][Ee][Jj][Hh][Bb][Jj].*/ OR /.*[Aa][Kk][Ee][Ee][Hh][Kk][Gg][Gg][Ll][Kk][Mm][Pp][Aa][Pp][Dd][Nn][Aa][Nn][Oo][Oo][Cc][Hh][Pp][Ff][Mm][Ee][Gg][Hh][Ff][Dd][Ll][Nn].*/ OR /.*[Gg][Bb][Mm][Dd][Mm][Ii][Pp][Aa][Pp][Oo][Ll][Aa][Oo][Hh][Pp][Ii][Nn][Hh][Bb][Ll][Mm][Cc][Nn][Pp][Mm][Mm][Ll][Gg][Ff][Gg][Jj][Ee].*/ OR /.*[Aa][Ii][Gg][Mm][Ff][Oo][Ee][Oo][Gg][Ff][Nn][Ll][Jj][Hh][Nn][Oo][Ff][Gg][Ll][Ll][Ee][Dd][Bb][Hh][Hh][Ff][Ee][Gg][Aa][Nn][Nn][Pp].*/ OR /.*[Cc][Gg][Oo][Jj][Mm][Ff][Oo][Cc][Hh][Ff][Ii][Kk][Pp][Hh][Ii][Nn][Cc][Bb][Hh][Oo][Kk][Ii][Mm][Mm][Mm][Jj][Ee][Nn][Hh][Hh][Gg][Kk].*/ OR /.*[Ff][Ii][Cc][Aa][Jj][Ff][Ee][Oo][Jj][Aa][Kk][Dd][Dd][Ii][Nn][Cc][Jj][Aa][Ff][Ee][Bb][Jj][Mm][Ff][Ii][Ee][Ff][Cc][Mm][Aa][Nn][Cc].*/ OR /.*[Ii][Ff][Nn][Aa][Ii][Bb][Ll][Dd][Jj][Ff][Dd][Mm][Aa][Ii][Pp][Aa][Dd][Dd][Ff][Ff][Mm][Gg][Cc][Mm][Ee][Kk][Jj][Hh][Ii][Ll][Oo][Aa].*/ OR /.*[Jj][Bb][Nn][Mm][Pp][Dd][Kk][Cc][Ff][Kk][Oo][Cc][Hh][Pp][Aa][Nn][Oo][Mm][Nn][Kk][Hh][Nn][Aa][Ff][Oo][Bb][Pp][Pp][Mm][Cc][Cc][Nn].*/ OR /.*[Aa][Pp][Cc][Ff][Dd][Ff][Ff][Ee][Mm][Oo][Ii][Nn][Oo][Pp][Ee][Ll][Ii][Dd][Nn][Cc][Dd][Dd][Jj][Bb][Hh][Kk][Ii][Bb][Ll][Ee][Cc][Cc].*/ OR /.*[Mm][Jj][Oo][Ll][Nn][Oo][Dd][Ff][Oo][Kk][Kk][Kk][Aa][Ii][Cc][Hh][Kk][Cc][Jj][Ii][Pp][Ff][Gg][Bb][Ll][Bb][Ff][Gg][Oo][Jj][Pp][Aa].*/ OR /.*[Oo][Ii][Ff][Jj][Bb][Nn][Nn][Aa][Ff][Aa][Pp][Ee][Ii][Kk][Nn][Aa][Pp][Ii][Hh][Cc][Mm][Pp][Ee][Oo][Dd][Aa][Ee][Bb][Ll][Bb][Kk][Nn].*/ OR /.*[Pp][Ll][Pp][Mm][Gg][Gg][Ff][Gg][Ll][Nn][Cc][Cc][Ee][Ii][Nn][Mm][Ii][Ll][Oo][Jj][Dd][Kk][Ii][Ii][Jj][Hh][Mm][Aa][Jj][Kk][Jj][Hh].*/ OR /.*[Mm][Jj][Nn][Bb][Cc][Ll][Mm][Ff][Ll][Cc][Pp][Oo][Oo][Kk][Ee][Aa][Pp][Gg][Hh][Ff][Hh][Aa][Pp][Ee][Ff][Ff][Mm][Pp][Oo][Dd][Ii][Jj].*/ OR /.*[Bb][Bb][Ll][Cc][Cc][Cc][Kk][Nn][Bb][Dd][Bb][Pp][Ll][Gg][Mm][Dd][Jj][Nn][Nn][Ii][Kk][Ff][Ff][Ee][Ff][Hh][Dd][Ll][Oo][Bb][Hh][Pp].*/ OR /.*[Aa][Oo][Jj][Ll][Hh][Gg][Bb][Kk][Mm][Kk][Aa][Hh][Aa][Bb][Cc][Mm][Cc][Pp][Ii][Ff][Bb][Oo][Ll][Nn][Oo][Ii][Cc][Hh][Ff][Ee][Ee][Pp].*/ OR /.*[Ll][Cc][Mm][Aa][Mm][Mm][Nn][Jj][Ll][Bb][Mm][Ll][Bb][Cc][Aa][Nn][Ii][Gg][Gg][Mm][Ll][Ee][Jj][Ff][Jj][Pp][Jj][Aa][Gg][Ii][Ii][Aa].*/ OR /.*[Kk][Nn][Aa][Jj][Dd][Ee][Aa][Oo][Cc][Bb][Pp][Mm][Ff][Gg][Hh][Hh][Mm][Ii][Jj][Ii][Cc][Ii][Dd][Ff][Cc][Mm][Dd][Gg][Bb][Dd][Pp][Mm].*/ OR /.*[Bb][Dd][Ll][Cc][Nn][Pp][Cc][Ee][Aa][Gg][Nn][Kk][Jj][Nn][Jj][Ll][Bb][Bb][Bb][Cc][Ee][Pp][Oo][Hh][Ee][Jj][Bb][Hh][Ee][Ii][Ll][Kk].*/ OR /.*[Ee][Dd][Kk][Nn][Jj][Dd][Jj][Ii][Ee][Ll][Mm][Pp][Dd][Ll][Nn][Ll][Ll][Kk][Dd][Mm][Aa][Gg][Hh][Ll][Bb][Pp][Nn][Mm][Jj][Mm][Gg][Bb].*/ OR /.*[Ee][Ii][Dd][Nn][Ii][Hh][Aa][Aa][Dd][Mm][Mm][Aa][Nn][Cc][Ee][Gg][Ll][Ll][Kk][Nn][Ff][Bb][Ll][Ii][Aa][Ii][Jj][Ff][Mm][Kk][Gg][Oo].*/ OR /.*[Cc][Kk][Ii][Aa][Hh][Bb][Cc][Mm][Ll][Mm][Kk][Pp][Ff][Ii][Ii][Jj][Ee][Cc][Bb][Pp][Ff][Ll][Ff][Aa][Hh][Oo][Ii][Mm][Kk][Ll][Kk][Ee].*/ OR /.*[Mm][Aa][Cc][Dd][Ll][Ee][Mm][Ff][Nn][Ii][Gg][Nn][Jj][Hh][Cc][Ll][Ff][Cc][Ff][Ii][Cc][Hh][Cc][Dd][Hh][Ii][Oo][Mm][Gg][Jj][Jj][Bb].*/ OR /.*[Cc][Hh][Ii][Oo][Aa][Ff][Kk][Oo][Nn][Nn][Hh][Bb][Pp][Aa][Jj][Pp][Ee][Nn][Gg][Bb][Aa][Ll][Kk][Ee][Cc][Ee][Cc][Ll][Ee][Ll][Dd][Ff].*/ OR /.*[Aa][Mm][Nn][Oo][Ii][Bb][Ee][Ff][Ll][Ff][Pp][Hh][Hh][Pp][Ll][Mm][Cc][Kk][Dd][Bb][Ii][Aa][Jj][Kk][Jj][Aa][Oo][Oo][Mm][Gg][Nn][Jj].*/ OR /.*[Ll][Ll][Bb][Hh][Dd][Dd][Ii][Kk][Ee][Oo][Nn][Kk][Pp][Bb][Hh][Pp][Nn][Cc][Nn][Hh][Ii][Aa][Ll][Ff][Bb][Pp][Nn][Ii][Ll][Cc][Nn][Cc].*/ OR /.*[Pp][Cc][Ii][Ee][Nn][Ll][Hh][Nn][Oo][Ff][Ii][Cc][Ee][Gg][Nn][Ee][Pp][Ee][Jj][Pp][Ff][Ii][Kk][Ll][Gg][Gg][Kk][Ii][Oo][Cc][Cc][Mm].*/ OR /.*[Ii][Oo][Cc][Nn][Gg][Ll][Nn][Mm][Ff][Kk][Gg][Ff][Ee][Dd][Pp][Cc][Ee][Mm][Dd][Ff][Ll][Hh][Kk][Cc][Hh][Oo][Kk][Kk][Ff][Ee][Ii][Ii].*/ OR /.*[Ii][Gg][Aa][Hh][Hh][Bb][Kk][Cc][Pp][Pp][Aa][Oo][Ll][Ll][Cc][Jj][Ee][Aa][Aa][Oo][Aa][Pp][Kk][Ii][Jj][Bb][Nn][Pp][Hh][Ff][Hh][Bb].*/ OR /.*[Nn][Jj][Pp][Mm][Ii][Ff][Cc][Hh][Gg][Ii][Dd][Ii][Nn][Ii][Hh][Mm][Ii][Jj][Hh][Cc][Ff][Pp][Bb][Dd][Mm][Gg][Ll][Ee][Cc][Dd][Ll][Bb].*/ OR /.*[Gg][Gg][Aa][Cc][Kk][Gg][Nn][Gg][Ll][Jj][Ii][Nn][Cc][Cc][Ll][Ll][Cc][Mm][Bb][Gg][Nn][Pp][Gg][Pp][Ll][Ll][Cc][Jj][Ee][Pp][Gg][Cc].*/ OR /.*[Kk][Cc][Hh][Oo][Cc][Jj][Cc][Ii][Hh][Dd][Gg][Kk][Oo][Pp][Ll][Nn][Gg][Jj][Ee][Mm][Hh][Pp][Pp][Ll][Mm][Mm][Ll][Oo][Aa][Nn][Jj][Aa].*/ OR /.*[Bb][Nn][Ii][Jj][Mm][Ii][Pp][Nn][Dd][Nn][Ii][Cc][Ee][Ff][Cc][Dd][Bb][Hh][Gg][Cc][Jj][Oo][Oo][Gg][Nn][Nn][Dd][Bb][Gg][Kk][Ee][Pp].*/ OR /.*[Ll][Kk][Ll][Ee][Kk][Jj][Oo][Dd][Gg][Aa][Nn][Nn][Jj][Cc][Cc][Cc][Dd][Ll][Bb][Ii][Cc][Oo][Aa][Mm][Ii][Bb][Gg][Bb][Dd][Nn][Mm][Ii].*/ OR /.*[Dd][Bb][Dd][Bb][Nn][Cc][Hh][Aa][Gg][Bb][Kk][Hh][Kk][Nn][Ee][Gg][Mm][Hh][Gg][Ii][Kk][Kk][Ll][Ee][Oo][Oo][Gg][Jj][Cc][Ff][Gg][Ee].*/ OR /.*[Ee][Gg][Bb][Ll][Hh][Cc][Jj][Ff][Jj][Mm][Bb][Jj][Aa][Jj][Hh][Jj][Hh][Pp][Mm][Nn][Ll][Ee][Kk][Ff][Ff][Gg][Aa][Ee][Mm][Gg][Ff][Hh].*/ OR /.*[Ee][Hh][Bb][Hh][Ff][Pp][Ff][Dd][Kk][Mm][Hh][Cc][Pp][Aa][Ee][Hh][Aa][Oo][Oo][Ee][Gg][Ff][Dd][Ff][Ll][Ll][Jj][Cc][Nn][Ff][Ee][Cc].*/ OR /.*[Bb][Kk][Kk][Gg][Dd][Jj][Pp][Oo][Mm][Dd][Nn][Ff][Ee][Mm][Hh][Hh][Kk][Aa][Ll][Ff][Kk][Oo][Gg][Cc][Kk][Jj][Dd][Kk][Cc][Jj][Kk][Gg].*/ OR /.*[Aa][Ll][Mm][Aa][Ll][Gg][Bb][Pp][Mm][Cc][Ff][Pp][Dd][Aa][Oo][Pp][Ii][Mm][Bb][Dd][Cc][Hh][Dd][Ll][Ii][Mm][Ii][Nn][Oo][Ii][Gg][Nn].*/ OR /.*[Aa][Kk][Kk][Bb][Kk][Hh][Nn][Ii][Kk][Oo][Ee][Oo][Jj][Ll][Hh][Ii][Ii][Oo][Mm][Oo][Hh][Pp][Dd][Nn][Kk][Hh][Bb][Kk][Hh][Ii][Ee][Hh].*/ OR /.*[Gg][Bb][Ff][Gg][Ff][Bb][Oo][Pp][Cc][Ff][Oo][Kk][Dd][Pp][Kk][Dd][Ii][Gg][Ff][Mm][Oo][Ee][Aa][Aa][Jj][Ff][Mm][Pp][Kk][Bb][Nn][Hh].*/ OR /.*[Bb][Nn][Ii][Ii][Kk][Oo][Hh][Ff][Mm][Aa][Jj][Hh][Dd][Cc][Ff][Ff][Ll][Jj][Gg][Ff][Ee][Ii][Kk][Ll][Cc][Bb][Gg][Ff][Ff][Pp][Pp][Ll].*/ OR /.*[Ll][Ee][Jj][Gg][Ff][Mm][Mm][Ll][Nn][Gg][Aa][Ii][Gg][Dd][Mm][Mm][Ii][Kk][Bb][Ll][Aa][Pp][Pp][Dd][Aa][Ff][Cc][Mm][Kk][Nn][Dd][Bb].*/ OR /.*[Ff][Ff][Hh][Hh][Kk][Mm][Ll][Gg][Ee][Dd][Gg][Cc][Ll][Ii][Aa][Jj][Aa][Ee][Dd][Aa][Pp][Kk][Dd][Ff][Ii][Gg][Dd][Oo][Bb][Cc][Ii][Ff].*/ OR /.*[Gg][Cc][Kk][Nn][Hh][Kk][Kk][Oo][Oo][Ll][Aa][Aa][Bb][Ff][Mm][Ll][Nn][Jj][Oo][Nn][Oo][Gg][Aa][Aa][Ii][Ff][Nn][Jj][Ll][Ff][Nn][Pp].*/ OR /.*[Pp][Oo][Oo][Ll][Jj][Nn][Bb][Oo][Ii][Ff][Bb][Oo][Dd][Gg][Ii][Ff][Nn][Gg][Pp][Pp][Pp][Ff][Kk][Ll][Hh][Ii][Ff][Ee][Cc][Hh][Oo][Ee].*/ OR /.*[Ff][Jj][Oo][Aa][Ll][Ee][Dd][Ff][Pp][Mm][Nn][Ee][Ee][Nn][Cc][Kk][Ff][Bb][Pp][Dd][Ff][Hh][Kk][Mm][Ii][Mm][Nn][Jj][Oo][Cc][Ff][Aa].*/ OR /.*[Aa][Aa][Kk][Cc][Hh][Aa][Ll][Ee][Ii][Gg][Kk][Oo][Hh][Aa][Ff][Kk][Ff][Jj][Ff][Jj][Bb][Bb][Ll][Oo][Bb][Jj][Ii][Ff][Ii][Kk][Ee][Kk].*/ OR /.*[Dd][Pp][Pp][Ll][Aa][Bb][Bb][Mm][Oo][Gg][Kk][Hh][Gg][Hh][Nn][Cc][Ff][Bb][Ff][Dd][Ee][Ee][Oo][Kk][Oo][Ee][Ff][Dd][Jj][Ee][Gg][Mm].*/ OR /.*[Pp][Aa][Dd][Ee][Kk][Gg][Cc][Ee][Mm][Ll][Oo][Kk][Bb][Aa][Dd][Oo][Hh][Gg][Kk][Ii][Ff][Ii][Jj][Oo][Mm][Cc][Ll][Gg][Jj][Gg][Ii][Ff].*/ OR /.*[Bb][Ff][Ii][Dd][Bb][Oo][Ll][Oo][Ee][Dd][Ll][Aa][Mm][Gg][Dd][Mm][Ee][Nn][Mm][Ll][Bb][Ii][Pp][Ff][Nn][Cc][Cc][Oo][Kk][Kk][Nn][Pp].*/))","rule_id":"b64a026b-8deb-4c1d-92fd-98893209dff1","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1133/T1133.md#atomic-test-1---running-chrome-vpn-extensions-via-the-registry-2-vpn-extension"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*Software\\\\Wow6432Node\\\\Google\\\\Chrome\\\\Extensions* AND registry.path:*update_url AND winlog.event_data.EventType:SetValue AND registry.path:(*fdcgdnkidjaadafnichfpabhfomcebme* OR *fcfhplploccackoneaefokcmbjfbkenj* OR *bihmplhobchoageeokmgbdihknkjbknd* OR *gkojfkhlekighikafcpjkiklfbnlmeio* OR *jajilbjjinjmgcibalaakngmkilboobh* OR *gjknjjomckknofjidppipffbpoekiipm* OR *nabbmpekekjknlbkgpodfndbodhijjem* OR *kpiecbcckbofpmkkkdibbllpinceiihk* OR *nlbejmccbhkncgokjcmghpfloaajcffj* OR *omghfjlpggmjjaagoclmmobgdodcjboh* OR *bibjcjfmgapbfoljiojpipaooddpkpai* OR *mpcaainmfjjigeicjnlkdfajbioopjko* OR *jljopmgdobloagejpohpldgkiellmfnc* OR *lochiccbgeohimldjooaakjllnafhaid* OR *nhnfcgpcbfclhfafjlooihdfghaeinfc* OR *ookhnhpkphagefgdiemllfajmkdkcaim* OR *namfblliamklmeodpcelkokjbffgmeoo* OR *nbcojefnccbanplpoffopkoepjmhgdgh* OR *majdfhpaihoncoakbjgbdhglocklcgno* OR *lnfdmdhmfbimhhpaeocncdlhiodoblbd* OR *eppiocemhmnlbhjplcgkofciiegomcon* OR *cocfojppfigjeefejbpfmedgjbpchcng* OR *foiopecknacmiihiocgdjgbjokkpkohc* OR *hhdobjgopfphlmjbmnpglhfcgppchgje* OR *jgbaghohigdbgbolncodkdlpenhcmcge* OR *inligpkjkhbpifecbdjhmdpcfhnlelja* OR *higioemojdadgdbhbbbkfbebbdlfjbip* OR *hipncndjamdcmphkgngojegjblibadbe* OR *iolonopooapdagdemdoaihahlfkncfgg* OR *nhfjkakglbnnpkpldhjmpmmfefifedcj* OR *jpgljfpmoofbmlieejglhonfofmahini* OR *fgddmllnllkalaagkghckoinaemmogpe* OR *ejkaocphofnobjdedneohbbiilggdlbi* OR *keodbianoliadkoelloecbhllnpiocoi* OR *hoapmlpnmpaehilehggglehfdlnoegck* OR *poeojclicodamonabcabmapamjkkmnnk* OR *dfkdflfgjdajbhocmfjolpjbebdkcjog* OR *kcdahmgmaagjhocpipbodaokikjkampi* OR *klnkiajpmpkkkgpgbogmcgfjhdoljacg* OR *lneaocagcijjdpkcabeanfpdbmapcjjg* OR *pgfpignfckbloagkfnamnolkeaecfgfh* OR *jplnlifepflhkbkgonidnobkakhmpnmh* OR *jliodmnojccaloajphkingdnpljdhdok* OR *hnmpcagpplmpfojmgmnngilcnanddlhb* OR *ffbkglfijbcbgblgflchnbphjdllaogb* OR *kcndmbbelllkmioekdagahekgimemejo* OR *jdgilggpfmjpbodmhndmhojklgfdlhob* OR *bihhflimonbpcfagfadcnbbdngpopnjb* OR *ppajinakbfocjfnijggfndbdmjggcmde* OR *oofgbpoabipfcfjapgnbbjjaenockbdp* OR *bhnhkdgoefpmekcgnccpnhjfdgicfebm* OR *knmmpciebaoojcpjjoeonlcjacjopcpf* OR *dhadilbmmjiooceioladdphemaliiobo* OR *jedieiamjmoflcknjdjhpieklepfglin* OR *mhngpdlhojliikfknhfaglpnddniijfh* OR *omdakjcmkglenbhjadbccaookpfjihpa* OR *npgimkapccfidfkfoklhpkgmhgfejhbj* OR *akeehkgglkmpapdnanoochpfmeghfdln* OR *gbmdmipapolaohpinhblmcnpmmlgfgje* OR *aigmfoeogfnljhnofglledbhhfegannp* OR *cgojmfochfikphincbhokimmmjenhhgk* OR *ficajfeojakddincjafebjmfiefcmanc* OR *ifnaibldjfdmaipaddffmgcmekjhiloa* OR *jbnmpdkcfkochpanomnkhnafobppmccn* OR *apcfdffemoinopelidncddjbhkiblecc* OR *mjolnodfokkkaichkcjipfgblbfgojpa* OR *oifjbnnafapeiknapihcmpeodaeblbkn* OR *plpmggfglncceinmilojdkiijhmajkjh* OR *mjnbclmflcpookeapghfhapeffmpodij* OR *bblcccknbdbplgmdjnnikffefhdlobhp* OR *aojlhgbkmkahabcmcpifbolnoichfeep* OR *lcmammnjlbmlbcaniggmlejfjpjagiia* OR *knajdeaocbpmfghhmijicidfcmdgbdpm* OR *bdlcnpceagnkjnjlbbbcepohejbheilk* OR *edknjdjielmpdlnllkdmaghlbpnmjmgb* OR *eidnihaadmmancegllknfbliaijfmkgo* OR *ckiahbcmlmkpfiijecbpflfahoimklke* OR *macdlemfnignjhclfcfichcdhiomgjjb* OR *chioafkonnhbpajpengbalkececleldf* OR *amnoibeflfphhplmckdbiajkjaoomgnj* OR *llbhddikeonkpbhpncnhialfbpnilcnc* OR *pcienlhnoficegnepejpfiklggkioccm* OR *iocnglnmfkgfedpcemdflhkchokkfeii* OR *igahhbkcppaollcjeaaoapkijbnphfhb* OR *njpmifchgidinihmijhcfpbdmglecdlb* OR *ggackgngljinccllcmbgnpgpllcjepgc* OR *kchocjcihdgkoplngjemhpplmmloanja* OR *bnijmipndnicefcdbhgcjoognndbgkep* OR *lklekjodgannjcccdlbicoamibgbdnmi* OR *dbdbnchagbkhknegmhgikkleoogjcfge* OR *egblhcjfjmbjajhjhpmnlekffgaemgfh* OR *ehbhfpfdkmhcpaehaooegfdflljcnfec* OR *bkkgdjpomdnfemhhkalfkogckjdkcjkg* OR *almalgbpmcfpdaopimbdchdliminoign* OR *akkbkhnikoeojlhiiomohpdnkhbkhieh* OR *gbfgfbopcfokdpkdigfmoeaajfmpkbnh* OR *bniikohfmajhdcffljgfeiklcbgffppl* OR *lejgfmmlngaigdmmikblappdafcmkndb* OR *ffhhkmlgedgcliajaedapkdfigdobcif* OR *gcknhkkoolaabfmlnjonogaaifnjlfnp* OR *pooljnboifbodgifngpppfklhifechoe* OR *fjoaledfpmneenckfbpdfhkmimnjocfa* OR *aakchaleigkohafkfjfjbblobjifikek* OR *dpplabbmogkhghncfbfdeeokoefdjegm* OR *padekgcemlokbadohgkifijomclgjgif* OR *bfidboloedlamgdmenmlbipfnccokknp*))`"}
