{"id":"62120148-6b7a-42be-8b91-271c04e281a3","created_by":"Den Iuzvyk","name":"Suspicious Camera and Microphone Access","tags":["attack.collection","attack.t1125","attack.t1123"],"interval":"5m","description":"Detects Processes accessing the camera and microphone from suspicious folder","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely, there could be conferencing software running from a Temp folder accessing the devices"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Cc][Aa][Pp][Aa][Bb][Ii][Ll][Ii][Tt][Yy][Aa][Cc][Cc][Ee][Ss][Ss][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt][Ss][Tt][Oo][Rr][Ee]\\\\.*/ AND registry.path:/.*\\\\[Nn][Oo][Nn][Pp][Aa][Cc][Kk][Aa][Gg][Ee][Dd].*/ AND registry.path:(/.*[Mm][Ii][Cc][Rr][Oo][Pp][Hh][Oo][Nn][Ee].*/ OR /.*[Ww][Ee][Bb][Cc][Aa][Mm].*/) AND registry.path:(/.*\\:#[Ww][Ii][Nn][Dd][Oo][Ww][Ss]#[Tt][Ee][Mm][Pp]#.*/ OR /.*\\:#$[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]#.*/ OR /.*\\:#[Tt][Ee][Mm][Pp]#.*/ OR /.*\\:#[Uu][Ss][Ee][Rr][Ss]#[Pp][Uu][Bb][Ll][Ii][Cc]#.*/ OR /.*\\:#[Uu][Ss][Ee][Rr][Ss]#[Dd][Ee][Ff][Aa][Uu][Ll][Tt]#.*/ OR /.*\\:#[Uu][Ss][Ee][Rr][Ss]#[Dd][Ee][Ss][Kk][Tt][Oo][Pp]#.*/))","rule_id":"62120148-6b7a-42be-8b91-271c04e281a3","timestamp_override":"event.ingested","references":["https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\* AND registry.path:*\\\\NonPackaged* AND registry.path:(*microphone* OR *webcam*) AND registry.path:(*\\:#Windows#Temp#* OR *\\:#$Recycle.bin#* OR *\\:#Temp#* OR *\\:#Users#Public#* OR *\\:#Users#Default#* OR *\\:#Users#Desktop#*))`"}
