{"id":"9b0f8a61-91b2-464f-aceb-0527e0a45020","created_by":"Kutepov Anton, oscd.community","name":"Windows Registry Persistence COM Key Linking","tags":["attack.persistence","attack.t1546.015"],"interval":"5m","description":"Detects COM object hijacking via TreatAs subkey","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Maybe some system utilities in rare cases use linking keys for backward compatibility"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*[Hh][Kk][Uu]\\\\.*/ AND registry.path:/.*[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/ AND registry.path:/.*\\\\[Tt][Rr][Ee][Aa][Tt][Aa][Ss].*/)","rule_id":"9b0f8a61-91b2-464f-aceb-0527e0a45020","timestamp_override":"event.ingested","references":["https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:CreateKey AND registry.path:*HKU\\\\* AND registry.path:*Classes\\\\CLSID\\\\* AND registry.path:*\\\\TreatAs*)`"}
