{"id":"7bdf2a7c-3acc-4091-9581-0a77dad1c5b5","created_by":"Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Chafer Activity","tags":["attack.persistence","attack.g0049","attack.t1053.005","attack.s0111","attack.t1543.003","attack.defense_evasion","attack.t1112","attack.command_and_control","attack.t1071.004"],"interval":"5m","description":"Detects Chafer activity attributed to OilRig as reported in Nyotron report in March 2018","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Uu][Mm][Ee]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Uu][Tt]/)","rule_id":"7bdf2a7c-3acc-4091-9581-0a77dad1c5b5","timestamp_override":"event.ingested","references":["https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:(*SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\UMe OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\UT)`"}
