{"id":"e3b50fa5-3c3f-444e-937b-0a99d33731cd","created_by":"@ScoubiMtl","name":"Outlook C2 Registry Key","tags":["attack.persistence","attack.command_and_control","attack.t1137","attack.t1008","attack.t1546"],"interval":"5m","description":"Detects the modification of Outlook Security Setting to allow unprompted execution. Goes with win_outlook_c2_macro_creation.yml and is particularly interesting if both events occur near to each other.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\16\\.0\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Ll][Ee][Vv][Ee][Ll]/ AND winlog.event_data.Details:/.*0[Xx]00000001.*/)","rule_id":"e3b50fa5-3c3f-444e-937b-0a99d33731cd","timestamp_override":"event.ingested","references":["https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKCU\\\\Software\\\\Microsoft\\\\Office\\\\16.0\\\\Outlook\\\\Security\\\\Level AND winlog.event_data.Details:*0x00000001*)`"}
