{"id":"5df86130-4e95-4a54-90f7-26541b40aec2","created_by":"frack113","name":"Registry Modification to Hidden File Extension","tags":["attack.persistence","attack.t1137"],"interval":"5m","description":"Hides the file extension through modification of the registry","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Hh][Ii][Dd][Ee][Ff][Ii][Ll][Ee][Ee][Xx][Tt]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Aa][Dd][Vv][Aa][Nn][Cc][Ee][Dd]\\\\[Hh][Ii][Dd][Dd][Ee][Nn]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/))","rule_id":"5df86130-4e95-4a54-90f7-26541b40aec2","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-1---modify-registry-of-current-user-profile---cmd","https://unit42.paloaltonetworks.com/ransomware-families/","https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?name=TrojanSpy%3aMSIL%2fHakey.A"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\HideFileExt AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR (winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\\\\Hidden AND winlog.event_data.Details:DWORD\\ \\(0x00000002\\)))`"}
