{"id":"046218bd-e0d8-4113-a3c3-895a12b2b298","created_by":"Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)","name":"Session Manager Autorun Keys Modification","tags":["attack.persistence","attack.t1547.001","attack.t1546.009"],"interval":"5m","description":"Detects modification of autostart extensibility point (ASEP) in registry.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ AND registry.path:(/.*\\\\[Ss][Ee][Tt][Uu][Pp][Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Ss]0[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*\\\\[Kk][Nn][Oo][Ww][Nn][Dd][Ll][Ll][Ss].*/ OR /.*\\\\[Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Bb][Oo][Oo][Tt][Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Aa][Pp][Pp][Cc][Ee][Rr][Tt][Dd][Ll][Ll][Ss].*/)) AND (NOT (winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/)))","rule_id":"046218bd-e0d8-4113-a3c3-895a12b2b298","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md","https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns","https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\System\\\\CurrentControlSet\\\\Control\\\\Session\\ Manager* AND registry.path:(*\\\\SetupExecute* OR *\\\\S0InitialCommand* OR *\\\\KnownDlls* OR *\\\\Execute* OR *\\\\BootExecute* OR *\\\\AppCertDlls*)) AND (NOT (winlog.event_data.Details:\\(Empty\\))))`"}
