{"id":"5b872a46-3b90-45c1-8419-f675db8053aa","created_by":"Omer Yampel, Christian Burkard","name":"UAC Bypass via Sdclt","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002","car.2019-04-001"],"interval":"5m","description":"Detects the pattern of UAC Bypass using registry key manipulation of sdclt.exe (e.g. UACMe 53)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Ee][Xx][Ee][Ff][Ii][Ll][Ee]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Rr][Uu][Nn][Aa][Ss]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Ii][Ss][Oo][Ll][Aa][Tt][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]/) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Ss][Yy][Mm][Bb][Oo][Ll][Ii][Cc][Ll][Ii][Nn][Kk][Vv][Aa][Ll][Uu][Ee]/ AND winlog.event_data.Details:/.*\\-1\\?\\?\\?\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\.*/))","rule_id":"5b872a46-3b90-45c1-8419-f675db8053aa","timestamp_override":"event.ingested","references":["https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/","https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*Software\\\\Classes\\\\exefile\\\\shell\\\\runas\\\\command\\\\isolatedCommand) OR (winlog.event_data.EventType:SetValue AND registry.path:*Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\\SymbolicLinkValue AND winlog.event_data.Details:*\\-1???\\\\Software\\\\Classes\\\\*))`"}
