{"id":"a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd","created_by":"Trent Liffick (@tliffick)","name":"Office Security Settings Changed","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects registry changes to Office macro settings. The TrustRecords contain information on executed macro-enabled documents. (see references)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Valid Macros and/or internal documents"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Tt][Rr][Uu][Ss][Tt][Ee][Dd]\\ [Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss]\\\\[Tt][Rr][Uu][Ss][Tt][Rr][Ee][Cc][Oo][Rr][Dd][Ss]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Vv][Bb][Oo][Mm]/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Vv][Bb][Aa][Ww][Aa][Rr][Nn][Ii][Nn][Gg][Ss]/))","rule_id":"a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd","timestamp_override":"event.ingested","references":["https://twitter.com/inversecos/status/1494174785621819397","https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/","https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:(*\\\\Security\\\\Trusted\\ Documents\\\\TrustRecords OR *\\\\Security\\\\AccessVBOM OR *\\\\Security\\\\VBAWarnings))`"}
