{"id":"9d15044a-7cfe-4d23-8085-6ebc11df7685","created_by":"Bhabesh Raj","name":"Stealthy VSTO Persistence","tags":["attack.t1137.006","attack.persistence"],"interval":"5m","description":"Detects persistence via Visual Studio Tools for Office (VSTO) add-ins in Office applications.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate Addin Installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Ww][Oo][Rr][Dd]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Oo][Ii][Nn][Tt]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Vv][Ss][Tt][Oo]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Ii][Nn][Cc][Ll][Uu][Ss][Ii][Oo][Nn]\\\\.*/)) AND (NOT ((process.executable:(/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Rr][Ee][Gg][Ss][Vv][Rr]\\.[Ee][Xx][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\.[Aa][Ss][Oo][Uu][Tt][Ee][Xx][Tt]\\\\.*/))))","rule_id":"9d15044a-7cfe-4d23-8085-6ebc11df7685","timestamp_override":"event.ingested","references":["https://twitter.com/_vivami/status/1347925307643355138","https://vanmieghem.io/stealth-outlook-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Software\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Word\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Excel\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Powerpoint\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\VSTO\\\\Security\\\\Inclusion\\\\*)) AND (NOT ((process.executable:(*\\\\msiexec.exe OR *\\\\regsvr32.exe)) OR (process.executable:(*\\\\winword.exe OR *\\\\integrator.exe OR *\\\\OfficeClickToRun.exe)) OR (process.executable:C\\:\\\\Program\\ Files\\\\AVG\\\\Antivirus\\\\RegSvr.exe AND registry.path:*\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\\\\Antivirus.AsOutExt\\\\*))))`"}
