{"id":"ad89044a-8f49-4673-9a55-cbd88a1b374f","created_by":"Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)","name":"Enabling COR Profiler Environment Variables","tags":["attack.persistence","attack.privilege_escalation","attack.defense_evasion","attack.t1574.012"],"interval":"5m","description":"This rule detects cor_enable_profiling and cor_profiler environment variables being set and configured.","risk_score":73,"enabled":true,"severity":"high","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Cc][Oo][Rr]_[Ee][Nn][Aa][Bb][Ll][Ee]_[Pp][Rr][Oo][Ff][Ii][Ll][Ii][Nn][Gg]/ OR /.*\\\\[Cc][Oo][Rr]_[Pp][Rr][Oo][Ff][Ii][Ll][Ee][Rr]/))","rule_id":"ad89044a-8f49-4673-9a55-cbd88a1b374f","timestamp_override":"event.ingested","references":["https://twitter.com/jamieantisocial/status/1304520651248668673","https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors","https://www.sans.org/cyber-security-summit/archives"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:(*\\\\COR_ENABLE_PROFILING OR *\\\\COR_PROFILER))`"}
