{"id":"c74d7efc-8826-45d9-b8bb-f04fac9e4eff","created_by":"Avneet Singh @v3t0_, oscd.community","name":"Run Once Task Configuration in Registry","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Rule to detect the configuration of Run Once registry key. Configured payload can be run by runonce.exe /AlternateShellStartup","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate modification of the registry key by legitimate program"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss].*/ AND registry.path:/.*\\\\[Ss][Tt][Uu][Bb][Pp][Aa][Tt][Hh]/) AND (NOT ((winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Cc][Hh][Rr][Mm][Ss][Tt][Pp]\\.[Ee][Xx][Ee]\\\"\\ \\-\\-[Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Ee]\\-[Uu][Ss][Ee][Rr]\\-[Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\ \\-\\-[Vv][Ee][Rr][Bb][Oo][Ss][Ee]\\-[Ll][Oo][Gg][Gg][Ii][Nn][Gg]\\ \\-\\-[Ss][Yy][Ss][Tt][Ee][Mm]\\-[Ll][Ee][Vv][Ee][Ll]/) OR (winlog.event_data.Details:(/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/ OR /\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/) AND winlog.event_data.Details:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]\\\"\\ \\-\\-[Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Ee]\\-[Uu][Ss][Ee][Rr]\\-[Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\ \\-\\-[Vv][Ee][Rr][Bb][Oo][Ss][Ee]\\-[Ll][Oo][Gg][Gg][Ii][Nn][Gg]\\ \\-\\-[Ss][Yy][Ss][Tt][Ee][Mm]\\-[Ll][Ee][Vv][Ee][Ll]\\ \\-\\-[Mm][Ss][Ee][Dd][Gg][Ee]\\ \\-\\-[Cc][Hh][Aa][Nn][Nn][Ee][Ll]\\=[Ss][Tt][Aa][Bb][Ll][Ee]/))))","rule_id":"c74d7efc-8826-45d9-b8bb-f04fac9e4eff","timestamp_override":"event.ingested","references":["https://twitter.com/pabraeken/status/990717080805789697","https://lolbas-project.github.io/lolbas/Binaries/Runonce/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:HKLM\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* AND registry.path:*\\\\StubPath) AND (NOT ((winlog.event_data.Details:\\\"C\\:\\\\Program\\ Files\\\\Google\\\\Chrome\\\\Application\\\\* AND winlog.event_data.Details:*\\\\Installer\\\\chrmstp.exe\\\"\\ \\-\\-configure\\-user\\-settings\\ \\-\\-verbose\\-logging\\ \\-\\-system\\-level) OR (winlog.event_data.Details:(\\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\* OR \\\"C\\:\\\\Program\\ Files\\\\Microsoft\\\\Edge\\\\Application\\\\*) AND winlog.event_data.Details:*\\\\Installer\\\\setup.exe\\\"\\ \\-\\-configure\\-user\\-settings\\ \\-\\-verbose\\-logging\\ \\-\\-system\\-level\\ \\-\\-msedge\\ \\-\\-channel\\=stable))))`"}
