{"id":"674202d0-b22a-4af4-ae5f-2eda1f3da1af","created_by":"frack113","name":"Bypass UAC Using Event Viewer","tags":["attack.persistence","attack.t1547.010"],"interval":"5m","description":"Bypasses User Account Control using Event Viewer and a relevant Windows Registry modification","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*_[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Mm][Ss][Cc][Ff][Ii][Ll][Ee]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/) AND (NOT (winlog.event_data.Details:/%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]\\ \\\"%1\\\"\\ %.*/)))","rule_id":"674202d0-b22a-4af4-ae5f-2eda1f3da1af","timestamp_override":"event.ingested","references":["https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-1---bypass-uac-using-event-viewer-cmd"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*_Classes\\\\mscfile\\\\shell\\\\open\\\\command\\\\\\(Default\\)) AND (NOT (winlog.event_data.Details:%SystemRoot%\\\\system32\\\\mmc.exe\\ \\\"%1\\\"\\ %*)))`"}
