{"id":"e88a6ddc-74f7-463b-9b26-f69fc0d2ce85","created_by":"frack113","name":"Set TimeProviders DllName","tags":["attack.persistence","attack.privilege_escalation","attack.t1547.003"],"interval":"5m","description":"Detects processes setting a new DLL in DllName in under HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\W32Time\\TimeProvider. Adversaries may abuse time providers to execute DLLs when the system boots. The Windows Time service (W32Time) enables time synchronization across and within domains.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww]32[Tt][Ii][Mm][Ee]\\\\[Tt][Ii][Mm][Ee][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ AND registry.path:/.*[Dd][Ll][Ll][Nn][Aa][Mm][Ee]/) AND (NOT (winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww]32[Tt][Ii][Mm][Ee]\\.[Dd][Ll][Ll]/)))","rule_id":"e88a6ddc-74f7-463b-9b26-f69fc0d2ce85","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.003/T1547.003.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\W32Time\\\\TimeProviders* AND registry.path:*DllName) AND (NOT (winlog.event_data.Details:C\\:\\\\Windows\\\\SYSTEM32\\\\w32time.DLL)))`"}
