{"id":"45e112d0-7759-4c2a-aa36-9f8fb79d3393","created_by":"frack113","name":"IE Change Domain Zone","tags":["attack.persistence","attack.t1137"],"interval":"5m","description":"Hides the file extension through modification of the registry","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\\\[Zz][Oo][Nn][Ee][Mm][Aa][Pp]\\\\[Dd][Oo][Mm][Aa][Ii][Nn][Ss]\\\\.*/) AND (NOT (winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /\\([Ee][Mm][Pp][Tt][Yy]\\)/))))","rule_id":"45e112d0-7759-4c2a-aa36-9f8fb79d3393","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone","https://docs.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet\\ Settings\\\\ZoneMap\\\\Domains\\\\*) AND (NOT (winlog.event_data.Details:(DWORD\\ \\(0x00000000\\) OR DWORD\\ \\(0x00000001\\) OR \\(Empty\\)))))`"}
