{"id":"36803969-5421-41ec-b92f-8500f79c23b0","created_by":"Karneades, Jonhnathan Ribeiro","name":"GlobalFlags Registry Persistence Mechanisms","tags":["attack.privilege_escalation","attack.persistence","attack.defense_evasion","attack.t1546.012","car.2013-01-002"],"interval":"5m","description":"Detects persistence using GlobalFlags in image file execution options","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\.*/ AND ((registry.path:/.*\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\.*/ AND registry.path:/.*\\\\[Gg][Ll][Oo][Bb][Aa][Ll][Ff][Ll][Aa][Gg].*/) OR (registry.path:/.*[Ss][Ii][Ll][Ee][Nn][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ee][Xx][Ii][Tt]\\\\.*/ AND registry.path:/.*\\\\[Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg][Mm][Oo][Dd][Ee].*/) OR (registry.path:/.*[Ss][Ii][Ll][Ee][Nn][Tt][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ee][Xx][Ii][Tt]\\\\.*/ AND registry.path:/.*\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/)))","rule_id":"36803969-5421-41ec-b92f-8500f79c23b0","timestamp_override":"event.ingested","references":["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\* AND ((registry.path:*\\\\Image\\ File\\ Execution\\ Options\\\\* AND registry.path:*\\\\GlobalFlag*) OR (registry.path:*SilentProcessExit\\\\* AND registry.path:*\\\\ReportingMode*) OR (registry.path:*SilentProcessExit\\\\* AND registry.path:*\\\\MonitorProcess*)))`"}
