{"id":"47e0852a-cf81-4494-a8e6-31864f8c86ed","created_by":"Florian Roth","name":"Pandemic Registry Key","tags":["attack.lateral_movement","attack.t1105"],"interval":"5m","description":"Detects Pandemic Windows Implant","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Uu][Ll][Ll]\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/","rule_id":"47e0852a-cf81-4494-a8e6-31864f8c86ed","timestamp_override":"event.ingested","references":["https://wikileaks.org/vault7/#Pandemic","https://twitter.com/MalwareJake/status/870349480356454401"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\null\\\\Instance*`"}
