{"id":"3d27f6dd-1c74-4687-b4fa-ca849d128d1c","created_by":"omkar72","name":"Office Application Startup - Office Test","tags":["attack.persistence","attack.t1137.002"],"interval":"5m","description":"Detects the addition of office test registry that allows a user to specify an arbitrary DLL that will be executed every time an Office application is started","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:(/[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\ [Tt][Ee][Ss][Tt]\\\\[Ss][Pp][Ee][Cc][Ii][Aa][Ll]\\\\[Pp][Ee][Rr][Ff]/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\ [Tt][Ee][Ss][Tt]\\\\[Ss][Pp][Ee][Cc][Ii][Aa][Ll]\\\\[Pp][Ee][Rr][Ff]/)","rule_id":"3d27f6dd-1c74-4687-b4fa-ca849d128d1c","timestamp_override":"event.ingested","references":["https://attack.mitre.org/techniques/T1137/002/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:(HKCU\\\\Software\\\\Microsoft\\\\Office\\ test\\\\Special\\\\Perf OR HKLM\\\\Software\\\\Microsoft\\\\Office\\ test\\\\Special\\\\Perf)`"}
