{"id":"5a2b21ee-6aaa-4234-ac9d-59a59edf90a1","created_by":"Nasreddine Bencherchali","name":"Persistence Via New SIP Provider","tags":["attack.persistence","attack.defense_evasion","attack.t1553.003"],"interval":"5m","description":"Detects when an attacker register a new SIP provider for persistence and defense evasion","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate SIP being registered by the OS or different software."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Oo][Ii][Dd]\\\\[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg][Tt][Yy][Pp][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Oo][Ii][Dd]\\\\[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg][Tt][Yy][Pp][Ee].*/) AND registry.path:(/.*\\\\[Dd][Ll][Ll].*/ OR /.*\\\\$[Dd][Ll][Ll].*/)) AND (NOT (winlog.event_data.Details:(/[Ww][Ii][Nn][Tt][Rr][Uu][Ss][Tt]\\.[Dd][Ll][Ll]/ OR /[Mm][Ss][Oo]\\.[Dd][Ll][Ll]/))))","rule_id":"5a2b21ee-6aaa-4234-ac9d-59a59edf90a1","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/codesigning.html","https://github.com/gtworek/PSBits/tree/master/SIP","https://specterops.io/assets/resources/SpecterOps_Subverting_Trust_in_Windows.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:(*\\\\SOFTWARE\\\\Microsoft\\\\Cryptography\\\\Providers\\\\* OR *\\\\SOFTWARE\\\\Microsoft\\\\Cryptography\\\\OID\\\\EncodingType* OR *\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Cryptography\\\\Providers\\\\* OR *\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\Cryptography\\\\OID\\\\EncodingType*) AND registry.path:(*\\\\Dll* OR *\\\\$DLL*)) AND (NOT (winlog.event_data.Details:(WINTRUST.DLL OR mso.dll))))`"}
