{"id":"2ff692c2-4594-41ec-8fcb-46587de769e0","created_by":"Tobias Michalski","name":"CrashControl CrashDump Disabled","tags":["attack.t1564","attack.t1112"],"interval":"5m","description":"Detects disabling the CrashDump per registry (as used by HermeticWiper)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate disabling of crashdumps"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Cc][Rr][Aa][Ss][Hh][Cc][Oo][Nn][Tt][Rr][Oo][Ll].*/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"2ff692c2-4594-41ec-8fcb-46587de769e0","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl* AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
