{"id":"9e3357ba-09d4-4fbd-a7c5-ad6386314513","created_by":"frack113","name":"Change the Fax Dll","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect possible persistence using Fax DLL load when service restart","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ff][Aa][Xx]\\\\[Dd][Ee][Vv][Ii][Cc][Ee]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ AND registry.path:/.*\\\\[Ii][Mm][Aa][Gg][Ee][Nn][Aa][Mm][Ee].*/) AND (NOT (details:/%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ff][Xx][Ss][Tt]30\\.[Dd][Ll][Ll]/)))","rule_id":"9e3357ba-09d4-4fbd-a7c5-ad6386314513","timestamp_override":"event.ingested","references":["https://twitter.com/dottor_morte/status/1544652325570191361","https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:*\\\\Software\\\\Microsoft\\\\Fax\\\\Device\\ Providers\\\\* AND registry.path:*\\\\ImageName*) AND (NOT (details:%systemroot%\\\\system32\\\\fxst30.dll)))`"}
