{"id":"526cc8bc-1cdc-48ad-8b26-f19bff969cec","created_by":"Nasreddine Bencherchali","name":"Removal Of Index Value to Hide Schedule Task","tags":["attack.defense_evasion","attack.t1562"],"interval":"5m","description":"Detects when the \"index\" value of a scheduled task is removed or deleted from the registry. Which effectively hides it from any tooling such as \"schtasks /query\"","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\[Tt][Rr][Ee][Ee]\\\\.*/ AND registry.path:/.*[Ii][Nn][Dd][Ee][Xx].*/)","rule_id":"526cc8bc-1cdc-48ad-8b26-f19bff969cec","timestamp_override":"event.ingested","references":["https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:DeleteKey AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tree\\\\* AND registry.path:*Index*)`"}
