{"id":"33efc23c-6ea2-4503-8cfe-bdf82ce8f705","created_by":"Nasreddine Bencherchali","name":"Persistence Via New AMSI Providers","tags":["attack.persistence"],"interval":"5m","description":"Detects when an attacker registers a new AMSI provider in order to achieve persistence","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate security products adding their own AMSI providers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Mm][Ss][Ii]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Mm][Ss][Ii]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/)) AND (NOT (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/)))","rule_id":"33efc23c-6ea2-4503-8cfe-bdf82ce8f705","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/amsi.html","https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/FakeAMSI/FakeAMSI.c"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:CreateKey AND registry.path:(*\\\\SOFTWARE\\\\Microsoft\\\\AMSI\\\\Providers\\\\* OR *\\\\SOFTWARE\\\\WOW6432Node\\\\Microsoft\\\\AMSI\\\\Providers\\\\*)) AND (NOT (process.executable:C\\:\\\\Program\\ Files*)))`"}
