{"id":"4e8d5fd3-c959-441f-a941-f73d0cdcdca5","created_by":"Sreeman","name":"Abusing Windows Telemetry For Persistence","tags":["attack.defense_evasion","attack.persistence","attack.t1112","attack.t1053"],"interval":"5m","description":"Windows telemetry makes use of the binary CompatTelRunner.exe to run a variety of commands and perform the actual telemetry collections. This binary was created to be easily extensible, and to that end, it relies on the registry to instruct on which commands to run. The problem is, it will run any arbitrary command without restriction of location or type.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Rr]\\\\.*/ AND winlog.event_data.Details:(/.*\\.[Ss][Hh]/ OR /.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Bb][Ii][Nn]/ OR /.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Cc][Mm][Dd]/ OR /.*\\.[Jj][Ss]/ OR /.*\\.[Pp][Ss]/ OR /.*\\.[Vv][Bb]/ OR /.*\\.[Jj][Aa][Rr]/ OR /.*\\.[Hh][Tt][Aa]/ OR /.*\\.[Mm][Ss][Ii]/ OR /.*\\.[Vv][Bb][Ss]/))","rule_id":"4e8d5fd3-c959-441f-a941-f73d0cdcdca5","timestamp_override":"event.ingested","references":["https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AppCompatFlags\\\\TelemetryController\\\\* AND winlog.event_data.Details:(*.sh OR *.exe OR *.dll OR *.bin OR *.bat OR *.cmd OR *.js OR *.ps OR *.vb OR *.jar OR *.hta OR *.msi OR *.vbs))`"}
