{"id":"8a58209c-7ae6-4027-afb0-307a78e4589a","created_by":"frack113","name":"User Account Hidden By Registry","tags":["attack.defense_evasion","attack.t1564.002"],"interval":"5m","description":"Detect modification for a specific user to prevent that user from being listed on the logon screen","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Ss][Pp][Ee][Cc][Ii][Aa][Ll][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\\\[Uu][Ss][Ee][Rr][Ll][Ii][Ss][Tt]\\\\.*/ AND registry.path:/.*$/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"8a58209c-7ae6-4027-afb0-307a78e4589a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1564.002/T1564.002.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon\\\\SpecialAccounts\\\\Userlist\\\\* AND registry.path:*$ AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
