{"id":"092af964-4233-4373-b4ba-d86ea2890288","created_by":"Nasreddine Bencherchali","name":"Add Debugger Entry To AeDebug For Persistence","tags":["attack.persistence"],"interval":"5m","description":"Detects when an attacker adds a new \"Debugger\" value to the \"AeDebug\" key in order to achieve persistence which will get invoked when an application crashes","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Ee][Dd][Ee][Bb][Uu][Gg]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr].*/ AND winlog.event_data.Details:/.*\\.[Dd][Ll][Ll]/) AND (NOT (winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Ss][Jj][Ii][Tt][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ \\-[Pp]\\ %[Ll][Dd]\\ \\-[Ee]\\ %[Ll][Dd]\\ \\-[Jj]\\ 0[Xx]%[Pp]/)))","rule_id":"092af964-4233-4373-b4ba-d86ea2890288","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/aedebug.html","https://docs.microsoft.com/en-us/windows/win32/debug/configuring-automatic-debugging"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AeDebug\\\\Debugger* AND winlog.event_data.Details:*.dll) AND (NOT (winlog.event_data.Details:\\\"C\\:\\\\WINDOWS\\\\system32\\\\vsjitdebugger.exe\\\"\\ \\-p\\ %ld\\ \\-e\\ %ld\\ \\-j\\ 0x%p)))`"}
