{"id":"e1aa95de-610a-427d-b9e7-9b46cfafbe6a","created_by":"Ján Trenčanský, frack113, AlertIQ, Nasreddine Bencherchali","name":"Windows Defender Service Disabled","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects when an attacker or tool disables the  Windows Defender service (WinDefend) via the registry","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd]\\\\[Ss][Tt][Aa][Rr][Tt]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000004\\)/)","rule_id":"e1aa95de-610a-427d-b9e7-9b46cfafbe6a","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/","https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\WinDefend\\\\Start AND winlog.event_data.Details:DWORD\\ \\(0x00000004\\))`"}
