{"id":"460479f3-80b7-42da-9c43-2cc1d54dbccd","created_by":"Christian Burkard","name":"Creation of a Local Hidden User Account by Registry","tags":["attack.persistence","attack.t1136.001"],"interval":"5m","description":"Sysmon registry detection of a local hidden user account.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Ss][Aa][Mm]\\\\[Ss][Aa][Mm]\\\\[Dd][Oo][Mm][Aa][Ii][Nn][Ss]\\\\[Aa][Cc][Cc][Oo][Uu][Nn][Tt]\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Nn][Aa][Mm][Ee][Ss]\\\\.*/ AND registry.path:/.*$/ AND process.executable:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/)","rule_id":"460479f3-80b7-42da-9c43-2cc1d54dbccd","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1387530414185664538"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\SAM\\\\SAM\\\\Domains\\\\Account\\\\Users\\\\Names\\\\* AND registry.path:*$ AND process.executable:*\\\\lsass.exe)`"}
