{"id":"6597be7b-ac61-4ac8-bef4-d3ec88174853","created_by":"Christian Burkard","name":"UAC Bypass Abusing Winsat Path Parsing - Registry","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Vv][Ee][Nn][Tt][Oo][Rr][Yy][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ff][Ii][Ll][Ee]\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]|.*/ AND registry.path:/.*\\\\[Ll][Oo][Ww][Ee][Rr][Cc][Aa][Ss][Ee][Ll][Oo][Nn][Gg][Pp][Aa][Tt][Hh]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]/)","rule_id":"6597be7b-ac61-4ac8-bef4-d3ec88174853","timestamp_override":"event.ingested","references":["https://github.com/hfiref0x/UACME"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Root\\\\InventoryApplicationFile\\\\winsat.exe|* AND registry.path:*\\\\LowerCaseLongPath AND winlog.event_data.Details:c\\:\\\\users\\\\* AND winlog.event_data.Details:*\\\\appdata\\\\local\\\\temp\\\\system32\\\\winsat.exe)`"}
