{"id":"e61e8a88-59a9-451c-874e-70fcc9740d67","created_by":"Florian Roth","name":"DNS ServerLevelPluginDll Install","tags":["attack.defense_evasion","attack.t1574.002","attack.t1112"],"interval":"5m","description":"Detects the installation of a plugin DLL via ServerLevelPluginDll parameter in Registry, which can be used to execute code in context of the DNS server (restart required)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Dd][Nn][Ss]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Ll][Ee][Vv][Ee][Ll][Pp][Ll][Uu][Gg][Ii][Nn][Dd][Ll][Ll]/)","rule_id":"e61e8a88-59a9-451c-874e-70fcc9740d67","timestamp_override":"event.ingested","references":["https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\services\\\\DNS\\\\Parameters\\\\ServerLevelPluginDll)`"}
