{"id":"9d3436ef-9476-4c43-acca-90ce06bdf33a","created_by":"Dimitrios Slamaris","name":"DHCP Callout DLL Installation","tags":["attack.defense_evasion","attack.t1574.002","attack.t1112"],"interval":"5m","description":"Detects the installation of a Callout DLL via CalloutDlls and CalloutEnabled parameter in Registry, which can be used to execute code in context of the DHCP server (restart required)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Dd][Hh][Cc][Pp][Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Cc][Aa][Ll][Ll][Oo][Uu][Tt][Dd][Ll][Ll][Ss]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Dd][Hh][Cc][Pp][Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Cc][Aa][Ll][Ll][Oo][Uu][Tt][Ee][Nn][Aa][Bb][Ll][Ee][Dd]/))","rule_id":"9d3436ef-9476-4c43-acca-90ce06bdf33a","timestamp_override":"event.ingested","references":["https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html","https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx","https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:(*\\\\Services\\\\DHCPServer\\\\Parameters\\\\CalloutDlls OR *\\\\Services\\\\DHCPServer\\\\Parameters\\\\CalloutEnabled))`"}
