{"id":"44a22d59-b175-4f13-8c16-cbaef5b581ff","created_by":"Andreas Hunkeler (@Karneades)","name":"New File Association Using Exefile","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects the abuse of the exefile handler in new file association. Used for bypass of security products.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\\\..*/ AND winlog.event_data.Details:/[Ee][Xx][Ee][Ff][Ii][Ll][Ee]/ AND winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/)","rule_id":"44a22d59-b175-4f13-8c16-cbaef5b581ff","timestamp_override":"event.ingested","references":["https://twitter.com/mrd0x/status/1461041276514623491"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*Classes\\\\.* AND winlog.event_data.Details:exefile AND winlog.event_data.EventType:SetValue)`"}
