{"id":"4916a35e-bfc4-47d0-8e25-a003d7067061","created_by":"B.Talebi","name":"Disable Sysmon Event Logging Via Registry","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects changes in Sysmon driver altitude. If the Sysmon driver is configured to load at an altitude of another registered service, it will fail to load at boot.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate driver altitude change to hide sysmon"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\.*/ AND registry.path:/.*\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee][Ss]\\\\[Ss][Yy][Ss][Mm][Oo][Nn]\\ [Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee]\\\\[Aa][Ll][Tt][Ii][Tt][Uu][Dd][Ee]/)","rule_id":"4916a35e-bfc4-47d0-8e25-a003d7067061","timestamp_override":"event.ingested","references":["https://posts.specterops.io/shhmon-silencing-sysmon-via-driver-unload-682b5be57650","https://youtu.be/zSihR3lTf7g"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\* AND registry.path:*\\\\Instances\\\\Sysmon\\ Instance\\\\Altitude)`"}
