{"id":"b98968aa-dbc0-4a9c-ac35-108363cbf8d5","created_by":"omkar72","name":"WINEKEY Registry Modification","tags":["attack.persistence","attack.t1547"],"interval":"5m","description":"Detects potential malicious modification of run keys by winekey or team9 backdoor","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Bb][Aa][Cc][Kk][Uu][Pp]\\ [Mm][Gg][Rr]/","rule_id":"b98968aa-dbc0-4a9c-ac35-108363cbf8d5","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Backup\\ Mgr`"}
