{"id":"dfb5b4e8-91d0-4291-b40a-e3b0d3942c45","created_by":"frack113","name":"Registry Key Creation or Modification for Shim DataBase","tags":["attack.persistence","attack.t1546.011"],"interval":"5m","description":"Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by application shims.\nThe Microsoft Windows Application Compatibility Infrastructure/Framework (Application Shim) was created to allow for backward compatibility of software as the operating system codebase changes over time\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd][Ss][Dd][Bb]\\\\.*/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Cc][Uu][Ss][Tt][Oo][Mm]\\\\.*/) AND winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/) AND (NOT (winlog.event_data.Details:\"\")))","rule_id":"dfb5b4e8-91d0-4291-b40a-e3b0d3942c45","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.011/T1546.011.md#atomic-test-3---registry-key-creation-andor-modification-events-for-sdb","https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:(HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AppCompatFlags\\\\InstalledSDB\\\\* OR HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AppCompatFlags\\\\Custom\\\\*) AND winlog.event_data.EventType:SetValue) AND (NOT (winlog.event_data.Details:\"\")))`"}
