{"id":"8023f872-3f1d-4301-a384-801889917ab4","created_by":"Nasreddine Bencherchali","name":"Usage of Renamed Sysinternals Tools - RegistrySet","tags":["attack.resource_development","attack.t1588.002"],"interval":"5m","description":"Detects the of the \"accepteula\" key related to sysinternals tools being set from non sysinternals tools","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt].*/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd].*/ OR /.*\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/) AND registry.path:/.*\\\\[Ee][Uu][Ll][Aa][Aa][Cc][Cc][Ee][Pp][Tt][Ee][Dd]/) AND (NOT (process.executable:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]64\\.[Ee][Xx][Ee]/))))","rule_id":"8023f872-3f1d-4301-a384-801889917ab4","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:(*\\\\PsExec* OR *\\\\ProcDump* OR *\\\\Handle* OR *\\\\LiveKd* OR *\\\\Process\\ Explorer* OR *\\\\PsLoglist* OR *\\\\PsPasswd* OR *\\\\Active\\ Directory\\ Explorer*) AND registry.path:*\\\\EulaAccepted) AND (NOT (process.executable:(*\\\\PsExec.exe OR *\\\\PsExec64.exe OR *\\\\procdump.exe OR *\\\\procdump64.exe OR *\\\\handle.exe OR *\\\\handle64.exe OR *\\\\livekd.exe OR *\\\\livekd64.exe OR *\\\\procexp.exe OR *\\\\procexp64.exe OR *\\\\psloglist.exe OR *\\\\psloglist64.exe OR *\\\\pspasswd.exe OR *\\\\pspasswd64.exe OR *\\\\ADExplorer.exe OR *\\\\ADExplorer64.exe))))`"}
