{"id":"d67572a0-e2ec-45d6-b8db-c100d14b8ef2","created_by":"Florian Roth, wagga","name":"NetNTLM Downgrade Attack","tags":["attack.defense_evasion","attack.t1562.001","attack.t1112"],"interval":"5m","description":"Detects NetNTLM downgrade attack","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\.*/ AND registry.path:/.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt].*/ AND registry.path:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa].*/ AND registry.path:(/.*\\\\[Ll][Mm][Cc][Oo][Mm][Pp][Aa][Tt][Ii][Bb][Ii][Ll][Ii][Tt][Yy][Ll][Ee][Vv][Ee][Ll]/ OR /.*\\\\[Nn][Tt][Ll][Mm][Mm][Ii][Nn][Cc][Ll][Ii][Ee][Nn][Tt][Ss][Ee][Cc]/ OR /.*\\\\[Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ss][Ee][Nn][Dd][Ii][Nn][Gg][Nn][Tt][Ll][Mm][Tt][Rr][Aa][Ff][Ff][Ii][Cc]/))","rule_id":"d67572a0-e2ec-45d6-b8db-c100d14b8ef2","timestamp_override":"event.ingested","references":["https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*SYSTEM\\\\* AND registry.path:*ControlSet* AND registry.path:*\\\\Control\\\\Lsa* AND registry.path:(*\\\\lmcompatibilitylevel OR *\\\\NtlmMinClientSec OR *\\\\RestrictSendingNTLMTraffic))`"}
