{"id":"e3fdf743-f05b-4051-990a-b66919be1743","created_by":"frack113","name":"Change User Account Associated with the FAX Service","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect change of the user account associated with the FAX service to avoid the escalation problem.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ff][Aa][Xx]\\\\[Oo][Bb][Jj][Ee][Cc][Tt][Nn][Aa][Mm][Ee]/ AND (NOT (details:/.*[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/)))","rule_id":"e3fdf743-f05b-4051-990a-b66919be1743","timestamp_override":"event.ingested","references":["https://twitter.com/dottor_morte/status/1544652325570191361","https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\Fax\\\\ObjectName AND (NOT (details:*NetworkService*)))`"}
