{"id":"ddd171b5-2cc6-4975-9e78-f0eccd08cc76","created_by":"Tobias Michalski","name":"Persistent Outlook Landing Pages","tags":["attack.persistence","attack.t1112"],"interval":"5m","description":"Detects the manipulation of persistent URLs which can be malicious","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\.*/) AND registry.path:/.*\\\\[Uu][Rr][Ll]/ AND registry.path:(/.*\\\\[Cc][Aa][Ll][Ee][Nn][Dd][Aa][Rr]\\\\.*/ OR /.*\\\\[Ii][Nn][Bb][Oo][Xx]\\\\.*/))","rule_id":"ddd171b5-2cc6-4975-9e78-f0eccd08cc76","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70","https://support.microsoft.com/en-us/topic/outlook-home-page-feature-is-missing-in-folder-properties-d207edb7-aa02-46c5-b608-5d9dbed9bd04?ui=en-us&rs=en-us&ad=us"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Software\\\\Microsoft\\\\Office\\\\* OR *\\\\Outlook\\\\WebView\\\\*) AND registry.path:*\\\\URL AND registry.path:(*\\\\Calendar\\\\* OR *\\\\Inbox\\\\*))`"}
