{"id":"a80f662f-022f-4429-9b8c-b1a41aaa6688","created_by":"Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)","name":"Internet Explorer Autorun Keys Modification","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects modification of autostart extensibility point (ASEP) in registry.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/) AND registry.path:(/.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr].*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\ [Bb][Aa][Rr][Ss].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR (registry.path:(/.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{2670000[Aa]\\-7350\\-4[Ff]3[Cc]\\-8081\\-5663[Ee][Ee]0[Cc]6[Cc]49\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{31[Dd]09[Bb][Aa]0\\-12[Ff]5\\-4[Cc][Cc][Ee]\\-[Bb][Ee]8[Aa]\\-2923[Ee]76605[Dd][Aa]\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{789[Ff][Ee]86[Ff]\\-6[Ff][Cc]4\\-46[Aa]1\\-9849\\-[Ee][Dd][Ee]0[Dd][Bb]0[Cc]95[Cc][Aa]\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{[Aa]95[Ff][Ee]080\\-8[Ff]5[Dd]\\-11[Dd]2\\-[Aa]20[Bb]\\-00[Aa][Aa]003[Cc]157[Aa]\\}.*/)) OR (registry.path:(/.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Ii][Tt][Bb][Aa][Rr]7[Ll][Aa][Yy][Oo][Uu][Tt]/ OR /.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ss][Hh][Oo][Ww][Dd][Ii][Ss][Cc][Uu][Ss][Ss][Ii][Oo][Nn][Bb][Uu][Tt][Tt][Oo][Nn]/ OR /.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ll][Oo][Cc][Kk][Ee][Dd]/)))))","rule_id":"a80f662f-022f-4429-9b8c-b1a41aaa6688","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md","https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns","https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Internet\\ Explorer* OR *\\\\Software\\\\Microsoft\\\\Internet\\ Explorer*) AND registry.path:(*\\\\Toolbar* OR *\\\\Extensions* OR *\\\\Explorer\\ Bars*)) AND (NOT ((winlog.event_data.Details:\\(Empty\\)) OR (registry.path:(*\\\\Extensions\\\\\\{2670000A\\-7350\\-4f3c\\-8081\\-5663EE0C6C49\\}* OR *\\\\Extensions\\\\\\{31D09BA0\\-12F5\\-4CCE\\-BE8A\\-2923E76605DA\\}* OR *\\\\Extensions\\\\\\{789FE86F\\-6FC4\\-46A1\\-9849\\-EDE0DB0C95CA\\}* OR *\\\\Extensions\\\\\\{A95fe080\\-8f5d\\-11d2\\-a20b\\-00aa003c157a\\}*)) OR (registry.path:(*\\\\Toolbar\\\\ShellBrowser\\\\ITBar7Layout OR *\\\\Toolbar\\\\ShowDiscussionButton OR *\\\\Toolbar\\\\Locked)))))`"}
