{"id":"7ec912f2-5175-4868-b811-ec13ad0f8567","created_by":"EagleEye Team, Florian Roth, NVISO","name":"Suspicious New Printer Ports in Registry (CVE-2020-1048)","tags":["attack.persistence","attack.execution","attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects a new and suspicious printer port creation in Registry that could be an attempt to exploit CVE-2020-1048","risk_score":73,"enabled":true,"severity":"high","false_positives":["New printer port install on host"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Rr][Tt][Ss].*/ AND winlog.event_data.Details:(/.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Oo][Mm].*/ OR /.*[Cc]\\:.*/))","rule_id":"7ec912f2-5175-4868-b811-ec13ad0f8567","timestamp_override":"event.ingested","references":["https://windows-internals.com/printdemon-cve-2020-1048/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Ports* AND winlog.event_data.Details:(*.dll* OR *.exe* OR *.bat* OR *.com* OR *C\\:*))`"}
