{"id":"d4e2745c-f0c6-4bde-a3ab-b553b3f693cc","created_by":"Nasreddine Bencherchali","name":"Persistence Via Disk Cleanup Handler - Autorun","tags":["attack.persistence"],"interval":"5m","description":"Detects when an attacker modifies values of the Disk Cleanup Handler in the registry to achieve persistence via autorun.\nThe disk cleanup manager is part of the operating system. It displays the dialog box […] The user has the option of enabling or disabling individual handlers by selecting or clearing their check box in the disk cleanup manager's UI. Although Windows comes with a number of disk cleanup handlers, they aren't designed to handle files produced by other applications. Instead, the disk cleanup manager is designed to be flexible and extensible by enabling any developer to implement and register their own disk cleanup handler. Any developer can extend the available disk cleanup services by implementing and registering a disk cleanup handler.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Vv][Oo][Ll][Uu][Mm][Ee][Cc][Aa][Cc][Hh][Ee][Ss]\\\\.*/) AND ((registry.path:/.*\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn].*/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/) OR (Targetobject:(/.*\\\\[Cc][Ll][Ee][Aa][Nn][Uu][Pp][Ss][Tt][Rr][Ii][Nn][Gg].*/ OR /.*\\\\[Pp][Rr][Ee][Cc][Ll][Ee][Aa][Nn][Uu][Pp][Ss][Tt][Rr][Ii][Nn][Gg].*/) AND winlog.event_data.Details:(/.*[Cc][Mm][Dd].*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ OR /.*[Mm][Ss][Hh][Tt][Aa].*/ OR /.*[Cc][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*[Ww][Ss][Ll].*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/))))","rule_id":"d4e2745c-f0c6-4bde-a3ab-b553b3f693cc","timestamp_override":"event.ingested","references":["https://persistence-info.github.io/Data/diskcleanuphandler.html","https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\VolumeCaches\\\\*) AND ((registry.path:*\\\\Autorun* AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\)) OR (Targetobject:(*\\\\CleanupString* OR *\\\\PreCleanupString*) AND winlog.event_data.Details:(*cmd* OR *powershell* OR *rundll32* OR *mshta* OR *cscript* OR *wscript* OR *wsl* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\TEMP\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*))))`"}
