{"id":"4a5f5a5e-ac01-474b-9b4e-d61298c9df1d","created_by":"oscd.community, Natalia Shornikova","name":"PowerShell as a Service in Registry","tags":["attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects that a powershell code is written to the registry as a service.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND registry.path:/.*\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]/ AND winlog.event_data.Details:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/))","rule_id":"4a5f5a5e-ac01-474b-9b4e-d61298c9df1d","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Services\\\\* AND registry.path:*\\\\ImagePath AND winlog.event_data.Details:(*powershell* OR *pwsh*))`"}
