{"id":"fc014922-5def-4da9-a0fc-28c973f41bfb","created_by":"oscd.community, Natalia Shornikova","name":"Execution DLL of Choice Using WAB.EXE","tags":["attack.defense_evasion","attack.t1218"],"interval":"5m","description":"This rule detects that the path to the DLL written in the registry is different from the default one. Launched WAB.exe tries to load the DLL from Registry.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Aa][Bb]\\\\[Dd][Ll][Ll][Pp][Aa][Tt][Hh]/) AND (NOT (winlog.event_data.Details:/%[Cc][Oo][Mm][Mm][Oo][Nn][Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ff][Ii][Ll][Ee][Ss]%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ww][Aa][Bb]32\\.[Dd][Ll][Ll]/)))","rule_id":"fc014922-5def-4da9-a0fc-28c973f41bfb","timestamp_override":"event.ingested","references":["https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OSBinaries/Wab.yml","https://twitter.com/Hexacorn/status/991447379864932352","http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\Software\\\\Microsoft\\\\WAB\\\\DLLPath) AND (NOT (winlog.event_data.Details:%CommonProgramFiles%\\\\System\\\\wab32.dll)))`"}
