{"id":"0442defa-b4a2-41c9-ae2c-ea7042fc4701","created_by":"Nasreddine Bencherchali","name":"New Network Provider - Registry","tags":["attack.credential_access","attack.t1003"],"interval":"5m","description":"Detects when an attacker tries to add a new network provider in order to dump clear text credentials, similar to how the NPPSpy tool does it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other legitimate network providers used and not filtred in this rule"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND registry.path:/.*\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/) AND (NOT (registry.path:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ll][Aa][Nn][Mm][Aa][Nn][Ww][Oo][Rr][Kk][Ss][Tt][Aa][Tt][Ii][Oo][Nn]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Rr][Dd][Pp][Nn][Pp]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/))))","rule_id":"0442defa-b4a2-41c9-ae2c-ea7042fc4701","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/troubleshoot/windows-client/deployment/network-provider-settings-removed-in-place-upgrade","https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND registry.path:*\\\\NetworkProvider*) AND (NOT (registry.path:(*\\\\System\\\\CurrentControlSet\\\\Services\\\\WebClient\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\LanmanWorkstation\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\RDPNP\\\\NetworkProvider*))))`"}
