{"id":"d88d0ab2-e696-4d40-a2ed-9790064e66b3","created_by":"frack113","name":"Modification of IE Registry Settings","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects the modification of the registry settings used for Internet Explorer and other Windows components that use these settings","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss].*/) AND (NOT ((winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd].*/) OR (winlog.event_data.Details:(/[Cc][Oo][Oo][Kk][Ii][Ee]\\:/ OR /[Vv][Ii][Ss][Ii][Tt][Ee][Dd]\\:/ OR /\\([Ee][Mm][Pp][Tt][Yy]\\)/)) OR (registry.path:(/.*\\\\[Cc][Aa][Cc][Hh][Ee].*/ OR /.*\\\\[Zz][Oo][Nn][Ee][Mm][Aa][Pp].*/ OR /.*\\\\[Ww][Pp][Aa][Dd][Dd][Ee][Cc][Ii][Ss][Ii][Oo][Nn].*/)) OR (winlog.event_data.Details:/[Bb][Ii][Nn][Aa][Rr][Yy]\\ [Dd][Aa][Tt][Aa]/))))","rule_id":"d88d0ab2-e696-4d40-a2ed-9790064e66b3","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet\\ Settings*) AND (NOT ((winlog.event_data.Details:DWORD*) OR (winlog.event_data.Details:(Cookie\\: OR Visited\\: OR \\(Empty\\))) OR (registry.path:(*\\\\Cache* OR *\\\\ZoneMap* OR *\\\\WpadDecision*)) OR (winlog.event_data.Details:Binary\\ Data))))`"}
