{"id":"612e47e9-8a59-43a6-b404-f48683f45bd6","created_by":"frack113","name":"ServiceDll Hijack","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects changes to the \"ServiceDLL\" value related to a service in the registry. This is often used as a method of persistence.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrative scripts","Installation of a service"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND registry.path:/.*\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll]/) AND (NOT ((winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\3\\\\[Pp][Rr][Ii][Nn][Tt][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Dd][Ll][Ll]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND registry.path:/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll]/ AND winlog.event_data.Details:/%%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]%%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ss][Aa]\\.[Dd][Ll][Ll]/))))","rule_id":"612e47e9-8a59-43a6-b404-f48683f45bd6","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time","https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND registry.path:*\\\\Parameters\\\\ServiceDll) AND (NOT ((winlog.event_data.Details:C\\:\\\\Windows\\\\system32\\\\spool\\\\drivers\\\\x64\\\\3\\\\PrintConfig.dll) OR (process.executable:C\\:\\\\Windows\\\\system32\\\\lsass.exe AND registry.path:*\\\\CurrentControlSet\\\\Services\\\\NTDS\\\\Parameters\\\\ServiceDll AND winlog.event_data.Details:%%systemroot%%\\\\system32\\\\ntdsa.dll))))`"}
