{"id":"1c3121ed-041b-4d97-a075-07f54f20fb4a","created_by":"frack113","name":"Registry Explorer Policy Modification","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects registry modifications that disable internal tools or functions in explorer (malware like Agent Tesla uses this technique)","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate admin script"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Ll][Oo][Gg][Oo][Ff][Ff]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Dd][Ee][Ss][Kk][Tt][Oo][Pp]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Rr][Uu][Nn]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Ff][Ii][Nn][Dd]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Pp][Aa][Nn][Ee][Ll]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Ff][Ii][Ll][Ee][Mm][Ee][Nn][Uu]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Cc][Ll][Oo][Ss][Ee]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Ss][Ee][Tt][Tt][Aa][Ss][Kk][Bb][Aa][Rr]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Ii][Ee][Ss][Mm][Yy][Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Nn][Oo][Tt][Rr][Aa][Yy][Cc][Oo][Nn][Tt][Ee][Xx][Tt][Mm][Ee][Nn][Uu]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"1c3121ed-041b-4d97-a075-07f54f20fb4a","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:(*SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoLogOff OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoDesktop OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoRun OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoFind OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoControlPanel OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoFileMenu OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoClose OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoSetTaskbar OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoPropertiesMyDocuments OR *SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\NoTrayContextMenu) AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
