{"id":"919f2ef0-be2d-4a7a-b635-eb2b41fde044","created_by":"Ilyas Ochkov, oscd.community","name":"Disable Security Events Logging Adding Reg Key MiniNt","tags":["attack.defense_evasion","attack.t1562.001","attack.t1112"],"interval":"5m","description":"Detects the addition of a key 'MiniNt' to the registry. Upon a reboot, Windows Event Log service will stopped write events.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Mm][Ii][Nn][Ii][Nn][Tt]/ AND winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/) OR winlog.event_data.NewName:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Mm][Ii][Nn][Ii][Nn][Tt]/)","rule_id":"919f2ef0-be2d-4a7a-b635-eb2b41fde044","timestamp_override":"event.ingested","references":["https://twitter.com/0gtweet/status/1182516740955226112"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\MiniNt AND winlog.event_data.EventType:CreateKey) OR winlog.event_data.NewName:HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\MiniNt)`"}
