{"id":"60936b49-fca0-4f32-993d-7415edcf9a5d","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"New Application in AppCompat","tags":["attack.execution","attack.t1204.002"],"interval":"5m","description":"A General detection for a new application in AppCompat. This indicates an application executing for the first time on an endpoint.","risk_score":73,"enabled":true,"severity":"informational","false_positives":["This rule is to explore new applications on an endpoint. False positives depends on the organization.","Newly setup system.","Legitimate installation of new application."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Ii][Bb][Ii][Ll][Ii][Tt][Yy]\\ [Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\\\[Ss][Tt][Oo][Rr][Ee]\\\\.*/)","rule_id":"60936b49-fca0-4f32-993d-7415edcf9a5d","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/1","https://threathunterplaybook.com/evals/apt29/detections/1.A.1_DFD6A782-9BDB-4550-AB6B-525E825B095E.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:Setvalue AND registry.path:*\\\\AppCompatFlags\\\\Compatibility\\ Assistant\\\\Store\\\\*)`"}
