{"id":"9ace0707-b560-49b8-b6ca-5148b42f39fb","created_by":"Tom Ueltschi (@c_APT_ure)","name":"Logon Scripts Creation in UserInitMprLogonScript Registry","tags":["attack.t1037.001","attack.persistence","attack.lateral_movement"],"interval":"5m","description":"Detects creation of UserInitMprLogonScript persistence method","risk_score":73,"enabled":true,"severity":"high","false_positives":["Exclude legitimate logon scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt][Mm][Pp][Rr][Ll][Oo][Gg][Oo][Nn][Ss][Cc][Rr][Ii][Pp][Tt].*/)","rule_id":"9ace0707-b560-49b8-b6ca-5148b42f39fb","timestamp_override":"event.ingested","references":["https://attack.mitre.org/techniques/T1037/","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:CreateKey AND registry.path:*UserInitMprLogonScript*)`"}
