{"id":"a982fc9c-6333-4ffb-a51d-addb04e8b529","created_by":"Christian Burkard","name":"Windows Defender Exclusions Added","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the Setting of Windows Defender Exclusions","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ss].*/)","rule_id":"a982fc9c-6333-4ffb-a51d-addb04e8b529","timestamp_override":"event.ingested","references":["https://twitter.com/_nullbind/status/1204923340810543109"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions*)`"}
