{"id":"1547e27c-3974-43e2-a7d7-7f484fb928ec","created_by":"frack113","name":"Registry Persitence via Service in Safe Mode","tags":["attack.defense_evasion","attack.t1564.001"],"interval":"5m","description":"Detects the modification of the registry to allow a driver or service to persist in Safe Mode.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Mm][Ii][Nn][Ii][Mm][Aa][Ll]\\\\.*/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\.*/) AND registry.path:/.*\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ AND winlog.event_data.Details:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND registry.path:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Mm][Ii][Nn][Ii][Mm][Aa][Ll]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/)))))","rule_id":"1547e27c-3974-43e2-a7d7-7f484fb928ec","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:Setvalue AND registry.path:(HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\Minimal\\\\* OR HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\Network\\\\*) AND registry.path:*\\\\\\(Default\\) AND winlog.event_data.Details:Service) AND (NOT ((process.executable:C\\:\\\\WINDOWS\\\\system32\\\\msiexec.exe AND registry.path:(HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\Minimal\\\\SAVService\\\\\\(Default\\) OR HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\Network\\\\SAVService\\\\\\(Default\\))))))`"}
