{"id":"fe20dda1-6f37-4379-bbe0-a98d400cae90","created_by":"frack113","name":"Scrobj.dll COM Hijacking","tags":["attack.persistence","attack.t1546.015"],"interval":"5m","description":"Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to get the location of the script to execute","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the dll."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Cc][Rr][Oo][Bb][Jj]\\.[Dd][Ll][Ll]/)","rule_id":"fe20dda1-6f37-4379-bbe0-a98d400cae90","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*InprocServer32\\\\\\(Default\\) AND winlog.event_data.Details:C\\:\\\\WINDOWS\\\\system32\\\\scrobj.dll)`"}
