{"id":"37b437cf-3fc5-4c8e-9c94-1d7c9aff842b","created_by":"frack113","name":"Allow RDP Remote Assistance Feature","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detect enable rdp feature to allow specific user to rdp connect on the targeted machine","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitmate use of the feature (alerts should be investigated either way)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ff][Aa][Ll][Ll][Oo][Ww][Tt][Oo][Gg][Ee][Tt][Hh][Ee][Ll][Pp]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)","rule_id":"37b437cf-3fc5-4c8e-9c94-1d7c9aff842b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*System\\\\CurrentControlSet\\\\Control\\\\Terminal\\ Server\\\\fAllowToGetHelp AND winlog.event_data.Details:DWORD\\ \\(0x00000001\\))`"}
