{"id":"baca5663-583c-45f9-b5dc-ea96a22ce542","created_by":"Florian Roth, @twjackomo, Jonhnathan Ribeiro, oscd.community","name":"Sticky Key Like Backdoor Usage","tags":["attack.privilege_escalation","attack.persistence","attack.t1546.008","car.2014-11-003","car.2014-11-008"],"interval":"5m","description":"Detects the usage and installation of a backdoor that uses an option to register a malicious debugger for built-in tools that are accessible in the login screen","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Uu][Tt][Ii][Ll][Mm][Aa][Nn]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Oo][Ss][Kk]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Mm][Aa][Gg][Nn][Ii][Ff][Yy]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Nn][Aa][Rr][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Dd][Ii][Ss][Pp][Ll][Aa][Yy][Ss][Ww][Ii][Tt][Cc][Hh]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Aa][Tt][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\[Hh][Ee][Ll][Pp][Pp][Aa][Nn][Ee]\\.[Ee][Xx][Ee]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/)","rule_id":"baca5663-583c-45f9-b5dc-ea96a22ce542","timestamp_override":"event.ingested","references":["https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/","https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:(*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\sethc.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\utilman.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\osk.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\Magnify.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\Narrator.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\DisplaySwitch.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\atbroker.exe\\\\Debugger OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\HelpPane.exe\\\\Debugger)`"}
