{"id":"944e8941-f6f6-4ee8-ac05-1c224e923c0e","created_by":"frack113","name":"Add Port Monitor Persistence in Registry","tags":["attack.persistence","attack.t1547.010"],"interval":"5m","description":"Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.\nA port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss]\\\\.*/ AND winlog.event_data.Details:/.*\\.[Dd][Ll][Ll]/ AND winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND registry.path:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss]\\\\[Cc][Uu][Tt][Ee][Pp][Dd][Ff]\\ [Ww][Rr][Ii][Tt][Ee][Rr]\\ [Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\ [Vv]4\\.0\\\\[Dd][Rr][Ii][Vv][Ee][Rr].*/ AND winlog.event_data.Details:/[Cc][Pp][Ww][Mm][Oo][Nn]64_[Vv]40\\.[Dd][Ll][Ll]/ AND winlog.event_data.User:(/.*[Aa][Uu][Tt][Hh][Oo][Rr][Ii].*/ OR /.*[Aa][Uu][Tt][Oo][Rr][Ii].*/)))))","rule_id":"944e8941-f6f6-4ee8-ac05-1c224e923c0e","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.010/T1547.010.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((registry.path:HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\Print\\\\Monitors\\\\* AND winlog.event_data.Details:*.dll AND winlog.event_data.EventType:SetValue) AND (NOT ((process.executable:C\\:\\\\Windows\\\\System32\\\\spoolsv.exe AND registry.path:*\\\\System\\\\CurrentControlSet\\\\Control\\\\Print\\\\Monitors\\\\CutePDF\\ Writer\\ Monitor\\ v4.0\\\\Driver* AND winlog.event_data.Details:cpwmon64_v40.dll AND winlog.event_data.User:(*AUTHORI* OR *AUTORI*)))))`"}
