{"id":"8fbe98a8-8f9d-44f8-aa71-8c572e29ef06","created_by":"Nasreddine Bencherchali","name":"Persistence Via MyComputer Key and SubKeys","tags":["attack.persistence"],"interval":"5m","description":"Detects modification to the \"Default\" value of the \"MyComputer\" key and subkeys to point to a custom binary that will be launched whenever the associated action is executed (see reference section for example)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely but if you experience FPs add specific processes and locations you would like to monitor for"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Mm][Yy][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr].*/ AND registry.path:/.*\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/)","rule_id":"8fbe98a8-8f9d-44f8-aa71-8c572e29ef06","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\MyComputer* AND registry.path:*\\(Default\\))`"}
