{"id":"67a6c006-3fbe-46a7-9074-2ba3b82c3000","created_by":"Bartlomiej Czyz @bczyz1, oscd.community","name":"Path To Screensaver Binary Modified","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.002"],"interval":"5m","description":"Detects value modification of registry key containing path to binary used as screensaver.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate modification of screensaver"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:(/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/))))","rule_id":"67a6c006-3fbe-46a7-9074-2ba3b82c3000","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md","https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\Control\\ Panel\\\\Desktop\\\\SCRNSAVE.EXE AND (NOT (process.executable:(*\\\\rundll32.exe OR *\\\\explorer.exe))))`"}
