{"id":"9f4662ac-17ca-43aa-8f12-5d7b989d0101","created_by":"Nasreddine Bencherchali","name":"Tamper With Sophos AV Registry Keys","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects tamper attempts to sophos av functionality via registry key modification","risk_score":73,"enabled":true,"severity":"high","false_positives":["Some FP may occure when the feature is disabled by the AV itself, you should always investigate if the action was legitimate"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Aa][Vv][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Ee][Dd][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)","rule_id":"9f4662ac-17ca-43aa-8f12-5d7b989d0101","timestamp_override":"event.ingested","references":["https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Sophos\\ Endpoint\\ Defense\\\\TamperProtection\\\\Config\\\\SAVEnabled* OR *\\\\Sophos\\ Endpoint\\ Defense\\\\TamperProtection\\\\Config\\\\SEDEnabled* OR *\\\\Sophos\\\\SAVService\\\\TamperProtection\\\\Enabled*) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\))`"}
