{"id":"7c81fec3-1c1d-43b0-996a-46753041b1b6","created_by":"Florian Roth","name":"UAC Bypass via Event Viewer","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002","car.2019-04-001"],"interval":"5m","description":"Detects UAC bypass method using Windows event viewer","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/[Hh][Kk][Cc][Uu]\\\\.*/ AND registry.path:/.*\\\\[Mm][Ss][Cc][Ff][Ii][Ll][Ee]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]/)","rule_id":"7c81fec3-1c1d-43b0-996a-46753041b1b6","timestamp_override":"event.ingested","references":["https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/","https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:HKCU\\\\* AND registry.path:*\\\\mscfile\\\\shell\\\\open\\\\command)`"}
