{"id":"1d218616-71b0-4c40-855b-9dbe75510f7f","created_by":"Christopher Peacock","name":"NetWire RAT Registry Key","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Attempts to detect registry events for common NetWire key HKCU\\Software\\NetWire","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.EventType:/[Cc][Rr][Ee][Aa][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Nn][Ee][Tt][Ww][Ii][Rr][Ee].*/)","rule_id":"1d218616-71b0-4c40-855b-9dbe75510f7f","timestamp_override":"event.ingested","references":["https://www.fortinet.com/blog/threat-research/new-netwire-rat-variant-spread-by-phishing","https://resources.infosecinstitute.com/topic/netwire-malware-what-it-is-how-it-works-and-how-to-prevent-it-malware-spotlight/","https://unit42.paloaltonetworks.com/guloader-installing-netwire-rat/","https://blogs.blackberry.com/en/2021/09/threat-thursday-netwire-rat-is-coming-down-the-line","https://app.any.run/tasks/41ecdbde-4997-4301-a350-0270448b4c8f/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.EventType:CreateKey AND registry.path:*\\\\software\\\\NetWire*)`"}
