{"id":"6aa1d992-5925-4e9f-a49b-845e51d1de01","created_by":"Ilyas Ochkov, oscd.community","name":"New DLL Added to AppCertDlls Registry Key","tags":["attack.persistence","attack.t1546.009"],"interval":"5m","description":"Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs value in the Registry key can be abused to obtain persistence and privilege escalation by causing a malicious DLL to be loaded and run in the context of separate processes on the computer.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Aa][Pp][Pp][Cc][Ee][Rr][Tt][Dd][Ll][Ll][Ss]/ OR winlog.event_data.NewName:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Aa][Pp][Pp][Cc][Ee][Rr][Tt][Dd][Ll][Ll][Ss]/)","rule_id":"6aa1d992-5925-4e9f-a49b-845e51d1de01","timestamp_override":"event.ingested","references":["http://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/","https://eqllib.readthedocs.io/en/latest/analytics/14f90406-10a0-4d36-a672-31cabe149f2f.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Session\\ Manager\\\\AppCertDlls OR winlog.event_data.NewName:HKLM\\\\SYSTEM\\\\CurentControlSet\\\\Control\\\\Session\\ Manager\\\\AppCertDlls)`"}
