{"id":"63647769-326d-4dde-a419-b925cc0caf42","created_by":"frack113","name":"Enable Microsoft Dynamic Data Exchange","tags":["attack.execution","attack.t1559.002"],"interval":"5m","description":"Enable Dynamic Data Exchange protocol (DDE) in all supported editions of Microsoft Word or Excel.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ww][Oo][Rr][Dd]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Aa][Ll][Ll][Oo][Ww][Dd][Dd][Ee]/ AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/)) OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:(/.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd][Dd][Ee][Ss][Ee][Rr][Vv][Ee][Rr][Ll][Aa][Uu][Nn][Cc][Hh]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd][Dd][Ee][Ss][Ee][Rr][Vv][Ee][Rr][Ll][Oo][Oo][Kk][Uu][Pp]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/))","rule_id":"63647769-326d-4dde-a419-b925cc0caf42","timestamp_override":"event.ingested","references":["https://msrc.microsoft.com/update-guide/vulnerability/ADV170021"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\Word\\\\Security\\\\AllowDDE AND winlog.event_data.Details:(DWORD\\ \\(0x00000001\\) OR DWORD\\ \\(0x00000002\\))) OR (winlog.event_data.EventType:SetValue AND registry.path:(*\\\\Excel\\\\Security\\\\DisableDDEServerLaunch OR *\\\\Excel\\\\Security\\\\DisableDDEServerLookup) AND winlog.event_data.Details:DWORD\\ \\(0x00000000\\)))`"}
