{"id":"96f697b0-b499-4e5d-9908-a67bec11cdb6","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Removal of Potential COM Hijacking Registry Keys","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"A General detection to trigger for processes removing .*\\shell\\open\\command registry keys. Registry keys that might have been used for COM hijacking activities.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Dd][Ee][Ll][Ee][Tt][Ee][Kk][Ee][Yy]/ AND registry.path:/.*\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee]/ AND registry.path:/[Hh][Kk][Cc][Rr]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\..*/))))","rule_id":"96f697b0-b499-4e5d-9908-a67bec11cdb6","timestamp_override":"event.ingested","references":["https://github.com/OTRF/detection-hackathon-apt29/issues/7","https://threathunterplaybook.com/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.html","https://docs.microsoft.com/en-us/windows/win32/shell/launch","https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand","https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:DeleteKey AND registry.path:*\\\\shell\\\\open\\\\command) AND (NOT ((process.executable:C\\:\\\\Windows\\\\system32\\\\svchost.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe) OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe) OR (process.executable:*\\\\Dropbox.exe AND registry.path:HKCR\\\\Dropbox.*))))`"}
