{"id":"9827ae57-3802-418f-994b-d5ecf5cd974b","created_by":"frack113","name":"Add Debugger Entry To DbgManagedDebugger For Persistence","tags":["attack.persistence","attack.t1574"],"interval":"5m","description":"Detects when an attacker adds a new \"Debugger\" value to the \"DbgManagedDebugger\" key in order to achieve persistence which will get invoked when an application crashes","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\.[Nn][Ee][Tt][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\[Dd][Bb][Gg][Mm][Aa][Nn][Aa][Gg][Ee][Dd][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/) AND (NOT (winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Ss][Jj][Ii][Tt][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ [Pp][Ii][Dd]\\ %[Dd]\\ [Aa][Pp][Pp][Dd][Oo][Mm]\\ %[Dd]\\ [Ee][Xx][Tt][Ee][Xx][Tt]\\ \\\"%[Ss]\\\"\\ [Ee][Vv][Tt][Hh][Dd][Ll]\\ %[Dd]/)))","rule_id":"9827ae57-3802-418f-994b-d5ecf5cd974b","timestamp_override":"event.ingested","references":["https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/","https://github.com/last-byte/PersistenceSniper"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\Microsoft\\\\.NETFramework\\\\DbgManagedDebugger) AND (NOT (winlog.event_data.Details:\\\"C\\:\\\\Windows\\\\system32\\\\vsjitdebugger.exe\\\"\\ PID\\ %d\\ APPDOM\\ %d\\ EXTEXT\\ \\\"%s\\\"\\ EVTHDL\\ %d)))`"}
