{"id":"5b175490-b652-4b02-b1de-5b5b4083c5f8","created_by":"Alexander Rausch","name":"RedMimicry Winnti Playbook Registry Manipulation","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Detects actions caused by the RedMimicry Winnti playbook","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Hh][Tt][Mm][Ll][Hh][Ee][Ll][Pp]\\\\[Dd][Aa][Tt][Aa].*/","rule_id":"5b175490-b652-4b02-b1de-5b5b4083c5f8","timestamp_override":"event.ingested","references":["https://redmimicry.com"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*HKLM\\\\SOFTWARE\\\\Microsoft\\\\HTMLHelp\\\\data*`"}
