{"id":"ac8866c7-ce44-46fd-8c17-b24acff96ca8","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"HybridConnectionManager Service Installation","tags":["attack.resource_development","attack.t1608"],"interval":"5m","description":"Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(registry.path:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Hh][Yy][Bb][Rr][Ii][Dd][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ OR (winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND winlog.event_data.Details:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Hh][Yy][Bb][Rr][Ii][Dd][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ll][Ii][Ss][Tt][Ee][Nn][Ee][Rr]\\.[Ee][Xx][Ee].*/))","rule_id":"ac8866c7-ce44-46fd-8c17-b24acff96ca8","timestamp_override":"event.ingested","references":["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(registry.path:*\\\\Services\\\\HybridConnectionManager* OR (winlog.event_data.EventType:SetValue AND winlog.event_data.Details:*Microsoft.HybridConnectionManager.Listener.exe*))`"}
