{"id":"b29aed60-ebd1-442b-9cb5-16a1d0324adb","created_by":"Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)","name":"Wow6432Node CurrentVersion Autorun Keys Modification","tags":["attack.persistence","attack.t1547.001"],"interval":"5m","description":"Detects modification of autostart extensibility point (ASEP) in registry.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.EventType:/[Ss][Ee][Tt][Vv][Aa][Ll][Uu][Ee]/ AND registry.path:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/ AND registry.path:(/.*\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Dd][Ee][Ll][Aa][Yy][Ll][Oo][Aa][Dd].*/ OR /.*\\\\[Rr][Uu][Nn]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee][Ee][Xx]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ii][Cc][Oo][Nn][Oo][Vv][Ee][Rr][Ll][Aa][Yy][Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc][Uu][Tt][Ee][Hh][Oo][Oo][Kk][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Aa][Rr][Ee][Dd][Tt][Aa][Ss][Kk][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Hh][Ee][Ll][Pp][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR (process.executable:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\\\\\{.*/ AND process.executable:/.*\\\\[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee].*/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ AND registry.path:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\.*/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/) AND registry.path:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Hh][Ee][Ll][Pp][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt][Ss]\\\\\\{31[Dd]09[Bb][Aa]0\\-12[Ff]5\\-4[Cc][Cc][Ee]\\-[Bb][Ee]8[Aa]\\-2923[Ee]76605[Dd][Aa]\\}\\\\.*/) OR (winlog.event_data.Details:/.*\\-[Aa]251\\-47[Bb]7\\-93[Ee]1\\-[Cc][Dd][Dd]82[Ee]34[Aa][Ff]8[Bb]\\}/ OR winlog.event_data.Details:/[Gg][Rr][Pp][Cc][Oo][Nn][Vv]\\ \\-[Oo]/ OR winlog.event_data.Details:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND winlog.event_data.Details:/.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee].*/ AND winlog.event_data.Details:/.*\\ \\/[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/) OR (registry.path:/.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Hh][Ee][Ll][Pp][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt][Ss]\\\\\\{92[Ee][Ff]2[Ee][Aa][Dd]\\-[Aa]7[Cc][Ee]\\-4424\\-[Bb]0[Dd][Bb]\\-499[Cc][Ff]856608[Ee]\\}\\\\[Nn][Oo][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]/) OR (process.executable:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\-[Rr][Uu][Nn][Tt][Ii][Mm][Ee]\\-.*/ AND registry.path:(/.*\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\\\{[Ee]2[Dd]1[Aa][Ee]32\\-[Dd][Dd]1[Dd]\\-4[Aa][Dd]7\\-[Aa]298\\-10[Ee]42[Ee]7840[Ff][Cc]\\}/ OR /.*\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\\\{7037[Bb]699\\-7382\\-448[Cc]\\-89[Aa]7\\-4765961[Dd]2537\\}/) AND winlog.event_data.Details:(/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ [Cc][Aa][Cc][Hh][Ee]\\\\\\{7037[Bb]699\\-7382\\-448[Cc]\\-89[Aa]7\\-4765961[Dd]2537\\}\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\-[Rr][Uu][Nn][Tt][Ii][Mm][Ee]\\-.*/ OR /\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ [Cc][Aa][Cc][Hh][Ee]\\\\\\{[Ee]2[Dd]1[Aa][Ee]32\\-[Dd][Dd]1[Dd]\\-4[Aa][Dd]7\\-[Aa]298\\-10[Ee]42[Ee]7840[Ff][Cc]\\}\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\-[Rr][Uu][Nn][Tt][Ii][Mm][Ee]\\-.*/) AND winlog.event_data.Details:/.*\\.[Ee][Xx][Ee]\\\"\\ \\/[Bb][Uu][Rr][Nn]\\.[Rr][Uu][Nn][Oo][Nn][Cc][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ [Cc][Aa][Cc][Hh][Ee]\\\\\\{[Dd]21[Aa]4[Ff]20\\-968[Aa]\\-4[Bb]0[Cc]\\-[Bb][Ff]04\\-[Aa]38[Dd][Aa]5[Ff]06[Ee]41\\}\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\-[Rr][Uu][Nn][Tt][Ii][Mm][Ee]\\-.*/))))","rule_id":"b29aed60-ebd1-442b-9cb5-16a1d0324adb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md","https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns","https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d","https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.EventType:SetValue AND registry.path:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND registry.path:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run\\\\* OR *\\\\RunOnce\\\\* OR *\\\\RunOnceEx\\\\* OR *\\\\RunServices\\\\* OR *\\\\RunServicesOnce\\\\* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects*)) AND (NOT ((winlog.event_data.Details:\\(Empty\\)) OR (process.executable:*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\\\{* AND process.executable:*\\\\setup.exe*) OR (process.executable:C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\OfficeClickToRun.exe AND registry.path:*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Wow6432Node\\\\*) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe) AND registry.path:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{31D09BA0\\-12F5\\-4CCE\\-BE8A\\-2923E76605DA\\}\\\\*) OR (winlog.event_data.Details:*\\-A251\\-47B7\\-93E1\\-CDD82E34AF8B\\} OR winlog.event_data.Details:grpconv\\ \\-o OR winlog.event_data.Details:*C\\:\\\\Program\\ Files* AND winlog.event_data.Details:*\\\\Dropbox\\\\Client\\\\Dropbox.exe* AND winlog.event_data.Details:*\\ \\/systemstartup*) OR (registry.path:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{92EF2EAD\\-A7CE\\-4424\\-B0DB\\-499CF856608E\\}\\\\NoExplorer) OR (process.executable:*\\\\windowsdesktop\\-runtime\\-* AND registry.path:(*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{e2d1ae32\\-dd1d\\-4ad7\\-a298\\-10e42e7840fc\\} OR *\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{7037b699\\-7382\\-448c\\-89a7\\-4765961d2537\\}) AND winlog.event_data.Details:(\\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{7037b699\\-7382\\-448c\\-89a7\\-4765961d2537\\}\\\\windowsdesktop\\-runtime\\-* OR \\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{e2d1ae32\\-dd1d\\-4ad7\\-a298\\-10e42e7840fc\\}\\\\windowsdesktop\\-runtime\\-*) AND winlog.event_data.Details:*.exe\\\"\\ \\/burn.runonce) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe) OR (winlog.event_data.Details:\\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{d21a4f20\\-968a\\-4b0c\\-bf04\\-a38da5f06e41\\}\\\\windowsdesktop\\-runtime\\-*))))`"}
