{"id":"6ea3bf32-9680-422d-9f50-e90716b12a66","created_by":"oscd.community, Dmitry Uchakin","name":"UAC Bypass Via Wsreset","tags":["attack.defense_evasion","attack.privilege_escalation","attack.t1548.002"],"interval":"5m","description":"Unfixed method for UAC bypass from windows 10. WSReset.exe file associated with the Windows Store. It will run a binary file contained in a low-privilege registry.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"registry.path:/.*\\\\[Aa][Pp][Pp][Xx]82[Aa]6[Gg][Ww][Rr][Ee]4[Ff][Dd][Gg]3[Bb][Tt]635[Tt][Nn]5[Cc][Tt][Qq][Jj][Ff]8[Mm][Ss][Dd][Dd]2\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]/","rule_id":"6ea3bf32-9680-422d-9f50-e90716b12a66","timestamp_override":"event.ingested","references":["https://www.bleepingcomputer.com/news/security/trickbot-uses-a-new-windows-10-uac-bypass-to-launch-quietly","https://lolbas-project.github.io/lolbas/Binaries/Wsreset"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`registry.path:*\\\\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\\\\Shell\\\\open\\\\command`"}
