{"id":"815cd91b-7dbc-4247-841a-d7dd1392b0a8","created_by":"frack113","name":"Sysmon Configuration Error","tags":["attack.defense_evasion","attack.t1564"],"interval":"5m","description":"Detects when an adversary is trying to hide it's action from Sysmon logging based on error messages","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative action"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Description:(/.*[Ff][Aa][Ii][Ll][Ee][Dd]\\ [Tt][Oo]\\ [Oo][Pp][Ee][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\ [Ww][Ii][Tt][Hh]\\ [Ee][Rr][Rr][Oo][Rr].*/ OR /.*[Ff][Aa][Ii][Ll][Ee][Dd]\\ [Tt][Oo]\\ [Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\ [Tt][Oo]\\ [Tt][Hh][Ee]\\ [Dd][Rr][Ii][Vv][Ee][Rr]\\ [Tt][Oo]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn].*/) AND (NOT ((winlog.event_data.Description:/.*[Ff][Aa][Ii][Ll][Ee][Dd]\\ [Tt][Oo]\\ [Oo][Pp][Ee][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\ [Ww][Ii][Tt][Hh]\\ [Ee][Rr][Rr][Oo][Rr].*/ AND winlog.event_data.Description:/.*[Ll][Aa][Ss][Tt]\\ [Ee][Rr][Rr][Oo][Rr]\\:\\ [Tt][Hh][Ee]\\ [Mm][Ee][Dd][Ii][Aa]\\ [Ii][Ss]\\ [Ww][Rr][Ii][Tt][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd]\\..*/) OR (winlog.event_data.Description:(/.*[Ff][Aa][Ii][Ll][Ee][Dd]\\ [Tt][Oo]\\ [Oo][Pp][Ee][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\ [Ww][Ii][Tt][Hh]\\ [Ee][Rr][Rr][Oo][Rr]\\ 19.*/ OR /.*[Ff][Aa][Ii][Ll][Ee][Dd]\\ [Tt][Oo]\\ [Oo][Pp][Ee][Nn]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Ff][Ii][Gg][Uu][Rr][Aa][Tt][Ii][Oo][Nn]\\ [Ww][Ii][Tt][Hh]\\ [Ee][Rr][Rr][Oo][Rr]\\ 93.*/)))))","rule_id":"815cd91b-7dbc-4247-841a-d7dd1392b0a8","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://talesfrominfosec.blogspot.com/2017/12/killing-sysmon-silently.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Description:(*Failed\\ to\\ open\\ service\\ configuration\\ with\\ error* OR *Failed\\ to\\ connect\\ to\\ the\\ driver\\ to\\ update\\ configuration*) AND (NOT ((winlog.event_data.Description:*Failed\\ to\\ open\\ service\\ configuration\\ with\\ error* AND winlog.event_data.Description:*Last\\ error\\:\\ The\\ media\\ is\\ write\\ protected.*) OR (winlog.event_data.Description:(*Failed\\ to\\ open\\ service\\ configuration\\ with\\ error\\ 19* OR *Failed\\ to\\ open\\ service\\ configuration\\ with\\ error\\ 93*)))))`"}
