{"id":"83844185-1c5b-45bc-bcf3-b5bf3084ca5b","created_by":"Florian Roth","name":"Suspicious Encoded Scripts in a WMI Consumer","tags":["attack.execution","attack.t1047","attack.persistence","attack.t1546.003"],"interval":"5m","description":"Detects suspicious encoded payloads in WMI Event Consumers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"process.executable:(/.*[Vv]3[Jj][Pp][Dd][Gg][Vv][Qq][Cc][Mm]9[Jj][Zz][Xx][Nn][Zz][Tt][Ww][Vv][Tt][Bb]3[Jj]5.*/ OR /.*[Dd][Yy][Aa][Xx][Rr][Ll][Uu][Hh][Jj][Vv][Yy]2[Vv][Zz][Cc]01[Ll][Bb][Ww]9[Yy][Ee].*/ OR /.*[Xx][Cc][Mm][Ll]0[Zz][Vv][Bb][Yy][Bb]2[Nn][Ll][Cc]3[Nn][Nn][Zz][Ww]1[Vv][Cc][Nn].*/ OR /.*[Vv][Gg][Hh][Pp][Cc][Yy][Bb][Ww][Cc][Mm]9[Nn][Cc][Mm][Ff][Tt][Ii][Gg][Nn][Hh][Bb][Mm]5[Vv][Dd][Cc][Bb][Ii][Zz][Ss][Bb][Yy][Dd][Ww]4[Gg][Aa][Ww]4[Gg][Rr][Ee]9[Tt][Ii][Gg]1[Vv][Zz][Gg].*/ OR /.*[Rr][Oo][Aa][Xx][Mm][Gg][Cc][Hh][Jj][Vv][Zz]3[Jj][Hh][Bb][Ss][Bb][Jj][Yy][Ww]5[Uu][Bb]3[Qq][Gg][Yy][Mm][Uu][Gg][Cc][Nn][Vv][Uu][Ii][Gg][Ll][Uu][Ii][Ee][Rr][Pp][Uu][Yy][Bb][Tt][Bb]2[Rr][Ll].*/ OR /.*[Uu][Aa][Gg][Ll][Zz][Ii][Hh][Bb][Yy][Bb]2[Dd][Yy][Yy][Ww]0[Gg][Yy]2[Ff][Uu][Bb][Mm]90[Ii][Gg][Jj][Ll][Ii][Hh][Jj]1[Bb][Ii][Bb][Pp][Bb][Ii][Bb][Ee][Tt]1[Mm][Gg][Bb][Ww]9[Kk][Zz].*/ OR /.*[Vv][Gg][Hh][Pp][Cc][Yy][Bb][Ww][Cc][Mm]9[Nn][Cc][Mm][Ff][Tt][Ii][Gg]11[Cc]3[Qq][Gg][Yy][Mm][Uu][Gg][Cc][Nn][Vv][Uu][Ii][Hh][Vv][Uu][Zz][Gg][Vv][Yy][Ii][Ff][Dd][Pp][Bb][Jj][Mm][Yy].*/ OR /.*[Rr][Oo][Aa][Xx][Mm][Gg][Cc][Hh][Jj][Vv][Zz]3[Jj][Hh][Bb][Ss][Bb][Tt][Dd][Xx][Nn]0[Ii][Gg][Jj][Ll][Ii][Hh][Jj]1[Bb][Ii][Bb]1[Bb][Mm][Rr][Ll][Cc][Ii][Bb][Xx][Aa][Ww]4[Zz][Mm].*/ OR /.*[Uu][Aa][Gg][Ll][Zz][Ii][Hh][Bb][Yy][Bb]2[Dd][Yy][Yy][Ww]0[Gg][Bb][Xx][Vv][Zz][Dd][Cc][Bb][Ii][Zz][Ss][Bb][Yy][Dd][Ww]4[Gg][Dd][Ww]5[Kk][Zz][Xx][Ii][Gg][Vv]2[Ll][Uu][Mm][Zz].*/)","rule_id":"83844185-1c5b-45bc-bcf3-b5bf3084ca5b","timestamp_override":"event.ingested","references":["https://github.com/RiccardoAncarani/LiquidSnake"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`process.executable:(*V3JpdGVQcm9jZXNzTWVtb3J5* OR *dyaXRlUHJvY2Vzc01lbW9ye* OR *Xcml0ZVByb2Nlc3NNZW1vcn* OR *VGhpcyBwcm9ncmFtIGNhbm5vdCBiZSBydW4gaW4gRE9TIG1vZG* OR *RoaXMgcHJvZ3JhbSBjYW5ub3QgYmUgcnVuIGluIERPUyBtb2Rl* OR *UaGlzIHByb2dyYW0gY2Fubm90IGJlIHJ1biBpbiBET1MgbW9kZ* OR *VGhpcyBwcm9ncmFtIG11c3QgYmUgcnVuIHVuZGVyIFdpbjMy* OR *RoaXMgcHJvZ3JhbSBtdXN0IGJlIHJ1biB1bmRlciBXaW4zM* OR *UaGlzIHByb2dyYW0gbXVzdCBiZSBydW4gdW5kZXIgV2luMz*)`"}
