{"id":"23b71bc5-953e-4971-be4c-c896cda73fc2","created_by":"Nasreddine Bencherchali","name":"Sysmon Blocked Executable","tags":["attack.defense_evasion"],"interval":"5m","description":"Triggers on any Sysmon file block executable event. Which should indicates a violation of the block policy set","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"event.code:27","rule_id":"23b71bc5-953e-4971-be4c-c896cda73fc2","timestamp_override":"event.ingested","references":["https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`event.code:27`"}
