{"id":"99b97608-3e21-4bfe-8217-2a127c396a0e","created_by":"Florian Roth","name":"PowerShell Rundll32 Remote Thread Creation","tags":["attack.defense_evasion","attack.execution","attack.t1218.011","attack.t1059.001"],"interval":"5m","description":"Detects PowerShell remote thread creation in Rundll32.exe","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetImage:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/)","rule_id":"99b97608-3e21-4bfe-8217-2a127c396a0e","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2018/06/bring-your-own-land-novel-red-teaming-technique.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND winlog.event_data.TargetImage:*\\\\rundll32.exe)`"}
