{"id":"1f2b5353-573f-4880-8e33-7d04dcf97744","created_by":"frack113","name":"Sysmon Configuration Modification","tags":["attack.defense_evasion","attack.t1564"],"interval":"5m","description":"Detects when an attacker tries to hide from Sysmon by disabling or stopping it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative action"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.State:/[Ss][Tt][Oo][Pp][Pp][Ee][Dd]/ OR /[Ss][Yy][Ss][Mm][Oo][Nn]\\ [Cc][Oo][Nn][Ff][Ii][Gg]\\ [Ss][Tt][Aa][Tt][Ee]\\ [Cc][Hh][Aa][Nn][Gg][Ee][Dd]/) AND (NOT (winlog.event_data.State:/[Ss][Tt][Aa][Rr][Tt][Ee][Dd]/)))","rule_id":"1f2b5353-573f-4880-8e33-7d04dcf97744","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md","https://talesfrominfosec.blogspot.com/2017/12/killing-sysmon-silently.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.State:Stopped OR Sysmon\\ config\\ state\\ changed) AND (NOT (winlog.event_data.State:Started)))`"}
