{"id":"e554f142-5cf3-4e55-ace9-a1b59e0def65","created_by":"Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR), wagga","name":"T1021 DCOM InternetExplorer.Application Iertutil DLL Hijack","tags":["attack.lateral_movement","attack.t1021.002","attack.t1021.003"],"interval":"5m","description":"Detects a threat actor creating a file named `iertutil.dll` in the `C:\\Program Files\\Internet Explorer\\` directory over the network and loading it for a DCOM InternetExplorer DLL Hijack scenario.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND ((event.code:11 AND process.executable:/[Ss][Yy][Ss][Tt][Ee][Mm]/ AND file.path:/.*\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/) OR (event.code:7 AND process.executable:/.*\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/)))","rule_id":"e554f142-5cf3-4e55-ace9-a1b59e0def65","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009183000.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND ((event.code:11 AND process.executable:System AND file.path:*\\\\Internet\\ Explorer\\\\iertutil.dll) OR (event.code:7 AND process.executable:*\\\\Internet\\ Explorer\\\\iexplore.exe AND file.path:*\\\\Internet\\ Explorer\\\\iertutil.dll)))`"}
