{"id":"66d31e5f-52d6-40a4-9615-002d3789a119","created_by":"Perez Diego (@darkquassar), oscd.community","name":"Suspicious Remote Thread Source","tags":["attack.privilege_escalation","attack.defense_evasion","attack.t1055"],"interval":"5m","description":"Offensive tradecraft is switching away from using APIs like \"CreateRemoteThread\", however, this is still largely observed in the wild. This rule aims to detect suspicious processes (those we would not expect to behave in this way like word.exe or outlook.exe) creating remote threads on other processes. It is a generalistic rule, but it should have a low FP ratio due to the selected range of processes.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Bb][Aa][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Vv][Tt][Rr][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Ff][Rr][Aa][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Nn][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Ss][Ee][Nn][Tt][Uu][Tt][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Aa][Nn][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Oo][Rr][Ff][Ii][Ll][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Pp][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Yy][Nn][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Aa][Kk][Ee][Cc][Aa][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Dd][Nn][Ss][Rr][Ee][Ss][Pp][Oo][Nn][Dd][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Pp][Aa][Ii][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Vv][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Yy][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Oo][Bb][Oo][Cc][Oo][Pp][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Aa][Pp][Cc][Ii][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ss][Tt][Hh][Ee][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww]3[Ww][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ss][Cc][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/) AND (NOT ((process.executable:/.*[Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR SourceParentImage:/.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\.*/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Rr][Oo][Vv][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ AND TargetParentProcessId:0) OR (process.executable:/.*\\\\[Gg][Ii][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:(/.*\\\\[Gg][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Ss][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Ss][Yy][Ss][Tt][Ee][Mm]/) OR (SourceParentImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/))))","rule_id":"66d31e5f-52d6-40a4-9615-002d3789a119","timestamp_override":"event.ingested","references":["Personal research, statistical analysis","https://lolbas-project.github.io"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\bash.exe OR *\\\\cvtres.exe OR *\\\\defrag.exe OR *\\\\dnx.exe OR *\\\\esentutl.exe OR *\\\\excel.exe OR *\\\\expand.exe OR *\\\\explorer.exe OR *\\\\find.exe OR *\\\\findstr.exe OR *\\\\forfiles.exe OR *\\\\gpupdate.exe OR *\\\\hh.exe OR *\\\\iexplore.exe OR *\\\\installutil.exe OR *\\\\lync.exe OR *\\\\makecab.exe OR *\\\\mDNSResponder.exe OR *\\\\monitoringhost.exe OR *\\\\msbuild.exe OR *\\\\mshta.exe OR *\\\\msiexec.exe OR *\\\\mspaint.exe OR *\\\\outlook.exe OR *\\\\ping.exe OR *\\\\powerpnt.exe OR *\\\\provtool.exe OR *\\\\python.exe OR *\\\\regsvr32.exe OR *\\\\robocopy.exe OR *\\\\runonce.exe OR *\\\\sapcimc.exe OR *\\\\schtasks.exe OR *\\\\smartscreen.exe OR *\\\\spoolsv.exe OR *\\\\tstheme.exe OR *\\\\userinit.exe OR *\\\\vssadmin.exe OR *\\\\vssvc.exe OR *\\\\w3wp.exe OR *\\\\winlogon.exe OR *\\\\winscp.exe OR *\\\\wmic.exe OR *\\\\word.exe OR *\\\\wscript.exe) AND (NOT ((process.executable:*Visual\\ Studio* OR SourceParentImage:*\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\*) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\winlogon.exe AND winlog.event_data.TargetImage:(C\\:\\\\Windows\\\\System32\\\\services.exe OR C\\:\\\\Windows\\\\System32\\\\wininit.exe OR C\\:\\\\Windows\\\\System32\\\\csrss.exe)) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\provtool.exe AND TargetParentProcessId:0) OR (process.executable:*\\\\git.exe AND winlog.event_data.TargetImage:(*\\\\git.exe OR *C\\:\\\\Windows\\\\System32\\\\conhost.exe)) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\VSSVC.exe AND winlog.event_data.TargetImage:System) OR (SourceParentImage:C\\:\\\\Windows\\\\System32\\\\CompatTelRunner.exe) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\schtasks.exe OR C\\:\\\\Windows\\\\SysWOW64\\\\schtasks.exe) AND winlog.event_data.TargetImage:C\\:\\\\Windows\\\\System32\\\\conhost.exe))))`"}
