{"id":"2e4e488a-6164-4811-9ea1-f960c7359c40","created_by":"@SBousseaden (detection), Thomas Patzke (rule)","name":"CACTUSTORCH Remote Thread Creation","tags":["attack.defense_evasion","attack.t1055.012","attack.execution","attack.t1059.005","attack.t1059.007","attack.t1218.005"],"interval":"5m","description":"Detects remote thread creation from CACTUSTORCH as described in references.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(process.executable:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetImage:/.*\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ AND NOT _exists_:winlog.event_data.StartModule)","rule_id":"2e4e488a-6164-4811-9ea1-f960c7359c40","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1090588499517079552","https://github.com/mdsecactivebreach/CACTUSTORCH"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(process.executable:(*\\\\System32\\\\cscript.exe OR *\\\\System32\\\\wscript.exe OR *\\\\System32\\\\mshta.exe OR *\\\\winword.exe OR *\\\\excel.exe) AND winlog.event_data.TargetImage:*\\\\SysWOW64\\\\* AND NOT _exists_:winlog.event_data.StartModule)`"}
