{"id":"c4b890e5-8d8c-4496-8c66-c805753817cd","created_by":"Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Sittikorn S","name":"Sysmon Process Hollowing Detection","tags":["attack.process_injection","attack.t1055.012"],"interval":"5m","description":"Detects when a memory process image does not match the disk image, indicative of process hollowing.","risk_score":73,"enabled":true,"severity":"high","false_positives":["There are no known false positives at this time"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.Type:/[Ii][Mm][Aa][Gg][Ee]\\ [Ii][Ss]\\ [Rr][Ee][Pp][Ll][Aa][Cc][Ee][Dd]/ AND (NOT (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\).*/) AND process.executable:(/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/))))","rule_id":"c4b890e5-8d8c-4496-8c66-c805753817cd","timestamp_override":"event.ingested","references":["https://twitter.com/SecurePeacock/status/1486054048390332423?s=20","https://www.bleepingcomputer.com/news/microsoft/microsoft-sysmon-now-detects-malware-process-tampering-attempts/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.Type:Image\\ is\\ replaced AND (NOT (process.executable:(*\\:\\\\Program\\ Files\\\\* OR *\\:\\\\Program\\ Files\\ \\(x86\\)*) AND process.executable:(*\\\\chrome.exe OR *\\\\opera.exe OR *\\\\firefox.exe OR *\\\\MicrosoftEdge.exe))))`"}
