{"id":"77564cc2-7382-438b-a7f6-395c2ae53b9a","created_by":"Timon Hackenjos","name":"KeePass Password Dumping","tags":["attack.credential_access","attack.t1555.005"],"interval":"5m","description":"Detects remote thread creation in KeePass.exe indicating password dumping activity","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"winlog.event_data.TargetImage:/.*\\\\[Kk][Ee][Ee][Pp][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/","rule_id":"77564cc2-7382-438b-a7f6-395c2ae53b9a","timestamp_override":"event.ingested","references":["https://www.cisa.gov/uscert/ncas/alerts/aa20-259a","https://github.com/denandz/KeeFarce","https://github.com/GhostPack/KeeThief"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`winlog.event_data.TargetImage:*\\\\KeePass.exe`"}
