{"id":"3f07b9d1-2082-4c56-9277-613a621983cc","created_by":"oscd.community, Natalia Shornikova","name":"Accessing WinAPI in PowerShell for Credentials Dumping","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects Accessing to lsass.exe by Powershell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND event.code:(8 OR 10) AND process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/)","rule_id":"3f07b9d1-2082-4c56-9277-613a621983cc","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND event.code:(8 OR 10) AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND winlog.event_data.TargetImage:*\\\\lsass.exe)`"}
