{"id":"f239b326-2f41-4d6b-9dfa-c846a60ef505","created_by":"Thomas Patzke","name":"Password Dumper Remote Thread in LSASS","tags":["attack.credential_access","attack.s0005","attack.t1003.001"],"interval":"5m","description":"Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage. The process in field Process is the malicious program. A single execution can lead to hundreds of events.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Antivirus products"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.event_data.TargetImage:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.StartModule:\"\")","rule_id":"f239b326-2f41-4d6b-9dfa-c846a60ef505","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.StartModule:\"\")`"}
