{"id":"fe21810c-2a8c-478f-8dd3-5a287fb2a0e0","created_by":"Florian Roth, Jonhnathan Ribeiro","name":"Suspicious Scripting in a WMI Consumer","tags":["attack.execution","attack.t1059.005"],"interval":"5m","description":"Detects suspicious commands that are related to scripting/powershell in WMI Event Consumers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate administrative scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((process.executable:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.executable:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND process.executable:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/) OR (process.executable:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND process.executable:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND process.executable:/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/) OR process.executable:(/.*\\ [Ii][Ee][Xx]\\(.*/ OR /.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\ .*/ OR /.*\\ \\-[Dd][Ee][Cc][Oo][Dd][Ee]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc]\\ .*/) OR process.executable:(/.*[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\.[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\.[Ff][Rr][Oo][Mm][Bb][Aa][Ss][Ee]64[Tt][Rr][Aa][Nn][Ss][Ff][Oo][Rr][Mm].*/))","rule_id":"fe21810c-2a8c-478f-8dd3-5a287fb2a0e0","timestamp_override":"event.ingested","references":["https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/","https://github.com/Neo23x0/signature-base/blob/615bf1f6bac3c1bdc417025c40c073e6c2771a76/yara/gen_susp_lnk_files.yar#L19","https://github.com/RiccardoAncarani/LiquidSnake"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((process.executable:*new\\-object* AND process.executable:*net.webclient* AND process.executable:*.downloadstring*) OR (process.executable:*new\\-object* AND process.executable:*net.webclient* AND process.executable:*.downloadfile*) OR process.executable:(*\\ iex\\(* OR *WScript.shell* OR *\\ \\-nop\\ * OR *\\ \\-noprofile\\ * OR *\\ \\-decode\\ * OR *\\ \\-enc\\ *) OR process.executable:(*WScript.Shell* OR *System.Security.Cryptography.FromBase64Transform*))`"}
