{"id":"db809f10-56ce-4420-8c86-d6a7d793c79c","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Raw Disk Access Using Illegitimate Tools","tags":["attack.defense_evasion","attack.t1006"],"interval":"5m","description":"Raw disk access using illegitimate tools, possible defence evasion","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate Administrator using tool for raw access or ongoing forensic investigation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(NOT ((file.path:/.*[Ff][Ll][Oo][Pp][Pp][Yy].*/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Aa][Pp][Pp][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ii][Nn][Gg]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Cc][Mm]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Uu][Uu][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/)) OR (process.pid:4) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Uu][Uu][Ss]\\\\[Aa][Mm][Dd]64\\\\[Mm][Oo][Uu][Ss][Oo][Cc][Oo][Rr][Ee][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Ss][Yy][Ss][Tt][Ee][Mm]/ OR /[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]/)) OR (process.executable:/.*\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\\\[Uu][Pp][Dd]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)) OR (process.executable:/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\.*/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND process.executable:/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Ss][Tt][Aa][Rr][Tt][Mm][Ee][Nn][Uu][Ee][Xx][Pp][Ee][Rr][Ii][Ee][Nn][Cc][Ee][Hh][Oo][Ss][Tt].*/ AND process.executable:/.*\\\\[Ss][Tt][Aa][Rr][Tt][Mm][Ee][Nn][Uu][Ee][Xx][Pp][Ee][Rr][Ii][Ee][Nn][Cc][Ee][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)))","rule_id":"db809f10-56ce-4420-8c86-d6a7d793c79c","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(NOT ((file.path:*floppy*) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SystemApps\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\servicing\\\\* OR C\\:\\\\Windows\\\\CCM\\\\* OR C\\:\\\\Windows\\\\uus\\\\* OR C\\:\\\\Windows\\\\WinSxs\\\\*)) OR (process.pid:4) OR (process.executable:(C\\:\\\\Windows\\\\UUS\\\\amd64\\\\MoUsoCoreWorker.exe OR C\\:\\\\Windows\\\\explorer.exe)) OR (process.executable:(System OR Registry)) OR (process.executable:*\\\\Keybase\\\\upd.exe) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable:*C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\* AND process.executable:*\\\\Microsoft\\\\*) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:*\\\\thor.exe) OR (process.executable:C\\:\\\\Windows\\\\SystemApps\\\\Microsoft.Windows.StartMenuExperienceHost* AND process.executable:*\\\\StartMenuExperienceHost.exe)))`"}
