{"id":"8ac03a65-6c84-4116-acad-dc1558ff7a77","created_by":"frack113","name":"Sysmon Configuration Change","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects a Sysmon configuration change, which could be the result of a legitimate reconfiguration or someone trying manipulate the configuration","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative action"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND event.code:16)","rule_id":"8ac03a65-6c84-4116-acad-dc1558ff7a77","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Sysmon\\/Operational AND event.code:16)`"}
