{"id":"7dbb86de-a0cc-494c-8aa8-b2996c9ef3c8","created_by":"Florian Roth","name":"LPE InstallerFileTakeOver PoC CVE-2021-41379","tags":["attack.initial_access","attack.t1190"],"interval":"5m","description":"Detects PoC tool used to exploit LPE vulnerability CVE-2021-41379","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other MSI packages for which your admins have used that name"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND event.code:1033 AND winlog.provider_name:/[Mm][Ss][Ii][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]/ AND Data:/.*[Tt][Ee][Ss][Tt]\\ [Pp][Kk][Gg].*/)","rule_id":"7dbb86de-a0cc-494c-8aa8-b2996c9ef3c8","timestamp_override":"event.ingested","references":["https://github.com/klinix5/InstallerFileTakeOver"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND event.code:1033 AND winlog.provider_name:MsiInstaller AND Data:*test\\ pkg*)`"}
