{"id":"401e5d00-b944-11ea-8f9a-00163ecd60ae","created_by":"Pushkarev Dmitry","name":"File Was Not Allowed To Run","tags":["attack.execution","attack.t1204.002","attack.t1059.001","attack.t1059.003","attack.t1059.005","attack.t1059.006","attack.t1059.007"],"interval":"5m","description":"Detect run not allowed files. Applocker is a very useful tool, especially on servers where unprivileged users have access. For example terminal servers. You need configure applocker and log collect to receive these events.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Need tuning applocker or add exceptions in SIEM"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:(Microsoft\\-Windows\\-AppLocker\\/MSI\\ and\\ Script OR Microsoft\\-Windows\\-AppLocker\\/EXE\\ and\\ DLL OR Microsoft\\-Windows\\-AppLocker\\/Packaged\\ app\\-Deployment OR Microsoft\\-Windows\\-AppLocker\\/Packaged\\ app\\-Execution) AND event.code:(8004 OR 8007 OR 8022 OR 8025))","rule_id":"401e5d00-b944-11ea-8f9a-00163ecd60ae","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/applocker/what-is-applocker","https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/applocker/using-event-viewer-with-applocker","https://nxlog.co/documentation/nxlog-user-guide/applocker.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:(Microsoft\\-Windows\\-AppLocker\\/MSI\\ and\\ Script OR Microsoft\\-Windows\\-AppLocker\\/EXE\\ and\\ DLL OR Microsoft\\-Windows\\-AppLocker\\/Packaged\\ app\\-Deployment OR Microsoft\\-Windows\\-AppLocker\\/Packaged\\ app\\-Execution) AND event.code:(8004 OR 8007 OR 8022 OR 8025))`"}
