{"id":"487c7524-f892-4054-b263-8a0ace63fc25","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Stdin","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via Stdin in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:/(?i).*(set).*&&\\s?set.*(environment|invoke|\\${?input).*&&.*\"/)","rule_id":"487c7524-f892-4054-b263-8a0ace63fc25","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:/(?i).*(set).*&&\\s?set.*(environment|invoke|\\${?input).*&&.*\"/)`"}
