{"id":"f6de9536-0441-4b3f-a646-f4e00f300ffd","created_by":"@neu5ron","name":"Weak Encryption Enabled and Kerberoast","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects scenario where weak encryption is enabled for a user profile which could be used for hash/password cracking.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4738 AND (((winlog.event_data.NewUacValue:(/.*8\\?\\?\\?/ OR /.*9\\?\\?\\?/ OR /.*[Aa]\\?\\?\\?/ OR /.*[Bb]\\?\\?\\?/ OR /.*[Cc]\\?\\?\\?/ OR /.*[Dd]\\?\\?\\?/ OR /.*[Ee]\\?\\?\\?/ OR /.*[Ff]\\?\\?\\?/) AND (NOT (winlog.event_data.OldUacValue:(/.*8\\?\\?\\?/ OR /.*9\\?\\?\\?/ OR /.*[Aa]\\?\\?\\?/ OR /.*[Bb]\\?\\?\\?/ OR /.*[Cc]\\?\\?\\?/ OR /.*[Dd]\\?\\?\\?/ OR /.*[Ee]\\?\\?\\?/ OR /.*[Ff]\\?\\?\\?/)))) OR (winlog.event_data.NewUacValue:(/.*1\\?\\?\\?\\?/ OR /.*3\\?\\?\\?\\?/ OR /.*5\\?\\?\\?\\?/ OR /.*7\\?\\?\\?\\?/ OR /.*9\\?\\?\\?\\?/ OR /.*[Bb]\\?\\?\\?\\?/ OR /.*[Dd]\\?\\?\\?\\?/ OR /.*[Ff]\\?\\?\\?\\?/) AND (NOT (winlog.event_data.OldUacValue:(/.*1\\?\\?\\?\\?/ OR /.*3\\?\\?\\?\\?/ OR /.*5\\?\\?\\?\\?/ OR /.*7\\?\\?\\?\\?/ OR /.*9\\?\\?\\?\\?/ OR /.*[Bb]\\?\\?\\?\\?/ OR /.*[Dd]\\?\\?\\?\\?/ OR /.*[Ff]\\?\\?\\?\\?/))))) OR (winlog.event_data.NewUacValue:(/.*8\\?\\?/ OR /.*9\\?\\?/ OR /.*[Aa]\\?\\?/ OR /.*[Bb]\\?\\?/ OR /.*[Cc]\\?\\?/ OR /.*[Dd]\\?\\?/ OR /.*[Ee]\\?\\?/ OR /.*[Ff]\\?\\?/) AND (NOT (winlog.event_data.OldUacValue:(/.*8\\?\\?/ OR /.*9\\?\\?/ OR /.*[Aa]\\?\\?/ OR /.*[Bb]\\?\\?/ OR /.*[Cc]\\?\\?/ OR /.*[Dd]\\?\\?/ OR /.*[Ee]\\?\\?/ OR /.*[Ff]\\?\\?/))))))","rule_id":"f6de9536-0441-4b3f-a646-f4e00f300ffd","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=2053","https://www.harmj0y.net/blog/activedirectory/roasting-as-reps/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4738 AND (((winlog.event_data.NewUacValue:(*8??? OR *9??? OR *A??? OR *B??? OR *C??? OR *D??? OR *E??? OR *F???) AND (NOT (winlog.event_data.OldUacValue:(*8??? OR *9??? OR *A??? OR *B??? OR *C??? OR *D??? OR *E??? OR *F???)))) OR (winlog.event_data.NewUacValue:(*1???? OR *3???? OR *5???? OR *7???? OR *9???? OR *B???? OR *D???? OR *F????) AND (NOT (winlog.event_data.OldUacValue:(*1???? OR *3???? OR *5???? OR *7???? OR *9???? OR *B???? OR *D???? OR *F????))))) OR (winlog.event_data.NewUacValue:(*8?? OR *9?? OR *A?? OR *B?? OR *C?? OR *D?? OR *E?? OR *F??) AND (NOT (winlog.event_data.OldUacValue:(*8?? OR *9?? OR *A?? OR *B?? OR *C?? OR *D?? OR *E?? OR *F??))))))`"}
