{"id":"a0cb7110-edf0-47a4-9177-541a4083128a","created_by":"NVISO","name":"Vulnerable Netlogon Secure Channel Connection Allowed","tags":["attack.privilege_escalation","attack.t1548"],"interval":"5m","description":"Detects that a vulnerable Netlogon secure channel connection was allowed, which could be an indicator of CVE-2020-1472.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Nn][Ee][Tt][Ll][Oo][Gg][Oo][Nn]/ AND event.code:5829)","rule_id":"a0cb7110-edf0-47a4-9177-541a4083128a","timestamp_override":"event.ingested","references":["https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:NetLogon AND event.code:5829)`"}
