{"id":"aaa5b30d-f418-420b-83a0-299cb6024885","created_by":"Lionel PRAT, Christophe BROCAS, @atc_project (improvements)","name":"Potential RDP Exploit CVE-2019-0708","tags":["attack.lateral_movement","attack.t1210","car.2013-07-002"],"interval":"5m","description":"Detect suspicious error on protocol RDP, potential CVE-2019-0708","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Bad connections or network interruptions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:(56 OR 50) AND winlog.provider_name:/[Tt][Ee][Rr][Mm][Dd][Dd]/)","rule_id":"aaa5b30d-f418-420b-83a0-299cb6024885","timestamp_override":"event.ingested","references":["https://github.com/zerosum0x0/CVE-2019-0708","https://github.com/Ekultek/BlueKeep"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:(56 OR 50) AND winlog.provider_name:TermDD)`"}
