{"id":"b55d23e5-6821-44ff-8a6e-67218891e49f","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"HybridConnectionManager Service Running","tags":["attack.persistence","attack.t1554"],"interval":"5m","description":"Rule to detect the Hybrid Connection Manager service running on an endpoint.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of Hybrid Connection Manager via Azure function apps."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-ServiceBus\\-Client AND event.code:(40300 OR 40301 OR 40302) AND \\*.keyword:(/.*[Hh][Yy][Bb][Rr][Ii][Dd][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Ss][Bb]\\:\\/\\/.*/ OR /.*[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Bb][Uu][Ss]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\.[Nn][Ee][Tt].*/ OR /.*[Hh][Yy][Bb][Rr][Ii][Dd][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ii][Oo][Nn][Mm][Aa][Nn][Aa][Gg][Ee].*/))","rule_id":"b55d23e5-6821-44ff-8a6e-67218891e49f","timestamp_override":"event.ingested","references":["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-ServiceBus\\-Client AND event.code:(40300 OR 40301 OR 40302) AND \\*.keyword:(*HybridConnection* OR *sb\\:\\/\\/* OR *servicebus.windows.net* OR *HybridConnectionManage*))`"}
