{"id":"910ab938-668b-401b-b08c-b596e80fdca5","created_by":"Teymur Kheirkhabarov, oscd.community","name":"Transferring Files with Credential Data via Network Shares","tags":["attack.credential_access","attack.t1003.002","attack.t1003.001","attack.t1003.003"],"interval":"5m","description":"Transferring files with well-known filenames (sensitive files with credential data) using network shares","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Transferring sensitive files for legitimate administration work by legitimate administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:5145 AND winlog.event_data.RelativeTargetName:(/.*\\\\[Mm][Ii][Mm][Ii][Dd][Rr][Vv].*/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Nn][Ii][Dd][Uu][Mm][Pp]\\\\.*/ OR /.*\\\\[Hh][Ii][Bb][Ee][Rr][Ff][Ii][Ll].*/ OR /.*\\\\[Ss][Qq][Ll][Dd][Mm][Pp][Rr].*/ OR /.*\\\\[Ss][Aa][Mm].*/ OR /.*\\\\[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy].*/))","rule_id":"910ab938-668b-401b-b08c-b596e80fdca5","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:5145 AND winlog.event_data.RelativeTargetName:(*\\\\mimidrv* OR *\\\\lsass* OR *\\\\windows\\\\minidump\\\\* OR *\\\\hiberfil* OR *\\\\sqldmpr* OR *\\\\sam* OR *\\\\ntds.dit* OR *\\\\security*))`"}
