{"id":"39a80702-d7ca-4a83-b776-525b1f86a36d","created_by":"Thomas Patzke","name":"Secure Deletion with SDelete","tags":["attack.impact","attack.defense_evasion","attack.t1070.004","attack.t1027.005","attack.t1485","attack.t1553.002","attack.s0195"],"interval":"5m","description":"Detects renaming of file while deletion with SDelete tool.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of SDelete"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4656 OR 4663 OR 4658) AND winlog.event_data.ObjectName:(/.*\\.[Aa][Aa][Aa]/ OR /.*\\.[Zz][Zz][Zz]/))","rule_id":"39a80702-d7ca-4a83-b776-525b1f86a36d","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/sdelete.htm","https://www.jpcert.or.jp/english/pub/sr/ir_research.html","https://docs.microsoft.com/en-gb/sysinternals/downloads/sdelete"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4656 OR 4663 OR 4658) AND winlog.event_data.ObjectName:(*.AAA OR *.ZZZ))`"}
