{"id":"f63508a0-c809-4435-b3be-ed819394d612","created_by":"xknow (@xknow_infosec), xorxes (@xor_xes)","name":"Suspicious Driver Loaded By User","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the loading of drivers via 'SeLoadDriverPrivilege' required to load or unload a device driver. With this privilege, the user can dynamically load and unload device drivers or other code in to kernel mode. This user right does not apply to Plug and Play device drivers. If you exclude privileged users/admins and processes, which are allowed to do so, you are maybe left with bad programs trying to load malicious kernel drivers. This will detect Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs) and the usage of Sysinternals and various other tools. So you have to work with a whitelist to find the bad stuff.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other legimate tools loading drivers. There are some: Sysinternals, CPU-Z, AVs etc. - but not much. You have to baseline this according to your used products and allowed tools. Also try to exclude users, which are allowed to load drivers."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:4673 AND winlog.event_data.PrivilegeList:/[Ss][Ee][Ll][Oo][Aa][Dd][Dd][Rr][Ii][Vv][Ee][Rr][Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee]/ AND winlog.event_data.Service:\\-) AND (NOT (process.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ff][Ll][Tt][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Hh][Ee][Ll][Pp][Pp][Aa][Nn][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Mm][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Mm][Ss][Ee][Rr][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/))))","rule_id":"f63508a0-c809-4435-b3be-ed819394d612","timestamp_override":"event.ingested","references":["https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/","https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4673"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:4673 AND winlog.event_data.PrivilegeList:SeLoadDriverPrivilege AND winlog.event_data.Service:\\-) AND (NOT (process.executable:(*\\\\Windows\\\\System32\\\\Dism.exe OR *\\\\Windows\\\\System32\\\\rundll32.exe OR *\\\\Windows\\\\System32\\\\fltMC.exe OR *\\\\Windows\\\\HelpPane.exe OR *\\\\Windows\\\\System32\\\\mmc.exe OR *\\\\Windows\\\\System32\\\\svchost.exe OR *\\\\Windows\\\\System32\\\\wimserv.exe OR *\\\\procexp64.exe OR *\\\\procexp.exe OR *\\\\procmon64.exe OR *\\\\procmon.exe OR *\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe))))`"}
