{"id":"6c82cf5c-090d-4d57-9188-533577631108","created_by":"Florian Roth","name":"Microsoft Malware Protection Engine Crash","tags":["attack.defense_evasion","attack.t1211","attack.t1562.001"],"interval":"5m","description":"This rule detects a suspicious crash of the Microsoft Malware Protection Engine","risk_score":73,"enabled":true,"severity":"high","false_positives":["MsMpEng.exe can crash when C:\\ is full"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND ((winlog.provider_name:/[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\ [Ee][Rr][Rr][Oo][Rr]/ AND event.code:1000) OR (winlog.provider_name:/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Ee][Rr][Rr][Oo][Rr]\\ [Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]/ AND event.code:1001)) AND (Data:/.*[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee].*/ AND Data:/.*[Mm][Pp][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Dd][Ll][Ll].*/))","rule_id":"6c82cf5c-090d-4d57-9188-533577631108","timestamp_override":"event.ingested","references":["https://bugs.chromium.org/p/project-zero/issues/detail?id=1252&desc=5","https://technet.microsoft.com/en-us/library/security/4022344"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND ((winlog.provider_name:Application\\ Error AND event.code:1000) OR (winlog.provider_name:Windows\\ Error\\ Reporting AND event.code:1001)) AND (Data:*MsMpEng.exe* AND Data:*mpengine.dll*))`"}
