{"id":"72124974-a68b-4366-b990-d30e0b2a190d","created_by":"Chakib Gzenayi (@Chak092), Hosni Mribah","name":"Metasploit SMB Authentication","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Alerts on Metasploit host's authentications on the domain.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Linux hostnames composed of 16 characters."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:(4625 OR 4624) AND winlog.event_data.LogonType:3 AND winlog.event_data.AuthenticationPackageName:/[Nn][Tt][Ll][Mm]/ AND source.domain:/[A-Za-z0-9]{16}/) OR (NOT _exists_:process.executable AND event.code:4776 AND winlog.event_data.Workstation:/[A-Za-z0-9]{16}/)))","rule_id":"72124974-a68b-4366-b990-d30e0b2a190d","timestamp_override":"event.ingested","references":["https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/lib/rex/proto/smb/client.rb"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:(4625 OR 4624) AND winlog.event_data.LogonType:3 AND winlog.event_data.AuthenticationPackageName:NTLM AND source.domain:/[A-Za-z0-9]{16}/) OR (NOT _exists_:process.executable AND event.code:4776 AND winlog.event_data.Workstation:/[A-Za-z0-9]{16}/)))`"}
