{"id":"098d7118-55bc-4912-a836-dc6483a8d150","created_by":"Florian Roth","name":"Access to ADMIN$ Share","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Detects access to $ADMIN share","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5140 AND winlog.event_data.ShareName:/[Aa][Dd][Mm][Ii][Nn]$/) AND (NOT (user.name:/.*$/)))","rule_id":"098d7118-55bc-4912-a836-dc6483a8d150","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5140 AND winlog.event_data.ShareName:Admin$) AND (NOT (user.name:*$)))`"}
