{"id":"1321dc4e-a1fe-481d-a016-52c45f0c8b4f","created_by":"Christian Burkard","name":"Windows Defender Exclusions Added","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the Setting of Windows Defender Exclusions","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:5007 AND winlog.event_data.NewValue:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ss].*/)","rule_id":"1321dc4e-a1fe-481d-a016-52c45f0c8b4f","timestamp_override":"event.ingested","references":["https://twitter.com/_nullbind/status/1204923340810543109"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:5007 AND winlog.event_data.NewValue:*\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions*)`"}
