{"id":"7ec15688-fd24-4177-ba43-1a950537ee39","created_by":"frack113","name":"Failed to Load Policy in Windows Firewall with Advanced Security","tags":null,"interval":"5m","description":"The Windows Firewall service failed to load Group Policy.","risk_score":21,"enabled":true,"severity":"low","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:2009)","rule_id":"7ec15688-fd24-4177-ba43-1a950537ee39","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:2009)`"}
