{"id":"51e33403-2a37-4d66-a574-1fda1782cc31","created_by":"Thomas Patzke","name":"RDP Login from Localhost","tags":["attack.lateral_movement","car.2013-07-002","attack.t1021.001"],"interval":"5m","description":"RDP login with localhost source address may be a tunnelled login","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:10 AND source.ip:(\\:\\:1 OR 127.0.0.1))","rule_id":"51e33403-2a37-4d66-a574-1fda1782cc31","timestamp_override":"event.ingested","references":["https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:10 AND source.ip:(\\:\\:1 OR 127.0.0.1))`"}
