{"id":"39f919f3-980b-4e6f-a975-8af7e507ef2b","created_by":"Florian Roth","name":"QuarksPwDump Clearing Access History","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects QuarksPwDump clearing access history in hive","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:16 AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Nn][Ee][Ll]\\-[Gg][Ee][Nn][Ee][Rr][Aa][Ll]/ AND winlog.event_data.HiveName:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Aa][Mm].*/ AND winlog.event_data.HiveName:/.*\\.[Dd][Mm][Pp]/)","rule_id":"39f919f3-980b-4e6f-a975-8af7e507ef2b","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:16 AND winlog.provider_name:Microsoft\\-Windows\\-Kernel\\-General AND winlog.event_data.HiveName:*\\\\AppData\\\\Local\\\\Temp\\\\SAM* AND winlog.event_data.HiveName:*.dmp)`"}
