{"id":"0f63e1ef-1eb9-4226-9d54-8927ca08520a","created_by":"juju4","name":"Admin User Remote Logon","tags":["attack.lateral_movement","attack.t1078.001","attack.t1078.002","attack.t1078.003","car.2016-04-005"],"interval":"5m","description":"Detect remote login by Administrator user (depending on internal pattern).","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrative activity."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:10 AND winlog.event_data.AuthenticationPackageName:/[Nn][Ee][Gg][Oo][Tt][Ii][Aa][Tt][Ee]/ AND winlog.event_data.TargetUserName:/[Aa][Dd][Mm][Ii][Nn].*/)","rule_id":"0f63e1ef-1eb9-4226-9d54-8927ca08520a","timestamp_override":"event.ingested","references":["https://car.mitre.org/wiki/CAR-2016-04-005"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:10 AND winlog.event_data.AuthenticationPackageName:Negotiate AND winlog.event_data.TargetUserName:Admin*)`"}
