{"id":"eca91c7c-9214-47b9-b4c5-cb1d7e4f2350","created_by":"Ilyas Ochkov, oscd.community","name":"Suspicious Outbound Kerberos Connection","tags":["attack.lateral_movement","attack.t1558.003"],"interval":"5m","description":"Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Other browsers"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5156 AND destination.port:88) AND (NOT (process.executable:(/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/))))","rule_id":"eca91c7c-9214-47b9-b4c5-cb1d7e4f2350","timestamp_override":"event.ingested","references":["https://github.com/GhostPack/Rubeus"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5156 AND destination.port:88) AND (NOT (process.executable:(*\\\\lsass.exe OR *\\\\opera.exe OR *\\\\chrome.exe OR *\\\\firefox.exe))))`"}
