{"id":"8289bf8c-4aca-4f5a-9db3-dc3d7afe5c10","created_by":"Nasreddine Bencherchali","name":"Unsigned Binary Loaded From Suspicious Location","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects Code Integrity (CI) engine blocking processes from loading unsigned DLLs residing in suspicious locations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(event.code:(11 OR 12) AND ImageName:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/))","rule_id":"8289bf8c-4aca-4f5a-9db3-dc3d7afe5c10","timestamp_override":"event.ingested","references":["https://github.com/nasbench/EVTX-ETW-Resources/blob/45fd5be71a51aa518b1b36d4e1f36af498084e27/ETWEventsList/CSV/Windows11/21H2/W11_21H2_Pro_20220719_22000.795/Providers/Microsoft-Windows-Security-Mitigations.csv"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(event.code:(11 OR 12) AND ImageName:(*\\\\Users\\\\Public\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\*))`"}
