{"id":"5af54681-df95-4c26-854f-2565e13cfab0","created_by":"Thomas Patzke","name":"Login with WMI","tags":["attack.execution","attack.t1047"],"interval":"5m","description":"Detection of logins performed with WMI","risk_score":21,"enabled":true,"severity":"low","false_positives":["Monitoring tools","Legitimate system administration"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND process.executable:/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/)","rule_id":"5af54681-df95-4c26-854f-2565e13cfab0","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND process.executable:*\\\\WmiPrvSE.exe)`"}
