{"id":"0248a7bc-8a9a-4cd8-a57e-3ae8e073a073","created_by":"Syed Hasan (@syedhasan009)","name":"ISO Image Mount","tags":["attack.initial_access","attack.t1566.001"],"interval":"5m","description":"Detects the mount of ISO images on an endpoint","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Software installation ISO files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4663 AND winlog.event_data.ObjectServer:/[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]/ AND winlog.event_data.ObjectType:/[Ff][Ii][Ll][Ee]/ AND winlog.event_data.ObjectName:/\\\\[Dd][Ee][Vv][Ii][Cc][Ee]\\\\[Cc][Dd][Rr][Oo][Mm].*/) AND (NOT (winlog.event_data.ObjectName:/\\\\[Dd][Ee][Vv][Ii][Cc][Ee]\\\\[Cc][Dd][Rr][Oo][Mm]0\\\\[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/)))","rule_id":"0248a7bc-8a9a-4cd8-a57e-3ae8e073a073","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore","https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages","https://twitter.com/MsftSecIntel/status/1257324139515269121"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4663 AND winlog.event_data.ObjectServer:Security AND winlog.event_data.ObjectType:File AND winlog.event_data.ObjectName:\\\\Device\\\\CdRom*) AND (NOT (winlog.event_data.ObjectName:\\\\Device\\\\CdRom0\\\\setup.exe)))`"}
