{"id":"2a926e6a-4b81-4011-8a96-e36cc8c04302","created_by":"oscd.community, Natalia Shornikova","name":"PowerShell Scripts Installed as Services","tags":["attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects powershell script installed as a Service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/))","rule_id":"2a926e6a-4b81-4011-8a96-e36cc8c04302","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:(*powershell* OR *pwsh*))`"}
