{"id":"17d619c1-e020-4347-957e-1d1207455c93","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Active Directory Replication from Non Machine Account","tags":["attack.credential_access","attack.t1003.006"],"interval":"5m","description":"Detects potential abuse of Active Directory Replication Service (ADRS) from a non machine account to request credentials.","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.AccessMask:/0[Xx]100/ AND winlog.event_data.Properties:(/.*1131[Ff]6[Aa][Aa]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*1131[Ff]6[Aa][Dd]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*89[Ee]95[Bb]76\\-444[Dd]\\-4[Cc]62\\-991[Aa]\\-0[Ff][Aa][Cc][Bb][Ee][Dd][Aa]640[Cc].*/)) AND (NOT (user.name:/.*$/ OR user.name:/[Mm][Ss][Oo][Ll]_.*/)))","rule_id":"17d619c1-e020-4347-957e-1d1207455c93","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-180815210510.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.AccessMask:0x100 AND winlog.event_data.Properties:(*1131f6aa\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *1131f6ad\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *89e95b76\\-444d\\-4c62\\-991a\\-0facbeda640c*)) AND (NOT (user.name:*$ OR user.name:MSOL_*)))`"}
