{"id":"8e4cf0e5-aa5d-4dc3-beff-dc26917744a9","created_by":"Daniil Yugoslavskiy, Ian Davis, oscd.community","name":"Tap Driver Installation","tags":["attack.exfiltration","attack.t1048"],"interval":"5m","description":"Well-known TAP software installation. Possible preparation for data exfiltration using tunnelling techniques","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate OpenVPN TAP insntallation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:/.*[Tt][Aa][Pp]0901.*/)","rule_id":"8e4cf0e5-aa5d-4dc3-beff-dc26917744a9","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:*tap0901*)`"}
