{"id":"87261fb2-69d0-42fe-b9de-88c6b5f65a43","created_by":"Bhabesh Raj","name":"Atera Agent Installation","tags":["attack.t1219"],"interval":"5m","description":"Detects successful installation of Atera Remote Monitoring & Management (RMM) agent as recently found to be used by Conti operators","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Atera agent installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND event.code:1033 AND winlog.provider_name:/[Mm][Ss][Ii][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]/ AND Message:/.*[Aa][Tt][Ee][Rr][Aa][Aa][Gg][Ee][Nn][Tt].*/)","rule_id":"87261fb2-69d0-42fe-b9de-88c6b5f65a43","timestamp_override":"event.ingested","references":["https://www.advintel.io/post/secret-backdoor-behind-conti-ransomware-operation-introducing-atera-agent"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND event.code:1033 AND winlog.provider_name:MsiInstaller AND Message:*AteraAgent*)`"}
