{"id":"8400629e-79a9-4737-b387-5db940ab2367","created_by":"Florian Roth (rule), Adam Bradbury (idea)","name":"Scanner PoC for CVE-2019-0708 RDP RCE Vuln","tags":["attack.lateral_movement","attack.t1210","car.2013-07-002"],"interval":"5m","description":"Detects the use of a scanner by zerosum0x0 that discovers targets vulnerable to  CVE-2019-0708 RDP RCE aka BlueKeep","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4625 AND winlog.event_data.TargetUserName:/[Aa][Aa][Aa][Aa][Aa][Aa][Aa]/)","rule_id":"8400629e-79a9-4737-b387-5db940ab2367","timestamp_override":"event.ingested","references":["https://twitter.com/AdamTheAnalyst/status/1134394070045003776","https://github.com/zerosum0x0/CVE-2019-0708"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4625 AND winlog.event_data.TargetUserName:AAAAAAA)`"}
