{"id":"0c718a5e-4284-4fb9-b4d9-b9a50b3a1974","created_by":"Jonathan Cheong, oscd.community","name":"Invoke-Obfuscation STDIN+ Launcher","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated use of stdin to execute PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*[Cc][Mm][Dd].*/ AND winlog.event_data.ServiceFileName:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ AND winlog.event_data.ServiceFileName:(/.*$\\{[Ii][Nn][Pp][Uu][Tt]\\}.*/ OR /.*[Nn][Oo][Ee][Xx][Ii][Tt].*/) AND winlog.event_data.ServiceFileName:(/.*\\ \\/[Cc]\\ .*/ OR /.*\\ \\/[Rr]\\ .*/))","rule_id":"0c718a5e-4284-4fb9-b4d9-b9a50b3a1974","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:*cmd* AND winlog.event_data.ServiceFileName:*powershell* AND winlog.event_data.ServiceFileName:(*$\\{input\\}* OR *noexit*) AND winlog.event_data.ServiceFileName:(*\\ \\/c\\ * OR *\\ \\/r\\ *))`"}
