{"id":"d3abac66-f11c-4ed0-8acb-50cc29c97eed","created_by":"Florian Roth, wagga","name":"NetNTLM Downgrade Attack","tags":["attack.defense_evasion","attack.t1562.001","attack.t1112"],"interval":"5m","description":"Detects NetNTLM downgrade attack","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4657 AND winlog.event_data.ObjectName:/.*\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Yy][Ss][Tt][Ee][Mm].*/ AND winlog.event_data.ObjectName:/.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt].*/ AND winlog.event_data.ObjectName:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ll][Ss][Aa].*/ AND winlog.event_data.ObjectValueName:(/[Ll][Mm][Cc][Oo][Mm][Pp][Aa][Tt][Ii][Bb][Ii][Ll][Ii][Tt][Yy][Ll][Ee][Vv][Ee][Ll]/ OR /[Nn][Tt][Ll][Mm][Mm][Ii][Nn][Cc][Ll][Ii][Ee][Nn][Tt][Ss][Ee][Cc]/ OR /[Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ss][Ee][Nn][Dd][Ii][Nn][Gg][Nn][Tt][Ll][Mm][Tt][Rr][Aa][Ff][Ff][Ii][Cc]/))","rule_id":"d3abac66-f11c-4ed0-8acb-50cc29c97eed","timestamp_override":"event.ingested","references":["https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4657 AND winlog.event_data.ObjectName:*\\\\REGISTRY\\\\MACHINE\\\\SYSTEM* AND winlog.event_data.ObjectName:*ControlSet* AND winlog.event_data.ObjectName:*\\\\Control\\\\Lsa* AND winlog.event_data.ObjectValueName:(LmCompatibilityLevel OR NtlmMinClientSec OR RestrictSendingNTLMTraffic))`"}
