{"id":"9e987c6c-4c1e-40d8-bd85-dd26fba8fdd6","created_by":"Florian Roth","name":"StoneDrill Service Install","tags":["attack.persistence","attack.g0064","attack.t1543.003"],"interval":"5m","description":"This method detects a service install of the malicious Microsoft Network Realtime Inspection Service service described in StoneDrill report by Kaspersky","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Nn][Tt][Ss][Ss][Rr][Vv]/ AND winlog.event_data.ImagePath:/.*\\ [Ll][Oo][Cc][Aa][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee]/)","rule_id":"9e987c6c-4c1e-40d8-bd85-dd26fba8fdd6","timestamp_override":"event.ingested","references":["https://securelist.com/blog/research/77725/from-shamoon-to-stonedrill/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:NtsSrv AND winlog.event_data.ImagePath:*\\ LocalService)`"}
