{"id":"a2e5019d-a658-4c6a-92bf-7197b54e2cae","created_by":"oscd.community, Natalia Shornikova","name":"PowerShell Scripts Installed as Services","tags":["attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects powershell script installed as a Service","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:(/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Pp][Ww][Ss][Hh].*/))","rule_id":"a2e5019d-a658-4c6a-92bf-7197b54e2cae","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:(*powershell* OR *pwsh*))`"}
