{"id":"2111118f-7e46-4fc8-974a-59fd8ec95196","created_by":"Nasreddine Bencherchali","name":"DiagTrackEoP Default Login Username","tags":["attack.privilege_escalation"],"interval":"5m","description":"Detects the default \"UserName\" used by the DiagTrackEoP POC","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:9 AND winlog.event_data.TargetOutboundUserName:/[Tt][Hh][Ii][Ss][Ii][Ss][Nn][Oo][Tt][Vv][Aa][Ll][Ii][Dd][Uu][Ss][Ee][Rr]/)","rule_id":"2111118f-7e46-4fc8-974a-59fd8ec95196","timestamp_override":"event.ingested","references":["https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L46"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:9 AND winlog.event_data.TargetOutboundUserName:thisisnotvaliduser)`"}
