{"id":"6c0a7755-6d31-44fa-80e1-133e57752680","created_by":"Ján Trenčanský, frack113","name":"Windows Defender Threat Detection Disabled - Service","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects the \"Windows Defender Threat Protection\" service has been disabled","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator actions","Auto updates of Windows Defender causes restarts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:7036 AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND param1:(/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]/ OR /[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]/) AND param2:/[Ss][Tt][Oo][Pp][Pp][Ee][Dd]/)","rule_id":"6c0a7755-6d31-44fa-80e1-133e57752680","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:7036 AND winlog.provider_name:Service\\ Control\\ Manager AND param1:(Windows\\ Defender\\ Antivirus\\ Service OR Service\\ antivirus\\ Microsoft\\ Defender) AND param2:stopped)`"}
