{"id":"252902e3-5830-4cf6-bf21-c22083dfd5cf","created_by":"Samir Bousseaden, wagga","name":"Possible Impacket SecretDump Remote Activity","tags":["attack.credential_access","attack.t1003.002","attack.t1003.004","attack.t1003.003"],"interval":"5m","description":"Detect AD credential dumping using impacket secretdump HKTL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:/\\\\\\\\\\*\\\\[Aa][Dd][Mm][Ii][Nn]$/ AND winlog.event_data.RelativeTargetName:/.*[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ AND winlog.event_data.RelativeTargetName:/.*\\.[Tt][Mm][Pp].*/)","rule_id":"252902e3-5830-4cf6-bf21-c22083dfd5cf","timestamp_override":"event.ingested","references":["https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\ADMIN$ AND winlog.event_data.RelativeTargetName:*SYSTEM32\\\\* AND winlog.event_data.RelativeTargetName:*.tmp*)`"}
