{"id":"13addce7-47b2-4ca0-a98f-1de964d1d669","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"SCM Database Handle Failure","tags":["attack.discovery","attack.t1010"],"interval":"5m","description":"Detects non-system users failing to get a handle of the SCM database.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4656 AND winlog.event_data.ObjectType:/[Ss][Cc]_[Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt]/ AND winlog.event_data.ObjectName:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Aa][Cc][Tt][Ii][Vv][Ee]/ AND winlog.event_data.AccessMask:/0[Xx][Ff]003[Ff]/) AND (NOT (winlog.logon.id:/0[Xx]3[Ee]4/)))","rule_id":"13addce7-47b2-4ca0-a98f-1de964d1d669","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190826010110.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4656 AND winlog.event_data.ObjectType:SC_MANAGER\\ OBJECT AND winlog.event_data.ObjectName:ServicesActive AND winlog.event_data.AccessMask:0xf003f) AND (NOT (winlog.logon.id:0x3e4)))`"}
