{"id":"44bbff3e-4ca3-452d-a49a-6efa4cafa06f","created_by":"frack113","name":"Exploit SamAccountName Spoofing with Kerberos","tags":["attack.credential_access","attack.t1558.003"],"interval":"5m","description":"The attacker creates a computer object using those permissions with a password known to her.\nAfter that she clears the attribute ServicePrincipalName on the computer object.\nBecause she created the object (CREATOR OWNER), she gets granted additional permissions and can do many changes to the object.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND ((winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Bb][Ee][Rr][Oo][Ss]\\-[Kk][Ee][Yy]\\-[Dd][Ii][Ss][Tt][Rr][Ii][Bb][Uu][Tt][Ii][Oo][Nn]\\-[Cc][Ee][Nn][Tt][Ee][Rr]/ AND event.code:(35 OR 36 OR 37 OR 38)) OR (winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\-[Ss][Aa][Mm]/ AND event.code:(16990 OR 16991))))","rule_id":"44bbff3e-4ca3-452d-a49a-6efa4cafa06f","timestamp_override":"event.ingested","references":["https://cloudbrothers.info/en/exploit-kerberos-samaccountname-spoofing/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND ((winlog.provider_name:Microsoft\\-Windows\\-Kerberos\\-Key\\-Distribution\\-Center AND event.code:(35 OR 36 OR 37 OR 38)) OR (winlog.provider_name:Microsoft\\-Windows\\-Directory\\-Services\\-SAM AND event.code:(16990 OR 16991))))`"}
