{"id":"d7a95147-145f-4678-b85d-d1ff4a3bb3f6","created_by":"Florian Roth, Wojciech Lesicki","name":"CobaltStrike Service Installations","tags":["attack.execution","attack.privilege_escalation","attack.lateral_movement","attack.t1021.002","attack.t1543.003","attack.t1569.002"],"interval":"5m","description":"Detects known malicious service installs that appear in cases in which a Cobalt Strike beacon elevates privileges or lateral movement","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND ((winlog.event_data.ServiceFileName:/.*[Aa][Dd][Mm][Ii][Nn]$.*/ AND winlog.event_data.ServiceFileName:/.*\\.[Ee][Xx][Ee].*/) OR (winlog.event_data.ServiceFileName:/.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ AND winlog.event_data.ServiceFileName:/.*[Ss][Tt][Aa][Rr][Tt].*/ AND winlog.event_data.ServiceFileName:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/) OR winlog.event_data.ServiceFileName:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\ \\-[Nn][Oo][Pp]\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR winlog.event_data.ServiceFileName:(/.*[Ss][Uu][Vv][Yy][Ii][Cc][Hh][Oo][Zz][Xx][Cc][Tt][Tt]2[Jj][Qq][Zz][Ww][Nn]0[Ii][Ee]5[Ll][Dd][Cc]5[Xx][Zz][Ww][Jj][Jj][Bb][Gg][Ll][Ll][Bb][Nn][Qq][Pp][Ll][Kk][Rr][Vv][Dd]25[Ss][Bb]2[Ff][Kk][Uu]3[Rr][Yy][Aa][Ww]5[Nn][Kk][Cc][Dd][Oo][Dd][Hh][Rr][Ww][Oo][Ii]8[Vv][Mm][Tt][Ii]3[Ll][Jj][Aa][Uu][Mm][Cc]4[Xx][Oo].*/ OR /.*[Ll][Ff][Ww][Cc][Aa][Oo][Tt][Mm][Vv]3[Ll][Uu]9[Ii][Aa][Mm][Vv][Jj][Dd][Cc][Bb][Oo][Zz][Xx][Qq][Uu][Vv]2[Vv][Ii][Yy]2[Xx][Pp][Zz][Ww]50[Kk][Ss]5[Ee][Bb]3[Dd][Uu][Bb][Gg]9[Hh][Zz][Ff][Nn]0[Cc][Mm][Ll][Uu][Zz][Yy][Gg][Nn][Aa][Hh][Rr]0[Cc][Dd][Oo][Vv][Ll][Zz][Ee][Yy][Nn][Yy]4[Ww][Ll][Jj][Aa][Uu][Mm][Tt].*/ OR /.*[Jj][Rr][Vv][Gg][Gg][Kk][Ee]5[Ll][Dd][Yy]1[Pp][Yy][Mm][Pp][Ll][Yy]3[Qq][Gg][Tt][Mm][Vv]0[Ll][Ll][Dd][Ll][Yy][Mm][Nn][Ss][Aa][Ww][Vv][Uu][Dd][Cc][Kk][Uu][Rr][Gg]93[Bb][Mm][Xx][Vv][Yy][Ww][Rr][Tt][Dd][Hh][Jj][Pp][Bb][Mm][Cc][Oo][Jj]2[Hh]0[Dd][Hh][Aa]6[Ll][Yy]8[Xx][Mm][Jj][Cc][Uu][Mm][Cc]4[Ww][Ll][Jj][Ee]6.*/)))","rule_id":"d7a95147-145f-4678-b85d-d1ff4a3bb3f6","timestamp_override":"event.ingested","references":["https://www.sans.org/webcasts/119395","https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/","https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND ((winlog.event_data.ServiceFileName:*ADMIN$* AND winlog.event_data.ServiceFileName:*.exe*) OR (winlog.event_data.ServiceFileName:*%COMSPEC%* AND winlog.event_data.ServiceFileName:*start* AND winlog.event_data.ServiceFileName:*powershell*) OR winlog.event_data.ServiceFileName:*powershell\\ \\-nop\\ \\-w\\ hidden\\ \\-encodedcommand* OR winlog.event_data.ServiceFileName:(*SUVYIChOZXctT2JqZWN0IE5ldC5XZWJjbGllbnQpLkRvd25sb2FkU3RyaW5nKCdodHRwOi8vMTI3LjAuMC4xO* OR *lFWCAoTmV3LU9iamVjdCBOZXQuV2ViY2xpZW50KS5Eb3dubG9hZFN0cmluZygnaHR0cDovLzEyNy4wLjAuMT* OR *JRVggKE5ldy1PYmplY3QgTmV0LldlYmNsaWVudCkuRG93bmxvYWRTdHJpbmcoJ2h0dHA6Ly8xMjcuMC4wLjE6*)))`"}
