{"id":"06d71506-7beb-4f22-8888-e2e5e2ca7fd8","created_by":"Florian Roth (rule), David ANDRE (additional keywords)","name":"Mimikatz Use","tags":["attack.s0002","attack.lateral_movement","attack.credential_access","car.2013-07-001","car.2019-04-004","attack.t1003.002","attack.t1003.004","attack.t1003.001","attack.t1003.006"],"interval":"5m","description":"This method detects mimikatz keywords in different Eventlogs (some of them only appear in older Mimikatz version that are however still used by different threat groups)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Naughty administrators","AV Signature updates","Files with Mimikatz in their filename"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(\\*.keyword:(*dpapi\\:\\:masterkey* OR *eo.oe.kiwi* OR *event\\:\\:clear* OR *event\\:\\:drop* OR *gentilkiwi.com* OR *kerberos\\:\\:golden* OR *kerberos\\:\\:ptc* OR *kerberos\\:\\:ptt* OR *kerberos\\:\\:tgt* OR *Kiwi\\ Legit\\ Printer* OR *lsadump\\:\\:* OR *mimidrv.sys* OR *\\\\mimilib.dll* OR *misc\\:\\:printnightmare* OR *misc\\:\\:shadowcopies* OR *misc\\:\\:skeleton* OR *privilege\\:\\:backup* OR *privilege\\:\\:debug* OR *privilege\\:\\:driver* OR *sekurlsa\\:\\:*) AND (NOT (event.code:15)))","rule_id":"06d71506-7beb-4f22-8888-e2e5e2ca7fd8","timestamp_override":"event.ingested","references":["https://tools.thehacker.recipes/mimikatz/modules"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(\\*.keyword:(*dpapi\\:\\:masterkey* OR *eo.oe.kiwi* OR *event\\:\\:clear* OR *event\\:\\:drop* OR *gentilkiwi.com* OR *kerberos\\:\\:golden* OR *kerberos\\:\\:ptc* OR *kerberos\\:\\:ptt* OR *kerberos\\:\\:tgt* OR *Kiwi\\ Legit\\ Printer* OR *lsadump\\:\\:* OR *mimidrv.sys* OR *\\\\mimilib.dll* OR *misc\\:\\:printnightmare* OR *misc\\:\\:shadowcopies* OR *misc\\:\\:skeleton* OR *privilege\\:\\:backup* OR *privilege\\:\\:debug* OR *privilege\\:\\:driver* OR *sekurlsa\\:\\:*) AND (NOT (event.code:15)))`"}
