{"id":"83c161b6-ca67-4f33-8ad0-644a0737cf07","created_by":"Nasreddine Bencherchali","name":"Suspicious Application Installed","tags":["attack.execution"],"interval":"5m","description":"Detects suspicious application installed by looking at the added shortcut to the app resolver cache","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Packages or applications being legitimately used by users or administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((event.code:28115 AND winlog.event_data.Name:(/.*[Zz][Ee][Nn][Mm][Aa][Pp].*/ OR /.*[Aa][Nn][Yy][Dd][Ee][Ss][Kk].*/ OR /.*[Ww][Ii][Rr][Ee][Ss][Hh][Aa][Rr][Kk].*/ OR /.*[Oo][Pp][Ee][Nn][Vv][Pp][Nn].*/)) OR (event.code:28115 AND AppID:(/.*[Zz][Ee][Nn][Mm][Aa][Pp]\\.[Ee][Xx][Ee].*/ OR /.*[Pp][Rr][Oo][Kk][Zz][Uu][Ll][Tt]\\ [Aa][Dd].*/ OR /.*[Ww][Ii][Rr][Ee][Ss][Hh][Aa][Rr][Kk].*/ OR /.*[Oo][Pp][Ee][Nn][Vv][Pp][Nn].*/)))","rule_id":"83c161b6-ca67-4f33-8ad0-644a0737cf07","timestamp_override":"event.ingested","references":["https://nasbench.medium.com/finding-forensic-goodness-in-obscure-windows-event-logs-60e978ea45a3"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((event.code:28115 AND winlog.event_data.Name:(*Zenmap* OR *AnyDesk* OR *wireshark* OR *openvpn*)) OR (event.code:28115 AND AppID:(*zenmap.exe* OR *prokzult\\ ad* OR *wireshark* OR *openvpn*)))`"}
