{"id":"968eef52-9cff-4454-8992-1e74b9cbad6c","created_by":"Florian Roth (rule), Jack Croock (method), Jonhnathan Ribeiro (improvements), oscd.community","name":"Reconnaissance Activity","tags":["attack.discovery","attack.t1087.002","attack.t1069.002","attack.s0039"],"interval":"5m","description":"Detects activity as \"net user administrator /domain\" and \"net group domain admins /domain\"","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4661 AND winlog.event_data.AccessMask:/0[Xx]2[Dd]/ AND winlog.event_data.ObjectType:(/[Ss][Aa][Mm]_[Uu][Ss][Ee][Rr]/ OR /[Ss][Aa][Mm]_[Gg][Rr][Oo][Uu][Pp]/) AND winlog.event_data.ObjectName:/[Ss]\\-1\\-5\\-21\\-.*/ AND winlog.event_data.ObjectName:(/.*\\-500/ OR /.*\\-512/))","rule_id":"968eef52-9cff-4454-8992-1e74b9cbad6c","timestamp_override":"event.ingested","references":["https://findingbad.blogspot.de/2017/01/hunting-what-does-it-look-like.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4661 AND winlog.event_data.AccessMask:0x2d AND winlog.event_data.ObjectType:(SAM_USER OR SAM_GROUP) AND winlog.event_data.ObjectName:S\\-1\\-5\\-21\\-* AND winlog.event_data.ObjectName:(*\\-500 OR *\\-512))`"}
