{"id":"5bed80b6-b3e8-428e-a3ae-d3c757589e41","created_by":"Samir Bousseaden","name":"RDP over Reverse SSH Tunnel WFP","tags":["attack.defense_evasion","attack.command_and_control","attack.lateral_movement","attack.t1090.001","attack.t1090.002","attack.t1021.001","car.2013-07-002"],"interval":"5m","description":"Detects svchost hosting RDP termsvcs communicating with the loopback address","risk_score":73,"enabled":true,"severity":"high","false_positives":["Programs that connect locally to the RDP port"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5156 AND ((source.port:3389 AND destination.ip:(/127\\..*/ OR \\:\\:1)) OR (destination.port:3389 AND source.ip:(/127\\..*/ OR \\:\\:1)))) AND (NOT ((FilterOrigin:/[Aa][Pp][Pp][Cc][Oo][Nn][Tt][Aa][Ii][Nn][Ee][Rr]\\ [Ll][Oo][Oo][Pp][Bb][Aa][Cc][Kk]/) OR (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/)))))","rule_id":"5bed80b6-b3e8-428e-a3ae-d3c757589e41","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1096148422984384514","https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/44fbe85f72ee91582876b49678f9a26292a155fb/Command%20and%20Control/DE_RDP_Tunnel_5156.evtx"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5156 AND ((source.port:3389 AND destination.ip:(127.* OR \\:\\:1)) OR (destination.port:3389 AND source.ip:(127.* OR \\:\\:1)))) AND (NOT ((FilterOrigin:AppContainer\\ Loopback) OR (process.executable:(*\\\\thor.exe OR *\\\\thor64.exe)))))`"}
