{"id":"d08dd86f-681e-4a00-a92c-1db218754417","created_by":"Nasreddine Bencherchali","name":"MSSQL XPCmdshell Option Change","tags":["attack.execution"],"interval":"5m","description":"Detects when the MSSQL \"xp_cmdshell\" stored procedure setting is changed","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate enable/disable of the setting","Note that since the event contain the change for both values. This means that this will trigger on both enable and disable"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]/ AND event.code:15457 AND Data:/.*[Xx][Pp]_[Cc][Mm][Dd][Ss][Hh][Ee][Ll][Ll].*/)","rule_id":"d08dd86f-681e-4a00-a92c-1db218754417","timestamp_override":"event.ingested","references":["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/","https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:MSSQLSERVER AND event.code:15457 AND Data:*xp_cmdshell*)`"}
