{"id":"b85e5894-9b19-4d86-8c87-a2f3b81f0521","created_by":"frack113","name":"Suspicious Download File Extension with BITS","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.\nWindows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through [Component Object Model](https://attack.mitre.org/techniques/T1559/001)\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrator PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND (event.code:16403 AND LocalName:(/.*\\.[Pp][Ss]1/ OR /.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Bb][Aa][Tt]/)) AND (NOT (LocalName:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\.*/ AND RemoteName:/.*\\.[Cc][Oo][Mm].*/)))","rule_id":"b85e5894-9b19-4d86-8c87-a2f3b81f0521","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND (event.code:16403 AND LocalName:(*.ps1 OR *.exe OR *.vbs OR *.bat)) AND (NOT (LocalName:*\\\\AppData\\\\* AND RemoteName:*.com*)))`"}
