{"id":"9c8acf1a-cbf9-4db6-b63c-74baabe03e59","created_by":"Jerry Shockley '@jsh0x'","name":"NTLM Brute Force","tags":["attack.credential_access","attack.t1110"],"interval":"5m","description":"Detects common NTLM brute force device names","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Systems with names equal to the spoofed ones used by the brute force tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8004 AND source.domain:(/[Rr][Dd][Ee][Ss][Kk][Tt][Oo][Pp]/ OR /[Rr][Ee][Mm][Mm][Ii][Nn][Aa]/ OR /[Ff][Rr][Ee][Ee][Rr][Dd][Pp]/ OR /[Ww][Ii][Nn][Dd][Oo][Ww][Ss]7/ OR /[Ww][Ii][Nn][Dd][Oo][Ww][Ss]8/ OR /[Ww][Ii][Nn][Dd][Oo][Ww][Ss]2012/ OR /[Ww][Ii][Nn][Dd][Oo][Ww][Ss]2016/ OR /[Ww][Ii][Nn][Dd][Oo][Ww][Ss]2019/))","rule_id":"9c8acf1a-cbf9-4db6-b63c-74baabe03e59","timestamp_override":"event.ingested","references":["https://www.varonis.com/blog/investigate-ntlm-brute-force"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8004 AND source.domain:(Rdesktop OR Remmina OR Freerdp OR Windows7 OR Windows8 OR Windows2012 OR Windows2016 OR Windows2019))`"}
