{"id":"1a0a2ff1-611b-4dac-8216-8a7b47c618a6","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Clip","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Clip.exe in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*\\([Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd]|[Ii].*/)","rule_id":"1a0a2ff1-611b-4dac-8216-8a7b47c618a6","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:*\\(Clipboard|i*)`"}
