{"id":"98c3bcf1-56f2-49dc-9d8d-c66cf190238b","created_by":"Florian Roth","name":"NTLM Logon","tags":["attack.lateral_movement","attack.t1550.002"],"interval":"5m","description":"Detects logons using NTLM, which could be caused by a legacy source or attackers","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legacy hosts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8002 AND process.executable:/.*/)","rule_id":"98c3bcf1-56f2-49dc-9d8d-c66cf190238b","timestamp_override":"event.ingested","references":["https://twitter.com/JohnLaTwC/status/1004895028995477505","https://goo.gl/PsqrhT"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8002 AND process.executable:*)`"}
