{"id":"5570c4d9-8fdd-4622-965b-403a5a101aa0","created_by":"frack113","name":"Modified Rule in Windows Firewall with Advanced Security","tags":null,"interval":"5m","description":"A rule has been modified in the Windows Firewall exception list","risk_score":21,"enabled":true,"severity":"low","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:2005 AND (NOT ((winlog.event_data.ModifyingApplication:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/)))))","rule_id":"5570c4d9-8fdd-4622-965b-403a5a101aa0","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:2005 AND (NOT ((winlog.event_data.ModifyingApplication:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Program\\ Files\\\\*)))))`"}
