{"id":"53ad8e36-f573-46bf-97e4-15ba5bf4bb51","created_by":"Thomas Patzke","name":"Password Change on Directory Service Restore Mode (DSRM) Account","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"The Directory Service Restore Mode (DSRM) account is a local administrator account on Domain Controllers. Attackers may change the password to gain persistence.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Initial installation of a domain controller"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4794)","rule_id":"53ad8e36-f573-46bf-97e4-15ba5bf4bb51","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=1714"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4794)`"}
