{"id":"c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9","created_by":"Florian Roth","name":"ProcessHacker Privilege Elevation","tags":["attack.execution","attack.privilege_escalation","attack.t1543.003","attack.t1569.002"],"interval":"5m","description":"Detects a ProcessHacker tool that elevated privileges to a very high level","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Hh][Aa][Cc][Kk][Ee][Rr].*/ AND user.name:/[Ll][Oo][Cc][Aa][Ll][Ss][Yy][Ss][Tt][Ee][Mm]/)","rule_id":"c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9","timestamp_override":"event.ingested","references":["https://twitter.com/1kwpeter/status/1397816101455765504"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:ProcessHacker* AND user.name:LocalSystem)`"}
