{"id":"f8a56cb7-a363-44ed-a82f-5926bb44cd05","created_by":"Florian Roth","name":"Download with BITS to Suspicious Folder","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.\nWindows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through [Component Object Model](https://attack.mitre.org/techniques/T1559/001)\n","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND LocalName:(/.*[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*%[Pp][Uu][Bb][Ll][Ii][Cc]%.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/))","rule_id":"f8a56cb7-a363-44ed-a82f-5926bb44cd05","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND LocalName:(*C\\:\\\\Users\\\\Public\\\\* OR *%public%* OR *\\\\Desktop\\\\*))`"}
