{"id":"e97d9903-53b2-41fc-8cb9-889ed4093e80","created_by":"Sittikorn S, Tim Shelton","name":"KrbRelayUp Service Installation","tags":["attack.privilege_escalation","attack.t1543"],"interval":"5m","description":"Detects service creation from KrbRelayUp tool used for privilege escalation in windows domain environments where LDAP signing is not enforced (the default settings)","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:7045 AND winlog.event_data.ServiceName:/[Kk][Rr][Bb][Ss][Cc][Mm]/)","rule_id":"e97d9903-53b2-41fc-8cb9-889ed4093e80","timestamp_override":"event.ingested","references":["https://github.com/Dec0ne/KrbRelayUp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:7045 AND winlog.event_data.ServiceName:KrbSCM)`"}
