{"id":"ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34","created_by":"Teymur Kheirkhabarov, Ecco, Florian Roth","name":"Meterpreter or Cobalt Strike Getsystem Service Installation","tags":["attack.privilege_escalation","attack.t1134.001","attack.t1134.002"],"interval":"5m","description":"Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service installation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Highly unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND ((winlog.event_data.ServiceFileName:/.*[Cc][Mm][Dd].*/ AND winlog.event_data.ServiceFileName:/.*\\/[Cc].*/ AND winlog.event_data.ServiceFileName:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ServiceFileName:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ServiceFileName:/.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ AND winlog.event_data.ServiceFileName:/.*\\/[Cc].*/ AND winlog.event_data.ServiceFileName:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ServiceFileName:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ServiceFileName:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND winlog.event_data.ServiceFileName:/.*\\/[Cc].*/ AND winlog.event_data.ServiceFileName:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ServiceFileName:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ServiceFileName:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND winlog.event_data.ServiceFileName:/.*\\.[Dd][Ll][Ll],[Aa].*/ AND winlog.event_data.ServiceFileName:/.*\\/[Pp]\\:.*/)))","rule_id":"ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND ((winlog.event_data.ServiceFileName:*cmd* AND winlog.event_data.ServiceFileName:*\\/c* AND winlog.event_data.ServiceFileName:*echo* AND winlog.event_data.ServiceFileName:*\\\\pipe\\\\*) OR (winlog.event_data.ServiceFileName:*%COMSPEC%* AND winlog.event_data.ServiceFileName:*\\/c* AND winlog.event_data.ServiceFileName:*echo* AND winlog.event_data.ServiceFileName:*\\\\pipe\\\\*) OR (winlog.event_data.ServiceFileName:*cmd.exe* AND winlog.event_data.ServiceFileName:*\\/c* AND winlog.event_data.ServiceFileName:*echo* AND winlog.event_data.ServiceFileName:*\\\\pipe\\\\*) OR (winlog.event_data.ServiceFileName:*rundll32* AND winlog.event_data.ServiceFileName:*.dll,a* AND winlog.event_data.ServiceFileName:*\\/p\\:*)))`"}
