{"id":"9599c180-e3a8-4743-8f92-7fb96d3be648","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Remote WMI ActiveScriptEventConsumers","tags":["attack.lateral_movement","attack.privilege_escalation","attack.persistence","attack.t1546.003"],"interval":"5m","description":"Detect potential adversaries leveraging WMI ActiveScriptEventConsumers remotely to move laterally in a network","risk_score":73,"enabled":true,"severity":"high","false_positives":["SCCM"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4624 AND winlog.event_data.LogonType:3 AND process.executable:/.*[Ss][Cc][Rr][Cc][Oo][Nn][Ss]\\.[Ee][Xx][Ee]/) AND (NOT (winlog.logon.id:/0[Xx]3[Ee]7/)))","rule_id":"9599c180-e3a8-4743-8f92-7fb96d3be648","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-200902020333.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4624 AND winlog.event_data.LogonType:3 AND process.executable:*scrcons.exe) AND (NOT (winlog.logon.id:0x3e7)))`"}
