{"id":"b3d57a5c-c92e-4b48-9a79-5f124b7cf964","created_by":"Nasreddine Bencherchali","name":"MSSQL SPProcoption Set","tags":["attack.persistence"],"interval":"5m","description":"Detects when the a stored procedure is set or cleared for automatic execution in MSSQL. A stored procedure that is set to automatic execution runs every time an instance of SQL Server is started","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of the feature by administrators (rare)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]/ AND event.code:33205 AND Data:/.*[Oo][Bb][Jj][Ee][Cc][Tt]_[Nn][Aa][Mm][Ee]\\:[Ss][Pp]_[Pp][Rr][Oo][Cc][Oo][Pp][Tt][Ii][Oo][Nn].*/ AND Data:/.*[Ss][Tt][Aa][Tt][Ee][Mm][Ee][Nn][Tt]\\:[Ee][Xx][Ee][Cc].*/)","rule_id":"b3d57a5c-c92e-4b48-9a79-5f124b7cf964","timestamp_override":"event.ingested","references":["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/","https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:MSSQLSERVER AND event.code:33205 AND Data:*object_name\\:sp_procoption* AND Data:*statement\\:EXEC*)`"}
