{"id":"b98a10af-1e1e-44a7-bab2-4cc026917648","created_by":"Nasreddine Bencherchali","name":"New PDQDeploy Service - Client Side","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects PDQDeploy service installation on the target system. When a package is deployed via PDQDeploy it installs a remote service on the target machine with the name \"PDQDeployRunner-X\" where \"X\" is an integer starting from 1","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the tool"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND (winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045) AND (winlog.event_data.ImagePath:/.*[Pp][Dd][Qq][Dd][Ee][Pp][Ll][Oo][Yy][Rr][Uu][Nn][Nn][Ee][Rr]\\-.*/ OR winlog.event_data.ServiceName:/[Pp][Dd][Qq][Dd][Ee][Pp][Ll][Oo][Yy][Rr][Uu][Nn][Nn][Ee][Rr]\\-.*/))","rule_id":"b98a10af-1e1e-44a7-bab2-4cc026917648","timestamp_override":"event.ingested","references":["https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND (winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045) AND (winlog.event_data.ImagePath:*PDQDeployRunner\\-* OR winlog.event_data.ServiceName:PDQDeployRunner\\-*))`"}
