{"id":"2632954e-db1c-49cb-9936-67d1ef1d17d2","created_by":"Thomas Patzke, @atc_project (improvements)","name":"Addition of SID History to Active Directory Object","tags":["attack.persistence","attack.privilege_escalation","attack.t1134.005"],"interval":"5m","description":"An attacker can use the SID history attribute to gain additional privileges.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Migration of an account into a new domain"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:(4765 OR 4766) OR ((event.code:4738 AND (NOT (winlog.event_data.SidHistory:(\\- OR %%1793)))) AND (NOT (NOT _exists_:winlog.event_data.SidHistory)))))","rule_id":"2632954e-db1c-49cb-9936-67d1ef1d17d2","timestamp_override":"event.ingested","references":["https://adsecurity.org/?p=1772"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:(4765 OR 4766) OR ((event.code:4738 AND (NOT (winlog.event_data.SidHistory:(\\- OR %%1793)))) AND (NOT (NOT _exists_:winlog.event_data.SidHistory)))))`"}
