{"id":"470ec5fa-7b4e-4071-b200-4c753100f49b","created_by":"Thomas Patzke","name":"Failed Code Integrity Checks","tags":["attack.defense_evasion","attack.t1027.001"],"interval":"5m","description":"Code integrity failures may indicate tampered executables.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Disk device errors"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(5038 OR 6281))","rule_id":"470ec5fa-7b4e-4071-b200-4c753100f49b","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(5038 OR 6281))`"}
