{"id":"13acf386-b8c6-4fe0-9a6e-c4756b974698","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Remote PowerShell Sessions Network Connections (WinRM)","tags":["attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound connections to ports 5985 OR 5986","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate use of remote PowerShell execution"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5156 AND destination.port:(5985 OR 5986) AND winlog.event_data.LayerRTID:44)","rule_id":"13acf386-b8c6-4fe0-9a6e-c4756b974698","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5156 AND destination.port:(5985 OR 5986) AND winlog.event_data.LayerRTID:44)`"}
