{"id":"4edf51e1-cb83-4e1a-bc39-800e396068e3","created_by":"Jonathan Cheong, oscd.community","name":"Invoke-Obfuscation CLIP+ Launcher","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated use of Clip.exe to execute PowerShell","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*[Cc][Mm][Dd].*/ AND winlog.event_data.ServiceFileName:/.*\\&\\&.*/ AND winlog.event_data.ServiceFileName:/.*[Cc][Ll][Ii][Pp][Bb][Oo][Aa][Rr][Dd]\\]\\:\\:.*/)","rule_id":"4edf51e1-cb83-4e1a-bc39-800e396068e3","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:4697 AND winlog.event_data.ServiceFileName:*cmd* AND winlog.event_data.ServiceFileName:*\\&&* AND winlog.event_data.ServiceFileName:*clipboard\\]\\:\\:*)`"}
