{"id":"cfeed607-6aa4-4bbd-9627-b637deb723c8","created_by":"Ilyas Ochkov, oscd.community","name":"New or Renamed User Account with '$' in Attribute 'SamAccountName'","tags":["attack.defense_evasion","attack.t1036"],"interval":"5m","description":"Detects possible bypass EDR and SIEM via abnormal user account name.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4720 OR 4781) AND winlog.event_data.SamAccountName:/.*$.*/)","rule_id":"cfeed607-6aa4-4bbd-9627-b637deb723c8","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4720 OR 4781) AND winlog.event_data.SamAccountName:*$*)`"}
