{"id":"e9c8808f-4cfb-4ba9-97d4-e5f3beaa244d","created_by":"@BarryShooshooga","name":"Windows Defender Exclusion Set","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects scenarios where an windows defender exclusion was added in registry where an entity would want to bypass antivirus scanning from windows defender","risk_score":73,"enabled":true,"severity":"high","false_positives":["Intended inclusions by administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4657 OR 4656 OR 4660 OR 4663) AND winlog.event_data.ObjectName:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Ee][Xx][Cc][Ll][Uu][Ss][Ii][Oo][Nn][Ss]\\\\.*/)","rule_id":"e9c8808f-4cfb-4ba9-97d4-e5f3beaa244d","timestamp_override":"event.ingested","references":["https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4657 OR 4656 OR 4660 OR 4663) AND winlog.event_data.ObjectName:*\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions\\\\*)`"}
