{"id":"0b7889b4-5577-4521-a60a-3376ee7f9f7b","created_by":"Florian Roth, Gleb Sukhodolskiy, Timur Zinniatullin oscd.community","name":"WMI Persistence","tags":["attack.persistence","attack.privilege_escalation","attack.t1546.003"],"interval":"5m","description":"Detects suspicious WMI event filter and command line event consumer based on WMI and Security Logs.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown (data set is too small; further testing needed)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((event.code:5861 AND \\*.keyword:(/.*[Aa][Cc][Tt][Ii][Vv][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ee][Vv][Ee][Nn][Tt][Cc][Oo][Nn][Ss][Uu][Mm][Ee][Rr].*/ OR /.*[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee][Ee][Vv][Ee][Nn][Tt][Cc][Oo][Nn][Ss][Uu][Mm][Ee][Rr].*/ OR /.*[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ll][Ii][Nn][Ee][Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee].*/)) OR event.code:5859) AND (NOT (Provider:/[Ss][Cc][Mm]\\ [Ee][Vv][Ee][Nn][Tt]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]/ AND winlog.event_data.Query:/[Ss][Ee][Ll][Ee][Cc][Tt]\\ .*\\ [Ff][Rr][Oo][Mm]\\ [Mm][Ss][Ff][Tt]_[Ss][Cc][Mm][Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg][Ee][Vv][Ee][Nn][Tt]/ AND winlog.event_data.User:/[Ss]\\-1\\-5\\-32\\-544/ AND PossibleCause:/[Pp][Ee][Rr][Mm][Aa][Nn][Ee][Nn][Tt]/)))","rule_id":"0b7889b4-5577-4521-a60a-3376ee7f9f7b","timestamp_override":"event.ingested","references":["https://twitter.com/mattifestation/status/899646620148539397","https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((event.code:5861 AND \\*.keyword:(*ActiveScriptEventConsumer* OR *CommandLineEventConsumer* OR *CommandLineTemplate*)) OR event.code:5859) AND (NOT (Provider:SCM\\ Event\\ Provider AND winlog.event_data.Query:select\\ *\\ from\\ MSFT_SCMEventLogEvent AND winlog.event_data.User:S\\-1\\-5\\-32\\-544 AND PossibleCause:Permanent)))`"}
