{"id":"516376b4-05cd-4122-bae0-ad7641c38d48","created_by":"Florian Roth, Rich Warren, Christian Burkard","name":"Mailbox Export to Exchange Webserver","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Detects a successful export of an Exchange mailbox to untypical directory or with aspx name suffix which can be used to place a webshell or the needed role assignment for it","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND ((\\*.keyword:(*New\\-MailboxExportRequest* AND *\\ \\-Mailbox\\ *) AND \\*.keyword:(*\\-FilePath\\ \\\"\\\\\\\\localhost\\\\C$* OR *\\-FilePath\\ \\\"\\\\\\\\127.0.0.1\\\\C$* OR *.aspx*)) OR \\*.keyword:(*New\\-ManagementRoleAssignment* AND *\\ \\-Role\\ \\\"Mailbox\\ Import\\ Export\\\"* AND *\\ \\-User\\ *)))","rule_id":"516376b4-05cd-4122-bae0-ad7641c38d48","timestamp_override":"event.ingested","references":["https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND ((\\*.keyword:(*New\\-MailboxExportRequest* AND *\\ \\-Mailbox\\ *) AND \\*.keyword:(*\\-FilePath\\ \\\"\\\\\\\\localhost\\\\C$* OR *\\-FilePath\\ \\\"\\\\\\\\127.0.0.1\\\\C$* OR *.aspx*)) OR \\*.keyword:(*New\\-ManagementRoleAssignment* AND *\\ \\-Role\\ \\\"Mailbox\\ Import\\ Export\\\"* AND *\\ \\-User\\ *)))`"}
