{"id":"57b649ef-ff42-4fb0-8bf6-62da243a1708","created_by":"Ján Trenčanský","name":"Windows Defender Threat Detected","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects all actions taken by Windows Defender malware detection engines","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:(1006 OR 1116 OR 1015 OR 1117))","rule_id":"57b649ef-ff42-4fb0-8bf6-62da243a1708","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:(1006 OR 1116 OR 1015 OR 1117))`"}
