{"id":"2c99737c-585d-4431-b61a-c911d86ff32f","created_by":"Samir Bousseaden; Roberto Rodriguez @Cyb3rWard0g; oscd.community; Tim Shelton; Maxence Fossat","name":"Powerview Add-DomainObjectAcl DCSync AD Extend Right","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"Backdooring domain object to grant the rights associated with DCSync to a regular user or machine account using Powerview\\Add-DomainObjectAcl DCSync Extended Right cmdlet, will allow to re-obtain the pwd hashes of any user/computer","risk_score":73,"enabled":true,"severity":"high","false_positives":["New Domain Controller computer account, check user SIDs within the value attribute of event 5136 and verify if it's a regular user or DC computer account."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:/[Nn][Tt][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Dd][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Oo][Rr]/ AND winlog.event_data.AttributeValue:(/.*1131[Ff]6[Aa][Dd]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*1131[Ff]6[Aa][Aa]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*89[Ee]95[Bb]76\\-444[Dd]\\-4[Cc]62\\-991[Aa]\\-0[Ff][Aa][Cc][Bb][Ee][Dd][Aa]640[Cc].*/)) AND (NOT ((winlog.event_data.ObjectClass:(/[Dd][Nn][Ss][Nn][Oo][Dd][Ee]/ OR /[Dd][Nn][Ss][Zz][Oo][Nn][Ee][Ss][Cc][Oo][Pp][Ee]/ OR /[Dd][Nn][Ss][Zz][Oo][Nn][Ee]/)))))","rule_id":"2c99737c-585d-4431-b61a-c911d86ff32f","timestamp_override":"event.ingested","references":["https://twitter.com/menasec1/status/1111556090137903104","https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:ntSecurityDescriptor AND winlog.event_data.AttributeValue:(*1131f6ad\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *1131f6aa\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *89e95b76\\-444d\\-4c62\\-991a\\-0facbeda640c*)) AND (NOT ((winlog.event_data.ObjectClass:(dnsNode OR dnsZoneScope OR dnsZone)))))`"}
