{"id":"00ba9da1-b510-4f6b-b258-8d338836180f","created_by":"Florian Roth","name":"Password Protected ZIP File Opened","tags":null,"interval":"5m","description":"Detects the extraction of password protected ZIP archives. See the filename variable for more details on which file has been opened.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate used of encrypted ZIP files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5379 AND TargetName:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]_[Ss][Hh][Ee][Ll][Ll]_[Zz][Ii][Pp][Ff][Oo][Ll][Dd][Ee][Rr]\\:[Ff][Ii][Ll][Ee][Nn][Aa][Mm][Ee].*/) AND (NOT (TargetName:/.*\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk].*/)))","rule_id":"00ba9da1-b510-4f6b-b258-8d338836180f","timestamp_override":"event.ingested","references":["https://twitter.com/sbousseaden/status/1523383197513379841"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5379 AND TargetName:*Microsoft_Windows_Shell_ZipFolder\\:filename*) AND (NOT (TargetName:*\\\\Temporary\\ Internet\\ Files\\\\Content.Outlook*)))`"}
