{"id":"25b9c01c-350d-4b95-bed1-836d04a4f324","created_by":"Bhabesh Raj","name":"Moriya Rootkit","tags":["attack.persistence","attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Zz][Zz][Nn][Ee][Tt][Ss][Vv][Cc]/)","rule_id":"25b9c01c-350d-4b95-bed1-836d04a4f324","timestamp_override":"event.ingested","references":["https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:ZzNetSvc)`"}
