{"id":"7a922f1b-2635-4d6c-91ef-af228b198ad3","created_by":"Timur Zinniatullin, oscd.community","name":"Invoke-Obfuscation COMPRESS OBFUSCATION","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via COMPRESS OBFUSCATION","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*[Nn][Ee][Ww]\\-[Oo][Bb][Jj][Ee][Cc][Tt].*/ AND winlog.event_data.ServiceFileName:/.*[Tt][Ee][Xx][Tt]\\.[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg]\\]\\:\\:[Aa][Ss][Cc][Ii][Ii].*/ AND winlog.event_data.ServiceFileName:/.*[Rr][Ee][Aa][Dd][Tt][Oo][Ee][Nn][Dd].*/ AND winlog.event_data.ServiceFileName:(/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Cc][Oo][Mm][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn]\\.[Dd][Ee][Ff][Ll][Aa][Tt][Ee][Ss][Tt][Rr][Ee][Aa][Mm].*/ OR /.*[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Oo]\\.[Ss][Tt][Rr][Ee][Aa][Mm][Rr][Ee][Aa][Dd][Ee][Rr].*/))","rule_id":"7a922f1b-2635-4d6c-91ef-af228b198ad3","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:*new\\-object* AND winlog.event_data.ServiceFileName:*text.encoding\\]\\:\\:ascii* AND winlog.event_data.ServiceFileName:*readtoend* AND winlog.event_data.ServiceFileName:(*system.io.compression.deflatestream* OR *system.io.streamreader*))`"}
