{"id":"8cd538a4-62d5-4e83-810b-12d41e428d6e","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Processes Accessing the Microphone and Webcam","tags":["attack.collection","attack.t1123"],"interval":"5m","description":"Potential adversaries accessing the microphone and webcam in an endpoint.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4657 OR 4656 OR 4663) AND winlog.event_data.ObjectName:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Cc][Aa][Pp][Aa][Bb][Ii][Ll][Ii][Tt][Yy][Aa][Cc][Cc][Ee][Ss][Ss][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt][Ss][Tt][Oo][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Pp][Hh][Oo][Nn][Ee]\\\\[Nn][Oo][Nn][Pp][Aa][Cc][Kk][Aa][Gg][Ee][Dd].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Cc][Aa][Pp][Aa][Bb][Ii][Ll][Ii][Tt][Yy][Aa][Cc][Cc][Ee][Ss][Ss][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt][Ss][Tt][Oo][Rr][Ee]\\\\[Ww][Ee][Bb][Cc][Aa][Mm]\\\\[Nn][Oo][Nn][Pp][Aa][Cc][Kk][Aa][Gg][Ee][Dd].*/))","rule_id":"8cd538a4-62d5-4e83-810b-12d41e428d6e","timestamp_override":"event.ingested","references":["https://twitter.com/duzvik/status/1269671601852813320","https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4657 OR 4656 OR 4663) AND winlog.event_data.ObjectName:(*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\microphone\\\\NonPackaged* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\webcam\\\\NonPackaged*))`"}
