{"id":"def8b624-e08f-4ae1-8612-1ba21190da6b","created_by":"Max Altgelt","name":"Outgoing Logon with New Credentials","tags":null,"interval":"5m","description":"Detects logon events that specify new credentials","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate remote administration activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:9)","rule_id":"def8b624-e08f-4ae1-8612-1ba21190da6b","timestamp_override":"event.ingested","references":["https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:9)`"}
