{"id":"50cb47b8-2c33-4b23-a2e9-4600657d9746","created_by":"Nasreddine Bencherchali","name":"Loading Diagcab Package From Remote Path","tags":["attack.execution"],"interval":"5m","description":"Detects loading of diagcab packages from a remote path, as seen in DogWalk vulnerability","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate package hosted on a known and authorized remote location"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(event.code:101 AND PackagePath:/.*\\\\\\\\\\*/)","rule_id":"50cb47b8-2c33-4b23-a2e9-4600657d9746","timestamp_override":"event.ingested","references":["https://twitter.com/nas_bench/status/1539679555908141061","https://twitter.com/j00sean/status/1537750439701225472"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(event.code:101 AND PackagePath:*\\\\\\\\\\*)`"}
