{"id":"962fe167-e48d-4fd6-9974-11e5b9a5d6d1","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"LSASS Access from Non System Account","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects potential mimikatz-like tools accessing LSASS from non system account","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:(4663 OR 4656) AND winlog.event_data.AccessMask:(/0[Xx]40/ OR /0[Xx]1400/ OR /0[Xx]100000/ OR /0[Xx]1410/ OR /0[Xx]1010/ OR /0[Xx]1438/ OR /0[Xx]143[Aa]/ OR /0[Xx]1418/ OR /0[Xx]1[Ff]0[Ff][Ff][Ff]/ OR /0[Xx]1[Ff]1[Ff][Ff][Ff]/ OR /0[Xx]1[Ff]2[Ff][Ff][Ff]/ OR /0[Xx]1[Ff]3[Ff][Ff][Ff]/ OR 40 OR 1400 OR 1000 OR 100000 OR 1410 OR 1010 OR 1438 OR /143[Aa]/ OR 1418 OR /1[Ff]0[Ff][Ff][Ff]/ OR /1[Ff]1[Ff][Ff][Ff]/ OR /1[Ff]2[Ff][Ff][Ff]/ OR /1[Ff]3[Ff][Ff][Ff]/) AND winlog.event_data.ObjectType:/[Pp][Rr][Oo][Cc][Ee][Ss][Ss]/ AND winlog.event_data.ObjectName:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/) AND (NOT ((user.name:/.*$/) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/))))","rule_id":"962fe167-e48d-4fd6-9974-11e5b9a5d6d1","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-170105221010.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:(4663 OR 4656) AND winlog.event_data.AccessMask:(0x40 OR 0x1400 OR 0x100000 OR 0x1410 OR 0x1010 OR 0x1438 OR 0x143a OR 0x1418 OR 0x1f0fff OR 0x1f1fff OR 0x1f2fff OR 0x1f3fff OR 40 OR 1400 OR 1000 OR 100000 OR 1410 OR 1010 OR 1438 OR 143a OR 1418 OR 1f0fff OR 1f1fff OR 1f2fff OR 1f3fff) AND winlog.event_data.ObjectType:Process AND winlog.event_data.ObjectName:*\\\\lsass.exe) AND (NOT ((user.name:*$) OR (process.executable:C\\:\\\\Program\\ Files*))))`"}
