{"id":"54f0434b-726f-48a1-b2aa-067df14516e4","created_by":"Florian Roth","name":"Password Protected ZIP File Opened (Suspicious Filenames)","tags":null,"interval":"5m","description":"Detects the extraction of password protected ZIP archives with suspicious file names. See the filename variable for more details on which file has been opened.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate used of encrypted ZIP files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5379 AND TargetName:/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]_[Ww][Ii][Nn][Dd][Oo][Ww][Ss]_[Ss][Hh][Ee][Ll][Ll]_[Zz][Ii][Pp][Ff][Oo][Ll][Dd][Ee][Rr]\\:[Ff][Ii][Ll][Ee][Nn][Aa][Mm][Ee].*/ AND TargetName:(/.*[Ii][Nn][Vv][Oo][Ii][Cc][Ee].*/ OR /.*[Nn][Ee][Ww]\\ [Oo][Rr][Dd][Ee][Rr].*/ OR /.*[Rr][Ee][Cc][Hh][Nn][Uu][Nn][Gg].*/ OR /.*[Ff][Aa][Cc][Tt][Uu][Rr][Aa].*/ OR /.*[Dd][Ee][Ll][Ii][Vv][Ee][Rr][Yy].*/ OR /.*[Pp][Uu][Rr][Cc][Hh][Aa][Ss][Ee].*/ OR /.*[Oo][Rr][Dd][Ee][Rr].*/ OR /.*[Pp][Aa][Yy][Mm][Ee][Nn][Tt].*/))","rule_id":"54f0434b-726f-48a1-b2aa-067df14516e4","timestamp_override":"event.ingested","references":["https://twitter.com/sbousseaden/status/1523383197513379841"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5379 AND TargetName:*Microsoft_Windows_Shell_ZipFolder\\:filename* AND TargetName:(*invoice* OR *new\\ order* OR *rechnung* OR *factura* OR *delivery* OR *purchase* OR *order* OR *payment*))`"}
