{"id":"b7bc7038-638b-4ffd-880c-292c692209ef","created_by":"Max Altgelt","name":"Certificate Request Export to Exchange Webserver","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Detects a write of an Exchange CSR to an untypical directory or with aspx name suffix which can be used to place a webshell","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND \\*.keyword:(*New\\-ExchangeCertificate* AND *\\ \\-GenerateRequest* AND *\\ \\-BinaryEncoded* AND *\\ \\-RequestFile*) AND \\*.keyword:(*\\\\\\\\localhost\\\\C$* OR *\\\\\\\\127.0.0.1\\\\C$* OR *C\\:\\\\inetpub* OR *.aspx*))","rule_id":"b7bc7038-638b-4ffd-880c-292c692209ef","timestamp_override":"event.ingested","references":["https://twitter.com/GossiTheDog/status/1429175908905127938"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND \\*.keyword:(*New\\-ExchangeCertificate* AND *\\ \\-GenerateRequest* AND *\\ \\-BinaryEncoded* AND *\\ \\-RequestFile*) AND \\*.keyword:(*\\\\\\\\localhost\\\\C$* OR *\\\\\\\\127.0.0.1\\\\C$* OR *C\\:\\\\inetpub* OR *.aspx*))`"}
