{"id":"3db10f25-2527-4b79-8d4b-471eb900ee29","created_by":"Tim Burrell","name":"GALLIUM Artefacts","tags":["attack.credential_access","attack.command_and_control","attack.t1071"],"interval":"5m","description":"Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:DNS\\ Server AND event.code:257 AND QNAME:(/[Aa][Ss][Yy][Ss][Pp][Yy]256\\.[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /[Hh][Oo][Tt][Kk][Ii][Ll][Ll][Mm][Aa][Ii][Ll]9[Ss][Dd][Dd][Cc][Cc]\\.[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /[Rr][Oo][Ss][Aa][Ff]112\\.[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /[Cc][Vv][Dd][Ff][Hh][Jj][Hh]1231\\.[Mm][Yy][Ff][Tt][Pp]\\.[Bb][Ii][Zz]/ OR /[Ss][Zz]2016[Rr][Oo][Ss][Ee]\\.[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /[Dd][Ff][Ff][Ww][Ee][Ss][Cc][Ww][Ee][Rr]4325\\.[Mm][Yy][Ff][Tt][Pp]\\.[Bb][Ii][Zz]/ OR /[Cc][Vv][Dd][Ff][Hh][Jj][Hh]1231\\.[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/))","rule_id":"3db10f25-2527-4b79-8d4b-471eb900ee29","timestamp_override":"event.ingested","references":["https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn800669(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:DNS\\ Server AND event.code:257 AND QNAME:(asyspy256.ddns.net OR hotkillmail9sddcc.ddns.net OR rosaf112.ddns.net OR cvdfhjh1231.myftp.biz OR sz2016rose.ddns.net OR dffwescwer4325.myftp.biz OR cvdfhjh1231.ddns.net))`"}
