{"id":"839dd1e8-eda8-4834-8145-01beeee33acd","created_by":"Florian Roth","name":"SAM Dump to AppData","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects suspicious SAM dump activity as cause by QuarksPwDump and other password dumpers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Nn][Ee][Ll]\\-[Gg][Ee][Nn][Ee][Rr][Aa][Ll]/ AND event.code:16 AND /\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Aa][Mm]\\-/ AND /\\.[Dd][Mm][Pp]/)","rule_id":"839dd1e8-eda8-4834-8145-01beeee33acd","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Microsoft\\-Windows\\-Kernel\\-General AND event.code:16 AND \\\\AppData\\\\Local\\\\Temp\\\\SAM\\- AND .dmp)`"}
