{"id":"611eab06-a145-4dfa-a295-3ccc5c20f59a","created_by":"Benjamin Delpy, Florian Roth, Scott Dermott, Sorina Ionescu","name":"Mimikatz DC Sync","tags":["attack.credential_access","attack.s0002","attack.t1003.006"],"interval":"5m","description":"Detects Mimikatz DC sync security events","risk_score":73,"enabled":true,"severity":"high","false_positives":["Valid DC Sync that is not covered by the filters; please report","Local Domain Admin account used for Azure AD Connect"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.Properties:(/.*[Rr][Ee][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Nn][Gg]\\ [Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\ [Cc][Hh][Aa][Nn][Gg][Ee][Ss]\\ [Aa][Ll][Ll].*/ OR /.*1131[Ff]6[Aa][Dd]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*1131[Ff]6[Aa][Aa]\\-9[Cc]07\\-11[Dd]1\\-[Ff]79[Ff]\\-00[Cc]04[Ff][Cc]2[Dd][Cc][Dd]2.*/ OR /.*9923[Aa]32[Aa]\\-3607\\-11[Dd]2\\-[Bb]9[Bb][Ee]\\-0000[Ff]87[Aa]36[Bb]2.*/ OR /.*89[Ee]95[Bb]76\\-444[Dd]\\-4[Cc]62\\-991[Aa]\\-0[Ff][Aa][Cc][Bb][Ee][Dd][Aa]640[Cc].*/) AND winlog.event_data.AccessMask:/0[Xx]100/) AND (NOT ((user.domain:/[Ww][Ii][Nn][Dd][Oo][Ww]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/) OR (user.name:(/[Nn][Tt]\\ [Aa][Uu][Tt].*/ OR /[Mm][Ss][Oo][Ll]_.*/)) OR (user.name:/.*$/))))","rule_id":"611eab06-a145-4dfa-a295-3ccc5c20f59a","timestamp_override":"event.ingested","references":["https://twitter.com/gentilkiwi/status/1003236624925413376","https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2","https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r","https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.Properties:(*Replicating\\ Directory\\ Changes\\ All* OR *1131f6ad\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *1131f6aa\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *9923a32a\\-3607\\-11d2\\-b9be\\-0000f87a36b2* OR *89e95b76\\-444d\\-4c62\\-991a\\-0facbeda640c*) AND winlog.event_data.AccessMask:0x100) AND (NOT ((user.domain:Window\\ Manager) OR (user.name:(NT\\ AUT* OR MSOL_*)) OR (user.name:*$))))`"}
