{"id":"53ba33fd-3a50-4468-a5ef-c583635cfa92","created_by":"Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community","name":"Chafer Activity","tags":["attack.persistence","attack.g0049","attack.t1053.005","attack.s0111","attack.t1543.003","attack.defense_evasion","attack.t1112","attack.command_and_control","attack.t1071.004"],"interval":"5m","description":"Detects Chafer activity attributed to OilRig as reported in Nyotron report in March 2018","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:(/[Ss][Cc]\\ [Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd]\\ [Ss][Cc][Aa][Nn]/ OR /[Uu][Pp][Dd][Aa][Tt][Mm][Aa][Cc][Hh][Ii][Nn][Ee]/))","rule_id":"53ba33fd-3a50-4468-a5ef-c583635cfa92","timestamp_override":"event.ingested","references":["https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:(SC\\ Scheduled\\ Scan OR UpdatMachine))`"}
