{"id":"45eb2ae2-9aa2-4c3a-99a5-6e5077655466","created_by":"Florian Roth","name":"Suspicious Computer Account Name Change CVE-2021-42287","tags":null,"interval":"5m","description":"Detects the renaming of an existing computer account to a account name that doesn't contain a $ symbol as seen in attacks against CVE-2021-42287","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4781 AND winlog.event_data.OldTargetUserName:/.*$.*/) AND (NOT (winlog.event_data.NewTargetUserName:/.*$.*/)))","rule_id":"45eb2ae2-9aa2-4c3a-99a5-6e5077655466","timestamp_override":"event.ingested","references":["https://medium.com/@mvelazco/hunting-for-samaccountname-spoofing-cve-2021-42287-and-domain-controller-impersonation-f704513c8a45"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4781 AND winlog.event_data.OldTargetUserName:*$*) AND (NOT (winlog.event_data.NewTargetUserName:*$*)))`"}
