{"id":"45545954-4016-43c6-855e-eae8f1c369dc","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"Protected Storage Service Access","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Detects access to a protected_storage service over the network. Potential abuse of DPAPI to extract domain backup keys from Domain Controllers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:/.*[Ii][Pp][Cc].*/ AND winlog.event_data.RelativeTargetName:/[Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd]_[Ss][Tt][Oo][Rr][Aa][Gg][Ee]/)","rule_id":"45545954-4016-43c6-855e-eae8f1c369dc","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:*IPC* AND winlog.event_data.RelativeTargetName:protected_storage)`"}
