{"id":"a62b37e0-45d3-48d9-a517-90c1a1b0186b","created_by":"Florian Roth","name":"Eventlog Cleared","tags":["attack.defense_evasion","attack.t1070.001","car.2016-04-002"],"interval":"5m","description":"One of the Windows Eventlogs has been cleared. e.g. caused by \"wevtutil cl\" command execution","risk_score":21,"enabled":true,"severity":"low","false_positives":["Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)","System provisioning (system reset before the golden image creation)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:104 AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]/)","rule_id":"a62b37e0-45d3-48d9-a517-90c1a1b0186b","timestamp_override":"event.ingested","references":["https://twitter.com/deviouspolack/status/832535435960209408","https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:104 AND winlog.provider_name:Microsoft\\-Windows\\-Eventlog)`"}
