{"id":"4ac1f50b-3bd0-4968-902d-868b4647937e","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"DPAPI Domain Backup Key Extraction","tags":["attack.credential_access","attack.t1003.004"],"interval":"5m","description":"Detects tools extracting LSA secret DPAPI domain backup key from Domain Controllers","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4662 AND winlog.event_data.ObjectType:/[Ss][Ee][Cc][Rr][Ee][Tt][Oo][Bb][Jj][Ee][Cc][Tt]/ AND winlog.event_data.AccessMask:/0[Xx]2/ AND winlog.event_data.ObjectName:/.*[Bb][Cc][Kk][Uu][Pp][Kk][Ee][Yy].*/)","rule_id":"4ac1f50b-3bd0-4968-902d-868b4647937e","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4662 AND winlog.event_data.ObjectType:SecretObject AND winlog.event_data.AccessMask:0x2 AND winlog.event_data.ObjectName:*BCKUPKEY*)`"}
