{"id":"32e19d25-4aed-4860-a55a-be99cb0bf7ed","created_by":"Ilyas Ochkov, oscd.community, Chakib Gzenayi (@Chak092), Hosni Mribah","name":"Possible DC Shadow","tags":["attack.credential_access","attack.t1207"],"interval":"5m","description":"Detects DCShadow via create new SPN","risk_score":73,"enabled":true,"severity":"high","false_positives":["Exclude known DCs"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:4742 AND winlog.event_data.ServicePrincipalNames:/.*[Gg][Cc]\\/.*/) OR (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll][Nn][Aa][Mm][Ee]/ AND winlog.event_data.AttributeValue:/[Gg][Cc]\\/.*/)))","rule_id":"32e19d25-4aed-4860-a55a-be99cb0bf7ed","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/blob/ec5bb710499caae6667c7f7311ca9e92c03b9039/rules/windows/builtin/win_dcsync.yml","https://twitter.com/gentilkiwi/status/1003236624925413376","https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2","https://blog.alsid.eu/dcshadow-explained-4510f52fc19d"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:4742 AND winlog.event_data.ServicePrincipalNames:*GC\\/*) OR (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:servicePrincipalName AND winlog.event_data.AttributeValue:GC\\/*)))`"}
