{"id":"74ad4314-482e-4c3e-b237-3f7ed3b9ca8d","created_by":"Florian Roth, frack113","name":"Operation Wocao Activity","tags":["attack.discovery","attack.t1012","attack.defense_evasion","attack.t1036.004","attack.t1027","attack.execution","attack.t1053.005","attack.t1059.001"],"interval":"5m","description":"Detects activity mentioned in Operation Wocao report","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrators that use checkadmin.exe tool to enumerate local administrators"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4799 AND winlog.event_data.TargetUserName:/[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr].*/ AND winlog.event_data.CallerProcessName:/.*\\\\[Cc][Hh][Ee][Cc][Kk][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)","rule_id":"74ad4314-482e-4c3e-b237-3f7ed3b9ca8d","timestamp_override":"event.ingested","references":["https://www.fox-it.com/en/news/whitepapers/operation-wocao-shining-a-light-on-one-of-chinas-hidden-hacking-groups/","https://twitter.com/SBousseaden/status/1207671369963646976"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4799 AND winlog.event_data.TargetUserName:Administr* AND winlog.event_data.CallerProcessName:*\\\\checkadmin.exe)`"}
