{"id":"0255a820-e564-4e40-af2b-6ac61160335c","created_by":"Thomas Patzke","name":"Addition of Domain Trusts","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"Addition of domains is seldom and should be verified for legitimacy.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate extension of domain structure"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4706)","rule_id":"0255a820-e564-4e40-af2b-6ac61160335c","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4706)`"}
