{"id":"fe3a2d49-f255-4d10-935c-bda7391108eb","created_by":"frack113","name":"Suspicious Task Added by Powershell","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.\nWindows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through [Component Object Model](https://attack.mitre.org/techniques/T1559/001)\n","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator PowerShell scripts"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:3 AND processPath:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/))","rule_id":"fe3a2d49-f255-4d10-935c-bda7391108eb","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:3 AND processPath:(*\\\\powershell.exe OR *\\\\pwsh.exe))`"}
