{"id":"1de68c67-af5c-4097-9c85-fe5578e09e67","created_by":"Thomas Patzke","name":"WCE wceaux.dll Access","tags":["attack.credential_access","attack.t1003","attack.s0005"],"interval":"5m","description":"Detects wceaux.dll access while WCE pass-the-hash remote command execution on source host","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4656 OR 4658 OR 4660 OR 4663) AND winlog.event_data.ObjectName:/.*\\\\[Ww][Cc][Ee][Aa][Uu][Xx]\\.[Dd][Ll][Ll]/)","rule_id":"1de68c67-af5c-4097-9c85-fe5578e09e67","timestamp_override":"event.ingested","references":["https://www.jpcert.or.jp/english/pub/sr/ir_research.html","https://jpcertcc.github.io/ToolAnalysisResultSheet"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4656 OR 4658 OR 4660 OR 4663) AND winlog.event_data.ObjectName:*\\\\wceaux.dll)`"}
