{"id":"39698b3f-da92-4bc6-bfb5-645a98386e45","created_by":"elhoim","name":"Win Susp Computer Name Containing Samtheadmin","tags":["cve.2021.42278","cve.2021.42287","attack.persistence","attack.privilege_escalation","attack.t1078"],"interval":"5m","description":"Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"((winlog.event_data.SamAccountName:/[Ss][Aa][Mm][Tt][Hh][Ee][Aa][Dd][Mm][Ii][Nn]\\-.*/ AND winlog.event_data.SamAccountName:/.*$/) OR (winlog.event_data.TargetUserName:/[Ss][Aa][Mm][Tt][Hh][Ee][Aa][Dd][Mm][Ii][Nn]\\-.*/ AND winlog.event_data.TargetUserName:/.*$/))","rule_id":"39698b3f-da92-4bc6-bfb5-645a98386e45","timestamp_override":"event.ingested","references":["https://twitter.com/malmoeb/status/1511760068743766026","https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py","https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`((winlog.event_data.SamAccountName:SAMTHEADMIN\\-* AND winlog.event_data.SamAccountName:*$) OR (winlog.event_data.TargetUserName:SAMTHEADMIN\\-* AND winlog.event_data.TargetUserName:*$))`"}
