{"id":"a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98","created_by":"Markus Neis","name":"LSASS Access Detected via Attack Surface Reduction","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects Access to LSASS Process","risk_score":73,"enabled":true,"severity":"high","false_positives":["Google Chrome GoogleUpdate.exe","Some Taskmgr.exe related activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND (event.code:1121 AND winlog.event_data.Path:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/) AND (NOT ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/ AND process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Aa][Tt][Ii][Ee][Ss][Rr][Xx][Xx]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Vv][Ww][Mm][Ii]64\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss][Tt][Oo][Rr][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)))))","rule_id":"a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-exploit-guard/attack-surface-reduction-exploit-guard?WT.mc_id=twitter"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND (event.code:1121 AND winlog.event_data.Path:*\\\\lsass.exe) AND (NOT ((process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe)) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\atiesrxx.exe OR C\\:\\\\Windows\\\\System32\\\\CompatTelRunner.exe OR C\\:\\\\Windows\\\\System32\\\\msiexec.exe OR C\\:\\\\Windows\\\\System32\\\\nvwmi64.exe OR C\\:\\\\Windows\\\\System32\\\\svchost.exe OR C\\:\\\\Windows\\\\System32\\\\Taskmgr.exe OR C\\:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe OR C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe)) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\DriverStore\\\\* OR C\\:\\\\WINDOWS\\\\Installer\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)))))`"}
