{"id":"d6266bf5-935e-4661-b477-78772735a7cb","created_by":"Florian Roth, wagga","name":"CVE-2020-0688 Exploitation via Eventlog","tags":["attack.initial_access","attack.t1190"],"interval":"5m","description":"Detects the exploitation of Microsoft Exchange vulnerability as described in CVE-2020-0688","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND (event.code:4 AND winlog.provider_name:/[Mm][Ss][Ee][Xx][Cc][Hh][Aa][Nn][Gg][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]/ AND winlog.event_data.Level:/[Ee][Rr][Rr][Oo][Rr]/) AND /\\&__[Vv][Ii][Ee][Ww][Ss][Tt][Aa][Tt][Ee]\\=/)","rule_id":"d6266bf5-935e-4661-b477-78772735a7cb","timestamp_override":"event.ingested","references":["https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/","https://cyberpolygon.com/materials/okhota-na-ataki-ms-exchange-chast-2-cve-2020-0688-cve-2020-16875-cve-2021-24085/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND (event.code:4 AND winlog.provider_name:MSExchange\\ Control\\ Panel AND winlog.event_data.Level:Error) AND &__VIEWSTATE\\=)`"}
