{"id":"71886b70-d7b4-4dbf-acce-87d2ca135262","created_by":"Florian Roth, KevTheHermit, fuzzyf10w","name":"Suspicious Rejected SMB Guest Logon From IP","tags":["attack.credential_access","attack.t1110.001"],"interval":"5m","description":"Detect Attempt PrintNightmare (CVE-2021-1675) Remote code execution in Windows Spooler Service","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Account fallback reasons (after failed login with specific account)"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-SmbClient\\/Security AND event.code:31017 AND winlog.event_data.Description:/.*[Rr][Ee][Jj][Ee][Cc][Tt][Ee][Dd]\\ [Aa][Nn]\\ [Ii][Nn][Ss][Ee][Cc][Uu][Rr][Ee]\\ [Gg][Uu][Ee][Ss][Tt]\\ [Ll][Oo][Gg][Oo][Nn].*/ AND winlog.event_data.UserName:\"\" AND ServerName:/\\\\1.*/)","rule_id":"71886b70-d7b4-4dbf-acce-87d2ca135262","timestamp_override":"event.ingested","references":["https://twitter.com/KevTheHermit/status/1410203844064301056","https://github.com/hhlxf/PrintNightmare","https://github.com/afwu/PrintNightmare"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-SmbClient\\/Security AND event.code:31017 AND winlog.event_data.Description:*Rejected\\ an\\ insecure\\ guest\\ logon* AND winlog.event_data.UserName:\"\" AND ServerName:\\\\1*)`"}
