{"id":"16f5d8ca-44bd-47c8-acbe-6fc95a16c12f","created_by":"@SBousseaden, Florian Roth","name":"RottenPotato Like Attack Pattern","tags":["attack.privilege_escalation","attack.credential_access","attack.t1557.001"],"interval":"5m","description":"Detects logon events that have characteristics of events generated during an attack with RottenPotato and the like","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:3 AND winlog.event_data.TargetUserName:/[Aa][Nn][Oo][Nn][Yy][Mm][Oo][Uu][Ss]_[Ll][Oo][Gg][Oo][Nn]/ AND source.domain:\\- AND source.ip:127.0.0.1)","rule_id":"16f5d8ca-44bd-47c8-acbe-6fc95a16c12f","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1195284233729777665"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4624 AND winlog.event_data.LogonType:3 AND winlog.event_data.TargetUserName:ANONYMOUS_LOGON AND source.domain:\\- AND source.ip:127.0.0.1)`"}
