{"id":"faa031b5-21ed-4e02-8881-2591f98d82ed","created_by":"@neu5ron","name":"Unauthorized System Time Modification","tags":["attack.defense_evasion","attack.t1070.006"],"interval":"5m","description":"Detect scenarios where a potentially unauthorized application or user is modifying the system time.","risk_score":21,"enabled":true,"severity":"low","false_positives":["HyperV or other virtualization technologies with binary not listed in filter portion of detection"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4616 AND (NOT ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Bb][Oo][Xx][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Oo][Oo][Bb][Ee]\\\\[Mm][Ss][Oo][Oo][Bb][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND user.id:/[Ss]\\-1\\-5\\-19/))))","rule_id":"faa031b5-21ed-4e02-8881-2591f98d82ed","timestamp_override":"event.ingested","references":["Private Cuckoo Sandbox (from many years ago, no longer have hash, NDA as well)","Live environment caused by malware","https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4616"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4616 AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\VMware\\\\VMware\\ Tools\\\\vmtoolsd.exe OR C\\:\\\\Windows\\\\System32\\\\VBoxService.exe OR C\\:\\\\Windows\\\\System32\\\\oobe\\\\msoobe.exe)) OR (process.executable:C\\:\\\\Windows\\\\System32\\\\svchost.exe AND user.id:S\\-1\\-5\\-19))))`"}
