{"id":"f7644214-0eb0-4ace-9455-331ec4c09253","created_by":"Florian Roth","name":"Kerberos Manipulation","tags":["attack.credential_access","attack.t1212"],"interval":"5m","description":"This method triggers on rare Kerberos Failure Codes caused by manipulations of Kerberos messages","risk_score":73,"enabled":true,"severity":"high","false_positives":["Faulty legacy applications"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(675 OR 4768 OR 4769 OR 4771) AND winlog.event_data.FailureCode:(/0[Xx]9/ OR /0[Xx][Aa]/ OR /0[Xx][Bb]/ OR /0[Xx][Ff]/ OR /0[Xx]10/ OR /0[Xx]11/ OR /0[Xx]13/ OR /0[Xx]14/ OR /0[Xx]1[Aa]/ OR /0[Xx]1[Ff]/ OR /0[Xx]21/ OR /0[Xx]22/ OR /0[Xx]23/ OR /0[Xx]24/ OR /0[Xx]26/ OR /0[Xx]27/ OR /0[Xx]28/ OR /0[Xx]29/ OR /0[Xx]2[Cc]/ OR /0[Xx]2[Dd]/ OR /0[Xx]2[Ee]/ OR /0[Xx]2[Ff]/ OR /0[Xx]31/ OR /0[Xx]32/ OR /0[Xx]3[Ee]/ OR /0[Xx]3[Ff]/ OR /0[Xx]40/ OR /0[Xx]41/ OR /0[Xx]43/ OR /0[Xx]44/))","rule_id":"f7644214-0eb0-4ace-9455-331ec4c09253","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(675 OR 4768 OR 4769 OR 4771) AND winlog.event_data.FailureCode:(0x9 OR 0xA OR 0xB OR 0xF OR 0x10 OR 0x11 OR 0x13 OR 0x14 OR 0x1A OR 0x1F OR 0x21 OR 0x22 OR 0x23 OR 0x24 OR 0x26 OR 0x27 OR 0x28 OR 0x29 OR 0x2C OR 0x2D OR 0x2E OR 0x2F OR 0x31 OR 0x32 OR 0x3E OR 0x3F OR 0x40 OR 0x41 OR 0x43 OR 0x44))`"}
