{"id":"c462f537-a1e3-41a6-b5fc-b2c2cef9bf82","created_by":"Samir Bousseaden","name":"Suspicious PsExec Execution","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"detects execution of psexec or paexec with renamed service name, this rule helps to filter out the noise if psexec is used for legit purposes or if attacker uses a different psexec client other than sysinternal one","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:/\\\\\\\\\\*\\\\[Ii][Pp][Cc]$/ AND winlog.event_data.RelativeTargetName:(/.*\\-[Ss][Tt][Dd][Ii][Nn]/ OR /.*\\-[Ss][Tt][Dd][Oo][Uu][Tt]/ OR /.*\\-[Ss][Tt][Dd][Ee][Rr][Rr]/)) AND (NOT (winlog.event_data.RelativeTargetName:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc].*/)))","rule_id":"c462f537-a1e3-41a6-b5fc-b2c2cef9bf82","timestamp_override":"event.ingested","references":["https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\IPC$ AND winlog.event_data.RelativeTargetName:(*\\-stdin OR *\\-stdout OR *\\-stderr)) AND (NOT (winlog.event_data.RelativeTargetName:PSEXESVC*)))`"}
