{"id":"91c945bc-2ad1-4799-a591-4d00198a1215","created_by":"Samir Bousseaden","name":"Suspicious Access to Sensitive File Extensions","tags":["attack.collection","attack.t1039"],"interval":"5m","description":"Detects known sensitive file extensions accessed on a network share","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Help Desk operator doing backup or re-imaging end user machine or backup software","Users working with these data types or exchanging message files"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.RelativeTargetName:(/.*\\.[Pp][Ss][Tt]/ OR /.*\\.[Oo][Ss][Tt]/ OR /.*\\.[Mm][Ss][Gg]/ OR /.*\\.[Nn][Ss][Tt]/ OR /.*\\.[Oo][Aa][Bb]/ OR /.*\\.[Ee][Dd][Bb]/ OR /.*\\.[Nn][Ss][Ff]/ OR /.*\\.[Bb][Aa][Kk]/ OR /.*\\.[Dd][Mm][Pp]/ OR /.*\\.[Kk][Ii][Rr][Bb][Ii]/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp][Ss]\\.[Xx][Mm][Ll]/ OR /.*\\.[Rr][Dd][Pp]/))","rule_id":"91c945bc-2ad1-4799-a591-4d00198a1215","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.RelativeTargetName:(*.pst OR *.ost OR *.msg OR *.nst OR *.oab OR *.edb OR *.nsf OR *.bak OR *.dmp OR *.kirbi OR *\\\\groups.xml OR *.rdp))`"}
