{"id":"75edd3fd-7146-48e5-9848-3013d7f0282c","created_by":"Dimitrios Slamaris, @atc_project (fix)","name":"DHCP Server Error Failed Loading the CallOut DLL","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"This rule detects a DHCP server error in which a specified Callout DLL (in registry) could not be loaded","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND event.code:(1031 OR 1032 OR 1034) AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Dd][Hh][Cc][Pp]\\-[Ss][Ee][Rr][Vv][Ee][Rr]/)","rule_id":"75edd3fd-7146-48e5-9848-3013d7f0282c","timestamp_override":"event.ingested","references":["https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html","https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx","https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND event.code:(1031 OR 1032 OR 1034) AND winlog.provider_name:Microsoft\\-Windows\\-DHCP\\-Server)`"}
