{"id":"09570ae5-889e-43ea-aac0-0e1221fb3d95","created_by":"Christian Burkard","name":"Remove Exported Mailbox from Exchange Webserver","tags":["attack.defense_evasion","attack.t1070"],"interval":"5m","description":"Detects removal of an exported Exchange mailbox which could be to cover tracks from ProxyShell exploit","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND Remove\\-MailboxExportRequest AND \\ \\-Identity\\  AND \\ \\-Confirm\\ \\\"False\\\")","rule_id":"09570ae5-889e-43ea-aac0-0e1221fb3d95","timestamp_override":"event.ingested","references":["https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND Remove\\-MailboxExportRequest AND \\ \\-Identity\\  AND \\ \\-Confirm\\ \\\"False\\\")`"}
