{"id":"641a4bfb-c017-44f7-800c-2aee0184ce9b","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use Rundll32","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use Rundll32 in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:/.*\\&\\&.*/ AND winlog.event_data.ImagePath:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND winlog.event_data.ImagePath:/.*[Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll].*/ AND winlog.event_data.ImagePath:/.*[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc]_[Rr][Uu][Nn][Dd][Ll][Ll].*/ AND winlog.event_data.ImagePath:(/.*[Vv][Aa][Ll][Uu][Ee].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Cc][Oo][Mm][Ss][Pp][Ee][Cc].*/ OR /.*[Ii][Ee][Xx].*/))","rule_id":"641a4bfb-c017-44f7-800c-2aee0184ce9b","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:*\\&&* AND winlog.event_data.ImagePath:*rundll32* AND winlog.event_data.ImagePath:*shell32.dll* AND winlog.event_data.ImagePath:*shellexec_rundll* AND winlog.event_data.ImagePath:(*value* OR *invoke* OR *comspec* OR *iex*))`"}
