{"id":"f8931561-97f5-4c46-907f-0a4a592e47a7","created_by":"Florian Roth","name":"Code Integrity Blocked Driver Load","tags":["attack.execution"],"interval":"5m","description":"Detects driver load events that got blocked by Windows code integrity checks","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-CodeIntegrity\\/Operational AND that\\ did\\ not\\ meet\\ the\\ Microsoft\\ signing\\ level\\ requirements)","rule_id":"f8931561-97f5-4c46-907f-0a4a592e47a7","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1483810148602814466"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-CodeIntegrity\\/Operational AND that\\ did\\ not\\ meet\\ the\\ Microsoft\\ signing\\ level\\ requirements)`"}
