{"id":"64d51a51-32a6-49f0-9f3d-17e34d640272","created_by":"Florian Roth","name":"Ngrok Usage with Remote Desktop Service","tags":["attack.command_and_control","attack.t1090"],"interval":"5m","description":"Detects cases in which ngrok, a reverse proxy tool, forwards events to the local RDP port, which could be a sign of malicious behaviour","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-TerminalServices\\-LocalSessionManager\\/Operational AND event.code:21 AND Address:/.*16777216.*/)","rule_id":"64d51a51-32a6-49f0-9f3d-17e34d640272","timestamp_override":"event.ingested","references":["https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg","https://ngrok.com/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-TerminalServices\\-LocalSessionManager\\/Operational AND event.code:21 AND Address:*16777216*)`"}
