{"id":"ea9bf0fa-edec-4fb8-8b78-b119f2528186","created_by":"Bhabesh Raj","name":"Windows Defender AMSI Trigger Detected","tags":["attack.execution","attack.t1059"],"interval":"5m","description":"Detects triggering of AMSI by Windows Defender.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:1116 AND winlog.event_data.Source\\ Name:/[Aa][Mm][Ss][Ii]/)","rule_id":"ea9bf0fa-edec-4fb8-8b78-b119f2528186","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/win32/amsi/how-amsi-helps"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:1116 AND winlog.event_data.Source\\ Name:AMSI)`"}
