{"id":"fd0f5778-d3cb-4c9a-9695-66759d04702a","created_by":"Daniel Bohannon (@Mandiant/@FireEye), oscd.community","name":"Invoke-Obfuscation Obfuscated IEX Invocation","tags":["attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects all variations of obfuscated powershell IEX invocation code generated by Invoke-Obfuscation framework from the code block linked in the references","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND (winlog.event_data.ServiceFileName:/\\$PSHome\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$PSHome\\[/ OR winlog.event_data.ServiceFileName:/\\$ShellId\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$ShellId\\[/ OR winlog.event_data.ServiceFileName:/\\$env:Public\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$env:Public\\[/ OR winlog.event_data.ServiceFileName:/\\$env:ComSpec\\[(\\s*\\d{1,3}\\s*,){2}/ OR winlog.event_data.ServiceFileName:/\\\\*mdr\\*\\W\\s*\\)\\.Name/ OR winlog.event_data.ServiceFileName:/\\$VerbosePreference\\.ToString\\(/ OR winlog.event_data.ServiceFileName:/\\String\\]\\s*\\$VerbosePreference/))","rule_id":"fd0f5778-d3cb-4c9a-9695-66759d04702a","timestamp_override":"event.ingested","references":["https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND (winlog.event_data.ServiceFileName:/\\$PSHome\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$PSHome\\[/ OR winlog.event_data.ServiceFileName:/\\$ShellId\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$ShellId\\[/ OR winlog.event_data.ServiceFileName:/\\$env:Public\\[\\s*\\d{1,3}\\s*\\]\\s*\\+\\s*\\$env:Public\\[/ OR winlog.event_data.ServiceFileName:/\\$env:ComSpec\\[(\\s*\\d{1,3}\\s*,){2}/ OR winlog.event_data.ServiceFileName:/\\\\*mdr\\*\\W\\s*\\)\\.Name/ OR winlog.event_data.ServiceFileName:/\\$VerbosePreference\\.ToString\\(/ OR winlog.event_data.ServiceFileName:/\\String\\]\\s*\\$VerbosePreference/))`"}
