{"id":"f8748f2c-89dc-4d95-afb0-5a2dfdbad332","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"SAM Registry Hive Handle Request","tags":["attack.discovery","attack.t1012","attack.credential_access","attack.t1552.002"],"interval":"5m","description":"Detects handles requested to SAM registry hive","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4656 AND winlog.event_data.ObjectType:/[Kk][Ee][Yy]/ AND winlog.event_data.ObjectName:/.*\\\\[Ss][Aa][Mm]/)","rule_id":"f8748f2c-89dc-4d95-afb0-5a2dfdbad332","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190725024610.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4656 AND winlog.event_data.ObjectType:Key AND winlog.event_data.ObjectName:*\\\\SAM)`"}
