{"id":"66b6be3d-55d0-4f47-9855-d69df21740ea","created_by":"Patrick Bareiss","name":"Local User Creation","tags":["attack.persistence","attack.t1136.001"],"interval":"5m","description":"Detects local user creation on windows servers, which shouldn't happen in an Active Directory environment. Apply this Sigma Use Case on your windows server logs and not on your DC logs.","risk_score":21,"enabled":true,"severity":"low","false_positives":["Domain Controller Logs","Local accounts managed by privileged account management tools"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:4720)","rule_id":"66b6be3d-55d0-4f47-9855-d69df21740ea","timestamp_override":"event.ingested","references":["https://patrick-bareiss.com/detecting-local-user-creation-in-ad-with-sigma/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:4720)`"}
