{"id":"b210394c-ba12-4f89-9117-44a2464b9511","created_by":"Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)","name":"SMB Create Remote File Admin Share","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"Look for non-system accounts SMB accessing a file with write (0x2) access mask via administrative share (i.e C$).","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:/.*[Cc]$/ AND winlog.event_data.AccessMask:/0[Xx]2/) AND (NOT (user.name:/.*$/)))","rule_id":"b210394c-ba12-4f89-9117-44a2464b9511","timestamp_override":"event.ingested","references":["https://github.com/OTRF/ThreatHunter-Playbook/blob/f7a58156dbfc9b019f17f638b8c62d22e557d350/playbooks/WIN-201012004336.yaml","https://securitydatasets.com/notebooks/small/windows/08_lateral_movement/SDWIN-200806015757.html?highlight=create%20file"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:*C$ AND winlog.event_data.AccessMask:0x2) AND (NOT (user.name:*$)))`"}
