{"id":"18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)","name":"Sysmon Channel Reference Deletion","tags":["attack.defense_evasion","attack.t1112"],"interval":"5m","description":"Potential threat actor tampering with Sysmon manifest and eventually disabling it","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:4657 AND winlog.event_data.ObjectName:(/.*[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ee][Rr][Ss]\\\\\\{5770385[Ff]\\-[Cc]22[Aa]\\-43[Ee]0\\-[Bb][Ff]4[Cc]\\-06[Ff]5698[Ff][Ff][Bb][Dd]9\\}.*/ OR /.*[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Cc][Hh][Aa][Nn][Nn][Ee][Ll][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Yy][Ss][Mm][Oo][Nn]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll].*/) AND winlog.event_data.ObjectValueName:/[Ee][Nn][Aa][Bb][Ll][Ee][Dd]/ AND winlog.event_data.NewValue:0) OR (event.code:4663 AND winlog.event_data.ObjectName:(/.*[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ee][Rr][Ss]\\\\\\{5770385[Ff]\\-[Cc]22[Aa]\\-43[Ee]0\\-[Bb][Ff]4[Cc]\\-06[Ff]5698[Ff][Ff][Bb][Dd]9\\}.*/ OR /.*[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Cc][Hh][Aa][Nn][Nn][Ee][Ll][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Yy][Ss][Mm][Oo][Nn]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll].*/) AND winlog.event_data.AccessMask:65536)))","rule_id":"18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc","timestamp_override":"event.ingested","references":["https://twitter.com/Flangvik/status/1283054508084473861","https://twitter.com/SecurityJosh/status/1283027365770276866","https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html","https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:4657 AND winlog.event_data.ObjectName:(*WINEVT\\\\Publishers\\\\\\{5770385f\\-c22a\\-43e0\\-bf4c\\-06f5698ffbd9\\}* OR *WINEVT\\\\Channels\\\\Microsoft\\-Windows\\-Sysmon\\/Operational*) AND winlog.event_data.ObjectValueName:Enabled AND winlog.event_data.NewValue:0) OR (event.code:4663 AND winlog.event_data.ObjectName:(*WINEVT\\\\Publishers\\\\\\{5770385f\\-c22a\\-43e0\\-bf4c\\-06f5698ffbd9\\}* OR *WINEVT\\\\Channels\\\\Microsoft\\-Windows\\-Sysmon\\/Operational*) AND winlog.event_data.AccessMask:65536)))`"}
