{"id":"843544a7-56e0-4dcc-a44f-5cc266dd97d6","created_by":"Teymur Kheirkhabarov, Ecco, Florian Roth","name":"Meterpreter or Cobalt Strike Getsystem Service Installation","tags":["attack.privilege_escalation","attack.t1134.001","attack.t1134.002"],"interval":"5m","description":"Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service installation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Highly unlikely"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND (winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045) AND ((winlog.event_data.ImagePath:/.*[Cc][Mm][Dd].*/ AND winlog.event_data.ImagePath:/.*\\/[Cc].*/ AND winlog.event_data.ImagePath:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ImagePath:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ImagePath:/.*%[Cc][Oo][Mm][Ss][Pp][Ee][Cc]%.*/ AND winlog.event_data.ImagePath:/.*\\/[Cc].*/ AND winlog.event_data.ImagePath:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ImagePath:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ImagePath:/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee].*/ AND winlog.event_data.ImagePath:/.*\\/[Cc].*/ AND winlog.event_data.ImagePath:/.*[Ee][Cc][Hh][Oo].*/ AND winlog.event_data.ImagePath:/.*\\\\[Pp][Ii][Pp][Ee]\\\\.*/) OR (winlog.event_data.ImagePath:/.*[Rr][Uu][Nn][Dd][Ll][Ll]32.*/ AND winlog.event_data.ImagePath:/.*\\.[Dd][Ll][Ll],[Aa].*/ AND winlog.event_data.ImagePath:/.*\\/[Pp]\\:.*/) OR winlog.event_data.ImagePath:/\\\\\\\\127\\.0\\.0\\.1\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\.*/))","rule_id":"843544a7-56e0-4dcc-a44f-5cc266dd97d6","timestamp_override":"event.ingested","references":["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment","https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND (winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045) AND ((winlog.event_data.ImagePath:*cmd* AND winlog.event_data.ImagePath:*\\/c* AND winlog.event_data.ImagePath:*echo* AND winlog.event_data.ImagePath:*\\\\pipe\\\\*) OR (winlog.event_data.ImagePath:*%COMSPEC%* AND winlog.event_data.ImagePath:*\\/c* AND winlog.event_data.ImagePath:*echo* AND winlog.event_data.ImagePath:*\\\\pipe\\\\*) OR (winlog.event_data.ImagePath:*cmd.exe* AND winlog.event_data.ImagePath:*\\/c* AND winlog.event_data.ImagePath:*echo* AND winlog.event_data.ImagePath:*\\\\pipe\\\\*) OR (winlog.event_data.ImagePath:*rundll32* AND winlog.event_data.ImagePath:*.dll,a* AND winlog.event_data.ImagePath:*\\/p\\:*) OR winlog.event_data.ImagePath:\\\\\\\\127.0.0.1\\\\ADMIN$\\\\*))`"}
