{"id":"f6de6525-4509-495a-8a82-1f8b0ed73a00","created_by":"Samir Bousseaden","name":"Remote Task Creation via ATSVC Named Pipe","tags":["attack.lateral_movement","attack.persistence","car.2013-05-004","car.2015-04-001","attack.t1053.002"],"interval":"5m","description":"Detects remote task creation via at.exe or API interacting with ATSVC namedpipe","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:/\\\\\\\\\\*\\\\[Ii][Pp][Cc]$/ AND winlog.event_data.RelativeTargetName:/[Aa][Tt][Ss][Vv][Cc]/ AND winlog.event_data.Accesses:/.*[Ww][Rr][Ii][Tt][Ee][Dd][Aa][Tt][Aa].*/)","rule_id":"f6de6525-4509-495a-8a82-1f8b0ed73a00","timestamp_override":"event.ingested","references":["https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\IPC$ AND winlog.event_data.RelativeTargetName:atsvc AND winlog.event_data.Accesses:*WriteData*)`"}
