{"id":"9c8afa4d-0022-48f0-9456-3712466f9701","created_by":"Daniil Yugoslavskiy, Ian Davis, oscd.community","name":"Tap Driver Installation","tags":["attack.exfiltration","attack.t1048"],"interval":"5m","description":"Well-known TAP software installation. Possible preparation for data exfiltration using tunnelling techniques","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate OpenVPN TAP insntallation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*[Tt][Aa][Pp]0901.*/)","rule_id":"9c8afa4d-0022-48f0-9456-3712466f9701","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:*tap0901*)`"}
