{"id":"42c575ea-e41e-41f1-b248-8093c3e82a28","created_by":"Thomas Patzke","name":"PsExec Tool Execution","tags":["attack.execution","attack.t1569.002","attack.s0029"],"interval":"5m","description":"Detects PsExec service installation and execution events (service and Sysmon)","risk_score":21,"enabled":true,"severity":"low","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND ((winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]/ AND winlog.event_data.ImagePath:/.*\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/) OR (event.code:7036 AND winlog.event_data.ServiceName:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]/)))","rule_id":"42c575ea-e41e-41f1-b248-8093c3e82a28","timestamp_override":"event.ingested","references":["https://www.jpcert.or.jp/english/pub/sr/ir_research.html","https://jpcertcc.github.io/ToolAnalysisResultSheet"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND ((winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:PSEXESVC AND winlog.event_data.ImagePath:*\\\\PSEXESVC.exe) OR (event.code:7036 AND winlog.event_data.ServiceName:PSEXESVC)))`"}
