{"id":"ff151c33-45fa-475d-af4f-c2f93571f4fe","created_by":"Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC","name":"Azure AD Health Monitoring Agent Registry Keys Access","tags":["attack.discovery","attack.t1012"],"interval":"5m","description":"This detection uses Windows security events to detect suspicious access attempts to the registry key of Azure AD Health monitoring agent.\nThis detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object HKLM\\SOFTWARE\\Microsoft\\Microsoft Online\\Reporting\\MonitoringAgent.\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:(4656 OR 4663) AND winlog.event_data.ObjectType:/[Kk][Ee][Yy]/ AND winlog.event_data.ObjectName:/\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ll][Ii][Nn][Ee]\\\\[Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg][Aa][Gg][Ee][Nn][Tt]/) AND (NOT (process.executable:(/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\.[Hh][Ee][Aa][Ll][Tt][Hh]\\.[Aa][Dd][Ff][Ss]\\.[Dd][Ii][Aa][Gg][Nn][Oo][Ss][Tt][Ii][Cc][Ss][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\.[Hh][Ee][Aa][Ll][Tt][Hh]\\.[Aa][Dd][Ff][Ss]\\.[Ii][Nn][Ss][Ii][Gg][Hh][Tt][Ss][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\.[Hh][Ee][Aa][Ll][Tt][Hh]\\.[Aa][Dd][Ff][Ss]\\.[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg][Aa][Gg][Ee][Nn][Tt]\\.[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\.[Hh][Ee][Aa][Ll][Tt][Hh]\\.[Aa][Dd][Ff][Ss]\\.[Pp][Ss][Hh][Ss][Uu][Rr][Rr][Oo][Gg][Aa][Tt][Ee]\\.[Ee][Xx][Ee].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]\\.[Hh][Ee][Aa][Ll][Tt][Hh]\\.[Cc][Oo][Mm][Mm][Oo][Nn]\\.[Cc][Ll][Ii][Ee][Nn][Tt][Ss]\\.[Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\.[Ee][Xx][Ee].*/))))","rule_id":"ff151c33-45fa-475d-af4f-c2f93571f4fe","timestamp_override":"event.ingested","references":["https://o365blog.com/post/hybridhealthagent/","https://github.com/OTRF/Set-AuditRule/blob/c3dec5443414231714d850565d364ca73475ade5/rules/registry/aad_connect_health_monitoring_agent.yml"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:(4656 OR 4663) AND winlog.event_data.ObjectType:Key AND winlog.event_data.ObjectName:\\\\REGISTRY\\\\MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Microsoft\\ Online\\\\Reporting\\\\MonitoringAgent) AND (NOT (process.executable:(*Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe* OR *Microsoft.Identity.Health.Adfs.InsightsService.exe* OR *Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe* OR *Microsoft.Identity.Health.Adfs.PshSurrogate.exe* OR *Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe*))))`"}
