{"id":"a8f29a7b-b137-4446-80a0-b804272f3da2","created_by":"Samir Bousseaden","name":"Persistence and Execution at Scale via GPO Scheduled Task","tags":["attack.persistence","attack.lateral_movement","attack.t1053.005"],"interval":"5m","description":"Detect lateral movement using GPO scheduled task, usually used to deploy ransomware at scale","risk_score":73,"enabled":true,"severity":"high","false_positives":["If the source IP is not localhost then it's super suspicious, better to monitor both local and remote changes to GPO scheduledtasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:/\\\\\\\\\\*\\\\[Ss][Yy][Ss][Vv][Oo][Ll]/ AND winlog.event_data.RelativeTargetName:/.*[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Aa][Ss][Kk][Ss]\\.[Xx][Mm][Ll]/ AND winlog.event_data.Accesses:(/.*[Ww][Rr][Ii][Tt][Ee][Dd][Aa][Tt][Aa].*/ OR /.*%%4417.*/))","rule_id":"a8f29a7b-b137-4446-80a0-b804272f3da2","timestamp_override":"event.ingested","references":["https://twitter.com/menasec1/status/1106899890377052160","https://www.secureworks.com/blog/ransomware-as-a-distraction"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\SYSVOL AND winlog.event_data.RelativeTargetName:*ScheduledTasks.xml AND winlog.event_data.Accesses:(*WriteData* OR *%%4417*))`"}
