{"id":"35bc7e28-ee6b-492f-ab04-da58fcf6402e","created_by":"Tim Shelton (HAWK.IO)","name":"Windows Network Access Suspicious desktop.ini Action","tags":["attack.persistence","attack.t1547.009"],"interval":"5m","description":"Detects unusual processes accessing desktop.ini remotely over network share, which can be leveraged to alter how Explorer displays a folder's content (i.e. renaming files) without changing them on disk.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Read only access list authority"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ObjectType:/[Ff][Ii][Ll][Ee]/ AND winlog.event_data.RelativeTargetName:/.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\.[Ii][Nn][Ii]/ AND winlog.event_data.AccessList:(/.*[Ww][Rr][Ii][Tt][Ee][Dd][Aa][Tt][Aa].*/ OR /.*[Dd][Ee][Ll][Ee][Tt][Ee].*/ OR /.*[Ww][Rr][Ii][Tt][Ee][Dd][Aa][Cc].*/ OR /.*[Aa][Pp][Pp][Ee][Nn][Dd][Dd][Aa][Tt][Aa].*/ OR /.*[Aa][Dd][Dd][Ss][Uu][Bb][Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy].*/))","rule_id":"35bc7e28-ee6b-492f-ab04-da58fcf6402e","timestamp_override":"event.ingested","references":["https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:5145 AND winlog.event_data.ObjectType:File AND winlog.event_data.RelativeTargetName:*\\\\desktop.ini AND winlog.event_data.AccessList:(*WriteData* OR *DELETE* OR *WriteDAC* OR *AppendData* OR *AddSubdirectory*))`"}
