{"id":"4976aa50-8f41-45c6-8b15-ab3fc10e79ed","created_by":"Florian Roth, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community","name":"Credential Dumping Tools Service Execution","tags":["attack.credential_access","attack.execution","attack.t1003.001","attack.t1003.002","attack.t1003.004","attack.t1003.005","attack.t1003.006","attack.t1569.002","attack.s0005"],"interval":"5m","description":"Detects well-known credential dumping tools execution via service execution events","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate Administrator using credential dumping tool for password recovery"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:(/.*[Ff][Gg][Ee][Xx][Ee][Cc].*/ OR /.*[Dd][Uu][Mm][Pp][Ss][Vv][Cc].*/ OR /.*[Cc][Aa][Cc][Hh][Ee][Dd][Uu][Mm][Pp].*/ OR /.*[Mm][Ii][Mm][Ii][Dd][Rr][Vv].*/ OR /.*[Gg][Ss][Ee][Cc][Dd][Uu][Mm][Pp].*/ OR /.*[Ss][Ee][Rr][Vv][Pp][Ww].*/ OR /.*[Pp][Ww][Dd][Uu][Mm][Pp].*/))","rule_id":"4976aa50-8f41-45c6-8b15-ab3fc10e79ed","timestamp_override":"event.ingested","references":["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:(*fgexec* OR *dumpsvc* OR *cachedump* OR *mimidrv* OR *gsecdump* OR *servpw* OR *pwdump*))`"}
