{"id":"c187c075-bb3e-4c62-b4fa-beae0ffc211f","created_by":"frack113","name":"Delete Rule in Windows Firewall with Advanced Security","tags":null,"interval":"5m","description":"A rule has been deleted in the Windows Firewall exception list.","risk_score":47,"enabled":true,"severity":"medium","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:(2006 OR 2033) AND (NOT (winlog.event_data.ModifyingApplication:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR winlog.event_data.ModifyingApplication:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/))))","rule_id":"c187c075-bb3e-4c62-b4fa-beae0ffc211f","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Firewall\\ With\\ Advanced\\ Security\\/Firewall AND event.code:(2006 OR 2033) AND (NOT (winlog.event_data.ModifyingApplication:C\\:\\\\Windows\\\\System32\\\\svchost.exe OR winlog.event_data.ModifyingApplication:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*))))`"}
