{"id":"aa1697b7-d611-4f9a-9cb2-5125b4ccfd5c","created_by":"sigma","name":"Password Dumper Activity on LSASS","tags":["attack.credential_access","attack.t1003.001"],"interval":"5m","description":"Detects process handle on LSASS process with certain access mask and object type SAM_DOMAIN","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4656 AND process.executable:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessMask:/0[Xx]705/ AND winlog.event_data.ObjectType:/[Ss][Aa][Mm]_[Dd][Oo][Mm][Aa][Ii][Nn]/)","rule_id":"aa1697b7-d611-4f9a-9cb2-5125b4ccfd5c","timestamp_override":"event.ingested","references":["https://twitter.com/jackcr/status/807385668833968128"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4656 AND process.executable:*\\\\lsass.exe AND winlog.event_data.AccessMask:0x705 AND winlog.event_data.ObjectType:SAM_DOMAIN)`"}
