{"id":"97b9ce1e-c5ab-11ea-87d0-0242ac130003","created_by":"Bhabesh Raj","name":"PSExec and WMI Process Creations Block","tags":["attack.execution","attack.lateral_movement","attack.t1047","attack.t1569.002"],"interval":"5m","description":"Detects blocking of process creations originating from PSExec and WMI commands","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:1121 AND process.executable:(/.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/))","rule_id":"97b9ce1e-c5ab-11ea-87d0-0242ac130003","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction?WT.mc_id=twitter#block-process-creations-originating-from-psexec-and-wmi-commands","https://twitter.com/duff22b/status/1280166329660497920"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:1121 AND process.executable:(*\\\\wmiprvse.exe OR *\\\\psexesvc.exe))`"}
