{"id":"eeb66bbb-3dde-4582-815a-584aee9fe6d1","created_by":"Arun Chauhan","name":"Correct Execution of Nltest.exe","tags":["attack.discovery","attack.t1482","attack.t1018","attack.t1016"],"interval":"5m","description":"The attacker might use LOLBAS nltest.exe for discovery of domain controllers, domain trusts, parent domain and the current user permissions.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Red team activity","Rare legitimate use by an administrator"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4689 AND process.executable:/.*[Nn][Ll][Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Status:/0[Xx]0/)","rule_id":"eeb66bbb-3dde-4582-815a-584aee9fe6d1","timestamp_override":"event.ingested","references":["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm","https://attack.mitre.org/software/S0359/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4689 AND process.executable:*nltest.exe AND winlog.event_data.Status:0x0)`"}
