{"id":"6daac7fc-77d1-449a-a71a-e6b4d59a0e54","created_by":"Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community","name":"User Couldn't Call a Privileged Service 'LsaRegisterLogonProcess'","tags":["attack.lateral_movement","attack.privilege_escalation","attack.t1558.003"],"interval":"5m","description":"The 'LsaRegisterLogonProcess' function verifies that the application making the function call is a logon process by checking that it has the SeTcbPrivilege privilege set. Possible Rubeus tries to get a handle to LSA.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:4673 AND winlog.event_data.Service:/[Ll][Ss][Aa][Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Ll][Oo][Gg][Oo][Nn][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\(\\)/ AND Keywords:/0[Xx]8010000000000000/)","rule_id":"6daac7fc-77d1-449a-a71a-e6b4d59a0e54","timestamp_override":"event.ingested","references":["https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:4673 AND winlog.event_data.Service:LsaRegisterLogonProcess\\(\\) AND Keywords:0x8010000000000000)`"}
