{"id":"e9faba72-4974-4ab2-a4c5-46e25ad59e9b","created_by":"Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)","name":"VSSAudit Security Event Source Registration","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects the registration of the security event source VSSAudit. It would usually trigger when volume shadow copy operations happen.","risk_score":47,"enabled":true,"severity":"informational","false_positives":["Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\\Windows\\System32\\VSSVC.exe."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND winlog.event_data.AuditSourceName:/[Vv][Ss][Ss][Aa][Uu][Dd][Ii][Tt]/ AND event.code:(4904 OR 4905))","rule_id":"e9faba72-4974-4ab2-a4c5-46e25ad59e9b","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND winlog.event_data.AuditSourceName:VSSAudit AND event.code:(4904 OR 4905))`"}
