{"id":"e6e88853-5f20-4c4a-8d26-cd469fd8d31f","created_by":"Nasreddine Bencherchali","name":"Ntdsutil Abuse","tags":["attack.execution"],"interval":"5m","description":"Detects potential abuse of ntdsutil to dump ntds.dit database","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate backup operation/creating shadow copies"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Ee][Ss][Ee][Nn][Tt]/ AND event.code:(216 OR 325 OR 326 OR 327) AND Data:/.*[Nn][Tt][Dd][Ss]\\.[Dd][Ii][Tt].*/)","rule_id":"e6e88853-5f20-4c4a-8d26-cd469fd8d31f","timestamp_override":"event.ingested","references":["https://twitter.com/mgreen27/status/1558223256704122882","https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:ESENT AND event.code:(216 OR 325 OR 326 OR 327) AND Data:*ntds.dit*)`"}
