{"id":"7b687634-ab20-11ea-bb37-0242ac130002","created_by":"Cian Heasley","name":"Windows Pcap Drivers","tags":["attack.discovery","attack.credential_access","attack.t1040"],"interval":"5m","description":"Detects Windows Pcap driver installation based on a list of associated .sys files.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:(/.*[Pp][Cc][Aa][Pp].*/ OR /.*[Nn][Pp][Cc][Aa][Pp].*/ OR /.*[Nn][Pp][Ff].*/ OR /.*[Nn][Mm]3.*/ OR /.*[Nn][Dd][Ii][Ss][Cc][Aa][Pp].*/ OR /.*[Nn][Mm][Nn][Tt].*/ OR /.*[Ww][Ii][Nn][Dd][Ii][Vv][Ee][Rr][Tt].*/ OR /.*[Uu][Ss][Bb][Pp][Cc][Aa][Pp].*/ OR /.*[Pp][Kk][Tt][Mm][Oo][Nn].*/))","rule_id":"7b687634-ab20-11ea-bb37-0242ac130002","timestamp_override":"event.ingested","references":["https://ragged-lab.blogspot.com/2020/06/capturing-pcap-driver-installations.html#more"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:(*pcap* OR *npcap* OR *npf* OR *nm3* OR *ndiscap* OR *nmnt* OR *windivert* OR *USBPcap* OR *pktmon*))`"}
