{"id":"31d68132-4038-47c7-8f8e-635a39a7c174","created_by":"Adeem Mawani","name":"LDAP Reconnaissance / Active Directory Enumeration","tags":["attack.discovery","attack.t1069.002","attack.t1087.002","attack.t1482"],"interval":"5m","description":"Detects possible Active Directory enumeration via LDAP","risk_score":47,"enabled":true,"severity":"medium","false_positives":null,"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(((event.code:30 AND SearchFilter:(/.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483648\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483656\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483652\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483650\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=805306369\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=805306368\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=536870913\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=536870912\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=268435457\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=268435456\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Cc][Oo][Nn][Tt][Aa][Ii][Nn][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Oo][Rr][Gg][Aa][Nn][Ii][Zz][Aa][Tt][Ii][Oo][Nn][Aa][Ll][Uu][Nn][Ii][Tt]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Nn][Tt][Dd][Ss][Dd][Ss][Aa]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Ss][Ee][Rr][Vv][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Dd][Oo][Mm][Aa][Ii][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Pp][Ee][Rr][Ss][Oo][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Gg][Rr][Oo][Uu][Pp]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Uu][Ss][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Dd][Oo][Mm][Aa][Ii][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Ss][Ee][Rr][Vv][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Gg][Rr][Oo][Uu][Pp]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Uu][Ss][Ee][Rr]\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=521\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=516\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=515\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=512\\).*/ OR /.*[Dd][Oo][Mm][Aa][Ii][Nn]\\ [Aa][Dd][Mm][Ii][Nn][Ss].*/)) AND (NOT (event.code:30 AND SearchFilter:(/.*\\([Dd][Oo][Mm][Aa][Ii][Nn][Ss][Ii][Dd]\\=.*\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Ss][Ii][Dd]\\=.*\\).*/)))) OR (event.code:30 AND SearchFilter:(/.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=4194304\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2097152\\).*/ OR /.*\\!\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=1048574\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=524288\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=65536\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=8192\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=544\\).*/ OR /.*\\!\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2\\).*/ OR /.*[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Aa][Cc][Tt][Oo][Nn][Bb][Ee][Hh][Aa][Ll][Ff][Oo][Ff][Oo][Tt][Hh][Ee][Rr][Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy].*/ OR /.*[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Tt][Oo].*/ OR /.*\\([Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ee][Xx][Pp][Ii][Rr][Ee][Ss]\\=9223372036854775807\\).*/ OR /.*\\([Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ee][Xx][Pp][Ii][Rr][Ee][Ss]\\=0\\).*/ OR /.*\\([Aa][Dd][Mm][Ii][Nn][Cc][Oo][Uu][Nn][Tt]\\=1\\).*/ OR /.*[Mm][Ss]\\-[Mm][Cc][Ss]\\-[Aa][Dd][Mm][Pp][Ww][Dd].*/)))","rule_id":"31d68132-4038-47c7-8f8e-635a39a7c174","timestamp_override":"event.ingested","references":["https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/hunting-for-reconnaissance-activities-using-ldap-search-filters/ba-p/824726","https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/Recon/PowerView.ps1","https://github.com/BloodHoundAD/SharpHound3/blob/7d96b991b1887ff50349ce59c80980bc0d95c86a/SharpHound3/LdapBuilder.cs"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(((event.code:30 AND SearchFilter:(*\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483648\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483656\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483652\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483650\\)* OR *\\(sAMAccountType\\=805306369\\)* OR *\\(sAMAccountType\\=805306368\\)* OR *\\(sAMAccountType\\=536870913\\)* OR *\\(sAMAccountType\\=536870912\\)* OR *\\(sAMAccountType\\=268435457\\)* OR *\\(sAMAccountType\\=268435456\\)* OR *\\(objectCategory\\=groupPolicyContainer\\)* OR *\\(objectCategory\\=organizationalUnit\\)* OR *\\(objectCategory\\=Computer\\)* OR *\\(objectCategory\\=nTDSDSA\\)* OR *\\(objectCategory\\=server\\)* OR *\\(objectCategory\\=domain\\)* OR *\\(objectCategory\\=person\\)* OR *\\(objectCategory\\=group\\)* OR *\\(objectCategory\\=user\\)* OR *\\(objectClass\\=trustedDomain\\)* OR *\\(objectClass\\=computer\\)* OR *\\(objectClass\\=server\\)* OR *\\(objectClass\\=group\\)* OR *\\(objectClass\\=user\\)* OR *\\(primaryGroupID\\=521\\)* OR *\\(primaryGroupID\\=516\\)* OR *\\(primaryGroupID\\=515\\)* OR *\\(primaryGroupID\\=512\\)* OR *Domain\\ Admins*)) AND (NOT (event.code:30 AND SearchFilter:(*\\(domainSid\\=*\\)* OR *\\(objectSid\\=*\\)*)))) OR (event.code:30 AND SearchFilter:(*\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=4194304\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=2097152\\)* OR *\\!\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=1048574\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=524288\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=65536\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=8192\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=544\\)* OR *\\!\\(UserAccountControl\\:1.2.840.113556.1.4.803\\:\\=2\\)* OR *msDS\\-AllowedToActOnBehalfOfOtherIdentity* OR *msDS\\-AllowedToDelegateTo* OR *\\(accountExpires\\=9223372036854775807\\)* OR *\\(accountExpires\\=0\\)* OR *\\(adminCount\\=1\\)* OR *ms\\-MCS\\-AdmPwd*)))`"}
