{"id":"1a4bd6e3-4c6e-405d-a9a3-53a116e341d4","created_by":"Florian Roth","name":"USB Device Plugged","tags":["attack.initial_access","attack.t1200"],"interval":"5m","description":"Detects plugged USB devices","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-DriverFrameworks\\-UserMode\\/Operational AND event.code:(2003 OR 2100 OR 2102))","rule_id":"1a4bd6e3-4c6e-405d-a9a3-53a116e341d4","timestamp_override":"event.ingested","references":["https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/","https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-DriverFrameworks\\-UserMode\\/Operational AND event.code:(2003 OR 2100 OR 2102))`"}
