{"id":"52a85084-6989-40c3-8f32-091e12e13f09","created_by":"Omer Faruk Celik","name":"smbexec.py Service Installation","tags":["attack.lateral_movement","attack.execution","attack.t1021.002","attack.t1569.002"],"interval":"5m","description":"Detects the use of smbexec.py tool by detecting a specific service installation","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Bb][Tt][Oo][Bb][Tt][Oo]/ AND winlog.event_data.ImagePath:/.*\\\\[Ee][Xx][Ee][Cc][Uu][Tt][Ee]\\.[Bb][Aa][Tt]/)","rule_id":"52a85084-6989-40c3-8f32-091e12e13f09","timestamp_override":"event.ingested","references":["https://blog.ropnop.com/using-credentials-to-own-windows-boxes-part-2-psexec-and-services/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:BTOBTO AND winlog.event_data.ImagePath:*\\\\execute.bat)`"}
