{"id":"0b0ea3cc-99c8-4730-9c53-45deee2a4c86","created_by":"Bhabesh Raj","name":"Microsoft Defender Blocked from Loading Unsigned DLL","tags":["attack.defense_evasion","attack.t1574.002"],"interval":"5m","description":"Detects Code Integrity (CI) engine blocking Microsoft Defender's processes (MpCmdRun and NisSrv) from loading unsigned DLLs which may be an attempt to sideload arbitrary DLL","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(event.code:(11 OR 12) AND ProcessPath:(/.*\\\\[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ii][Ss][Ss][Rr][Vv]\\.[Ee][Xx][Ee]/))","rule_id":"0b0ea3cc-99c8-4730-9c53-45deee2a4c86","timestamp_override":"event.ingested","references":["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(event.code:(11 OR 12) AND ProcessPath:(*\\\\MpCmdRun.exe OR *\\\\NisSrv.exe))`"}
