{"id":"7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Use MSHTA","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via use MSHTA in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:/.*[Mm][Ss][Hh][Tt][Aa].*/ AND winlog.event_data.ImagePath:/.*[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\:[Cc][Rr][Ee][Aa][Tt][Ee][Oo][Bb][Jj][Ee][Cc][Tt].*/)","rule_id":"7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:*mshta* AND winlog.event_data.ImagePath:*vbscript\\:createobject*)`"}
