{"id":"530a6faa-ff3d-4022-b315-50828e77eef5","created_by":"Nasreddine Bencherchali","name":"Anydesk Remote Access Software Service Installation","tags":["attack.persistence"],"interval":"5m","description":"Detects the installation of the anydesk software service. Which could be an indication of anydesk abuse if you the software isn't already used.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate usage of the anydesk tool"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Aa][Nn][Yy][Dd][Ee][Ss][Kk]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee]/)","rule_id":"530a6faa-ff3d-4022-b315-50828e77eef5","timestamp_override":"event.ingested","references":["https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:AnyDesk\\ Service)`"}
