{"id":"9a4ff3b8-6187-4fd2-8e8b-e0eae1129495","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"SysKey Registry Keys Access","tags":["attack.discovery","attack.t1012"],"interval":"5m","description":"Detects handle requests and access operations to specific registry keys to calculate the SysKey","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:(4656 OR 4663) AND winlog.event_data.ObjectType:/[Kk][Ee][Yy]/ AND winlog.event_data.ObjectName:(/.*[Ll][Ss][Aa]\\\\[Jj][Dd]/ OR /.*[Ll][Ss][Aa]\\\\[Gg][Bb][Gg]/ OR /.*[Ll][Ss][Aa]\\\\[Ss][Kk][Ee][Ww]1/ OR /.*[Ll][Ss][Aa]\\\\[Dd][Aa][Tt][Aa]/))","rule_id":"9a4ff3b8-6187-4fd2-8e8b-e0eae1129495","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190625024610.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:(4656 OR 4663) AND winlog.event_data.ObjectType:key AND winlog.event_data.ObjectName:(*lsa\\\\JD OR *lsa\\\\GBG OR *lsa\\\\Skew1 OR *lsa\\\\Data))`"}
