{"id":"1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2","created_by":"pH-T","name":"Service Installation with Suspicious Folder Pattern","tags":["attack.persistence","attack.privilege_escalation","car.2013-09-005","attack.t1543.003"],"interval":"5m","description":"Detects service installation with suspicious folder patterns","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND (winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045) AND (winlog.event_data.ImagePath:/[Cc]:\\\\[Pp]rogram[Dd]ata\\\\.{1,9}\\.exe.*/ OR winlog.event_data.ImagePath:/[Cc]:\\\\.{1,9}\\.exe.*/))","rule_id":"1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND (winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045) AND (winlog.event_data.ImagePath:/[Cc]:\\\\[Pp]rogram[Dd]ata\\\\.{1,9}\\.exe.*/ OR winlog.event_data.ImagePath:/[Cc]:\\\\.{1,9}\\.exe.*/))`"}
