{"id":"c265cf08-3f99-46c1-8d59-328247057d57","created_by":"Florian Roth","name":"User Added to Local Administrators","tags":["attack.privilege_escalation","attack.t1078","attack.persistence","attack.t1098"],"interval":"5m","description":"This rule triggers on user accounts that are added to the local Administrators group, which could be legitimate activity or a sign of privilege escalation activity","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\-[Aa][Uu][Dd][Ii][Tt][Ii][Nn][Gg]/ AND event.code:4732) AND (winlog.event_data.TargetUserName:/[Aa][Dd][Mm][Ii][Nn][Ii][Ss][Tt][Rr].*/ OR winlog.event_data.TargetSid:/[Ss]\\-1\\-5\\-32\\-544/)) AND (NOT (user.name:/.*$/)))","rule_id":"c265cf08-3f99-46c1-8d59-328247057d57","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((winlog.provider_name:Microsoft\\-Windows\\-Security\\-Auditing AND event.code:4732) AND (winlog.event_data.TargetUserName:Administr* OR winlog.event_data.TargetSid:S\\-1\\-5\\-32\\-544)) AND (NOT (user.name:*$)))`"}
