{"id":"4f86b304-3e02-40e3-aa5d-e88a167c9617","created_by":"David Strassegger, Tim Shelton","name":"Scheduled Task Deletion","tags":["attack.execution","attack.privilege_escalation","car.2013-08-001","attack.t1053.005"],"interval":"5m","description":"Detects scheduled task deletion events. Scheduled tasks are likely to be deleted if not used for persistence. Malicious Software often creates tasks directly under the root node e.g. \\TASKNAME","risk_score":21,"enabled":true,"severity":"low","false_positives":["Software installation"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4699 AND (NOT ((winlog.event_data.TaskName:/\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Rr][Ee][Mm][Oo][Vv][Aa][Ll][Tt][Oo][Oo][Ll][Ss]\\\\[Mm][Rr][Tt]_[Ee][Rr][Rr][Oo][Rr]_[Hh][Bb]/))))","rule_id":"4f86b304-3e02-40e3-aa5d-e88a167c9617","timestamp_override":"event.ingested","references":["https://twitter.com/matthewdunwoody/status/1352356685982146562","https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4699"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4699 AND (NOT ((winlog.event_data.TaskName:\\\\Microsoft\\\\Windows\\\\RemovalTools\\\\MRT_ERROR_HB))))`"}
