{"id":"dae8171c-5ec6-4396-b210-8466585b53e9","created_by":"Roberto Rodriguez @Cyb3rWard0g, Tim Shelton","name":"SCM Database Privileged Operation","tags":["attack.privilege_escalation","attack.t1548"],"interval":"5m","description":"Detects non-system users performing privileged operation os the SCM database","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4674 AND winlog.event_data.ObjectType:/[Ss][Cc]_[Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt]/ AND winlog.event_data.ObjectName:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Aa][Cc][Tt][Ii][Vv][Ee]/ AND winlog.event_data.PrivilegeList:/[Ss][Ee][Tt][Aa][Kk][Ee][Oo][Ww][Nn][Ee][Rr][Ss][Hh][Ii][Pp][Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee]/) AND (NOT (winlog.logon.id:/0[Xx]3[Ee]4/ AND process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/)))","rule_id":"dae8171c-5ec6-4396-b210-8466585b53e9","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190826010110.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4674 AND winlog.event_data.ObjectType:SC_MANAGER\\ OBJECT AND winlog.event_data.ObjectName:servicesactive AND winlog.event_data.PrivilegeList:SeTakeOwnershipPrivilege) AND (NOT (winlog.logon.id:0x3e4 AND process.executable:*\\:\\\\Windows\\\\System32\\\\services.exe)))`"}
