{"id":"ca83e9f3-657a-45d0-88d6-c1ac280caf53","created_by":"Florian Roth","name":"New Service Uses Double Ampersand in Path","tags":["attack.defense_evasion","attack.t1027"],"interval":"5m","description":"Detects a service installation that uses a suspicious double ampersand used in the image path value","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ImagePath:/.*\\&\\&.*/)","rule_id":"ca83e9f3-657a-45d0-88d6-c1ac280caf53","timestamp_override":"event.ingested","references":["Internal Research"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ImagePath:*\\&&*)`"}
