{"id":"fe34868f-6e0e-4882-81f6-c43aa8f15b62","created_by":"Ján Trenčanský, frack113","name":"Windows Defender Threat Detection Disabled","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects disabling Windows Defender threat protection","risk_score":21,"enabled":true,"severity":"low","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:(5001 OR 5010 OR 5012 OR 5101))","rule_id":"fe34868f-6e0e-4882-81f6-c43aa8f15b62","timestamp_override":"event.ingested","references":["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus","https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:(5001 OR 5010 OR 5012 OR 5101))`"}
