{"id":"ce5678bb-b9aa-4fb5-be4b-e57f686256ad","created_by":"James Pemberton","name":"Potential Remote Desktop Connection to Non-Domain Host","tags":["attack.command_and_control","attack.t1219"],"interval":"5m","description":"Detects logons using NTLM to hosts that are potentially not part of the domain.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Host connections to valid domains, exclude these.","Host connections not using host FQDN.","Host connections to external legitimate domains."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8001 AND TargetName:/[Tt][Ee][Rr][Mm][Ss][Rr][Vv].*/)","rule_id":"ce5678bb-b9aa-4fb5-be4b-e57f686256ad","timestamp_override":"event.ingested","references":["n/a"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-NTLM\\/Operational AND event.code:8001 AND TargetName:TERMSRV*)`"}
