{"id":"f512acbf-e662-4903-843e-97ce4652b740","created_by":"Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)","name":"Volume Shadow Copy Mount","tags":["attack.credential_access","attack.t1003.002"],"interval":"5m","description":"Detects volume shadow copy mount via windows event log","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate use of volume shadow copy mounts (backups maybe)."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Nn][Tt][Ff][Ss]/ AND event.code:98 AND winlog.event_data.DeviceName:/.*[Hh][Aa][Rr][Dd][Dd][Ii][Ss][Kk][Vv][Oo][Ll][Uu][Mm][Ee][Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/)","rule_id":"f512acbf-e662-4903-843e-97ce4652b740","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Microsoft\\-Windows\\-Ntfs AND event.code:98 AND winlog.event_data.DeviceName:*HarddiskVolumeShadowCopy*)`"}
