{"id":"9db37458-4df2-46a5-95ab-307e7f29e675","created_by":"Jose Rodriguez @Cyb3rPandaH","name":"Exchange Set OabVirtualDirectory ExternalUrl Property","tags":["attack.persistence","attack.t1505.003"],"interval":"5m","description":"Rule to detect an adversary setting OabVirtualDirectory External URL property to a script in Exchange Management log","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND Set\\-OabVirtualDirectory AND ExternalUrl AND Page_Load AND script)","rule_id":"9db37458-4df2-46a5-95ab-307e7f29e675","timestamp_override":"event.ingested","references":["https://twitter.com/OTR_Community/status/1371053369071132675"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND Set\\-OabVirtualDirectory AND ExternalUrl AND Page_Load AND script)`"}
