{"id":"c92f1896-d1d2-43c3-92d5-7a5b35c217bb","created_by":"Florian Roth, @testanull","name":"Possible Exploitation of Exchange RCE CVE-2021-42321","tags":["attack.lateral_movement","attack.t1210"],"interval":"5m","description":"Detects log entries that appear in exploitation attempts against MS Exchange RCE CVE-2021-42321","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown, please report false positives via https://github.com/SigmaHQ/sigma/issues"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND event.code:(6 OR 8) AND Data:(/.*[Cc][Mm][Dd][Ll][Ee][Tt]\\ [Ff][Aa][Ii][Ll][Ee][Dd]\\.\\ [Cc][Mm][Dd][Ll][Ee][Tt]\\ [Gg][Ee][Tt]\\-[Aa][Pp][Pp],\\ .*/ OR /.*[Tt][Aa][Ss][Kk]\\ [Gg][Ee][Tt]\\-[Aa][Pp][Pp]\\ [Tt][Hh][Rr][Oo][Ww][Ii][Nn][Gg]\\ [Uu][Nn][Hh][Aa][Nn][Dd][Ll][Ee][Dd]\\ [Ee][Xx][Cc][Ee][Pp][Tt][Ii][Oo][Nn]\\:\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\.[Ii][Nn][Vv][Aa][Ll][Ii][Dd][Cc][Aa][Ss][Tt][Ee][Xx][Cc][Ee][Pp][Tt][Ii][Oo][Nn]\\:.*/))","rule_id":"c92f1896-d1d2-43c3-92d5-7a5b35c217bb","timestamp_override":"event.ingested","references":["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-42321"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND event.code:(6 OR 8) AND Data:(*Cmdlet\\ failed.\\ Cmdlet\\ Get\\-App,\\ * OR *Task\\ Get\\-App\\ throwing\\ unhandled\\ exception\\:\\ System.InvalidCastException\\:*))`"}
