{"id":"311b6ce2-7890-4383-a8c2-663a9f6b43cd","created_by":"@neu5ron","name":"Enabled User Right in AD to Control User Objects","tags":["attack.persistence","attack.t1098"],"interval":"5m","description":"Detects scenario where if a user is assigned the SeEnableDelegationPrivilege right in Active Directory it would allow control of other AD user objects.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4704 AND winlog.event_data.PrivilegeList:/.*[Ss][Ee][Ee][Nn][Aa][Bb][Ll][Ee][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ii][Oo][Nn][Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee].*/)","rule_id":"311b6ce2-7890-4383-a8c2-663a9f6b43cd","timestamp_override":"event.ingested","references":["https://www.harmj0y.net/blog/activedirectory/the-most-dangerous-user-right-you-probably-have-never-heard-of/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4704 AND winlog.event_data.PrivilegeList:*SeEnableDelegationPrivilege*)`"}
