{"id":"35ba1d85-724d-42a3-889f-2e2362bcaf23","created_by":"Samir Bousseaden","name":"AD Privileged Users or Groups Reconnaissance","tags":["attack.discovery","attack.t1087.002"],"interval":"5m","description":"Detect priv users or groups recon based on 4661 eventid and known privileged users or groups SIDs","risk_score":73,"enabled":true,"severity":"high","false_positives":["If source account name is not an admin then its super suspicious"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:4661 AND winlog.event_data.ObjectType:(/[Ss][Aa][Mm]_[Uu][Ss][Ee][Rr]/ OR /[Ss][Aa][Mm]_[Gg][Rr][Oo][Uu][Pp]/)) AND (winlog.event_data.ObjectName:(/.*\\-512/ OR /.*\\-502/ OR /.*\\-500/ OR /.*\\-505/ OR /.*\\-519/ OR /.*\\-520/ OR /.*\\-544/ OR /.*\\-551/ OR /.*\\-555/) OR winlog.event_data.ObjectName:/.*[Aa][Dd][Mm][Ii][Nn].*/)) AND (NOT (user.name:/.*$/)))","rule_id":"35ba1d85-724d-42a3-889f-2e2362bcaf23","timestamp_override":"event.ingested","references":["https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:4661 AND winlog.event_data.ObjectType:(SAM_USER OR SAM_GROUP)) AND (winlog.event_data.ObjectName:(*\\-512 OR *\\-502 OR *\\-500 OR *\\-505 OR *\\-519 OR *\\-520 OR *\\-544 OR *\\-551 OR *\\-555) OR winlog.event_data.ObjectName:*admin*)) AND (NOT (user.name:*$)))`"}
