{"id":"941e5c45-cda7-4864-8cea-bbb7458d194a","created_by":"oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st, Tim Shelton","name":"Suspicious Remote Logon with Explicit Credentials","tags":["attack.t1078","attack.lateral_movement"],"interval":"5m","description":"Detects suspicious processes logging on with explicit credentials","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrators that use the RunAS command or scheduled tasks"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4648 AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Rr][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/)) AND (NOT ((winlog.event_data.TargetServerName:/[Ll][Oo][Cc][Aa][Ll][Hh][Oo][Ss][Tt]/) OR (user.name:/.*$/ AND winlog.event_data.TargetUserName:/.*$/))))","rule_id":"941e5c45-cda7-4864-8cea-bbb7458d194a","timestamp_override":"event.ingested","references":["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4648 AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\winrs.exe OR *\\\\wmic.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\reg.exe)) AND (NOT ((winlog.event_data.TargetServerName:localhost) OR (user.name:*$ AND winlog.event_data.TargetUserName:*$))))`"}
