{"id":"f69a87ea-955e-4fb4-adb2-bb9fd6685632","created_by":"Keith Wright","name":"External Disk Drive Or USB Storage Device","tags":["attack.t1091","attack.t1200","attack.lateral_movement","attack.initial_access"],"interval":"5m","description":"Detects external diskdrives or plugged in USB devices , EventID 6416 on windows 10 or later","risk_score":21,"enabled":true,"severity":"low","false_positives":["Legitimate administrative activity"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:6416 AND winlog.event_data.ClassName:/[Dd][Ii][Ss][Kk][Dd][Rr][Ii][Vv][Ee]/) OR winlog.event_data.DeviceDescription:/[Uu][Ss][Bb]\\ [Mm][Aa][Ss][Ss]\\ [Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\ [Dd][Ee][Vv][Ii][Cc][Ee]/))","rule_id":"f69a87ea-955e-4fb4-adb2-bb9fd6685632","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:6416 AND winlog.event_data.ClassName:DiskDrive) OR winlog.event_data.DeviceDescription:USB\\ Mass\\ Storage\\ Device))`"}
