{"id":"ee9ca27c-9bd7-4cee-9b01-6e906be7cae3","created_by":"Nasreddine Bencherchali","name":"New PDQDeploy Service - Server Side","tags":["attack.privilege_escalation","attack.t1543.003"],"interval":"5m","description":"Detects a PDQDeploy service installation which indicates that PDQDeploy was installed on the machines.\nPDQDeploy can be abused by attackers to remotely install packages or execute commands on target machines\n","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Legitimate use of the tool"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND (winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045) AND (winlog.event_data.ImagePath:/.*[Pp][Dd][Qq][Dd][Ee][Pp][Ll][Oo][Yy][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee].*/ OR winlog.event_data.ServiceName:(/[Pp][Dd][Qq][Dd][Ee][Pp][Ll][Oo][Yy]/ OR /[Pp][Dd][Qq]\\ [Dd][Ee][Pp][Ll][Oo][Yy]/)))","rule_id":"ee9ca27c-9bd7-4cee-9b01-6e906be7cae3","timestamp_override":"event.ingested","references":["https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND (winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045) AND (winlog.event_data.ImagePath:*PDQDeployService.exe* OR winlog.event_data.ServiceName:(PDQDeploy OR PDQ\\ Deploy)))`"}
