{"id":"028c7842-4243-41cd-be6f-12f3cf1a26c7","created_by":"Roberto Rodriguez @Cyb3rWard0g","name":"AD Object WriteDAC Access","tags":["attack.defense_evasion","attack.t1222.001"],"interval":"5m","description":"Detects WRITE_DAC access to a domain object","risk_score":99,"enabled":true,"severity":"critical","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4662 AND winlog.event_data.ObjectServer:/[Dd][Ss]/ AND winlog.event_data.AccessMask:/0[Xx]40000/ AND winlog.event_data.ObjectType:(19195a5b\\-6da0\\-11d0\\-afd3\\-00c04fd930c9 OR /[Dd][Oo][Mm][Aa][Ii][Nn][Dd][Nn][Ss]/))","rule_id":"028c7842-4243-41cd-be6f-12f3cf1a26c7","timestamp_override":"event.ingested","references":["https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190101151110.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4662 AND winlog.event_data.ObjectServer:DS AND winlog.event_data.AccessMask:0x40000 AND winlog.event_data.ObjectType:(19195a5b\\-6da0\\-11d0\\-afd3\\-00c04fd930c9 OR domainDNS))`"}
