{"id":"c7c8aa1c-5aff-408e-828b-998e3620b341","created_by":"Nasreddine Bencherchali","name":"MSI Installation From Suspicious Locations","tags":["attack.execution"],"interval":"5m","description":"Detects MSI package installation from suspicious locations","risk_score":73,"enabled":true,"severity":"high","false_positives":["Some false positives may occure depending on the environnement"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Mm][Ss][Ii][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]/ AND event.code:(1040 OR 1042) AND Data:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\\\\\\\*/))","rule_id":"c7c8aa1c-5aff-408e-828b-998e3620b341","timestamp_override":"event.ingested","references":["https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:MsiInstaller AND event.code:(1040 OR 1042) AND Data:(*\\\\Users\\\\Public\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\\\\\\\*))`"}
