{"id":"6fb63b40-e02a-403e-9ffd-3bcc1d749442","created_by":"Bartlomiej Czyz, Relativity","name":"Metasploit Or Impacket Service Installation Via SMB PsExec","tags":["attack.lateral_movement","attack.t1021.002","attack.t1570","attack.execution","attack.t1569.002"],"interval":"5m","description":"Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and Impacket psexec.py by triggering on specific service installation","risk_score":73,"enabled":true,"severity":"high","false_positives":["Possible, different agents with a 8 character binary and a 4, 8 or 16 character service name"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4697 AND winlog.event_data.ServiceFileName:/%systemroot%\\\\[a-zA-Z]{8}\\.exe/ AND service.name:/(^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)/ AND winlog.event_data.ServiceStartType:3 AND winlog.event_data.ServiceType:/0[Xx]10/) AND (NOT (service.name:/[Pp][Ss][Ee][Xx][Ee][Ss][Vv][Cc]/)))","rule_id":"6fb63b40-e02a-403e-9ffd-3bcc1d749442","timestamp_override":"event.ingested","references":["https://bczyz1.github.io/2021/01/30/psexec.html"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4697 AND winlog.event_data.ServiceFileName:/%systemroot%\\\\[a-zA-Z]{8}\\.exe/ AND service.name:/(^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)/ AND winlog.event_data.ServiceStartType:3 AND winlog.event_data.ServiceType:0x10) AND (NOT (service.name:PSEXESVC)))`"}
