{"id":"c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa","created_by":"Tobias Michalski","name":"Failed MSExchange Transport Agent Installation","tags":["attack.persistence","attack.t1505.002"],"interval":"5m","description":"Detects a failed installation of a Exchange Transport Agent","risk_score":73,"enabled":true,"severity":"high","false_positives":["Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator for this."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:MSExchange\\ Management AND event.code:6 AND Data:/.*[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\-[Tt][Rr][Aa][Nn][Ss][Pp][Oo][Rr][Tt][Aa][Gg][Ee][Nn][Tt].*/)","rule_id":"c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa","timestamp_override":"event.ingested","references":["https://twitter.com/blueteamsec1/status/1401290874202382336?s=20"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:MSExchange\\ Management AND event.code:6 AND Data:*Install\\-TransportAgent*)`"}
