{"id":"91c49341-e2ef-40c0-ac45-49ec5c3fe26c","created_by":"Nasreddine Bencherchali","name":"RTCore Suspicious Service Installation","tags":["attack.persistence"],"interval":"5m","description":"Detects the installation of RTCore service. Which could be an indication of Micro-Star MSI Afterburner vulnerable driver abuse","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045 AND winlog.event_data.ServiceName:/[Rr][Tt][Cc][Oo][Rr][Ee]64/)","rule_id":"91c49341-e2ef-40c0-ac45-49ec5c3fe26c","timestamp_override":"event.ingested","references":["https://github.com/br-sn/CheekyBlinder/blob/e1764a8a0e7cda8a3716aefa35799f560686e01c/CheekyBlinder/CheekyBlinder.cpp"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045 AND winlog.event_data.ServiceName:RTCore64)`"}
