{"id":"52d8b0c6-53d6-439a-9e41-52ad442ad9ad","created_by":"Samir Bousseaden","name":"First Time Seen Remote Named Pipe","tags":["attack.lateral_movement","attack.t1021.002"],"interval":"5m","description":"This detection excludes known namped pipes accessible remotely and notify on newly observed ones, may help to detect lateral movement and remote exec using named pipes","risk_score":73,"enabled":true,"severity":"high","false_positives":["Update the excluded named pipe to filter out any newly observed legit named pipe"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:/\\\\\\\\\\*\\\\[Ii][Pp][Cc]$/) AND (NOT (winlog.event_data.RelativeTargetName:(/[Aa][Tt][Ss][Vv][Cc]/ OR /[Ss][Aa][Mm][Rr]/ OR /[Ll][Ss][Aa][Rr][Pp][Cc]/ OR /[Ll][Ss][Aa][Ss][Ss]/ OR /[Ww][Ii][Nn][Rr][Ee][Gg]/ OR /[Nn][Ee][Tt][Ll][Oo][Gg][Oo][Nn]/ OR /[Ss][Rr][Vv][Ss][Vv][Cc]/ OR /[Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd]_[Ss][Tt][Oo][Rr][Aa][Gg][Ee]/ OR /[Ww][Kk][Ss][Ss][Vv][Cc]/ OR /[Bb][Rr][Oo][Ww][Ss][Ee][Rr]/ OR /[Nn][Ee][Tt][Dd][Ff][Ss]/ OR /[Ss][Vv][Cc][Cc][Tt][Ll]/ OR /[Ss][Pp][Oo][Oo][Ll][Ss][Ss]/ OR /[Nn][Tt][Ss][Vv][Cc][Ss]/ OR /[Ll][Ss][Mm]_[Aa][Pp][Ii]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee]/ OR /[Hh][Yy][Dd][Rr][Aa][Ll][Ss][Pp][Ii][Pp][Ee]/ OR /[Tt][Ee][Rr][Mm][Ss][Rr][Vv]_[Aa][Pp][Ii]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee]/ OR /[Mm][Ss][Ff][Tt][Ee][Ww][Dd][Ss]/ OR /[Ss][Qq][Ll]\\\\[Qq][Uu][Ee][Rr][Yy]/))))","rule_id":"52d8b0c6-53d6-439a-9e41-52ad442ad9ad","timestamp_override":"event.ingested","references":["https://twitter.com/menasec1/status/1104489274387451904"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:5145 AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\IPC$) AND (NOT (winlog.event_data.RelativeTargetName:(atsvc OR samr OR lsarpc OR lsass OR winreg OR netlogon OR srvsvc OR protected_storage OR wkssvc OR browser OR netdfs OR svcctl OR spoolss OR ntsvcs OR LSM_API_service OR HydraLsPipe OR TermSrv_API_service OR MsFteWds OR sql\\\\query))))`"}
