{"id":"300bac00-e041-4ee2-9c36-e262656a6ecc","created_by":"@neu5ron","name":"Active Directory User Backdoors","tags":["attack.t1098","attack.persistence"],"interval":"5m","description":"Detects scenarios where one can control another users or computers account without having to use their credentials.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND ((event.code:4738 AND (NOT (winlog.event_data.AllowedToDelegateTo:\\- OR NOT _exists_:winlog.event_data.AllowedToDelegateTo))) OR ((event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:/[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Tt][Oo]/) OR (event.code:5136 AND winlog.event_data.ObjectClass:/[Uu][Ss][Ee][Rr]/ AND winlog.event_data.AttributeLDAPDisplayName:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Pp][Rr][Ii][Nn][Cc][Ii][Pp][Aa][Ll][Nn][Aa][Mm][Ee]/) OR (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:/[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Aa][Cc][Tt][Oo][Nn][Bb][Ee][Hh][Aa][Ll][Ff][Oo][Ff][Oo][Tt][Hh][Ee][Rr][Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy]/))))","rule_id":"300bac00-e041-4ee2-9c36-e262656a6ecc","timestamp_override":"event.ingested","references":["https://msdn.microsoft.com/en-us/library/cc220234.aspx","https://adsecurity.org/?p=3466","https://www.harmj0y.net/blog/redteaming/another-word-on-delegation/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND ((event.code:4738 AND (NOT (winlog.event_data.AllowedToDelegateTo:\\- OR NOT _exists_:winlog.event_data.AllowedToDelegateTo))) OR ((event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:msDS\\-AllowedToDelegateTo) OR (event.code:5136 AND winlog.event_data.ObjectClass:user AND winlog.event_data.AttributeLDAPDisplayName:servicePrincipalName) OR (event.code:5136 AND winlog.event_data.AttributeLDAPDisplayName:msDS\\-AllowedToActOnBehalfOfOtherIdentity))))`"}
