{"id":"d635249d-86b5-4dad-a8c7-d7272b788586","created_by":"Florian Roth","name":"Suspicious Download with BITS from Suspicious TLD","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Detects a suspicious download using the BITS client from a FQDN that is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND RemoteName:(/.*[Rr][Aa][Ww]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Ii][Ss][Tt]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*\\.[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*\\.[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*\\.[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo]\\/.*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/))","rule_id":"d635249d-86b5-4dad-a8c7-d7272b788586","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md","https://twitter.com/malmoeb/status/1535142803075960832","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND RemoteName:(*raw.githubusercontent.com* OR *gist.githubusercontent.com* OR *pastebin.com* OR *cdn.discordapp.com\\/attachments\\/* OR *mediafire.com* OR *mega.nz* OR *ddns.net* OR *.paste.ee* OR *.hastebin.com* OR *.ghostbin.co\\/* OR *ufile.io* OR *storage.googleapis.com* OR *anonfiles.com* OR *send.exploit.in* OR *transfer.sh*))`"}
