{"id":"80b708f3-d034-40e4-a6c8-d23b7a7db3d1","created_by":"Nikita Nazarov, oscd.community","name":"Invoke-Obfuscation Via Stdin","tags":["attack.defense_evasion","attack.t1027","attack.execution","attack.t1059.001"],"interval":"5m","description":"Detects Obfuscated Powershell via Stdin in Scripts","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:/.*[Ss][Ee][Tt].*/ AND winlog.event_data.ServiceFileName:/.*\\&\\&.*/ AND winlog.event_data.ServiceFileName:(/.*[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*$\\{[Ii][Nn][Pp][Uu][Tt]\\).*/))","rule_id":"80b708f3-d034-40e4-a6c8-d23b7a7db3d1","timestamp_override":"event.ingested","references":["https://github.com/Neo23x0/sigma/issues/1009"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4697 AND winlog.event_data.ServiceFileName:*set* AND winlog.event_data.ServiceFileName:*\\&&* AND winlog.event_data.ServiceFileName:(*environment* OR *invoke* OR *$\\{input\\)*))`"}
