{"id":"6d44fb93-e7d2-475c-9d3d-54c9c1e33427","created_by":"Florian Roth","name":"Suspicious Download with BITS from Suspicious TLD","tags":["attack.defense_evasion","attack.persistence","attack.t1197"],"interval":"5m","description":"Detects a suspicious download using the BITS client from a FQDN that is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Other legitimate domains used by software updaters"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND (NOT (RemoteName:(/.*\\.[Cc][Oo][Mm].*/ OR /.*\\.[Aa][Zz][Uu][Rr][Ee][Ee][Dd][Gg][Ee]\\.[Nn][Ee][Tt].*/ OR /.*\\.[Ss][Ff][Xx]\\.[Mm][Ss].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd]\\.[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\.[Oo][Rr][Gg].*/))))","rule_id":"6d44fb93-e7d2-475c-9d3d-54c9c1e33427","timestamp_override":"event.ingested","references":["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md","https://twitter.com/malmoeb/status/1535142803075960832"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Bits\\-Client\\/Operational AND event.code:16403 AND (NOT (RemoteName:(*.com* OR *.azureedge.net* OR *.sfx.ms* OR *download.mozilla.org*))))`"}
