{"id":"350dfb37-3706-4cdc-9e2e-5e24bc3a46df","created_by":"Nasreddine Bencherchali","name":"MSSQL Disable Audit Settings","tags":["attack.defense_evasion"],"interval":"5m","description":"Detects when an attacker calls the \"ALTER SERVER AUDIT\" or \"DROP SERVER AUDIT\" transaction in order to delete or disable audit logs on the server","risk_score":73,"enabled":true,"severity":"high","false_positives":["This event should only fire when an administrator is modifying the audit policy. Which should be a rare occurrence once it's set up"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]/ AND event.code:33205 AND Data:(/.*[Ss][Tt][Aa][Tt][Ee][Mm][Ee][Nn][Tt]\\:[Aa][Ll][Tt][Ee][Rr]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Aa][Uu][Dd][Ii][Tt].*/ OR /.*[Ss][Tt][Aa][Tt][Ee][Mm][Ee][Nn][Tt]\\:[Dd][Rr][Oo][Pp]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Aa][Uu][Dd][Ii][Tt].*/))","rule_id":"350dfb37-3706-4cdc-9e2e-5e24bc3a46df","timestamp_override":"event.ingested","references":["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/","https://docs.microsoft.com/en-us/sql/t-sql/statements/drop-server-audit-transact-sql?view=sql-server-ver16","https://docs.microsoft.com/en-us/sql/t-sql/statements/alter-server-audit-transact-sql?view=sql-server-ver16"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:MSSQLSERVER AND event.code:33205 AND Data:(*statement\\:ALTER\\ SERVER\\ AUDIT* OR *statement\\:DROP\\ SERVER\\ AUDIT*))`"}
