{"id":"ab6bffca-beff-4baa-af11-6733f296d57a","created_by":"Maxime Thiebaut (@0xThiebaut)","name":"AD User Enumeration","tags":["attack.discovery","attack.t1087.002"],"interval":"5m","description":"Detects access to a domain user from a non-machine account","risk_score":47,"enabled":true,"severity":"medium","false_positives":["Administrators configuring new users."],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.ObjectType:/.*[Bb][Ff]967[Aa][Bb][Aa]\\-0[Dd][Ee]6\\-11[Dd]0\\-[Aa]285\\-00[Aa][Aa]003049[Ee]2.*/) AND (NOT (user.name:/.*$/ OR user.name:/[Mm][Ss][Oo][Ll]_.*/)))","rule_id":"ab6bffca-beff-4baa-af11-6733f296d57a","timestamp_override":"event.ingested","references":["https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf","http://www.stuffithoughtiknew.com/2019/02/detecting-bloodhound.html","https://docs.microsoft.com/en-us/windows/win32/adschema/attributes-all"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND (event.code:4662 AND winlog.event_data.ObjectType:*bf967aba\\-0de6\\-11d0\\-a285\\-00aa003049e2*) AND (NOT (user.name:*$ OR user.name:MSOL_*)))`"}
