{"id":"1bbf25b9-8038-4154-a50b-118f2a32be27","created_by":"James Pemberton / @4A616D6573","name":"Suspicious Windows ANONYMOUS LOGON Local Account Created","tags":["attack.persistence","attack.t1136.001","attack.t1136.002"],"interval":"5m","description":"Detects the creation of suspicious accounts similar to ANONYMOUS LOGON, such as using additional spaces. Created as an covering detection for exclusion of Logon Type 3 from ANONYMOUS LOGON accounts.","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Security AND event.code:4720 AND winlog.event_data.SamAccountName:/.*[Aa][Nn][Oo][Nn][Yy][Mm][Oo][Uu][Ss].*/ AND winlog.event_data.SamAccountName:/.*[Ll][Oo][Gg][Oo][Nn].*/)","rule_id":"1bbf25b9-8038-4154-a50b-118f2a32be27","timestamp_override":"event.ingested","references":["https://twitter.com/SBousseaden/status/1189469425482829824"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Security AND event.code:4720 AND winlog.event_data.SamAccountName:*ANONYMOUS* AND winlog.event_data.SamAccountName:*LOGON*)`"}
