{"id":"1d61f71d-59d2-479e-9562-4ff5f4ead16b","created_by":"pH-T","name":"Suspicious Service Installation","tags":["attack.persistence","attack.privilege_escalation","car.2013-09-005","attack.t1543.003"],"interval":"5m","description":"Detects suspicious service installation commands","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:System AND ((winlog.provider_name:/[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ [Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]/ AND event.code:7045) AND (winlog.event_data.ImagePath:(/.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Ss][Tt][Aa]\\ .*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\\\\\\\\\.\\\\[Pp][Ii][Pp][Ee].*/ OR /.*\\\\[Aa][Dd][Mm][Ii][Nn]$\\\\.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/) OR (winlog.event_data.ImagePath:/.*\\ \\-[Ee].*/ AND winlog.event_data.ImagePath:(/.*\\ [Jj][Aa][Bb].*/ OR /.*\\ [Ss][Uu][Vv][Yy][Ii].*/ OR /.*\\ [Ss][Qq][Bb][Ff][Aa][Ff][Gg][Aa].*/ OR /.*\\ [Aa][Ww][Vv]4[Ii].*/ OR /.*\\ [Ii][Aa][Bb].*/ OR /.*\\ [Pp][Aa][Aa].*/ OR /.*\\ [Aa][Qq][Bb][Ll][Aa][Hh][Gg][Aa].*/)))) AND (NOT ((winlog.event_data.ImagePath:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Tt][Hh][Oo][Rr]10\\-[Rr][Ee][Mm][Oo][Tt][Ee]\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee].*/))))","rule_id":"1d61f71d-59d2-479e-9562-4ff5f4ead16b","timestamp_override":"event.ingested","references":null,"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:System AND ((winlog.provider_name:Service\\ Control\\ Manager AND event.code:7045) AND (winlog.event_data.ImagePath:(*\\ \\-w\\ hidden\\ * OR *\\ \\-nop\\ * OR *\\ \\-sta\\ * OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\Perflogs\\\\* OR *\\\\\\\\.\\\\pipe* OR *\\\\ADMIN$\\\\* OR *.downloadstring\\(* OR *.downloadfile\\(*) OR (winlog.event_data.ImagePath:*\\ \\-e* AND winlog.event_data.ImagePath:(*\\ JAB* OR *\\ SUVYI* OR *\\ SQBFAFgA* OR *\\ aWV4I* OR *\\ IAB* OR *\\ PAA* OR *\\ aQBlAHgA*)))) AND (NOT ((winlog.event_data.ImagePath:C\\:\\\\WINDOWS\\\\TEMP\\\\thor10\\-remote\\\\thor64.exe*))))`"}
