{"id":"7f103213-a04e-4d59-8261-213dddf22314","created_by":"Nasreddine Bencherchali","name":"MSSQL XPCmdshell Suspicious Execution","tags":["attack.execution"],"interval":"5m","description":"Detects when the MSSQL \"xp_cmdshell\" stored procedure is used to execute commands","risk_score":73,"enabled":true,"severity":"high","false_positives":["Unknown"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Application AND winlog.provider_name:/[Mm][Ss][Ss][Qq][Ll][Ss][Ee][Rr][Vv][Ee][Rr]/ AND event.code:33205 AND Data:/.*[Oo][Bb][Jj][Ee][Cc][Tt]_[Nn][Aa][Mm][Ee]\\:[Xx][Pp]_[Cc][Mm][Dd][Ss][Hh][Ee][Ll][Ll].*/ AND Data:/.*[Ss][Tt][Aa][Tt][Ee][Mm][Ee][Nn][Tt]\\:[Ee][Xx][Ee][Cc].*/)","rule_id":"7f103213-a04e-4d59-8261-213dddf22314","timestamp_override":"event.ingested","references":["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/","https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Application AND winlog.provider_name:MSSQLSERVER AND event.code:33205 AND Data:*object_name\\:xp_cmdshell* AND Data:*statement\\:EXEC*)`"}
