{"id":"49e5bc24-8b86-49f1-b743-535f332c2856","created_by":"Bhabesh Raj","name":"Microsoft Defender Tamper Protection Trigger","tags":["attack.defense_evasion","attack.t1562.001"],"interval":"5m","description":"Detects block of attempt to disable real time protection of Microsoft Defender by tamper protection","risk_score":73,"enabled":true,"severity":"high","false_positives":["Administrator actions"],"from":"now-720s","type":"query","language":"lucene","index":["winlogbeat-*","logs-*"],"query":"(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:5013 AND Value:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Ss][Pp][Yy][Ww][Aa][Rr][Ee]\\ \\=\\ 0[Xx]1\\(\\)/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ \\=\\ \\([Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\)/))","rule_id":"49e5bc24-8b86-49f1-b743-535f332c2856","timestamp_override":"event.ingested","references":["https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection"],"note":"**Detection Rule without Regex for better understanding. Be careful, this way is case sensitive:**`(winlog.channel:Microsoft\\-Windows\\-Windows\\ Defender\\/Operational AND event.code:5013 AND Value:(*\\\\Windows\\ Defender\\\\DisableAntiSpyware\\ \\=\\ 0x1\\(\\) OR *\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring\\ \\=\\ \\(Current\\)))`"}
